{"Job Title": "SOFTWARE DEVELOPMENT ENGINEER", "Company": "McAfee Software (India) Pvt. Ltd", "Experience": "0 - 1 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "       Role Overview:        As a team member of Technology Center of excellence for Customer Success group, you will report to Engineering Manager who leads the cross functional team which has foot print across Customer Success Organization. High level roles expectation for a developer would include to develop code mainly focusing on Java based platforms, along with Product Supportable Tools and Frameworks, through the software development life cycle using Agile, Scrum, and Lean methodologies and works crossfunctionally to ensure projects are effectively developed and deployed with quality and on time delivery into our production systems. Responsible for global scope, impact and complexity.      About the role:      Developing applications both web based/ server side and standalone.   Following all the coding standards and best practices.   Works in a Agile environment.   Work as a team member in a team which works on different technologies.   Follow the Secure development life cycle.   Capable of designing/developing applications from scratch.   Follow the DevOps model and ensure structured output is delivered ensuring customer satisfaction.           About you:       2 or more years of experience in software development   Highly proficient in Applications Software developing using Microsoft technologies like asp.net, C#.   T skills Depth in one area , ability and willingness to work across other domains and technologies including UI development   Designing technical solutions using object-oriented design concepts. Knowing Java is a big plus.   Familiarity with HTML/CSS, JavaScript, ReactJS and UI/UX design   Experience in debugging, performance analysis and tuning of production applications.   Ability to translate requirements into design and code, identify the dependencies   Must have good understanding and application of design patterns   Experience using and developing RESTful APIs   Ability to translate a high level problem statement into a workable product strategy   Work in individual contributor roles Technical path   Experience in Deploying applications to AWS Cloud infrastructure        ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["UI development", "Object oriented design", "Agile scrum", "Coding", "Diversity and Inclusion", "Debugging", "Cloud", "Javascript", "Software development life cycle", "HTML"]}