{"Job Title": "SENIOR SOFTWARE DEVELOPMENT ENGINEER", "Company": "McAfee Software (India) Pvt. Ltd", "Experience": "7 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "    Role Overview:       We are seeking a Senior Software Development Engineer to work on the McAfee Endpoint Security product line for Linux.     About the Role :      Have technical leadership experience.   Have worked closely with Product Management to understand product requirements and customer problems.   Have worked tightly with QA team to ensure the high quality outcomes for your product.   Have collaborated with support to get product feedback and help solve customer problems.   Analyze complex real world data usage scenarios, research and apply the best solution possible   You are a developer with the primary responsibility of effective assurance of product quality through excellent coding techniques, code inspections, peer reviews, unit testing and other forms of engineering excellence. It is a unique and challenging role that calls for a strong passion for quality   and   technology, while providing an immense opportunity to design and develop worldclass security products.       About You :     At least 7-10 years of experience in product development including design and development tasks along with   Code review / bug analysis / Testing  .   A proven track record of developing/shipping high quality, scalable software in   Linux,   or *NIX platforms   Should have programming,   debugging experience  , and excellent problem solving skills. Proven knowledge of debugging using tools like   gdb   and   crash  .   Expertise in C, C,   Linux Kernel Programming  , Multithreading, IPC, System Programming and UML as well as solid understanding of basic CS concepts is must.   Should be able to write Unit Tests.   Knowledge of   Linux internals  .   Familiar with Test Driven Development concepts.   Demonstrated ability to work effectively both within a team and cross-group to drive identification and resolution of issues to ship under tight deadlines along with being able to drive features into the product.   Must be highly motivated with a strong passion for and commitment to   software quality     ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Product management", "C++", "Multithreading", "Linux", "UML", "Coding", "Debugging", "System programming", "Unit testing", "software quality"]}