{"Job Title": "P2 - Software Development Engineer in Test (sdet)", "Company": "Cardinal Health", "Experience": "0 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru, Bangalore", "Job Description": "  What Software Engineering contributes to Cardinal Health      Software Engineering is responsible for designing, developing, implementing and supporting applications, systems and IT products required to achieve the company's business objectives.   Demonstrates knowledge of software development techniques and fluency in software languages and application programming interfaces.  Demonstrates general understanding of hardware/software platforms including but not limited to operating systems, databases, application servers, web servers and integration technologies.  Plans and executes system implementations that ensure success and minimize risk of system outages or other negative production impacts.  Demonstrates conceptual knowledge of architecture standards and database and operating systems.  Demonstrates problem solving ability that allows for effective and timely resolution of system issues including but not limited to production outages.  Analyzes production system operations using tools such as monitoring, capacity analysis and outage root cause analysis to identify and drive change that ensures continuous improvement in system stability and performance.  Demonstrates knowledge of software development, life cycle, modeling of business processes, application design patterns, business/functional documents. Estimates to high level business requirements and provide options analysis.  Hands on experience of working with different platforms like Web applications and API (Android, iOS would be a plus)  Experience in designing Test Automation Frameworks.  Design & development skills in any high-level language.  Hands on experience with multiple scripting languages.  Ability to perform development of test automation by designing and writing automated test scripts based on defined test cases, including the definition of test data for consumption by scripts during test execution.  Analyzing Test Results, Defect Reporting & Tracking on regular basis.  Experience in Test Planning, Test Estimation and Risk Assessment.  Work closely with Business Analysts to understand requirements and translate them in to test cases which capture all possible test conditions and has strong analytical skills in identifying and designing Regression scenarios for the same.  Solid experience in all phases of the software development lifecycle applying best practices and Agile software development methodologies.  Passion for improving code quality through interaction with development teams in India and across.  Collaboratively work with various cross-functional teams across the globe     Qualifications     Bachelor's degree in Electronics, Computer Science, Computer Engineering or a software-related discipline.   4+ years as a software automation tester.     What is expected of you and others at this level     Applies working knowledge in the application of concepts, principles, and technical capabilities to perform varied tasks  Works on projects of moderate scope and complexity  Identifies possbile solutions to a variety of technical problems and takes actions to resolve  Applies judgment within defined parameters  Receives general guidance may receive more detailed instruction on new projects  Work reviewed for sound reasoning and accuracy    Cardinal Health is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status.  ", "Role": "Testing Engineer,", "Industry Type": "Medical, Healthcare, Hospitals,", "Functional Area": "IT Software - QA & Testing,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["Software Automation testing"]}