{"Job Title": "Software Development Engineer - Java/j2ee", "Company": "Catalyst", "Experience": "4 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   Job Duties :   - Develop server-side components, REST APIs - Assume ownership for existing and new modules including design, development and unit testing for enhancements of existing modules and development of new modules. Follows coding standards, builds appropriate unit tests, integration tests, and deployment scripts.   - Solve Problems - Analyze problems logically and exercise sound judgment in defining, evaluating, and solving difficult technical and operational problems where solutions may be of a precedent-establishing nature.   - Contribute to continual improvement to design and architecture      - Participate and collaborate with leads in design discussions, determines areas of complexity, potential risks to successful implementation, suggest enhancements to architecture, implement POCs and enhance the application.   - Work closely with team members, coordinate requirements, and perform the feasibility study to implement them in the application, provide schedules, and activities; contribute to team meetings and activities; troubleshooting development and production problems across multiple environments and operating platforms.   Required Candidate profileA solid grounding in Computer Science fundamentals (based on a BS or MS in CS or related field) from IITs. - Excellent Object Orientation, coupled with excellent problem solving and debugging skills. - Highly skilled at Java and related technologies, including J2EE/ JEE, RESTful web services, JSON, Servlet, JSP, MySQL, MongoDB, Kafka, AWS, Solr - Good understanding of one of the JavaScript libraries and frameworks such as jQuery, AngularJS, ReactJS etc - Well versed in software engineering principles, frameworks, and technologies ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Sc in Any Specialization, BCA in Computers, B.Tech/B.E. in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["Java", "J2EE/ JEE", "JSP", "RESTful Webservices", "Kafka", "J2EE", "JSON", "REST API", "jQuery", "RESTful web services", "MySQL", "Javascript", "Servlet", "MongoDB", "AWS", "Servlets"]}