{"Job Title": "Software Development Engineer - Test - Automation Testing", "Company": "People Gamut HR Solutions", "Experience": "6 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "- We are looking for SDETs for a Singapore based company- Roles and ResponsibilitiesSkill Requirement: - Linux, Apache, MySQL, MongoDB - Javascript, AngularJS, JQuery, HTML, CSS- Object-oriented programming with Java/Python/Ruby - REST API testing / Automation - Data Structures - Microservices - API load testing / Performance testing - CI/CD, DevOps concepts - Tools : Cucumber, Protractor, Robot Framework, Selenium web driver, Jenkins/BambooResponsibilities: - 6 to 8 years of experience in automation testing.- Coordinate across teams for complete feature deliverables. - Mentoring: Demonstrated an ability to mentor junior members of the team, and leading thought provoking technical conversations, be it pertaining to the current tech stack or new emerging technologies - - Must be experienced in automating Web & Mobile applications. - Understanding of QA methodologies, life cycle and processes. - Should be an expert in web automation framework : Selenium, Rest API - Performed Automation Testing of Rest API using automation Frameworks. - Experience working with Postman tool, API and Docker - Working knowledge of Load testing framework (Jmeter & Locust) - Should have good Knowledge on Java/Python and any other scripting language - Knowledge on MySql, MongoDB - A passion for testing, development, and design - Strong mentoring and leadership skills - Well versed with CI/CD - Understand and Analyze the Functional & Regression scope of Product Development items. Assign resources to various projects so that their utilization is maximized. - Good in designing different automation frameworks/Architecture based on project needs. - Come up with technology suggestions and implementation ( Tools & Framework improvements) Explore, Implementation & usage of code coverage tools", "Role": "Testing Engineer,", "Industry Type": "Automobile, Auto Anciliary, Auto Components,", "Functional Area": "IT Software - QA & Testing,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization, B.Sc in Any Specialization, BCA in Computers", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["Java", "REST API", "Cucumber Testing", "SDET", "API Testing", "Automation Testing", "Selenium", "Load Testing", "Testing"]}