{"Job Title": "Software Engineer - React.js Development - ES6/ Javascript", "Company": "Talent Stock Solutions", "Experience": "4 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Responsibilities : - Design, implementation, and deployment of applications that impact the business with an emphasis on Payments, Customer Account Management and e-Commerce website development.- Knowledge in performance, scalability, enterprise system architecture, and best engineering practices.- Penchant for writing super-efficient and scalable code- Designing and building low latency front-end solutions that work gracefully on a wide spectrum of network bandwidths, screen sizes and provide the best mobile shopping experience for our customers.- Pixel-perfect front-end development attitudeMust have skill-sets :- Proficiency using modern web development technologies and techniques,- including proficiency in core JavaScript (ES6/ESNext).- Excellent knowledge of React and testing (Jest, React-Testing-Library, etc) &- React Native, AJAX, HTML5, CSS & Preprocessors, Responsive Design.- Advanced understanding of web fundamentals (accessibility, security, DOM,- SEO, how browsers work, etc).- Deep knowledge about web performance and page speed with Google Lighthouse, and more.- Great knowledge of Webpack and how to configure it properly.- Solid experience with distributed (multi-tiered) systems, algorithms, and relational databases.- RESTful Services and APIs.- Hands-on expertise in many disparate technologies, typically ranging from front-end user interfaces such as HTML5.- A creative mindset with the ability to help solve challenging domain problems.- Proficient understanding of code versioning tools, such as Git.- Agile Methodologies like Scrum or Kanban.Extra Credits :- Understanding of Isomorphic applications and SSR.- Knowledge of React frameworks such as Gatsby/NextJS and GraphQL, Node.js.- Working experience building PWAs.- Real-world TypeScript/JavaScript code we can review.- Knowledge of bundlers outside of Webpack (e.g. Rollup or Parcel) and their proper configurations.- Block Element Modifier (BEM) methodology and ability to work with Object Oriented CSS architectures.- Love of engineering practices like continuous delivery and automated testing.- Knowledge of tooling and build systems.- Experience working on accessibility.- Virtual Machines and Containerization i.e. Vagrant, Docker.- Experience with Cloud Services (AWS, GCP, or Azure).- Open-source contributions or contributions to programs designed to help underrepresented people enter the tech field.- Data analysis experience, and understanding of how analytics can help with product decisions.- Experience working with offshore and nearshore development teams.Note :- 3-4 years experience (preferably in e-commerce/B2C industry)- 2+ on the front-end side.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "BCA in Computers, B.Sc in Any Specialization, B.Tech/B.E. in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["RESTful API", "CSS", "Git", "Progressive Web App", "Cloud Services", "HTML5", "Javascript", "RESTful Webservices", "ES6", "React.js", "AJAX"]}