{"Job Title": "Principal Software Engineer Development (Business Intelligence)", "Company": "Advanced Computer Software", "Experience": "3 - 7 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "          Must have    Experience in data and BI architecture ,infrastructure and solution design ,implementation and management   Knowledge of and experience with advanced data access and extraction storage and reporting analytic tools methods     Database development and design technologies including SQL Server other databases   Data Modelling, DW Architecture, ETL Architecture, Reporting Architecture, DATA Cube, And Analytical Dashboards & Best Practices.    Good to have    OnPrem & Cloud (Hybrid Solution) architecture   Data Migration and knowledge and experience on Loosely coupled architecture.     BI Reporting Solution    Must have (**below is applicable to Jasper or similar BI Reporting tool)    Experience BI Platforms using JASPERSOFT, SSAS, SSIS, SSRS   Handson for all Jasper static reports,   domains, and Ad Hoc Views.    Should have worked in development,   integration and configuration of Jasper reports, by using RESTFUL API calls    Experience in identifying   performance issues, debugging and performance tuning.    Designed and developed Sub reports, Drill Down reports, Dashboard using Jasper   Responsible for Designing   the Different jasper reports using multiple I-Report components like Crosstabs, sub reports, Frames, Groups and Bands  .    Good to have    Experience in   AWS Cloud platform   and its features which includes EC2, AMI, EBS, AWS SQS and AWS S3.   Descriptive / Suggestive / Prescriptive / Adaptive Analytics.     BI supporting development Skills     Experience in developing applications using Web Services (SOAP, RESTFUL), Core Java, JDBC, Servlets, JSP, HTML, Java Scripts and develop Jasper Reports     General Skills good to have     Strong communication and influencing skills with the ability to work and collaborate at all level of an organization   Excellent Team building , coaching and mentoring skills   Problem resolution, Strong management and leadership skills, with ability to motivate professionals and maximize levels of productivity, Excellent communicator, with emphasis on building strong client relationships.   Industry experience in, Agile Product Management Methodology, SCRUM, JIRA, Confluence      Additionally good to have skills    Machine Learning    Data Science    ", "Role": "Technical Architect,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Performance tuning", "Core Java", "JSP", "SSRS", "Agile", "JDBC", "HTML", "SSIS", "Business intelligence", "SQL"]}