{"Job Title": "Software Development Lead", "Company": "Sygina Data Systems Private limited", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Mumbai, Bangalore/Bengaluru", "Job Description": "    We are looking for a qualified team leader to manage our team and provide effective guidance. You will be responsible for supervising, managing and motivating team members on a daily basis. As a team leader, you will be the contact point for all team members, so your communication skills should be excellent. You should also be able to act proactively to ensure smooth team operations and effective collaboration. Apart from management skills, you should be technically proficient in client and server side technologies to efficiently work along with your team.   Responsibilities:     Integration of user-facing elements developed by front-end developers.     Build efficient, testable, and reusable PHP, Asp.net, node.js modules.     Solve complex performance problems and architectural challenges.     Integration of data storage solutions.     Share Daily and Weekly status reports with all stake holders.     Communicate with clients to understand their requirements and relay it to team members for implementation.     Review assignments for accuracy and quality.    Skills and Qualifications:     B.E/ B.Tech. M.E/ M.Tech/ MSc Computer Science/ IT     Strong knowledge of web frameworks. PHP, Asp.net, node.js.     Basic understanding of front-end technologies, such as JavaScript, HTML5, and CSS3     Understanding fundamental design principles behind a scalable application.     Understanding fundamental design principles behind a scalable application     Creating database schemas that represent and support business processes.     Familiarity with SQL/NOSQL databases and their declarative query languages     Be able to make excellent decisions.     Have superior organizational skills.     Be detail oriented and flexible.     Be able to handle multiple assignments.  ", "Role": "Team Lead/Technical Lead,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "MS/M.Sc(Science) in Chemistry, M.Tech in Electronics/Telecommunication", "Doctorate": "None", "Key Skills": ["Computer science", "Cloud computing", "Front end", "NoSQL", "PHP", "Healthcare", "ASP.Net", "HR", "SQL", "CSS3"]}