{"Job Title": "Senior Solution Engineer", "Company": "Freshdesk", "Experience": "4 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   As a Senior Solution Engineer, your primary responsibilities include:     Work closely with our mid-market customers to identify and solve their most critical business problems.   Tactical role which provides a marked contribution to defining the direction of new solutions, processes, standards or operational plans based upon business strategy, with a significant impact on business unit overall results.   Work on process improvement and mentoring the junior resources.   Support the sales team by conducting discovery calls and product demonstrations for our active deals. User requirement gathering, analysis, and scope definition, Wireframing, Creating Proof of Concept (POC),Business Consulting.   Conduct effective requirements gathering to clearly identify customer problems.   Build and deliver compelling technical demonstrations of the Freshworks products.   Articulate the value of Freshworks solutions to a variety of audiences.   Be a lifelong learner and develop your skills continuously.     Job Requirements     We re looking for mid- senior level professionals with 4-8 years of professional experience. Any experience as a Pre-Sales/Solution Engineer/ Consultant or Business Analyst in an IT setup is preferred.   Excellent soft skills and presentation skills are a must for this role. You will rely on the skills every single day!   Experienced in mentoring and building teams.   You should be capable of working on a cross-functional team to solve business tech problems.   You will work on multiple deals every month. Proven time management skills in a dynamic sales environment will come in really handy!   We are looking for highly driven individuals with an execution focus and a strong sense of urgency.   ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["SAN", "GIT", "Process improvement", "Customer support", "Business strategy", "Customer engagement", "cisco", "Operations", "CRM", "marketing automation"]}