{"Job Title": "Python Developer", "Company": "Zymr Systems Pvt. Ltd.", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Pune, Ahmedabad, Bangalore/Bengaluru", "Job Description": "   Lead the delivery of high quality, innovative, flexible, cost-optimized, and scalable technical solutions that meet business requirements.     Design, develop, test, and maintain software applications with MVC architectures, Microservices, and scalable cloud-native apps.     Perform hands-on coding and provide thoughtful code reviews.     Mentor and lead team members to continuously improve the quality and productivity of deliverables.     Demonstrate the ability to work within an Agile team and collaborate with other teams on design and implementation strategies.      Follow Scrum Agile development methodology.     Effective communication skills with an ability to express ideas to the recipient or co-ordinate and communicate with the cross-functional team along with the client s team.     Problem-solving hustler with a get things done attitude.      A self-disciplined individual who is open-minded, user-focused, and adaptive in nature.     Lean principles and analytical thinking.     Project planning, timelines, and milestones for execution and deliverables.     Participate in the evaluation review of the fellow team members.     DESIRED SKILLS:      Expert in Python with knowledge of at least one Python web framework Flask, Django.     Expert in server programming with an ability to implement complex business logic.     Good understanding of the threading limitations of Python and multi-process architecture.     Understanding of fundamental design principles behind a scalable application.     Knowledge of event-driven programming in Python.     Experience with python packages like NumPy, Pandas, Flask, PySpark, PyMongo, OS, Logging, re, PyYAML.     Experience with swagger io module to expose API.     Substantial unit test and debugging skills.     At least two years of experience in RESTful API / HTTP / JSON.     Knowledge of AWS cloud and Python Boto library.     Proficient understanding of code versioning tools like Git.     Good understanding of Linux OS.     AWS Kinesis.     Web Sockets.     RabbitMQ.     AWS CloudFormation.   ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Linux", "Coding", "Django", "Debugging", "HTTP", "JSON", "Scrum", "Project planning", "MVC", "Python"]}