{"Job Title": "Oracle Retail Development Consultant - RMS / ReSA / SIM", "Company": "Olr", "Experience": "3 - 5 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "\n\nOracle Retail Development Consultant -  RMS /  ReSA /  SIM\n\nEssential Duties and Responsibilities:\n\n Frequently analyze and define client data conversion  ,   interface  ,   report  ,   bolt - on and application enhancement requirements within the technical framework of OLR projects and Oracle Retail products.\n\n Frequently develop code to a high standard of quality to support functional and technical requirements derived from OLR project teams globally\n\n Write or contribute to technical specifications based on functional requirements (or other documents) to satisfy the identified enhancement or development work.\n\n Create and execute Unit Test Plans for your own and another team member (s) deliverables to capture and demonstrate the successful and high - quality development of technical deliverables which satisfy their specified requirements.\n\n Work in accordance with the defect and issue tracking procedures and systems which may be used to assign tasks  ,   track progress  ,   review quality and support the SDLC of the client  ,   OLR or project.\n\n Create and contribute to Release Notes  ,   package deliverables and coordinate with team lead or project team members to perform releases.\n\n Assist with work estimation and preliminary requirement analysis\n\n Work within a team structure in accordance with established deliverable dates  ,   in conjunction with onsite / nearshore / offshore team constructions  ,   reporting to assigned Team Lead(s)  ,   Development Leads and / or onsite leads and project managers.\n\n Frequently attend and contribute to regular project team meetings involving local and remote team members (which may be outside normal office hours) to provide progress updates  ,   discuss issues or challenges  ,   with the objective to ensure the successful outcomes of project assignments.\n\n Infrequently travel to global destinations to work in a development consultant capacity on - site at a client or at another OLR office alongside OLR and client projects teams\n\n Additional duties as assigned\n\nEssential Skills: - \n\n3+ years of development and / or systems integration experience preferred\n\n3+ years in the Retail industry or an associated Retail IT field preferred\n\nPrevious consulting experience\n\nTechnical Skills\n\nStrong knowledge of\n\nOracle PL / SQL\n\nGood knowledge of ProC  ,   Unix Shell Script\n\nGood to have technical knowledge of Forms  ,   Reports  ,   BIP & OBIEE\n\nFunctional Skills: - \n\nMust know\n\n2)\n\nReSA  ,   RIB  ,   RPM( an added advantage)\n\nAt OLR we believe that applicants skill sets can be applied to multiple roles and as such we will consider your profile on an ongoing basis to assess what other exciting roles you might be suited to. We ll always treat your personal details with the upmost care in accordance with our privacy notice.\n\n", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["Unix", "Retail", "Data conversion", "Shell scripting", "Consulting", "RIB", "Unit testing", "Oracle Retail", "SDLC", "RPM"]}