{"Job Title": "Software Giant -technical Support, BPO, US Voice - Sal 40k, Noida", "Company": "Creative Hands HR Consultancy", "Experience": "1 - 6 years", "Salary": "₹ 2,00,000 - 5,50,000 P.A. ", "Location": "Noida, Chandigarh, New Delhi, Gurgaon/Gurugram, Delhi / NCR, Greater Noida", "Job Description": " Hi,        India 3rd Biggest Technology Company is hiring for Technical Support voice process for Noida location -  BPO - Voice process for US Shift       Work location - Only Noida      Only Walkin interview. No telephonic interview.    Required Skills / Experience:   Excellent verbal and written communication  Freshers or any experience in BPO preferred.  Exceptional problem-solving skills and ability to navigate challenging situations in a professional manner.  Excellent organizational skills ability to prioritize, manage, multi-task, and execute projects cross-functionally.  Able to apply non-linear thinking to problem-solving.   Should be able to work in Rotational shifts   Responsibilities:   Understand and become conversant in a relatively large software application  Understand, interpret, reproduce, and diagnose customer problems. Perform Root cause Analysis  Teach solutions to customers.  Communicate clearly and precisely with customers in written and verbal form, and maintain accurate and timely records in case tracking system.  Work with members of the team and other departments/teams to resolve product issues.  Meet individual case management, and contractual metrics   Benefits :   Cab facilities   Excellent Growth   No. of vacancies: 120  If interested please contact Varsha 7200847046 .Get your interview scheduled before you walk-in.   Please refer your friends and colleagues.  Thanks,   Varsha  7200847046  ", "Role": "Associate/Senior Associate -(NonTechnical),", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Any Graduate in Any Specialization, Graduation Not Required", "PG": "Post Graduation Not Required, Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["sitel", "serco", "sutherland", "networking", "microsoft", "hcl", "roku", "voice process", "Technical Support", "exl", "bpo", "cts", "wipro", "tcs", "ms", "google", "infosys", "dell", "netgear", "ibm", "satyam", "Fresher", "mcafee", "Call Center", "lenovo"]}