{"Job Title": "Huge Openings For International Voice Process@[24]7.ai-Fresher Can try", "Company": "Job Shop    ", "Experience": "0 - 5 years", "Salary": "₹ 2,00,000 - 4,50,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": " [24]7.ai Hiring for International Voice and Non Voice Process.Bangalore - International Voice and Non Voice ProcessDear Candidate,Greetings for the day,We are hiring for International Voice and Non Voice Process.Company Profile: [24]7.ai, is a global leader in intent-driven customer engagement solutions. We are redefining the way companies interact with consumers. We combine artificial intelligence with human intelligence to substantially improve customer experience. Our clients include more than 250 of the worlds largest brands and most recognizable brands across 12 industries.Roles and ResponsibilitiesJob Designation : Associate and Senior AssociateJob Description : Interact with customers to provide information in response to inquiries,concerns, and requests about products and services, upsell products and services, follow standard processes and procedures. Redirect problems to appropriate resources.Desired Candidate ProfileQualifications : PUC (12th)/Diploma/Undergraduates/BE /Btech and Graduates from any stream are eligible to apply. Freshers & candidates with prior relevant (BPO) and non-relevant (other domain) experience are eligible to apply. Master Graduates should have at least 1 year experience in BPO sector.Skills :Excellent Verbal and Written Communication skills with 25 WPM/85% accuracy in Typing,Good logical reasoning & analytical skills, excellent customer service skills,Able to interact with customers via chat, should be able to answer servicing questions.Perks and BenefitsSalary Range : INR 2,50,000 - 3,50,000 P.A (13,000 - 19,000) Take Home Salary)Incentives Minimum of Rs.1400 eligible from 4th month onwardsBroadband Reimbursement Rs.1300 (if own Broadband connection is chosen)Self to work (STW) Rs.2200 if choosing own mode of travel to work)Shifts: Rotational Shifts (Primarily Night Shifts and 5 days Working )Benefits: Transport: Free transportation with door to door pick up and drop facility round the clock. PF/ESI, Life Insurance for self , Medical Insurance for self and immediate dependentsWorld Class Facilities - Cafeteria, Gym, Sports arena, Amphitheater, Theme based break-out zonesfor more details Please call HR Call Job Shop - 7406026000 & Drop a Wats app message with a Voice recording of your self introduction and resume , If I didn't respond to your call.", "Role": "Associate/Senior Associate -(NonTechnical),", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Graduation Not Required", "Doctorate": "None", "Key Skills": ["Voice Process", "router", "Software Services", "Desktop Support", "ustomer Service", "Remote Support", "vpn", "Technical Support", "Cisco", "troubleshooting", "international call center", "ccna", "International Voice Process"]}