{"Job Title": "Project IT resource in Software Development Department - Mumbai", "Company": "MS Prudential Travels Pvt Ltd", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Mumbai (All Areas)", "Job Description": "Job Description (JD) and qualification required for hiring Project-IT resource in Software Development Department  - Mumbai Qualification: Diploma (Electrical, Electronics, Instrumentation, Computers, IT).Experience: 3 to 6 years of experience in Information Technology with basic PL/SQL programming knowledge.Notice Period :- Immediate to 30 days JD        Should act as a coordinator between Project-IT.        User support (including Site users), troubleshooting and providing solutions and workarounds for the day to day issues encountered for engineering applications with database.        Provide Level 1 end user support, using ticketing system and maintain SLAs.        Should be familiar with my support Oracle portal for raising technical SRs and concluding the same with Oracle.        Oracle PL/SQL expertise with regards to database data structures         Training end users for usage of specific applications (which Company-I uses. company-I will provide training on such applications e.g. EDMS, Material management System, Finance System, etc.)        Candidate needs to travel to our site offices and client offices to conduct training sessions of these applications.        Candidate needs to travel and stay at our site offices to resolve user related problems and conduct awareness programs for the company specific applications.        Deployment of Engineering Applications including installations.        Concepts of RDBMS (ORACLE, MS-SQL).        Good Communication skills are a must. Interested candidate can apply ASAP with updated resume.  RegardsPrudential team", "Role": "Project Manager-IT/Software,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Project Management", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["MS SQL", "Software Development", "Material Management", "RDBMS", "Oracle Portal", "Providing Training", "Data Structures", "End User Support", "Application Engineering", "Oracle PL"]}