{"Job Title": "Software Development Engineer - Test - Automation/ API Testing", "Company": "Lending Hands", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Mandatory Skills : python, linux, unix, restapi, test framework, automation testing, software testing, soap, qa, python automation Job Description : We are looking for people who believe in challenging the status quo and are ready to be a part of this change. If you are the one who is looking to take a leap of faith and work on the technology of the future, if you obsess over customer satisfaction and experience then we are looking for you. Key Responsibilities : - Automate test plans for APIs, User Interface and Other software components in Hevo's entire technology stack. - Use Java/ Python to build scalable automation use cases/tools. - Able to work independently and with the team to deliver test plans and test cases successfully. - Work consistently with a thorough, thoughtful, data-driven approach and incorporates best practices. - Write automated tests that are maintainable and reusable. - Constructively identify problems and propose solutions, taking on projects that identify and mitigate risk while measuring software quality. - Establish good working relationships with team members and peers working on related software. - Participation in design and code inspections. - Ability to analyze automation frameworks suitable for projects - Perform manual testing, the scope of which will encompass all functionalities of services as a prequel to automation. - Analyze test logs; create test reports, co-ordinate with stakeholders. Additional Information : Key Requirements : - Bachelor's degree from a tier 1 or tier 2 institution with 4+ years- experience working in QA, developing automated tests for enterprise products. - Proven coding skills in Python on Unix/Linux platforms - Experience with REST or SOAP and a history of working with API based applications - Experience writing or enhancing test harness/framework is desired. - Strong understanding of databases. Required Qualification : B.Tech/BE from a Tier 1/2 institution only Job Insights : Vital inputs for the search : - Test Engineer position with expertise / proven experience using Python to build frameworks- Worked in core backend, having a Good understanding of databases in application system (like hubspot, mailchimp, etc) - Experience in REST API & UI Testing - Candidates from Tier-1 or Tier 2 colleges only - Early joiners (Joining within 30 days, Notice period Buyout is possible) - Virtual Onboarding is possible - Open to candidates willing to relocate - Open to a Notice period Buy-out Interview Stages : 5 to 6 rounds of interview. Including 3 technical rounds Required Candidate profileCandidates required from TIER 1 and TIER 2 Institutes. ", "Role": "Testing Engineer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - QA & Testing,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "Doctorate Not Required", "Key Skills": ["SDET", "Automation Testing Tools", "Software Quality Assurance", "API Testing", "Automation Testing", "UI / UX Testing", "Testing", "Python"]}