{"Job Title": "Hiring Freshers -AR Associate/Call center/US Healthcare/Sat n Sun Off", "Company": "Black and White Business Solutions Pvt Ltd", "Experience": "0 - 3 years", "Salary": "₹ 2,25,000 - 3,75,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": "Dear Candidate,Greeting form Black and White Business Solution Pvt Ltd..!!  Walkin for TOP BPO Leading Healthcare Company - Medical Billing / AR Caller / Claims Associate / Sr. Associate Contact : HR Harshitha -9742674848Email - hr4848@blackwhite.inShift : US Fixed Shift ( Saturday and Sunday FIXED OFF ) with  2way CAB Education : 10+2/ UG / 10+3 / Diploma / BCA / B.Com / BE / B.Tech / BBA any Graduate or under graduate in any Specialization with Relevant Experience  Designation: AR Associate / AR Anlayst / Claims Associate /  Analyst / Associate Job Roles : Ensures efficient processing of denials and appeals. Meets cash collection goals by reviewing , analyzing , completing , and submitting appropriate documentation based on payer requirements. Conducts research and provides updates and current status of collection efforts using the appropriate data management systems. Performs extensive follow - up and collections for third parties , resolving issues that are adversely impacting claims payment.  Communicates information and ideas to make system - wide process improvements. Updates data regarding changes and modifications in plan benefits and other contract information relevant to billing or claims follow up and collection processes.  Completes special projects as assigned. Serves as a communication link to various departments , external payers or vendors by developing positive relationships with managed care organizations and outside agencies , and clinical areas within the organization. Performs liaison services to both internal and external customers providing assistance in billing , collections and claims resolution.  Reviews and responds to correspondence and inquiries generated by third party payers. Provides medical record copies and other pertinent information to the appropriate sources throughout the collection process. Assists with education of internal staff and external customers to bring about the timely , accurate , and cost effective Adjudication of all claims.Required Candidate profile Desired Candidate Profile Possess good analytical skills - detail oriented Possess good communication skills, both oral and written Have a good attitude - should be committed to the work.Benefits Best in the industry + Incentives + NSAFor more quires please call Contact : HR Harshitha -9742674848Email : hr4848@blackwhite.in (OR Walkin Date :9th march - 12th March 9am to 1pm)Venue : Black & White Business Solutions #721, 2nd floor, CMH Road Indiranagar, blore-38 Landmark: OPP MK Retail, Next to Andhra Bank. Land Mark: Next to Andhra bank or Opposite to MK Retail.  Please carry 2 copies of resume with all the educational documents  and Aadhar card. Required Candidate profileOne day interview process  and Immediate JoiningDesired Candidate Profile   * Possess good analytical skills - detail oriented  * Possess good communication skills, both oral and written  * Have a good attitude - should be committed to the work.* Any graduates can appear or 10+2 , 10+3.* Should be flexible with rotational shift.Perks and Benefits Best in the industry + Incentives + NSA************PLEASE DO REFER YOUR FRIENDS*************  ", "Role": "Associate/Senior Associate -(NonTechnical),", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Graduation Not Required, Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization, Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["BPO", "AR Analyst", "US Healthcare", "Revenue Cycle Management", "AR Calling", "Accounts Receivable Executive", "Accounts Receivable Analyst", "AR Caller", "Call Center", "RCM", "International BPO"]}