{"Job Title": "Sr Software Engineer Development", "Company": "RedLock, Inc", "Experience": "10 - 15 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "    Your Impact     Responsible for complete software development process including requirement analysis, design, development, deployment, and support   Write clean, testable, readable, scalable and maintainable Java code that scales and performs well for thousands of customers   Participate actively and be a factor to design and development discussions   Develop a strong understanding and be able to explain advanced Cloud Computing and Cloud Security concepts to others   10 years of solid experience building web applications in Java/J2EE      Experience with open-source frameworks/servers (Spring, Hibernate, Apache Tomcat)   Strong computer science fundamentals (e.g. understanding of lock-free data structures, bloom filters, minimal perfect hashing, consistent hashing, etc.)   Experience designing, building operationalising highly scalable distributed applications   Experience in designing/building scalable micro-services based architectures and REST APIs.   Demonstrated experience working with at-least one Public Cloud Service (AWS, Azure, GCP, OCI, Alibaba) and invoking their APIs at a high scale.   Hands-on experience building applications using at-least 1 SQL database and in-memory database.   Demonstrated experience with at least one messaging system such as ActiveMQ, Kafka, RabbitMQ, SQS etc.   Experience in building multithreaded concurrent systems.   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Cloud computing", "activemq", "Hibernate", "cloud security", "GCP", "Social media", "Data structures", "Open source", "Analytics"]}