{"Job Title": "Senior Software Engineer – Product Development", "Company": "Foray Software Pvt Ltd", "Experience": "2 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Greetings from Foray Soft Pvt LtdWe are looking Senior Software Engineer.Roles and Responsibilities Design and development of software platforms/products/data platform pipeline Strong problem-solving capability. Analyse business issues and technical problems independently, andcome up with smart, logical solutions. Participate in product releases through requirement reviews, development, deployment, setting upenvironments, documenting release notes and technical details regarding functionality and configuration. Desired Skills:Graduate(BE/BTech/MCA) in Computer Science or equivalent from a premier institute with 2 4years hands-on software development experience Strong hands-on experience in development using Java and Spring framework Expertise in developing microservices using Spring Boot, Spring Data JPA and Spring Security. Experience in working with Angular, HTML and CSS and JavaScript Database programming knowledge using any flavours of SQL Exposure across all the SDLC process, including testing and deployment Experience in Azure Infrastructure and Azure DevOps (CI/CD) will be a strong plus Good knowledge of Python or Scala will be a plus Team player with an inclusive approach to decision making. Experience with Agile methodologies like Scrum and Test Driven Development is a plus Proven track record in keeping existing technical skills and developing new ones, so that you canmake strong contributions to architecturediscussions around systems and applications in the cloud (Azure, AWS or GCP)If interested, can you revert on  divya.chatla@foraysoft.com Thanks & Regards,Divya.CH  Mobile No: 9154954658 Foray Soft Pvt Ltd.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Client/Server Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Product Development", "Java", "Software Engineering", "SE/SSE"]}