{"Job Title": "Software Development Analyst", "Company": "NTT Data", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "  Roles Responsibilities       Team member is responsible for the below listed activities.      Writes efficient, re-usable, optimal, and well documented code.      Designs, codes, tests and documents software programs for systems of the moderate to high complexity and engages in peer code reviews.      Perform architecture, design and review of development policies for adherence to standards and best practices      Participates in client/ external interactions on technical matters.      Drives engineering processes for the project such as build automation, unit testing, software configuration management and packaging.      Being a team player and adhering to project schedule.      Writing code enhancements and supporting existing code.      Providing guidance to junior developers in the team      Should have good logical skills and experience in delivering good quality code.      Provide software solutions to customer issues and responds to suggestions for improvements and enhancements / new tools.      Interacts with business users, I/T, vendors and customers to Identify potential tasks with production teams, customers and implement Robotic Process Automation including other applicable technologies for current and future application requirements       Required Skills: - Technical Skills       Minimum 3 years of relevant experience as developer in Microsoft technologies(C#, VB.NET)      Minimum 1 year hands on experience in SQL development      Minumum 2 years hands on experience in building RPA solutions using Automation Anywhere/UiPath tool       Desired Skills       Domain Knowledge: Healthcare, Banking Financial, Supply Chain or Manufacturing      BPO industry related domain background.       Preference:       Graduate degree in Computer Science      Certification on Automation Anywhere/UiPath (preferred).    ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["BPO", "Supply chain", "Computer science", "Process automation", "SQL database", "Software configuration management", "Packaging", "Healthcare", "Unit testing", "Software Development Analyst"]}