{"Job Title": "Content Writer (Female)", "Company": "Evodigital Technologies Private Limited", "Experience": "0 - 1 years", "Salary": "₹ 2,00,000 - 2,75,000 P.A. ", "Location": "Chennai", "Job Description": " Evodigital Technologies is looking for a dedicated content writer who has excellent writing skills. We need people who research and create content for articles, websites, blogs, social media, and product descriptions. Candidates should be able to understand the latest SEO techniques and contribute excellent content to increase reader engagement.ResponsibilitiesUnderstand requirements and do the industry research online to write quality contentCreate compelling headlines and product descriptions to attract target audienceUse SEO techniques in writing content to increase the website trafficCreate related and SEO optimized content for multiple platforms, websites, content marketing blogs, email marketing, videos and social media postWork with marketing team and design team to understand clients products and advertising needsMake improvements to the current content as per the requirementsWrite fact-filled content that convinces people to take favorable actions.Proof-read and provide plagium free contentBasic Qualifications0-2 year of experience as content writerAny Graduate in any specializationCreative writing skills that make readers easy to understandHighly organized and ability to handle tight deadlinesExcellent communication skills and interpersonal skillsCapability to understand complex topics.Proven ability to handle multiple works simultaneouslyFamiliarity in working with Microsoft office suite. ", "Role": "Fresher,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - eCommerce, Internet Technologies,", "Employment Type": "Full Time, Permanent", "Role Category": "Other", "UG": "Graduation Not Required", "Doctorate": "None", "Key Skills": ["SEO Writing", "Blogs", "Blog Writing", "Content Writing", "Communication Skills", "Creative Writing", "Writing Skills", "Content Analysis", "Content Editing", "Content", "Content Development", "Web Content Writing", "SEO"]}