{"Job Title": "Software Development EngineerTest", "Company": "GRUNDFOS", "Experience": "6 - 11 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "          Job Purpose    End to end product verification and play a key role in testing product SW for various applications in the Grundfos pumps and drives to ensure that we continue having the world best products by testing embedded software in close colaboration with the other developers using our common software platform. We work in an agile environment where flexibility is a natual thing as well as the ability to plan your own day      Key Responsibilities      Test development and test of new different embedded SW for product applications and products to the full value chain as a part of Product development team and ensure that it is working as expected.     Quality improvement on existing software, troubleshooting test   Build and share knowledge       Test architecture governance     Contribute to enhancements of existing test architecture and framework    Contribute to test governance   Identify tools based on application domain complexity and needs   Process implementation   Identify and implement best practices in the team with respect to test       Product/System Development     Support test set-up and maintenance.   Test plan / test case / test environment preparation   Drive and develop re-usable test scripts   End-to-end System Testing   Field issues support    Test automation   Configuration management   Ensure test beds are operational in line with CI framework       What you need to apply     Work experience in testing embedded work products in Embedded C   Test principles, test driven development, test automation and writing test cases.   Experience in using the protocol testing/analyzer tools for testing protocols (Wireshark, Modscan, Modbus Conformance Tool, Bacnet ).   Knowledge of scripting languages like Python, Java   Any continuous integration tool. Preferably Jenkins.   Any version control tool. Preferably GIT   Have good understanding of software failures;   Embedded concepts at SW as well HW levels.   Emulators, OCD and other tools.   Hardware related testing (Peripherals, schematic reading, oscilloscope, Multi-meter etc).   Documentation.   Experience of 6 years of relevant work experience after formal degree of B.E/ B. Tech, M.E/M.Tech (Electronics Background       Competencies     Should be highly collaborative with colleagues around the world.   Working in agile teams and is self -organized   Individual contributor as well a good team player in a multi-culture environment.   Is able to understand technical problems and make them simple to implement   Challenge the team on assumptions and dependencies   Is able to focus on possibilities instead of seeing the limitations present   Achieving Personal Work Goals and Objectives    Strong attitude towards Quality and Process.   Open to share knowledge and contribute proactively.    Ability to Listen actively and understand requirements accurately, with good oral, written and presentation skills in English           ", "Role": "Software Developer,", "Industry Type": "Construction, Engineering, Cement, Metals,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Embedded C", "System testing", "Version control", "GIT", "Test scripts", "Configuration management", "Agile", "Test cases", "Python", "Embedded software"]}