{"Job Title": "Sr. Solution Architect & Software Development", "Company": "Leader Document Processing Pvt. Ltd", "Experience": "6 - 10 years", "Salary": "₹ 60,000 - 1,25,000 P.A. ", "Location": "Delhi / NCR", "Job Description": " Responsibilities We Ask For: Minimum of 6+ years real world experience implementing modern, efficient, scalable, fast-convergence application and infrastructure design, micro-service architectures, responsive, stateless, and distributed architecture/platform which ensure long term technical viability of new application developments and business demands. 8+ years as senior solution      architecture / software developer / team leadExperience in hands-on      platform ownership, design, and deploymentExperience in building and      using Micro-services, PaaS, Docker, and Container PlatformsSubject Matter Expert of AWS      services and technologiesExperience in building      SAML/SSO/OIDC and other authentication/authorization technologiesExpert in AWS Lambda function      coding and development Experience with Continuous Integration and      DeliveryDefine solution architecture,      generating detailed technical designs and workflow for use in developmentHelp to improve the banks      current technology servicing platform and architecture layer Ensure platform requirements      are met in accordance with business demands and needsHelp to accelerate new      technologies and methodologies to support the bank’s digital      transformationMust have in-depth understanding across      infrastructure and applications landscapeDevelop and support with API      integrations with external party vendorsAbility to think-big,      challenge conventional status-quo, and make strategical impactsHelp to establish a future-proof      systems architecture roadmap and technology strategy Partners with the CTO and      business leaders to act as a technology enabler and push innovationWork with the development      team and able to step-in and assist with various development projects as      necessary Strong leadership and negotiation skills      with business and technical groupsStrong familiarity in      computer languages: C#, Python, ASP.Net, Java, JavaScript, React,      SQL/Database, Git, PowerShell Must have AWS      certifications Wish List from Us: Project Management & Capacity PlanningArtificial Intelligence and Machine LearningExperience with mobile application developmentSecurity in Software Development LifecycleExceptional technology presenter and mentor", "Role": "Technical Architect,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Sc in Computers", "PG": "M.Tech in Any Specialization", "Doctorate": "None", "Key Skills": ["Java", "software development", "cloud architecture", "C#", "python", "sr. solution architect", "Powershell", "PaaS", "react", "SAML", "Mobile Application Development", "SSO", "GIT", "Aws Lambda", "Docker", "Javascript", "ASP.Net", "SQL Database", "java script", "OIDC"]}