{"Job Title": "Chat Support Executive", "Company": "Concentrix Daksh Services India Private Limited.", "Experience": "0 - 3 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram( Sector-24 Gurgaon, Cyber City )", "Job Description": " Job description : We are hiring for Chat - Customer Support at Concentrix Gurgaon/Gurugram ! Spot offers for immediate joiners ! TOTAL Openings 200Work Location: Gurgoan ( DLF cyber city Phase III )Freshers ( or ) - 0.6 months Mode of Interview : Telephonic /Video call INV only Interviews from : Monday to Saturday Time : 9.30am to 5.30 pm Salary and Benefits :Fresher 2.30L to 2.60L per annum (Inclusive PF, Gratuity)Qualification: Graduates / Undergraduates or Diploma Holders /HSC passed ( Arrears/Backlogs can be considered) .Interview Process: HR RoundCommunication RoundTyping Test (Min 25 wpm/90% Accuracy)Chat Round Final Ops RoundWork Shifts/ Hours:  24/ 7 Rotational Day & Night shift . 5 days working ( Rotational OFF)Roles and ResponsibilitiesUnderstand customer queries by Chat and respond to it ensuring that all queries/concerns are answered.Answers their questions in a clear and concise manner using full sentences without grammatical and spelling errors.Respond to customers in the prescribed format given by the client.Exhibits promptness and politeness using the appropriate verbiage while answering customer queries.Desired Candidate Profile :Ability to work well under pressure with high attention to detailDecent English communication with HINDI ( Both Oral & Written) and interpersonal skillsAbility to work in a team or as a single contributorAdaptability / Flexibility on shifts, Ownership and initiativeBeing Active & Energetic Disclaimer:Neither Concentrix Technologies (India) Private Limited nor any authorized 3rd party who assist with our recruitment process, ever ask candidates for 'Recruitment', 'processing' or any other kind of fees in exchange for offer letters from Concentrix. Offer letters and other recruiting correspondence from Concentrix are printed on Concentrix letter head with authentic signatures of appropriate Concentrix authorities. Regards Talent Transformation TeamConcentrix GGN ", "Role": "Associate/Senior Associate -(NonTechnical),", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["BPO", "Email Support", "Customer Support", "US Shift", "Back Office", "Chat", "Non Voice", "International BPO"]}