{"Job Title": "BPO | International Chat Process | Salary upto 3.5L #Manali", "Company": "Oxilum Technologies", "Experience": "0 - 5 years", "Salary": "₹ 2,25,000 - 3,50,000 P.A. ", "Location": "Chennai", "Job Description": "Please find the below job description for  International Email & Chat Process  Job Title: Technical / Customer Support    Qualification  Any (Graduation is not mandatory)   Requirements  -Excellent communication skill in English - Freshers  or minimum 6 months of international voice/Chat/Email experience is must  Job Description- Research customer problems and deliver solutions- Deliver an experience to every customer, meeting Clients service standards- Respond to 60-70 emails per day through template and long form email responses to customer email inquiries- Achieve and maintain required metrics and goals- Work pro-actively to ensure potential issues are escalated appropriately.- Work as part of the team to ensure the program floor is a positive and professional environment.- Provide support in projects and initiatives as and when required. Shift Rotational Shift (5 Days Work 2 Days Rotational Off) Salary  For Fresher up to 2.2 L CTC + IncentivesFor Experienced up to 3.5 L CTC + Incentives Rounds of Interview Manager Round, V&A and Written Round. For more details Call or Ping MANALI @ 9790848602 or  mail @  oxilum2@gmail.com    Regards, Manali  HR - Oxilum  ", "Role": "Associate/Senior Associate -(NonTechnical),", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Graduation Not Required, Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization, Post Graduation Not Required", "Doctorate": "Any Doctorate in Any Specialization, Doctorate Not Required", "Key Skills": ["BPO", "Symantec", "Email Support", "International Call Center", "Telstra", "Semi Voice", "Norton", "Antivirus", "Voice Process", "UK Shift", "McAfee", "Chat Process", "Customer Support", "graduate", "Technical Support", "Fresher"]}