{"Job Title": "Manager Software Development", "Company": "Full Potential Solutions", "Experience": "3 - 7 years", "Salary": "Not Disclosed", "Location": "India", "Job Description": "         Some exciting initiatives we are working on are:      Creating AI driven conversational experiences for a wide spectrum of global enterprises      Designing and development amazing user experiences across data visualization and analytics in the customer engagement / contact center industry      Salesforce based solutions for omni-channel customer engagement leveraging AI to enhance contact strategy and routing,  guide agents on next best action (NBA),  enable dynamic scripting,  capture voice of customer (VOC)     Developing standardized AI/ML models to optimize customer engagement and agent performance using various Python frameworks and AWS services (Transcribe,  Comprehend,  Sagemaker,  etc.)     Developing a comprehensive Data,  Analytics and Reporting platform to integrate,  measure and analyze millions of daily customer interactions/metrics across all our clients      Building web/mobile apps to improve agent/manager performance across thousands of agents (metrics,  gamification,  collaboration)     Deploying cutting-edge,  tech-enablement services using the AWS ecosystem,  including microservices and serverless architecture,  CI/CD pipelines,  event notification services,  search services,  multi-tenant architecture and lots more.           Responsibilities        You will:         Be a technical leader and valued contributor in an autonomous,  cross-functional agile team     Collaborate with multidisciplinary team of business users,  product managers,  ux designers and senior engineers to understand the product vision,  bring the vision alive through the creation of elegant and robust solution     Produce documentation from architecture design to technical specification     Design,  develop and deploy high-quality,  enterprise scale code on our AWS cloud infrastructure     Work hands-on across the entire software stack comfortably     Provide oversight through code and design reviews for features delivered by the team members      Mentor our team members in development technologies,  tools,  and processes     Develop test strategies,  design automation frameworks,  write unit/functional tests to drive up code coverage and automation metrics.     Take responsibility for your code and features right from working with product management all the way through to deployment and thereafter.     Work closely with our Product Management,  Chief Architect and back-end team to develop an optimal architecture for the API integration points     Develop high-quality,  production ready code with optimal CI/CD pipelines on AWS for rapid iteration of the application     Learn and apply new technologies continuously     Take ownership from design to delivery as a senior member of the team     Work directly with and learn from the business,  product and engineering leaders across the organization     Exhibit our core values: integrity,  excellence,  accountability and grace          About You:        We are looking for an entrepreneurial senior software development manager who can lead and deliver a product for our product development team. We are looking for someone who has a very good understanding in SDLC and Product development from scratch. Must be willing to take any challenging tasks and deliver,  should be language agnostic. Exceptional team player and leader by example.     Qualifications         Your experience and skills:         Be a technical leader and valued contributor in an autonomous,  cross-functional agile team     Collaborate with multidisciplinary team of business users,  product managers,  ux designers and senior engineers to understand the product vision,  bring the vision alive through the creation of elegant and robust solution     Produce documentation from architecture design to technical specification     Design,  develop and deploy high-quality,  enterprise scale code on our AWS cloud infrastructure     Work hands-on across the entire software stack comfortably     Provide oversight through code and design reviews for features delivered by the team members      Mentor our team members in development technologies,  tools,  and processes     Develop test strategies,  design automation frameworks,  write unit/functional tests to drive up code coverage and automation metrics.     Take responsibility for your code and features right from working with product management all the way through to deployment and thereafter.     Work closely with our Product Management,  Chief Architect and back-end team to develop an optimal architecture for the API integration points     Develop high-quality,  production ready code with optimal CI/CD pipelines on AWS for rapid iteration of the application     Learn and apply new technologies continuously     Take ownership from design to delivery as a senior member of the team     Work directly with and learn from the business,  product and engineering leaders across the organization     Exhibit our core values: integrity,  excellence,  accountability and grace        ", "Role": "Technical Architect,", "Industry Type": "Strategy, Management Consulting Firms,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Product management", "Computer science", "Automation", "Agile", "SMS", "data visualization", "SDLC", "Analytics", "Python", "Salesforce"]}