{"Job Title": "Team Lead - Software Development - Java/HTML", "Company": "Newgen Software Technologies", "Experience": "5 - 7 years", "Salary": "Not Disclosed", "Location": "Noida", "Job Description": "Roles and ResponsibilitiesJob Description:- Translating system requirements into the design and development of systems.- Transform vital business needs into code and drive innovation.- Collaborating and integrating code into enterprise systems.- Creative problem-solving skills.- Attitude to achieve the goals with complete ownership and hard work.Must have:- Engineering. degree in Computer Science ( Full Time through out 1st Div.) with 5-7 yearsof experience in in software design and development, database design and development, and system integrationTechnical Skills:- Thorough knowledge of current technological trends in Web based Software - Strong experience in Responsive Front End Development using HTML5, JavaScript, CSS3, JQuery, Ajax and JSON- Working knowledge of JSP, Web application development and Core Java- Working knowledge of working with databases using EJB.- Knowledge of Bug Tracking tool such as Jira, Bugzilla and source code version control systems (SVN, GIT)- Knowledge of working in Scrum methodology.- Good to have knowledge of SonarQube and Web Security Aspects.- Should be able to write test cases for the feature.- Ability to gather and analyze data & draw logical conclusionsResponsibilities:This being an advanced level position in the S/W development team the individual is expected to:- Participate as a team member in all phases of S/W lifecycle, including the analysis and design of S/W systems.- Participate in detail level of coding, code walk - through and unit testing of S/W modules.- Participate in integrated testing of product/ package.- Participate in difficult and typical coding assignments with responsibility of a small module consisting of 3 - 5 members.- Participate in exploration/ feasibility study of product.- Have a thorough understanding of assigned product/ project.- Participate in generating of technical documentation of product/ package.- Providing technical training to the juniors.- Manage allocated resources, keep compliance with discipline and decorum of the organization.- Keep compliance with Newgen Quality Systems and Procedures.", "Role": "Team Lead/Technical Lead,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["Java", "JSP", "Javascript", "HTML", "Scrum", "SDLC", "Project Life Cycle"]}