{"Job Title": "Process Executive-Non Voice (Freshers/Experinced)", "Company": "EQUINITI INDIA PRIVATE LIMITED", "Experience": "0 - 2 years", "Salary": "Not Disclosed", "Location": "Chennai( Ramapuram )", "Job Description": " We have an exciting opportunity for a Process Executive - Non Voice to perform operational accounting activities related to transfer agency and maintenance. Duties may include: Providing operational accounting support to internal business groups and/or operations departments. Ensuring that transactions are being managed within the Process procedure and policy requirements.Business Functions:EQI Operations as team carry out a range of activities in accordance with the predetermined procedure and service standards under appropriate guidance and direction. the scope of these activities will range across all Equiniti's business lines.The successful candidate will be responsible for the following duties:Analysing and reviewing shareowner/client documents for accuracy; tracing and investigating transactions to resolve questionable data and applying corrective actions when necessary.Knowledge on accounting concepts and principles.Performing customer account maintenance duties.Reviewing taxes/share balance. Assists and provides guidance to lower level operations accounting clerks and specialists with reconciliation of complex problems.The successful candidate should posses the following skills and behaviourGood written and oral communication skills.Strong analytical and problem solving skills.Able to multi task able to work under pressure and under own initiative.Eligible Criteria:Any GraduatesYears of Experience in Non Voice from 0 to 2 years.", "Role": "Associate/Senior Associate -(NonTechnical),", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Communication Skills", "Email Support", "handling queries", "Oral Communication", "Problem Solving", "Non Voice", "Operations"]}