{"Job Title": "Linux Kernel Engineer", "Company": "Brainstorm Technologies", "Experience": "4 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "\n\nKernel Engineer with development experience in software design ,  debug ,  and verification of drivers and kernel code. You will use your nb\u0006pdeep understanding of kernel development ,  scheduling ,  locking and performance; to contribute to and interoperate within in a highly scalable multi-protocol network attached file system. \n\nDevelopment and maintenance of drivers and Linux kernel code.\n\nThis position will interface with Hardware engineers ,  Software Engineers ,  Manufacturing engineers and the Field Service Engineers. Some of these will be located at remote sites. Collaboration and interaction with other groups and remote teams is essential for development.\n\nThe successful Software Engineer must demonstrate good problem solving and analytical skills.\n\nGood verbal and written communication skills are also essential in daily functioning\n\nWork with the Linux community.\n\nRequirements\n\n4 years or more experience in software development.\n\nPrevious experience in building commercial customer products\n\nLinux Kervnel development experience\n\n Device driver implementation in 2.6.x\n\nExperience with performance optimization for low latency application s\n\nClient / Server implementations\n\n C ,  C \n\nExperience in building highly scalable systems\n\nDemonstrated ability of strong software designs and debug skills\n\nSelf Starter with the ability to remain flexible and learn new technologies quickly\n\nClose interaction with development management (both local and remote)\n\n Must have excellent troubleshooting / debugging skills ,  using a variety of tools such as gdb ,  gprof\n\nAbility to interact and collaborate with other senior engineers in different geographies\n\nExcellent teamwork; written and verbal communication skills.\n\nExperience developing distributed / clustered systems\n\nExperience developing NAS protocols\n\nFile system I / O\n\nStrong Networking skills\n\nScheduling and multi threaded applications\n\n", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["Analytical skills", "Development management", "Software design", "Linux", "Networking", "Linux kernel", "Debugging", "Performance optimization", "Scheduling", "Troubleshooting"]}