{"Job Title": "Mean Stack Developer", "Company": "QUOVANTIS TECHNOLOGIES PVT LTD", "Experience": "4 - 6 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad, Bangalore/Bengaluru, Delhi / NCR", "Job Description": "Experience - 4-6 yearsIs software engineering your passion? Are you always hungry for challenges? Do you liketo take risks? Do you always crave to learn more and more? Do you like to help otherssolve their problems? Do you like to solve complex problems by simple methods?We have: Culture to promote learning and growth by relentless focus on innovation. A team of aces to work with Streamlined engineering processes woven around Agile methodology withthe help of tools Design led engineering focus Opportunity to work on B2B and B2C products in various domainslike healthcare & education Opportunity to work on cutting edge technologies like IoT, Azure, AWS,Power BI, ML, Data Analytics etcYou have: Proficiency in Node.js, Angular, Javascript, REST, Shell scripting Good knowledge of MVC Frameworks Completed hands-on and is able to deep dive into the code. Proven skills to create technical solutions and take architectural decisions. Good understanding of commonly used design principles and design patterns An experienced grasp of version control, branches and git in particular Thorough knowledge in NoSQL database design and development Thorough understanding of working in development, staging and production environments Understanding of Vagrant, AWS Codedeploy, Cloudformation Unix related skills including installation with apt-get, compiling from source, intermediate shell scripting Working experience building high performance and scalable applications Ability to troubleshoot and debug application for functional and common problems Should have good written/verbal communication skills.You might also have: Working experience with Scrum methodology Good written and Verbal Communication Skills Exposure to various tools that help in maintaining code quality like SonarQube Exposure with Atlassian JIRA application lifecycle management tool", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Javascript", "Node.Js", "Angular", "Rest", "GIT", "NoSQL", "Mean Stack", "MVC", "AWS", "Vagrant"]}