{"Job Title": "Analog Design Engineer", "Company": "Orca Systems", "Experience": "4 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Job DescriptionYou will design and verify blocks for Orca s next-generation products. You will work with the system team and the RF/Analog IC team to define architectures based on high-level specifications and lead the system level validation of these circuits. You will participate in integration of these designs into the products and will be responsible for design validation, debug, and characterization through product release..\n\nRequired Skills\n\nBE in Electrical/Electronics Engineering with 4 to 8 years of experience in Analog design or ME/MS in Electrical/Electronics Engineering with 3 to 7 years of experience in Analog design\n\nResponsible for designing, developing, modifying and evaluating analog and mixed signal circuits.\n\nHas strong grasp of low power techniques, and must possess strong intuitive and analytical understanding of transistor level design, layout, and simulation.\n\nknowledge of band gaps, bias, op-amps, switched-cap circuits, LDOs.\n\nknowledge of low noise design techniques.\n\nExpertise in RF/Analog circuit design in sub-90nm CMOS.\n\nStrong CMOS device physics knowledge as it applies to analog IC designs.\n\nHas hands on experience with designs of low power and high performance converters (ADC/DAC) including Delta Sigma, SAR, Pipeline and Current steering(DAC) converters.\n\nFamiliarity with Cadence analog design suite Virtuoso, Spectre/RF, VXL, etc.\n\nExperience in VerilogA/Matlab modeling\n\nHands-on experience testing your own designs in the lab, and you must be able to define characterization and production test techniques for all building blocks.\n\nCommunication and presentation skills are critical, and a strong desire and potential to lead technology development.Job Location\n\nBangalore, India.\n\nPosition Type\n\nFull-Time/Regular\n\nProduct Inquiry", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Embedded, EDA, VLSI, ASIC, Chip Design,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["RF", "Simulation", "ORCA", "SAR", "Mixed signal", "Analytical", "analog circuit design", "MATLAB", "Analog design", "Virtuoso"]}