{"Job Title": "Principal Engineer", "Company": "Continuum Managed Solutions LLP", "Experience": "8 - 12 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": " Division:Engineering Role & Responsibility • Guide, mentor and provide direction to development team to successfully deliver projects. • Design, develop, code and test program logic, coding programs, program documentation and planning of software programs. • Collaborate with developers, testers, architects, product manager, to plan, design, develop, test business  applications on various technologies. • Oversee the development cycle, i.e. from user requirements to delivery. • Ensure that standards of coding follows global standards by establishing good coding practices. • Monitor production programs for expected performance and respond to errors and emergency problems  with a high sense of urgency. • Assist architect in determining system requirements and appropriate environments to meet operational  needs and performance objectives. • Support in gathering user requirements, determine estimates, and draw up work plans. • Conduct debugs for user related problems related to existing applications and collaborate with Technical  Architects to solve complex problems. • Conduct testing, and integration of software applications as per the requirements of project. • Collaborating with Architects, Testers, DBAs, product owners on refactoring and new development design  and planning, participating in Scrum rituals (standup, backlog refinement, planning, etc.) • Understand the migration process and prepare programs for migration. • Prepare any operational documentation related to application development • Must be able to work with cross functional global teams  • Must be involved with architects to work on SDDs,prototyping,blueprints and estimation Required Skills: • Good knowledge of front end and backend technologies, and full stack experience such as React JS/Angular JS/ Python .Golang Java, AWS, Docker,Lambda • Able to conceptualize and design high quality product features. • Must have wide breadth of technical knowledge and exposure. • Experience of developing services oriented architecture (SOA). Knowledge of enterprise architecture methodologies. • Working knowledge of infrastructure including servers, storage, firewalls, load balancers, routers, etc. • Exposure of modern patterns, technologies and methodologies like AngularJS, Node.js, MicroService architecture, TDD (Test Driven development). Educational Recommendations -  BE-Btech, Me- Mtech", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "M.Tech in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["Golang", "Angularjs", "Java", "Angular JS", "Front End", "Docker", "TDD", "Javascript", "Node.Js", "Test Driven Development", "AWS", "Angular"]}