{"Job Title": "Data Engineer", "Company": "Palnar Transmedia Pvt Ltd.,", "Experience": "8 - 13 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru, Trivandrum/Thiruvananthapuram", "Job Description": "    Lead and deliver complete application lifecycle design,  development,  deployment,  and support for actionable BI and Advanced Analytics solutions     Design and develop data models and ETL process for structured and unstructured data that is distributed across the globe between Cloud and On- Premises     Develop and deliver solutions with data streaming capabilities for large volume of factory data     Demonstrate and document the development methodology,  results and insights to the business partners and senior leadership.     Work directly with management and Business units to design,  configure,  support cloud deployment,  and performance tuning/optimization.     Develop design documents and translates into component- level designs to accelerate development.     Competencies Experience Required/Desired     8+ years of experience in data modeling and ETL using industrial leading tools to process the data using RDBMS,  In- Memory and Bigdata data stores     5+ years of experience in deploying custom data solution using Talend     4+ years of experience in Big Data development using Cloudera Hadoop (Hive,  Impala Talend)     3+ years of experience in developing flows using data streaming,  batch processing,  and Microservices     2+ years of experience with AWS tools such as S3,  EC2,  ECS,  EKS,  SageMaker,  Aurora,  Redshift,  RDS,  Lambda Functions AMI,  ELB,  ALB,  NLB,  VPC,  Auto Scaling configurations,  DMS,  Amazon FW,  API Gateway,  IAM,  CloudTrail,  and CloudFront.     Multiple experiences in implementing solutions involving unstructured data using Talend     Strong problem- solving capabilities. Results oriented. Relies on fact- based logic for decision- making.     Ability to work with multiple projects and work streams at one time. Must be able to deliver results based upon project deadlines.     Willing to flex daily work schedule to allow for time- zone differences for global team communications     Strong interpersonal and communication skills     Degree in Management Information Systems,  Computer Science OR equivalent work experience in an IT organization     Additional Skills:     Having subject matter expertise in one or more of the functional areas such as Sales,  Finance,      Manufacturing,  production planning,  purchasing,  marketing,  engineering     Experience in demonstrating the challenges and recommendation to leadership team in a precise manner     Prior working experience with SAP HANA,  SAP ERP,  SAP BW environments     Experience in visualization tools     Experience in developing basic data science models using Python or a similar language     Java development and API management experience is a great plus  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Embedded, EDA, VLSI, ASIC, Chip Design,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Performance tuning", "Data modeling", "RDBMS", "Production planning", "Flex", "Dms", "Subject matter expertise", "Management", "Python"]}