{"Job Title": "Senior Software Engineer - Development (Java + ETL)", "Company": "MEDIAOCEAN ASIA PRIVATE LIMITED", "Experience": "5 - 6 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "Mediaocean is the mission-critical platform for omnichannel advertising. Processing $150 billion in annual media spend, Mediaocean provides foundational software to connect brands, agencies, media, technology, and data. With AI and machine learning technology to control marketing investments and optimize business outcomes, Mediaocean enables end-to-end management of campaigns from planning, buying, and selling to analysis, invoices, and payments. Mediaocean employs 1,200 people across 20 global offices and is part of the Vista Equity Partners portfolio.What You Will Do:You will be involved in development activities related to a particular application using Java, spring and hibernate.Tasks/ Duties will include:Complete software lifecycle involvement from initial specification through release and implementationUsing Java, SQL, Kafka and data warehouse knowledgeCandidate will be involved in development activities using Java/Spring-Hibernate, JSON, XML, JMS, JBPMInteraction with peers, Development Leads, Quality Assurance, DBA, UNIX Administrator.Understand of Database and write complex SQL statementsProvide work status and highlight risks on time in an Agile environmentWho You Are: Candidate should have total 5 to 6 years of experience working as Java.Java, SQL, Kafka and data warehouse knowledgeCandidate must have worked on spring, hibernate and OOP.Candidate must have worked on Agile Development.Candidate with Ant and Maven experience will be added advantage. Why Mediaocean? Mediclaim      Policy (Total Coverage: 7 Lakhs/year). Term Life and Accidental InsuranceInclusive      workplace environment.Professional      development opportunities within our Learning & Development programsHealth      Benefits - Health Check-ups, Fitness Activities.Belong@Mediaocean      affinity based groups of colleagues to create communityAll      of these benefits/perks are effective on the date of hireWe would hate to miss out on your application because you do not meet every requirement - transferrable skills and education will also be considered, so please do not hesitate to apply! Mediaocean recognizes our true strength and value shine when all our team members feel there is space in the conversation for their voices, thoughts, ideas, perspectives, and concerns. Mediaocean is committed to being an equal opportunity employer, and we consider all applicants regardless of their age, race, color, gender, sexual orientation, ethnicity, religion, national origin, disability, or veteran status.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Java", "JMS", "Maven", "data warehouse", "Hibernate", "Software Engineering", "XML", "JBPM", "JSON", "Spring", "SQL"]}