{"Job Title": "Software Development Engineer (SDE) - Intern", "Company": "Volercars", "Experience": "0 - 2 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": "Software Development Engineer  (SDE)   -  Intern Software Development Engineer  (SDE)   -  Intern  About the Role The role requires an engineer to be a part of the core engineering team and focus on development of robust,  scalable,  extensible software applications used by millions of users. We are trying to redefine the way India drives and approaches urban mobility,  the right candidate need to have urge to learn more,  be a self starter and innovator.  To focus on understanding the technical specifications and translate the same into reusable,  maintainable and executable codes within specified timelines and parameters of quality.  Key Responsibility Areas   Work on evolution of requirements along with technology and product managers.  Work and get exposure on varied technologies based on the allocated work stream iOS,  Android,  Core Java,  J2EE,  MySQL,  NOSQL,  Mongo,  Aerospike,  MemCache,  Lucene,  Nginx,  CDN,  Spring,  Hibernate,  DevOps,  MVC Frameworks and other upcoming internet technologies.  Responsible for coding,  documenting and maintaining web and mobile applications in a fast paced project environment.  Responsible for high end product development.  Continuously upgrading and building new technology skills and methodologies.  Innovate,  research,  propose and discuss design with your peers.  Work as directed by the line manager and be ready to change/ learn new technologies based on business demand.  Requirements  B.E./ B.Tech  (CS) /  MCA from good engineering institutes or universities.  With 0 to 2 years of work experience in a web/ mobile based environment.  Excellent Algorithms Data - Structure skills.  Excellent Object Oriented Programming skills.  Experience of at least one program language is a must and excellent refactoring skill.  Ability to take ownership of Modules delivery and leading a team.   VIEW DETAILS ", "Role": "Software Developer,", "Industry Type": "Travel , Hotels , Restaurants , Airlines , Railways,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "MCA in Computers", "Doctorate": "None", "Key Skills": ["Hibernate", "Core Java", "Algorithms", "Intern", "Coding", "Software Development Manager", "MySQL", "Software Development Engineer", "MVC", "Android"]}