{"Job Title": "Immediate Openings For Customer Service Executive- Voice Process", "Company": "Job Shop    ", "Experience": "0 - 5 years", "Salary": "₹ 2,00,000 - 4,75,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": " Some careers have more impact than others.If you're looking for a career where you can make a real impression, join BPO and discover how valued you'll be. We aim to be where the growth is, enabling businesses to thrive and economies to prosper, and, ultimately, helping people to fulfil their hopes and realize their ambitions.We are currently seeking an Fresher OR Experienced professional to join our team in the role of Customer Service ExecutivePrincipal responsibilitiesProviding Customer Service in Banking Domain via voice support.To resolve the queries of the customers.RequirementsFlexibility to work in a 24/7 environmentFlexibility in terms of week offsExcellent communication skills both written and verbalEfficiently handle inbound and outbound calls to resolve overseas customer queriesMaintain highest standards of audit and compliance requirementsBPO experience can be added advantage Additional Benefits-2way side cab facility.Medical insurance worth 1 lakhs.Group Term Life Insurance / Group Personal accident Insurance worth 5 lakhsGratuityEducation Assistance plan Annual entitlement of up to INR 24,000.Employee / Corporate discounts at majority of Retail Chains / Hospitals / Laboratories.Please call HR SUMA - 7406026000 / Drop a Wats app message with a Voice recording of your self introduction and resume , If I didn't respond to your call.", "Role": "Associate/Senior Associate -(NonTechnical),", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Graduation Not Required", "Doctorate": "None", "Key Skills": ["BPO", "Customer Service", "Professional Development", "Audit Compliance", "Customer Service Management", "Voice Process", "Inbound", "graduate fresher", "Voice Support", "Voice Processing", "Outbound Calling", "Communication Skills", "customer service processing", "customer care executive processing"]}