{"Job Title": "Openings For International Call center with joining bonus Call AYesha", "Company": "Job Shop    ", "Experience": "0 - 4 years", "Salary": "₹ 2,25,000 - 3,50,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": "Dear Candidate,We are hiring puc (12th)/Diploma/ undergraduates/graduates, freshers and experienced candidates for International Voice Process.Company Profile:[24]7.ai, is a global leader in intent-driven customer engagement solutions. We are redefining the way companies interact with consumers. We combine artificial intelligence with human intelligence to substantially improve customer experience. Our clients include more than 250 of the worlds largest brands and most recognizable brands across 12 industries.Contact Person: Ayesha -9513113000 or whats app on 6360075781Shifts: Candidates should be comfortable working 5 days with Rotational shifts and 2 split offs .Benefits:Transport: Free transportation with door to door pick up and drop facility round the clock.Life Insurance for selfMedical Insurance for self and immediate dependentsWorld Class FacilityCafeteria, Gym, Sports arena, Amphitheater, Theme based break-out zonesEligibility Criteria :Minimum qualification : Candidate should have completed 12th / 2nd puc or 3 years of diploma from a recognized university.BE /Btech and Graduates from any stream are eligible to apply.Freshers & candidates with prior relevant (bpo) and non-relevant (other domain) experience are eligible to apply.Post Graduate with BPO Experience can apply.Salary Range ( Voice process)-: 15000 to 22000per month take home salary (Based on Educational qualification & Prior work experienceRegards,Contact Person: Ayeshs 9513113000 or wehats app on 6360075781", "Role": "Associate/Senior Associate -(NonTechnical),", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Graduation Not Required", "Doctorate": "None", "Key Skills": ["Customer Support", "Customer Service", "International Call Center", "Outbound Sales", "Technical Support", "Customer Care", "Domestic BPO", "Domestic Calling", "Voice Process", "International BPO", "International Voice Process"]}