{"Job Title": "Senior Lead/SME - Software Development - Java/Python - eLearning", "Company": "Simply People", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Roles and ResponsibilitiesSenior Lead/SME - Software Development - Java/Python - eLearning/EduTechThe role demands candidates to work as a part of the program team(creating learning programs) and act as a resident subject matter expert for all the technical learning programs. The candidate shall be responsible for the following aspects of all the learning programs launched as a part of School of Software Engineering - Create and deploy our virtual lab environments, and integrate with other platforms, etc. where needed at full scale- Identify and implement the best-automated grading solution, and customize for our use- Create end-to-end industry-ready projects for our certificate programs in collaboration with various universities. - Create a full application(serving as hands on projects for learners) - including consuming and producing APIs, design and deployment on Heroku for Software Engineering learning programs- Develop modular applications and features that will be used for corporate and student learners- Being comfortable developing modular code using the test-driven development (TDD) methodology- Being a resident subject matter expert - scoping out the appropriate projects and solutions for a variety of needs - from companies that come to us with scenarios & use cases, to universities that bring us large-scale problems w.r.t training their workforce.- Engineering in Computer Science with 5+ experience tehno-functional experience with exp in Academics/Education projects, curriculum integration, innovation labs etc. ", "Role": "Technical Architect,", "Industry Type": "Education, Teaching, Training,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["Technical Architect", "Software Development", "TDD", "Java Architect", "IT Product Development", "Python"]}