{"Job Title": "Hiring Both Fresher&EXP For International Voice & Non Voice Process-\n", "Company": "Job Shop    ", "Experience": "0 - 5 years", "Salary": "₹ 2,00,000 - 6,00,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": " [24]7.ai Hiring for International Voice and Non Voice Process.Call your career negotiator on 9964080000Bangalore - International Voice and Non Voice ProcessDear Candidate,Greetings for the day,We are hiring PUC (12th)/Diploma/ undergraduates/graduates, freshers and experienced candidates for International voice process and non voice process.Company Profile:[24]7.ai, is a global leader in intent-driven customer engagement solutions. We are redefining the way companies interact with consumers. We combine artificial intelligence with human intelligence to substantially improve customer experience. Our clients include more than 250 of the worlds largest brands and most recognizable brands across 12 industries.Job Requirement :Minimum qualification : Candidate should have completed 12th / 2nd PUC or 3 years of diploma from a recognized university.BE /Btech and Graduates from any stream are eligible to apply.Freshers & candidates with prior relevant (BPO) and non-relevant (other domain) experience are eligible to apply.Good Communication Skills only in EnglishMaster Graduate should have atleast 1 year experience in bpo sector.Salary Range : 13,000 - 21,000 ( Take Home Salary) and incentivesShifts: Rotational Shifts and 5 days WorkingBenefits:Transport: Free transportation with door to door pick up and drop facility round the clock.Life Insurance for selfMedical Insurance for self and immediate dependentsWorld Class Facility - Cafeteria, Gym, Sports arena, Amphitheater, Theme based break-out zonesJob Designation : Associate and Senior AssociateWork Address: Bangalore -Marathahalli Outer Ring Road,You can also refer your friends if they are looking for a job.Ignore if already attended within 30days.Non Voice Process Interview Rounds:HROnline TestEssayOps RoundTo know more details or To schedule your interview, Call us on 9964080000, we have 30 plus lines open to answer you calls", "Role": "Associate/Senior Associate -(NonTechnical),", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Graduation Not Required", "Doctorate": "None", "Key Skills": ["BPO", "Communication Skills", "Email Support", "technical chat", "Customer Experience", "International Call Center", "Non Voice Process", "Artificial Intelligence", "bcom fresher", "Calling", "International Voice Process", "Customer Engagement"]}