{"Job Title": "Technical Writer - Software Development Life Cycle", "Company": "L A Consultancy", "Experience": "4 - 8 years", "Salary": "Not Disclosed", "Location": "Kochi/Cochin, Kochinda, Chennai, Bangalore/Bengaluru", "Job Description": "Roles and ResponsibilitiesRequirements :- Good written and verbal communication skills- Proficient in Microsoft Office- Familiarity with SDLC and software development- 4+ years- industry experience as an effective technical writer- Proven ability to quickly learn and understand complex topics- Previous experience writing documentation and procedural materials for multiple audiencesResponsibilities :- Write user-friendly content that meets the needs of the target audience, turning insights language that sets our users up for success- Evaluate current content and develop innovative approaches for improvement- Independently gather information from subject matter experts to develop, organize, and write procedure manuals, technical specifications, and process documentation- Analyze content marketing metrics and makes changes as needed- Collaborate with other departments to create innovative content idea- Regularly produce various content types, including email, social media posts, blogs etc.- Actively manage and promote our blog, and pitch articles in relevant platformsApply here with the following details :1. Total Relevant work exp (in years) :2. Present salary per annum :3. Expected salary per annum : 4. Notice period (preferred joining time 2 weeks) :5. Present Location :6. Are you willing to relocate?: Yes/No :7. Are your available for interview during the week days Monday- Saturday? : YES/NO", "Role": "Technical Writer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "QA/Testing/Documentation", "UG": "B.Tech/B.E. in Any Specialization, BCA in Computers, B.Sc in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["Technical Design Documentation", "Software Development", "Microsoft Office", "Technical Writer", "SDLC"]}