{"Job Title": "Tech Mahindra |International Chat Process |Fresher & Exp |Noida", "Company": "THR Consultants ", "Experience": "0 - 5 years", "Salary": "₹ 1,00,000 - 2,25,000 P.A. ", "Location": "Noida", "Job Description": " Tech Mahindra Hiring Fresher/ Experience for Chat Support  Salary upto- 17k@ Noida/ HR Connect- 9818031859.Salary - 16k - 17k CTC.Location- Noida Shift- Rotational Shift On the Spot Offer Letter\"To Fix up the interview schedule (Pls fix your interview schedule before walk-in):Contact Details_-HR Connect Mustafa-9818031859Interested candidates can coordinate with me for fix their interview (10AM -11PM).About The Tech Mahindra-Tech Mahindra represents the connected world, offering innovative and customer-centric information technology services and solutions, enabling Enterprises, Associates and the Society to Rise. We are a USD 4.0 billion company with 107,100+ professionals across 90 countries, helping over 800 global customers including Fortune 500 companies. Our innovation platforms and reusable assets connect across a number of technologies to deliver tangible business value to our stakeholders. Tech Mahindra is also amongst the Fab 50 companies in Asia as per the Forbes 2014 List.We are part of the USD 16.9 billion Mahindra Group that employs more than 200,000 people in over 100 countries. The Group operates in the key industries that drive economic growth, enjoying a leadership position in tractors, utility vehicles, information technology, after-market and vacation ownership.Job DescriptionTech Mahindra - Hiring for Email and Voice Process.Designation : Customer Service AssociateQualification Required : Graduate / Post GraduateExperience Required : 0 - 6 YearsSkills Required : Good Communication skills and basic computer knowledgeJob Roles & Responsibilities :1) Answer calls/emails professionally to provide information about products and services, take/cancel orders or obtain details of complaints.2) Keep records of customer interactions, details of inquiries, complaints and comments as well as actions taken.3) Process orders, forms and applications.4) Follow up to ensure that appropriate actions were taken on customers' requests.5) Refer unresolved customer grievances or special requests to designated departments for further investigation.Knowledge, Skills and Attitude:Should have very good convincing and selling skills.Should have good English communication skills.Under Graduate/Graduate/P.G./MBA will be preferred.Should be very confident and presentable.Fresher also welcomeEnergy levels should be highQualification and Experience: MBA/PG/Graduate/ Drop out/ UG.Compensation & Benefits: Rs. 15,000 - Rs. 17500(CTC) per Month + Incentives; will be decided based on qualification, experience and interview. ESIC, PF & Gratuity, as per applicable law. Group Insurance, Cover.", "Role": "Telecalling/Telemarketing Executive,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Graduation Not Required", "Doctorate": "None", "Key Skills": ["Email Support", "Customer Service", "International Call Center", "Non Voice Process", "Inbound Calls", "Semi Voice", "Voice Process", "Non Voice", "Bpo Non Voice", "Chat Process", "Communication Skills", "Customer Support", "Selling Skills", "Back Office", "Customer Care", "International BPO"]}