{"Job Title": "SOFTWARE DEVELOPMENT ENGINEER", "Company": "McAfee Software (India) Pvt. Ltd", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "    Role Overview:       As a Senior Staff Engineer you will have the opportunity to build a world class highly scalable and available cloudsecurity platform. You will be part of a fast paced high caliber team solving challenging problems bridging cloud,infrastructure and security.      McAfee is seeking an experienced and selfmotivated individual to assume the Senior Staff Engineer role in the Engineering Team.        As a Senior Staff Engineer, the successful candidate will build a world class highly scalable cloud security platform using cutting-edge technologies in a fast-paced work environment.        You will be part of a fast paced high calibre team solving challenging problems bridging cloud, infrastructure and security.           About the Role     :             Develops and implements enterprise class applications using Java           Prepare technical designs for application development.           Develop complex modules using Java and related frameworks           Develop and execute unit test plans           Practice standardized development processes to create quality deliverables           Help support team and ensure supportability of the product right from the design               About You     :             Must have strong core java.           Must have experience writing production quality code, preferably in a product based company.           Good understanding of core programming constructs.           Understand existing code and independently develop code from design.           Strong debugging skills using various java debugging tools and strategies                 Good understanding of Object Oriented design and design patterns.           Ability to design and document Class Diagrams, Sequence flows etc.           Good knowledge of Data structures and Algorithms.                 Extensive experience with database technologies Good knowledge of TCP/IP, DNS, DHCP, Firewall, Load balancers, IP and Hostname configurations and protocols HTTP, HTTPS, SMTP.           Good communication skills. Good command on English and can effectively explain complex scenarios.           Working knowledge of at least two popular Java based open source frameworks Working knowledge of frameworks such as, Spring, Hibernate, REST(Jersey, Retrofit etc), JSON(     jackson     , GSON etc), Jetty, Netty, Tomcat, Hadoop,       Dropwizard     , Apache Strom.             Traits     :             The ideal candidate is self-motivated, results oriented, passion about Customer Success and adept at Customer management                 High integrity, excellent judgement you ll have access to sensitive information and must treat it appropriately           Highly collaborative you recognize the value of bringing people along Intellectual curiosity youre eager to learn new concepts; youre willing to admit you don t know certain things, will ask for help, roll up your sleeves, and learn           Self-aware you arent complacent when it comes to personal growth; you re receptive to feedback and eager to grow despite ones seniority           Sense of ownership you have a mentality of the buck stops with me and always ask what did I contribute to this situation          Low ego you shouldn t be prone to thinking that a job is too small                 Brave, adaptable, calm under pressure you re unafraid to operate in high-pressure, chaotic situations         ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Hibernate", "Core Java", "Tomcat", "Cloud", "Data structures", "JSON", "HTTP", "Application development", "Apache", "Open source"]}