{"Job Title": "Customer Support Executive", "Company": "ANEXUS", "Experience": "0 - 3 years", "Salary": "₹ 1,75,000 - 3,00,000 P.A. ", "Location": "Mohali", "Job Description": "Our growing company is in need of an experienced and resourceful (CSE) Customer Support Executive to develop and implement growth opportunities in existing and new markets. Were searching for professionals that have a solid track record of creating long-term value for organizations. First and foremost, were looking for an executive who understands how to leverage real data and capitalize on business trends and opportunities. Were looking for executives who are customer-obsessed and ready to solve the changing needs of our clients. Candidates should have strong communication and writing skills, as well as the ability to manage a diversity in an evolving industry landscape.  Roles and Responsibilities Overseeing the Customer Service process. The key responsibility is to understand the client brief and translate the requirements to the designated team. Resolving customer complaints brought to your attention.Work with senior team members to identify and manage risks.Maintain fruitful relationships with clients and address their needs effectively.Making/receiving outbound/inbound calls to/from clients.Answering the incoming calls from the customers as well.Prepare the answers and deliver to potential clients as per the requirements.Foster a collaborative environment within the organization.Compiling the data as per the instructions  Taking input of issues and their redressal thereof . Seize opportunities to up sell products when they arise  Frequently to attend training and seminars to improve knowledge and performance level. Provide accurate, valid and complete information to the customer by using the right methods/tools.  The target is to ensure excellent service standards, respond efficiently to customer inquiries and maintain high customer satisfaction. Desired Candidate Profile An optimistic, confident, independent thinker and a team personPrevious experience in a customer support roleTrack record of over-achieving quotaStrong phone and verbal communication skills along with active listeningFamiliarity with CRM systems and practicesCustomer focus and adaptability to different personality typesAbility to multi-task, set priorities and manage time effectivelyMinimum Educational Requirements- A Graduate Degree in Any StreamFresher can apply, experienced will be given preference.Perks and Benefits Dearness Allowance.Medical Allowance.Transport Allowance.House Rent Allowance.Experience Allowance.Cab Facility.", "Role": "Telecalling/Telemarketing Executive,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["MS Excel", "Time Management", "Word", "Cross Selling", "Analytical Skills", "Data Interpretation", "Product Knowledge", "Positive Attitude", "Research", "Bilingual Customer Support", "Report Writing", "Attention to Detail", "PowerPoint", "Customer Support", "Active Listening Skills", "Interpersonal Skills"]}