{"Job Title": "Customer Care Executive- Work From Home", "Company": "Excitel Broadband Private Limited", "Experience": "0 - 1 years", "Salary": "Not Disclosed", "Location": "Delhi / NCR", "Job Description": "We are looking to hire Agent(Customer Care Executive).Should have own Laptop/ System(WINDOWS 10/RAM4) & Wi-Fi connectivity at home.Preferred- From Delhi NCRJob Profile: This role involves providing a delightful Customer Service experience to our customers. This job requires you tohandle customers escalation. The position may also be required to carry out other roles & responsibilities basedon business requirement.Required skills:• Greet customers in a courteous, friendly, and professional manner using agreed upon procedures• Listen attentively to customer needs and concerns; demonstrate empathy while maximizing opportunityto build rapport with the customer• Clarify customer requirements, probe for understanding.• Demonstrate patience in all customer contact situations, including maintaining a pleasant andprofessional tone and manner.• Ability to work as a team member, as well as independently• Listening Skills: You will need to listen to your customer queries & close it with a proper resolutionWho will be preferred:• Ability to effectively communicate, both written and verbally• Strong computer navigation skills and PC Knowledge• Should be able to take the ownership of our customer issues• Both Graduates and Undergraduates can apply• Should own system & have Wi-Fi connectivity• Age should be less than 30 Years.• Fresher/ experienced both are welcomed• Candidate should be flexible to work in rotational shifts.", "Role": "Telecalling/Telemarketing Executive,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Graduation Not Required", "Doctorate": "None", "Key Skills": ["Telecom", "Customer Experience", "CHAT", "ISP", "Customer Care", "Domestic BPO", "Voice Process"]}