{"Job Title": "Data Science / Machine Learning stream project intern", "Company": "Vikatan", "Experience": "0 - 1 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "Data Science /  Machine Learning stream project intern position open for Computer Science -  Engineers and students.Location: Chennai\n\nStipend : Upto Rs.15000 per month consolidated\n\nNo. of open positions : 3\n\nWe are the industry first innovaters in adopting technolgy in driving business and our digital transformation has been very successful. We would like to percolate the learnings and inspire student talent and look for exceptional talent to join our innovative,  inspiring family. We are now seeking to recruit interns to join our team. This offer does not guarantee future job positions though exceptional candidates may be absorbed into permanent positions based on performance.\n\nThe intern will be learning and working on cutting edge Data Science /  Machine Learning projects in the publishing domain and preparing Proof Of Concepts which will be tested and integrated with the live system.\n\nEligibility and Prerequisites:Computer Science Engineering students in the final (2019) /  pre- final year or just passed out(2018) graduates. Must be available for a minimum period of continous three months full time. Basic progarmming skills as per BE course curriculam. Programming Knowledge of python is a mandatory. A flair to explore,  grow and learn new technology Problem analysis,  out of box thinking ability with perseveranceThis unique opportunity is open until 6 pm,  Jan 18 2019.\n\nOur CompanyWell known over 90 years as South India s leading media powerhouse,  Vikatan Group is renowned for its curated,  credible content delivered thru multiple platforms,  viz.,  Magazines,  TV,  Book and Digital publishing. Vikatan s portfolio consists of much- loved 12 Tamil magazines,  immensely captivating TV fiction series that s been ranked #1 for over a decade and a strong,  growing dynamic digital presence. Since 1997,  Vikatan.com has emerged as a quintessential bridge that connects the smartest Tamilians across the globe to their roots & culture\n\nBest of luck\n\nSubscribe & SaveSubscribe today for attractive offers\n\nSubscribe\n\n\n\n NewsletterGet top stories and blog posts emailed to me each day\n\nExploreBooks e- Books Archives SitemapPoliciesTerms Privacy Policy Cookie Policy Copyright", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Printing", "Power house", "Publishing", "data science", "Machine learning", "Manager Technology", "digital transformation", "Project Intern", "Python"]}