{"Job Title": "Software Development Engineer IV", "Company": "Flipkart Internet Private Limited", "Experience": "8 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Job Description:SDE 4 About the role You will own a functional area - from product conception to its delivery to customers. You are expected to design and code independently in multiple tech components related to your functional area. You must also develop a deep understanding of non-functional requirements, such as reliability and availability, scale, horizontal scalability, etc., over time and make tech stack decisions accordingly. You are expected to actively mentor junior engineers. You own the codebase quality. We are looking for seasoned engineers who are quality conscious, product thinkers, business cognizant and smart – not mere coders. Engineers get to significantly amplify the impact of their work or creations with the scale that Flipkart operates at. The same scale also demands the engineers to produce super-efficient solutions. What you’ll do: Thought Leader for Tech and DomainOwn Functional area from product conceptualization to realization working with product teams.Drive Technical roadmap focusing more on platformization, generic components and own tech metrics like product reliability, performance and availability.Tech Design and solution for well defined systems without supervision.\"Go to” person within the team on the domain and the related concepts.Good understanding of partner eco-systems and interfaces.Familiar with academic research, industry trends and standards. Lead By ExampleLeads across teams with cross functional stakeholders Mentor and guide team members on everything from structured problem solving to development of best practices.Has a strong impact in Senior Engineers hiring and improves hiring culture within teamAccountable for Onboarding team members Be a ChampionBreaks down into components, identifies dependencies, understands priorities, plans for iterations and feature creeps, provides accurate estimates that feed into the larger plan.Communicates with stakeholders in an effective and timely fashion. Capable of unblocking self and other teams whenever necessary. Finishes deliverables on time, ensures functional correctness and completeness. Contributes to non-functional aspects without supervision.Accountable for quality of deliverables and artifacts in adherence to defined processes for the entire team.Estimates cost of resources (including tech and non-tech resources) What you’ll need: B.E or B.Tech or equivalent with at least 8-years relevant experienceDeep expertise with any or combination programming languages: Java, C++, C#, Ruby, PHP, any objected oriented high level proprietary or open source language with strong programming constructs. Substantial experience in building complex and scalable solutions Strong object oriented design skills, ability to apply design patterns, and an uncanny ability to design intuitive module and class-level interfaces.Skills Required :Problem solving skills, Curiosity to learn, Team player, System & entity design, coding, scale & architectureMandatory Skills : Problem solving skills, Curiosity to learn, Team player, System & entity design, coding, scale & architecture", "Role": "Software Developer,", "Industry Type": "Internet, Ecommerce,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Java", "C++", "Software Development", "Open Source", "Scalability", "Design Patterns", "Object Oriented Design", "Programming", "PHP", "Ruby"]}