{"Job Title": "Social Media Internship", "Company": "WerIndia.com", "Experience": "0 - 1 years", "Salary": "Not Disclosed", "Location": "Mohali", "Job Description": "  WerIndia based in Mohali (Chandigarh), India is the Leading online news platform. Our objective is to promote India. Our website is www.WerIndia.com. WerIndia consists of English, Hindi and Language news platform and content sub-domains of Fusion (variety), HealthyLife, Threads (Fashion) and OurVoice.   We are offering Social Media & Digital Marketing Internship opportunities in our office for 6 months starting as soon as possible. Current need is for 2 candidates.  Responsibilities:    You will work with our Social Media, Digital Marketing and SEO team on:  Facebook, Twitter, Pinterest, Google +, Instagram, Discussion forums like Quora, Reddit, etc.- Others     Your daily responsibilities would be to create and/or post content and engage with your audience, grow your audience all leading to rapidly building the awareness and use of WerIndia websites and apps. You may also get involved with WhatsApp marketing and Email marketing campaigns.     You should have some to good working knowledge and education of these social media platform. You do not need to be an expert on all. For the ones you are not familiar, you would be expected to learn and become proficient on the job at the earliest.     Working hours: we work regular working hours (9am to 6pm) five days a week. For students, we will offer some flexibility to accommodate college work.   Benefits of this Internship:    You will gain live and practical knowledge & experience about popular and important social media platforms and tools. You will gain solid work experience in promoting our brand and building our social media presence. There are no commitments to future full-time hires.     You can expect a fast-paced work environment and this internship is ideal for those specializing in marketing who want to make a career in Social Media and Digital Marketing.     Salary / compensation: these are unpaid internships, but will consider stipend to cover your travel costs.     Duration: 6 months.  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - eCommerce, Internet Technologies,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Email marketing", "Social media", "Marketing campaigns", "SEO", "Digital marketing", "Internship"]}