{"Job Title": "Customer Service Professionals- (Only Tamil or Bengali)-Voice/Chat .", "Company": "Sreyas Holistic Remedies Pvt Ltd", "Experience": "0 - 5 years", "Salary": "₹ 2,00,000 - 3,50,000 P.A. ", "Location": "Hyderabad/Secunderabad( Begumpet )", "Job Description": "Roles and Responsibilities Job Purpose: -Oliva is looking for enthusiastic and dynamic candidates for its Business Process Management Team, this is a great opportunity for those who hold a great passion for customer service.Job Description:Business Process AssociateUnderstanding the business structure, attending client calls, and provide the best services.Understanding customers and their requirements to provide the right solutions at the right time.Responding and resolving various client/applicant queries put forth through voice and chat processes.Ensuring high-quality services being rendered to clients to increase the Brand Value.Should be well versed in (Local language- Tamil, Malayalam, Bengali) as well as English as mandatory. People who are multi-lingual would hold an added advantage.Your Job starts with 1 month of On the Job Training (OJT), where you will be learning about our products and services. You will be also trained to improve your communication skills and sales pitch.Post-training you will start handling the calls.Interested Candidates can share their profiles with Ms Deepika @ careers@olivaclinic.com.Note: Please put SUBJECT as  CSPFEB21 while emailing your profile.Desired Candidate Profile Fluency in English speaking is mandatory.Both Freshers and Experienced candidates are eligible.People with high professionalism, punctuality will be given high priority.Sales oriented and Target driven personalityA good team player with great adaptabilityPerks and Benefits Medical Insuranace/ESI , PF & Handsome Incentives.", "Role": "Associate/Senior Associate -(Technical),", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Graduation Not Required", "Doctorate": "None", "Key Skills": ["Target", "Sales", "Voice", "BPO", "insurance", "Telesales", "Inside Sales", "process associate", "KPO", "call center", "domestic", "nightshift", "technical support", "outbound", "Telecalling", "international", "email", "service quality", "customer care", "satisfaction", "Tamil", "Bengali", "handling client calls", "chat", "solving queries"]}