{"Job Title": "Engineering Manager - Software Development", "Company": "Dell International Services IndiaPrivate Limited", "Experience": "12 - 15 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Connectivity-IOT & Telemetry – Senior Engineering Manager, Software DevelopmentRole IntroductionWe are seeking a versatile Software Development Manager to develop cutting-edge IoT software solutions to optimize and grow our business operations. In this role, your duties will include managing the careers of Software Developers, the application of programming technologies, processes, and methodologies to develop, maintain, deploy and support business applications in a Product based development environment.Dell -Connectivity/IoT and Telemetry.Dell maintains a strong commitment to protecting customers' information infrastructure through the 24x7 availability of always-on secure connectivity. The Connectivity/IoT provides 24x7 availability of always-on secure connectivity. It is a secure, IP-based, distributed connectivity solution that offers Remote Takeover and Diagnostics, Telemetry and Event Management, Software Distribution, and Remote Scripting & Provisioning. Connectivity/IoT is an asynchronous messaging system in which all communications are initiated from the customer side. With over 60K customers globally, ~1 Million devices enrolled and ~16PB of telemetry data processed in 2020, we make a difference by managing critical customer infrastructure in near real time and without physical presence in data centers.Job Role and ResponsibilitiesLead a team of Software Engineers on Connectivity products used and enjoyed by customers worldwide;Responsible for hiring and career development/planning, performance and pay discussions of team membersApplies knowledge of software engineering, programming, technologies, processes, and methodologies to develop, maintain and support enterprise IoT applications.Enable management of availability, latency, scalability and efficiency of Connectivity product development by instilling software quality into our development life cycle with a focus on fault tolerant approaches.Drive and achieve Secure software development practices and results.Implement metrics driven processes to ensure development quality targets are met.Collaborate with global teams to delivery critical projects on time and within budgetProvides oversight of resources, budgets, projects, and programs.Required Skill sets:Highly experienced with Agile development methodologiesExperience with Cloud Native, Microservice, Container and Serverless technologiesExperience working in and with global teamsIn Depth Knowledge of programming languages such as Java, JavaScript, C#, Python etcSoftware Requirements Analysis and Modelling skillsets, e.g. UMLProficiency with SQL and NoSQL database technologiesExtensive experience in developing, deploying, and integrating software solutions using modern techniques such as CI-CD, Devops etc.Knowledge of best practices related to data encryption and cybersecurityAbility to keep up with software industry trends and innovation.Effective interpersonal and communication skills.Project Management SkillsEducational Requirements:4+ years’ experience managing software development teams12+ years hands on experience in software developmentBachelor's Degree in Software Engineering, Computer Science, Information Systems, Information Technology, or similar.", "Role": "IT/Networking-Manager,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Admin/Maintenance/Security/Datawarehousing", "UG": "B.Sc in Computers, BCA in Computers, B.Tech/B.E. in Computers", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["C#", "Java", "Software Development", "NoSQL", "Software Engineering", "Javascript", "Programming", "Agile Development", "SQL"]}