{"Job Title": "Assistant Vice President - Software Development Life Cycle", "Company": "Highrise Solutions LLP", "Experience": "8 - 13 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "Job Description :Assistant Vice President - Software Development Life Cycle - Linux/Shell ScriptingRoles and Responsibilities :- Work with overall Core team and build generic loading framework using Java, Apache Spark, Hive/Impala, Parquet and related Big Data Technologies- Ensuring high quality software development, with complete documentation and traceability- Provide expertise in area and advanced knowledge of applications programming and ensure application design adheres to the overall architecture blueprint- Strong experience in validating testing and have quality product at early stage of life cycle- Work with partner systems to capture interfacing requirements at granular levelsSpecification :- Mandatory : Min 4-6 years experience in as Java Developer and In Spark - Person with overall 8-11 years of experience, working in similar roles across banking or services technology; Knowledge of Corporate banking and trade finance is preferred- Well versed with SDLC life cycle having exposure to various Phases- Strong hands-on working experience in multiple Big data and Cloud technologies- Good to have Datawarehouse exposureTechnical / Functional Proficiency :- BE/B.Tech/BCA candidates only- Person with overall 8-11 years of experience, working in similar roles across banking or services technology; Knowledge of Corporate banking and trade finance is preferred- Min. 4-6 years of working experience as Senior Big Data Developer preferably in Corporate / Retail Banking domain- Strong Core Java working experience - Experience in Big data technologies like HDFS, Hive. Hbase, Apache Spark Kafka- Experience in building self-service platform agnostic data access APIs- Well versed with SDLC life cycle having exposure to various Phases- Strong hands-on working experience in multiple Big data and Cloud technologies- Service oriented architecture, and data standards like JSON, Avro, Parquet- Agile/Scrum methodology experience is required.- Experience in SCMs like GIT; and tools like JIRA- Experience in working on Linux shell scripting- Experience in RDMS and No SQL databasesLeadership Skills :- Excellent organization skills, attention to detail, and ability to multi-task- Demonstrated sense of responsibility and capability to deliver quickly- Excellent communication skills. Clearly articulating and documenting technical and functional specifications is a key requirement- Proactive problem-solver- Relationship builder and a very good team player- Good analytical and business skills", "Role": "Head/VP/GM-Technology(IT)/CTO,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Senior Management", "UG": "B.Tech/B.E. in Any Specialization, BCA in Computers", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["Java", "J2EE Architect", "Big Data Architect", "Hive", "Linux OS", "RDBMS", "Shell Scripting", "Cloud", "Apache Server", "Spark", "SDLC", "SQL"]}