{"Job Title": "C # and WPF Developer", "Company": "RedBixBite Pvt Ltd", "Experience": "4 - 7 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  Responsibilities  : Software design and development of moderately complex software resulting in high-quality, software products.    Analyze and understand the functional/non-functional requirements.     Understand the high-level design and ability to translate to low-level design and implementation     Implementation of the complex modules with high quality and clean coding.     Desired Skills and Experience :     4-7 years of hands-on experience in Software /Technology Development     Must-Have:      Good experience in .Net C# and WPF development   Good experience in client-server architecture development   Development experience in Visual Studio 2008, 2013 and 2015   Knowledge about developing multi-threading highly scalable components Systems thinking, technical acumen, analytical skills, and communication skills.   Testing skills (Unit testing, Integration testing)   Exposure to one or more software development methodologies (RUP preferred, one full lifecycle preferred)   Good analytical and problem-solving skills   Quality mindset and attention to detail in all aspects of software engineering and development     Good to have:      Good experience in WCF service development   Exposure to SCRUM methodology work culture   Exposure to writing .net wrapper to C++ API.   Exposure to HTML5   Exposure to design tools Enterprise Architect / Rational rose.   Experience with debugging tools, profiling tools.   Exposure on 3rd party chart tool   Knowledge in Industrial Automation, Simulation, Control and Instrumentation, MES, OPC     Education:     Bachelor / Masters in Computer Engineering, EEE, Electronics & Communication, Information Technology, Computer Science, Instrumentation or Chemical Engineering. ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["C++", "Coding", "Integration testing", "Debugging", "Scrum", "Unit testing", "WCF", "Visual Studio", "WPF", "Information technology"]}