{"Job Title": "Backend Developer ( with Java )", "Company": "Version 1", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": " Job Description   We are looking for a Java Developer to join our agile development team. You will be working with a team of engineers and testers to create solutions and deliver both mobile and web applications to our clients. The ideal candidate is someone who has a track record of high-quality delivery, combined with a keen appetite for all aspects of software development. These roles are working with greenfield projects where you will have the opportunities to recommend and champion the use of new technologies whether for direct use in products or in supporting the development lifecycle. You should be hands on, able to contribute individually and should have experience with in a fast pace dynamic environment. We use the latest JAVA technologies and tools SOA Architecture, Domain Driven Design, Microservices, Hibernate and Spring.    RESPONSIBILITIES     Planning and estimation of development tasks as part of the SCRUM team and strive for accuracy while meeting deadlines     Implement solutions as per technical design for new features and changes to existing components     Participate in the full development lifecycle of new functionality and enhancements to existing applications     Commitment to producing high quality, highly performant and robust software within agreed time estimates and to agreed quality standards     Participate in changes, and continuous improvements to existing software development, testing and deployment processes     Ability to work hands on in a fast-paced, agile work environment supporting your colleagues as required     Ability to work in a team and collaborate with multiple business and technical team    Qualifications    REQUIREMENTS     5+ years experience in software development, ideally at least 1 year of which was working with JAVA stack     Experience working in a cross functional Scrum team in an agile environment     Strong database and MySQL development experience     Be flexible and hardworking both independently and as part of a team     A willingness and enthusiasm to improve and develop new skills and learn new technologies     Work with Amazon Web Services technologies     Excellent interpersonal and written and verbal communication skills     TECHNOLOGIES WE USE FOR THIS ROLE:     Java 8, Spring, Jackson, Mapstract     MySQL, MongoDB (similar), SQL      JMS, (AWS [SQS, SNS]), Security,      JSON, SOAP, Maven, Docker, Kubernetes     SWAGGER     JUnit, Mockito     Jira, Confluence, Agile, Scrum  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["JMS", "Maven", "Hibernate", "Backend", "SOA", "MySQL", "JSON", "MongoDB", "JIRA", "SQL"]}