{"Job Title": "Talend ESB Developer", "Company": "IT Trailblazers", "Experience": "3 - 4 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": " At least 10+ years of experience in IT services and at least 3 years' experience in architecting and implementation of large-scale Enterprise applications using the Talend ESB Middleware.   3-4 years experience on Talend ESB components like Apache Camel, CXF, AMQ.    Designed and developed Service Oriented Architecture (SOA) concepts including REST-ful and SOAP-based services Talend ESB certification added advantage.    At least 7 years experience in Java Web services, JMS and other middleware technologies.    Thorough understanding of Talend ESB components and features using EIPs in Camel, SOAP and RESTful service in CXF, Active MQ configuration At least 5 years of experience in software development life cycle.    At least 3 years of experience in translating functional/non-functional requirements to system requirements. Configure and optimize ESB installation on cloud e.g. AWS, AZURE, Google Cloud etc.   Experience working with PaaS and cloud native containerized micro services solutions    Experience of working in Agile Methodology    Ability to work with cross cultural teams. Business acumen, innovation, analytical skills, target achievement, team work, willing to learn, flexibility are essential ;     Requirements:    7+ years Java Development    3+ years SQL (or Couchbase) Experience    2+ years React/Redux (only required for one req. at this point in time)    Experience with Git     Highly desired:   AWS , Kaufka     Nice to have:   Obsidian , GoAnywhere  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["IT services", "JMS", "SAN", "Java web services", "SOA", "Enterprise applications", "Staffing", "PAAS", "Agile methodology", "Middleware"]}