{"Job Title": "Senior .Net Developer", "Company": "24/7 Customer", "Experience": "4 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Roles and Responsibilities JD –Sr .Net DeveloperWork Location: Bangalore, IndiaQualification Required:Bachelor’s degree in Computer Science or equivalent  and/or equivalent work experienceMinimum experience: 4 -6years of Computer Science, Software Engineering or a  related area is preferred. Certifications: Microsoft certifications are a plus.Working Hours: 12:00PM to 9:00PMSkills Required  4 Yrs. – 6 Yrs. experience as a       developer. Strong thought leadership       skills in evaluating software solutions, following Microsoft’s best       practices in architectural design and applying design patterns. Strong experience       designing and working with n-tier architectures (UI, Business Logic Layer,       Data Access Layer) along with some experience with service-oriented       architectures (SOA).  Candidate should be a       self-motivated, independent, detail oriented, responsible team-player and       exhibit exceptional relationship management skills.  Passionate about building       high-quality systems with software implementation best practices. Job Responsibilities Design Develop and Architect applications which are scalable, reliable and with high  performance Mentoring team members in full SDLC (using agile  software development methodology and Test Driven Development), provided recommendation, guidance and assistance to developers as  required Develop and deliver       efficient and cost-effective technical solutions to meet        business requirementsExpertise inbuilding applications with microservices and .Net CORE architectureBuild new systems       with .NET 4.5/ ASP.NET / C#.NET / MS SQL Server /MySql / WCF / Web API / Entity Framework / WCF Web Services Experience in developing       apps using BPM platforms such as K2, Skelta, Apian, Bizagi Expertise in MVC/MVVM Architecture, REST,       Ajax, LINQ, RAZOR Knowledge in HTML5/       CSS3, OOPS, OO JavaScript/Jquery / Angular JS / Node JS Knowledge in LINQ       / Lamda Exp / REST / JSON / XML Services Knowledge on Team       Foundation Server/SVN Source Control Develop new       functionality on our existing software products.  Participate in a       small, experienced, energetic team on a rapid, agile development schedule.     ", "Role": "Network Administrator,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Network Administration, Security,", "Employment Type": "Full Time, Permanent", "Role Category": "Admin/Maintenance/Security/Datawarehousing", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": [".Net Core", "web api", "mvc", "sql"]}