{"Job Title": "Urgent requirement  of the top product based client  Office Developer", "Company": "Teamware Solutions ( A division of Quantum Leap Co   nsulting Private LTD).", "Experience": "1 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Roles and Responsibilities -The Support Engineer  Office Developer acts as the primary technical contact, and delivers advanced technical troubleshooting support and problem resolution for Corporate Customers, including issues escalated to the highest levels of Management. The candidate will provide technical support including product technical training to peers.Office Developer Support Engineer primarily works with external developers (customers) who use Client technologies including but not limited to :- Office add-ins (COM,  .NET, VSTO, Office-JS etc), Office automation from any supported client programming language, VBA (macros), Office 365 Graph APIs.Responsibilities: Troubleshooting complex technical issues, identifying and fixing the reported issues. Write samples or how to prototypes to explain a particular technique/technology or Product. Identify and escalate reported bugs in client products. Provide appropriate alternate implementations/techniques/workarounds to help developers workaround a confirmed bug in client products Identify issues that occur frequently and help create a knowledge base article to solve/workaround that issue.-Desired Candidate Profile Perks and Benefits Bachelor's Degree in Computer Science, Engineering or related field.Abilities and Experience should include:Required Hard:- Strong in technologies: .NET Fundamentals, VB.NET or C#, Windows or Web Applications development.- Strong in OOPs concepts- Knowledge of core OS concepts (processes, threads, scheduling, memory management, etc)- 3+ years of experience.Required Soft:- Willingness to learn new technologies/skills- Willingness to take on challenges- Strong customer focus- Excellent verbal and written communications skills- Ability to multitask- Hard-workingNice to have/desired:- Exposure to scripting languages: VBScript, JavaScript.- Prior technical support experience- Microsoft certifications- C++, COM, ATL, MFC coding experience.- Enterprise/Corporate working experience- Experience with software development and/or test- Knowledge of Programming against Microsoft Office Products (Word, Outlook, Excel, PowerPoint, etc)Critical Exposure areas:1) Great troubleshooting skills2) Good logical approach to resolve the problem quickly3) Ability to learn from an issue/situation, adapt, and carry forward the solution to another seemingly unrelated issueThe position requires working in NIGHT SHIFTS and provide VOICE-BASED SUPPORTInterested share their resumes        puja@twsol.com Contact No:   91132 62106", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Temporary/Contractual", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Microsoft Technologies", "VSTO", "Graph", "VBA", "Problem Resolution", "Technical Support", ".Net", "Technical Training", "Troubleshooting", "Office 365"]}