{"Job Title": "Mobile Engineer-iOS/Android", "Company": "CAVISTA", "Experience": "1 - 4 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "  Job Description       A Native Mobile Application Developer passionate about advancing mobility to construct elegant, effective and exceptional native mobile code, through self-motivation and collaboration.      Responsibilities      Strategize by helping define product features alongside product management, UX design, and engineering to enable quality home health solutions    Work in an agile atmosphere to drive the system architecture, implement, test and deploy the next generation of mobile features for iOS OR Android applications.    Spearhead the best practices in progressive code design and reviews; identify and address performance bottlenecks; recommend changes and enhancements to existing code to extend the reach of existing applications, timely.    Contribute to a repository of highly reusable organization-focused artifacts such as libraries, demonstrations, documentation and many more      Qualifications       Bachelors or Master s degree in Computer Science, Engineering (or related field)    4+ years of experience building complex native Android or iOS applications that have been successfully delivered to customers    4+ years of involvement in publishing mobile applications for Google Play Store     For iOS   - Proficient with iOS SDK, Swift, Objective-C, Cocoa, Xcode, and OO programming and design.     For Android   - Proficient with Android SDK, Java, Kotlin, Android Studio and OO programming and design.    Noteworthy experience utilizing RESTful APIs.    Functional knowledge of the Android Material Design Guidelines OR iOS Human Interface Guidelines.    Knowledge of professional software engineering practices and best practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations    Ability to take a project feature from scoping requirements through actual launch of the feature.    Excellent analytical, organizational, project management and time management skills with emphasis on product performance, user experience and scalability.    Ability to solve software problem or workflow and decompose a problem into clear software APIs and UX design actions.    Communication skills across different teams and technical backgrounds highly valued    Experience with third-party libraries/frameworks like Realm, Retrofit and Firebase is a plus.   ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Mobile,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Product management", "Computer science", "System architecture", "Coding", "Project management", "Agile", "Workflow", "Android SDK", "IOS", "Android"]}