{"Job Title": "Mean Stack Developer", "Company": "solus software and systems", "Experience": "4 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": " Experienced Mean Stack Developer specializing in Angular JS, NodeJS and React Native, who is extremely hands - on and can take charge of the complete Web Development process to deliver unique customer centric web applications.    Job Responsibilities:    PRIMARY SKILLS NEEDED: Angular 3+, (atleast 3 years experience) Angular 6+(essential) , ReactJS, NodeJS.   MSSQL or Oracle and NoSQL DB (like MongoDB - MUST HAVE).   jQuery, JSON, AJAX, web servicesREST, SQL.   JavaScript frameworks like NodeJS, AngularJS, React JS.   Working knowledge of GraphQL, Moment.js is essential.   UX or UI designing experience is an advantage.   Cryptography and Security knowledge on transferring and storing data ensuring security.  nbsp;    Experience::    3+ years of Full Stack Application development experience mainly.   Deep understanding of client side development, coding in HTML5, CSS3, JavaScript ES6, and jQuery.   Strong experience using a client side MVC framework such as NodeJS, React JS and AngularJS.   Topnotch programming skills and write code for robust software design.   Experience in responsive design, cross browser compatibility and website performance.   Experience in object oriented design skills.   Aggressive problem diagnosis and creative problem solving skills.   Good understanding of how browsers and DOM work.   Experience with handling Services, RESTful, APIs.   Knowledge of front end CSS frameworks like Bootstrap, Material UI (Fuse) and preprocessors like SASS and LESS.   Good Knowledge on Application Architecture (of current projects handled).     Responsibilities:    To work with a cross functional software development team on highly visible nbsp;strategic projects as an expert level individual contributor to the coding tasks nbsp;assigned.   Responsible for .         Educational Qualifications:    PRIMARY SKILLS NEEDED: Angular 3+, (atleast 3 years experience) Angular 6+(essential) , ReactJS, NodeJS.    MSSQL or Oracle and NoSQL DB (like MongoDB - MUST HAVE).    jQuery, JSON, AJAX, web servicesREST, SQL.    JavaScript frameworks like NodeJS, AngularJS, React JS.    Working knowledge of GraphQL, Moment.js is essential.    UX or UI designing experience is an advantage.    Cryptography and Security knowledge on transferring and storing data ensuring security.      3+ years of Full Stack Application development experience mainly.    Deep understanding of client side development, coding in HTML5, CSS3, JavaScript ES6, and jQuery.    Strong experience using a client side MVC framework such as NodeJS, React JS and AngularJS.    Topnotch programming skills and write code for robust software design.    Experience in responsive design, cross browser compatibility and website performance.    Experience in object oriented design skills.    Aggressive problem diagnosis and creative problem solving skills.    Good understanding of how browsers and DOM work.    Experience with handling Services, RESTful, APIs.    Knowledge of front end CSS frameworks like Bootstrap, Material UI (Fuse) and preprocessors like SASS and LESS.    Good Knowledge on Application Architecture (of current projects handled).      To work with a cross functional software development team on highly visible strategic projects as an expert level individual contributor to the coding tasks assigned.    Responsible for development of highly responsive, web based UI in a flexible and well - structured frontend architecture.    Experience working with remote data via REST and JSON.    Experience with third party libraries and APIs (Google APIs etc.).    Produce well designed efficient code in a timely manner to meet delivery timescalesmilestones.    Mentor other developers on software best practices technical guidance and help grow their software development skill sets.    To proactively stay plugged into emerging technologiesindustry trends and them into operations and activities.    Should demonstrate the ability to handle multiple projects simultaneously, manage priorities and communicate progress effectively.                                                                     ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Software design", "jQuery", "Coding", "Web development", "Javascript", "Application development", "JSON", "Oracle", "SQL", "Ajax"]}