{"Job Title": "Tech Mahindra Hiring For Agile Delivery Coach-Bangalore", "Company": "tech mahindra ltd", "Experience": "10 - 15 years", "Salary": "Not Disclosed", "Location": "Chennai, Bangalore/Bengaluru", "Job Description": "To be successful in the role you would have to be considered a thought leader by your peers, have experience in leading groups of teams in an organisational transition and have a depth of analytical understanding of a variety of New Ways of Working such as Scrum, Kanban, Human Centred Design or Design Thinking, Lean, Dynamic Work Design, A3 problem solving, Extreme Programming, Behaviour Driven Development and DevOps. Each day will be different as each team and environment is different; understanding what practice, tool or technique to apply given the environment and the situation is the challenge that you will need to demonstrate mastery in using a show/tell/do approach.Your communication skills will be tested against a wide variety of audiences as Agile is not solely applied to just the Information Technology areas. You will need to be able to effectively adapt your communication approach based upon the audience's context and familiarity of the Agile ways of working You could be communicating with teams within technology or within other areas of the business such as Sales, Marketing, Banking Operation,  HR, Finance or even Risk. You would be working as a trusted advisor to leaders in all levels within the organisation from team leaders through to Managing Directors. Working autonomously, you will have the freedom to be innovative and creative with the approaches that you use to facilitate change. You will need to have passion and drive to foster motivation in others to change, but also understand the fine line between being over-zealous, pragmatic and providing appropriate encouragement. You will need to be able to tap into people's intrinsic motivation, empower and guide them through their individual Agile capability journey.With over 100 years combined experience in Agile and cultural transformation inside of the Agile Coaching team you will be supported by some of the most highly experienced Agile Coaches across the globe  learn and grow with the best!Qualifications & ExperienceAcademic or Professional Education/Qualifications: As per Banks requirements and HR policyLicences and Certifications/accreditations: Scrum Master and Product Owner certification from Scrum Alliance, Scrum.org or other associations are must, Practitioner certification of Scaled Agile framework like LeSS, SaFE, Scrum@Scale, Spotify, Nexus and Human Centred Design or Design Thinking are plus. Desired Professional Memberships: Association or Discipline Association Membership well regarded.Language: EnglishExperience (minimum type and level of experience required to perform the role)Minimum of 5 years hands on experience in Agile or other related disciplines (Lean Software Development, Human Centred Design).Minimum of 10-year experience in Information TechnologyMinimum of 2 years leading & managing Software/ IT Projects / Teams using Agile Desired) Experience in leading transformation in non-technology functions (Desired) Experience in cultural transformation Proficient in using a variety of agile delivery tools e.g. JIRA, Confluence", "Role": "Agile Coach,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Not mentioned", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Project Management", "Confluence", "Scrum Master", "Agile", "agile coach", "Scrum", "JIRA"]}