{"Job Title": "Salesforce Developer in MNC Company – Bangalore Location.", "Company": "Intelliswift Software India Pvt Ltd", "Experience": "3 - 7 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "This is Sunita from Intelliswift Software Pvt Ltd. We have an excellent opportunity for you at Intelliswsift Software. Please find the below details.Urgent Opening for Salesforce Developer in MNC Company – Bangalore Location.Position: Salesforce DeveloperNotice Period: 30 daysExperience: 3-6 YearsLocation: BangaloreAbout the Company:Intelliswift is a service-based product engineering company. Head office located in California. We have around 4 branches in India i.e. Mumbai, Bangalore, Pune & Chennai. We are working in the domain i.e. Retail, technology, BSFI, Healthcare, Manufacturing, Telecom, Travel & Hospitality, Media, Education etc.Intelliswift an ISO 2001 certified company has an ELITE Clientele comprising of Large fortune 1000 companies like eBay, PayPal, Apple, Fujitsu, Vodafone, Cisco, Hewlett Packard, Sun Microsystems, Oracle, Adobe, Google, Facebook, Pearson, T-Mobile, Amazon, and Disney to name a few. The strength of the company is 1200.Job Description for Salesforce Developer    > Perform design, hands-on coding and configuration to deliver solutions on salesforce    > Work with the existing team to integrate salesforce solutions with an existing product line    > Debug complex issues spanning multiple systems    > Learn new technologies and drive opportunities for adoption    > Support engineering excellence and advance agile maturity of the team    > Engage in and promote open source and inner source initiatives    > Evangelize industry best practicesQualification• Bachelor’s Degree in Information Technology or related field, or equivalent combination of education and experience, preferred.3-7 years experienceAbility to work independently with the customer & business usersAbility to prioritize work componentsHighly collaborative and a good team player!Willingness to learn new technologies and drive opportunities for adoptionIf you are interested, then please revert back to me with your updated resume or you can contact me on Sunita (mail id: sunita.hangrangi@intelliswift.com) One reference can make someone's career kindly refer to your friends. Reason for Job change – Relevant years of Experience Salesforce Development – Relevant years of Experience Lightning Web Component– Relevant years of Experience Service Cloud – Current CTC- Expected CTC- Notice Period – Any Other Offer –. Current Location-. Preferred location- Availability for interview: -Regards,8291797950Sunita HangrangiTalent Acquisition – AssociateIntelliswift Software India Pvt. Ltd.www.intelliswift.com | USA - India - SingaporeWe are Hiring Globally - http://www.intelliswift.co.ina/careers", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Other,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Any Doctorate in Any Specialization", "Key Skills": ["Service Cloud", "Lightning Web Component", "Salesforce"]}