{"Job Title": "Oracle ERP Cloud PAAS - OIC Developer", "Company": "Version 1", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  Job Description   Working as part of a team of managed services consultants, the primary role will be the development in and technical support of Oracle ERP cloud applications, Oracle Integration Cloud (OIC) and client specific customisations, interfaces built using OIC.    Daily tasks include:    Provide day-to-day support and quality assurance      Design and develop integrations in OIC to Oracle ERP Cloud including making REST and SOAP calls, FBDI File Uploads.     Design and develop integrations in OIC to Oracle ERP Cloud including extracting Oracle ERP Cloud data using BIPublsiher reports, analysis and OTBI Reports.     Design and develop customizations using Visual Builder and Process Builder in OIC to Oracle ERP Cloud     Provide hands-on technical and development support for implemented Oracle ERP Cloud modules     Provide hands-on technical and development support for implemented integrations in OIC to Oracle ERP Cloud.     Provide hands-on technical and development support for implemented customizations using Visual Builder and Process Builder in OIC to Oracle ERP Cloud     Gather and document business requirements on IT incidents and change work.     Document and manage technical specifications and software packages      Assist in defining and optimizing simple yet effective business processes and drive change within the organization through negotiation and consensus-building      Help ensure that ERP initiatives follow the proper planning, scheduling and management processes      Manage on-time changes delivery and business expectations and ensure internal customer satisfaction      Provide hands on analysis, design, testing, implementation and post implementation support utilizing prescribed software design lifecycle techniques and system documentation techniques (AIMS/OUM)     Complete development tasks based on requirements submitted by business partners and best practices    Qualifications    Oracle ERP Cloud, Oracle Integration Cloud and Oracle E-Business support experience.     Oracle ERP and HCM integration delivery using Oracle Integration Cloud     Experience of system interfaces (predominantly on a PaaS Cloud)     Experience building integration in OIC using REST/SOAP Services.     Experience building integrations in OIC, building and Uploading FBDI Files to Oracle ERP Cloud     Knowledge of Oracle Interface tables in financial and procurement modules.     Hands-On Experience on data migration/integration methods i.e. SOAP and Rest Web Services, FBDI and ADF DI     Hands-On Experience on reporting tools such as OTBI, BI Publisher, Smart View and FRS reports     Good Knowledge on building custom ESS jobs     Hands-on with development & unit testing of integration components & web services (SOAP/REST) using OIC     Hands-on with development & unit testing of VBCS components using OIC     Knowledge of Oracle R11i/12 ideal with functional knowledge of core Oracle EBS Modules including Financials and procurement.     Strong knowledge of Oracle development tools, some e-Business application functionality, system administration, database structure, online patching and knowledge of a multi-Org architecture     Technical requirements: FBDI files, OTBI Reports, BIP Analysis, BPM workflows, Application Composer, SQL, PL/SQL, Unix Script, XML Publisher, JDeveloper, Oracle Reports/Forms, Oracle Workflow, Oracle BI Publisher, Web Adi, APEX, AME, OBIEE/OBIA & Java core skills     Must have good experience translating business requirements and design into technical solutions      ITIL process Knowledge     Ability to research, learn, troubleshoot and support complex system customisations     Willingness to operate and progress in areas that are outside of previous experience     Ability to multi-task and prioritise across concurrent workload may be required.     Excellent written and verbal communication   Additional Information    Recruiter Name  ,  Version 1 Talent Acquisition Team  Tel:   Recruiter Phone    Recruiter e-mail  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Unix", "Procurement", "Software design", "Data migration", "XML", "Scheduling", "Unit testing", "Technical support", "System administration", "Oracle Reports"]}