{"Job Title": "Engineer Manager / Lead", "Company": "Neptune Ubicom Pvt. Ltd.", "Experience": "7 - 10 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "  Key Responsibilities        Inspire, lead, shape and grow a high performing software engineering team consisting of 8-10 team members        Lead two teams of product (full stack software) engineers in implementing high-quality services including design, development, and deployment of new business functionality.       Assist your teams in developing roadmaps for system and product growth, then identify, plan, and execute projects to support that growth.       Allocate available resources to meet operating objectives. Interacts with peers in able to translate technical requirements to your team members and improve cross-functional processes.       Strong ability to mentor developers, helping them improve their skills and grow their careers.       Experience solving large-scale engineering challenges.       Encourages and supports others to take on responsibility, authority, and accountability.       You'll continue to work closely with the code and make informed decisions while you identify technical risks       Scope and own a problem space while you develop your team's vision and mission statement       Succeed, fail, and learn together with your team!       Play a key role in helping us continue to attract, develop and retain great engineering talent         Some of the technologies you'll get to work with        Java (latest versions)       Angular (10)       Spring Boot        Kafka       Docker and Docker Swarm       MySQL, H2, ELK Stack       Microservices architecture and Self Contained System on private cloud         To succeed in this role, we think you should have        A proven track record of successfully leading teams for more than 4+ years of experience and delivering new products, preferably in complex and high transaction environments       Demonstrable experience at acting independently, coupled with strong collaboration and coordination skills       A desire to spend a significant percentage of your time close to the code       Experience at developing, mentoring and growing a team      Recent experience working with one or more general purpose programming languages including, but not limited to, Java     Bachelor's degree (or higher) in Computer Science or a related discipline   ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Computer science", "Training", "spring boot", "Architecture", "MySQL", "Programming", "Design development", "private cloud", "microservices"]}