{"Job Title": "JDE Developer", "Company": "Version 1", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "     Key Responsibilities:      Scope out technical developments     Peer Review technical specifications     Work alongside functional colleagues to design technical solutions     Good knowledge of JDE development standards.     Adhere to JDE continuous upgrade standards     Code and unit test developments     Create development plans     Dev Lead on larger projects     Multi-skilled across the JDE toolset     Experience of data migration, performance monitoring and large project implementations     Responsible for learning new functionality and keeping personal knowledge up-to-date      Adhere to Version 1 standards and policies       Additional Responsibilities:      Assist in the support and training of fellow colleagues      Assist in the support and training of fellow colleagues      Performance Targets:      High customer satisfaction ratings (internal & external)     Delivering high quality solutions within the agreed timescales.     Quarterly objectives set during appraisal are met   Qualifications     Skills and Qualities:      A minimum of 5 years experience in ERP Implementations and knowledge and experience with multiple JDE modules     Strong JD Edwards (JDE) Developer skills     Knowledge of the JDE toolset     C++     Oracle BI publisher     JDE WebServices     Java     SQL     JD Edwards UX One and Orchestrator     Good analytical and debugging skills.     Flexible but methodical and thorough approach; excellent organisational skills     Able to demonstrable experience in a similar role     Excellent time management skills; able to work under pressure, can meet tight deadlines in a fast paced, solution driven environment     Excellent Interpersonal and communication skills, able to communicate effectively at all levels (internal & external). Excellent spoken and written English     Able to manage sensitive and sometimes confidential information      Behaviours:       Customer Service  : ability to meet and strive to exceed the needs of internal and external customers by producing quality work and service      Drive for Results  : able to go the extra mile to achieve tasks, objectives and targets. Demonstrates good attention to detail across all areas of work. Self-motivated.      Teamwork  : able to work together with colleagues to pool skills, ideas and resources to achieve objectives and resolve problems      Initiative and Problem Solving  : able to take ownership, accepts issues and follow up with actions to rectify      Planning and Organising  : able to work to deadlines and manage time effectively      Expert Analytical skills:   - ability to delve into complex problems and translate into effective solutions.      Development standards:-   have knowledge of and adhere to, the Oracle JDE development standards.      New technologies:-   show awareness of new developing technologies coming out of Oracle  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["IT services", "C++", "ERP", "Data migration", "Talent acquisition", "Debugging", "JD Edwards", "Customer service", "Oracle", "SQL"]}