{"Job Title": "SOFTWARE DEVELOPMENT ENGINEER IN TEST - PYTHON", "Company": "McAfee Software (India) Pvt. Ltd", "Experience": "10 - 15 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   Role Overview:       The McAfee Web Gateway Unit within McAfee is chartered with the mission of ensuring the leadership position in the Cloud Security market. The end-to-end software engineering team based in Bangalore is focused on designing the excellent network security products for use by enterprise customers. The team provides security software solutions that is integrated with the entire security threat life cycle for McAfee's enterprise customers. This excellent engineering team is renowned for developing optimised system software solutions with high reliability.        About the Role     You will write Test Automation code to efficiently validate our Cloud-based network security product set from a end-to-end functionality, scale, performance and security perspective   You will establish automation framework and processes for the project   You will use Python and other languages when you are coding test cases, along with technologies such as Cloud, IAM, Networking and security concepts.   You will review product requirements, specifications and technical design documents and provide accurate feedback to ensure that software is written in a testable and supportable fashion   You will define detailed, comprehensive and well-structured test plans and test cases which are streamlined for automation   You will help drive the existing automation frameworks forward to benefit automation across multiple products, and may be asked to create new frameworks depending on need   You will actively measure code coverage of the automation tests in order to identify areas of focus, and other metrics to identify areas of brittleness in the automation code, producing dashboards to provide data to the team   You will propose and create innovative solutions to automating software testing in a performant and scalable fashion   You will use your experience in agile development/testing practices, and risk based testing to ensure efficient release testing   You will be estimating, prioritizing, planning and coordinating automation activities   You will need to identify and document product defects that you find, and work closely with the development team to help them resolve the defects   You will write automated regression tests to ensure that defects to not reoccur.   You will report to the QA Manager.     About You     10+ years of experience in a Software Test Automation role programming in Python   Demonstrable experience of using Python in an object-oriented environment   Exposure to variety of Operating Systems (Linux, Windows Server/Desktop, Mac, Mobile clients)   Experience of TestComplete, Selenium, PyWinAuto or similar Test Automation frameworks   Experience of Gherkin for BDD   Excellent partnership and interpersonal skills,and the ability to collaborate with all parties including Dev and QA teams, Program/Product managers, Technical Publications and other Project Partners.   A keen interest/experience in improving efficiency in software testing.   Understanding of risk-based testing or other approaches to increase efficiency.     Preferred Skills     Preferable to have experience in continuous delivery environment using test driven development and Agile   Prior experience working on software security products is a plus  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Linux", "Networking", "Coding", "Software Development Manager", "Agile", "Network security", "Windows", "Selenium", "Python", "Testing"]}