{"Job Title": "Front End Developer", "Company": "CoStrategix Technologies Pvt. Ltd.", "Experience": "7 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "     Job Description Product Developer FE       The Product Developer - FE is a key member of the New Product development and is responsible for developing the web user interface for the new product on cloud platforms. This role will report into Technical Architect and Delivery Manager, with matrix reporting to Director - Technology & Engineering.      Required Technical & Professional Expertise       7+ years of relevant industry experience       Expert Programmer in Reactjs, Redux and JavaScript ES6.       Strong proficiency in JavaScript, including DOM manipulation and the JavaScript object model       Experience with common front-end development tools such as Babel, Webpack, NPM, etc.       Strong knowledge and Working Experience with Integrating / Consuming RESTful APIs       Proficient with fundamental front end languages such as HTML, CSS and JavaScript.       Knowledge of modern authorization mechanisms, such as JSON Web Token       Basic understanding of server-side CSS pre-processing platforms, such as LESS and SASS       Proficient in debugging and fixing bugs in minimal time       Follows coding standards, builds appropriate unit tests       Good communication skills       Previous experience in having worked on an offering on the cloud or having designed cloud solutions for clients.       Experience in using modern development tooling and source code control management tools       Experience in Agile/Scrum product development experience.       Preferred Technical & Professional Expertise       3 to 5 years of strong development experience ReactJS.       3 to 7 years of strong development experience in JavaScript        2 to 4 years of hands on cloud technology experience. Either in development or cloud solutioning.       Prior product development experience using ReactJS preferably on cloud, but at least in Unix / Linux.       Experience in working with open source.       Responsibilities:       Developing user-facing features using Reactjs       Building reusable components and front-end libraries for future use       Responsive web applications.       Writing clean, scalable code and Implementing unit tests.       Working alongside graphic designers for web design features.       Participating in requirements analysis   .   ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Unix", "Front end", "Linux", "Coding", "Debugging", "Javascript", "HTML", "Web designing", "JSON", "Open source"]}