{"Job Title": "BRM Developer", "Company": "LUMINITE SERVICES", "Experience": "2 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   Job Requirements : - GraduationPost-graduation (Engineering graduate and post graduate preferable)  - Overall Experience of 7+ which includes at least 4 years on implementation of large scale BRM applications  - Experience on integrating BRM with Siebel, OSM  - Requirement understanding, Analysing, designing, developing, customizing and enhancing the Oracle Billing and Revenue Management (BRM) application  - Subscription Management, Rating Discounting, Billing Invoicing, Payments Account Receivable, General Ledger, Collections, Third Party Integration  - Extensive experience in developing custom opcode development and custom data manager (DM)or EM (External Manager)  - Hands on exposure to ECE PDC Mediation  - Unix Shell scripting experience  - Experience in designing price plans (products, discounts, charge share etc.)  - Experience of working in at least 4-5 relevant projects  - Exposure on Siebel Communication Module (Preferred)  - Sound business knowledge of TelecomISP operations (Optional)  - Oracle BRM certification (Optional- Added Advantage)  Responsibilities:  - Team management and Planning  - Single point of contact for Technical and functional deliverables  - Requirements gathering and modelling as per business requirements  - Understanding the application requirements, mapping with BRM data model, transforming the data and loading into OBRM.  - BRM architecture and design  - Responsible for incident, problem and change management processes.  Acquired sound Business knowledge of Telecom applications.  - Experienced in incident, problem and change management processes.  - Excellent organizational and interpersonal skills    ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Telecom Software,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Telecom", "Change management", "Interpersonal skills", "Siebel", "Oracle BRM", "Team management", "Data modeling", "Billing", "Revenue management", "Unix shell scripting"]}