{"Job Title": "PeopleSoft Technical Developer", "Company": "Version 1", "Experience": "3 - 7 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  Job Description     Significant experience in PeopleSoft technology, including latest releases    Extensive project experience    Knowledge of PeopleSoft applications at recent 9.2 version is essential.    We re seeking someone with experience in HCM. Additional experience in Financials or Campus would also be desirable.       Specific knowledge of most of the following is assumed:      Application Designer and development experience in most of the following    PeopleCode object classes     Fluid page building    Integration Broker messaging technology including Web Services    JavaScript, HTML5 and CSS3    AWE and Page Composer    BI Publisher, Pivot Grids, Connected Query    PeopleSoft Update Manager and operating the Selective Adoption process    PeopleTools associated infrastructure design and management   Development lifecycle management process   Application, UIUX, Integration and Reporting design   PeopleTools frameworks such as Related Content, Related Actions, Activity Guides, PeopleTools Test Framework, Push Notifications, Portal, Forms Builder, Event Mapping and Search      Qualifications     A positive, dynamic and flexible attitude    Able to work well as part of a mixed team including Functional Consultants, Project Managers and Technical Consultants   Displays passion for the role and a strong desire to deliver to the best of their ability   Displays the persistence to complete tasks and the rigor to ensure the solutions are thoroughly tested   Displays a passion for learning and developing their skills   Documents solutions clearly and shares knowledge freely within our PeopleSoft community   Excellent English language communication skills are a must      Additional Desirable Skills:      A working knowledge of nVision would be beneficial.   ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["ERP", "Technical management", "Peoplecode", "Talent acquisition", "Infrastructure design", "PeopleSoft technical", "Javascript", "PeopleSoft", "Oracle", "CSS3"]}