{"Job Title": "Frontend Developer - ReactJS", "Company": "ShieldSquare _x001A_", "Experience": "3 - 5 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  Experience:   3 -5 years    Educational Qualification:   BE/B.Tech/MCA    Job Responsibilities:     Writing reusable, testable, and efficient code     Design and implementation of low-latency, high-availability, and performant applications     Integration of user-facing elements developed by front-end developers with server side logic     Implementation of security and data protection     Integration of data storage solutions, experience in SQL.     Requirements:     Front end Technologies:     JavaScript ES6 (eslint, prettier)      React (15.6.2, old lifecycle, no Hooks),      Redux     Jest/enzyme Unit test (e2e testing: protractor)     Nice to know:     npm, babel, webpack (chunks), gulp, Jenkins (build machine)     Dev-env: Express/Node     Able to integrate multiple data sources and databases into one system     Understanding of the multi-process architecture to work on parallel processing     Good understanding of front-end technologies, such as JavaScript, HTML5, and CSS3     Periodic report, simple notifications (email content formatting)     Good understanding of client side templating and also exposure to single page application is a plus point     Knowledge of user authentication and authorization between multiple systems, servers, and environments     Understanding of fundamental design principles behind a scalable application     Able to create database schemas that represent and support business processes     Strong unit test and debugging skills     Proficient understanding of code versioning tools such as Git  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Embedded, EDA, VLSI, ASIC, Chip Design,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "MCA in Computers", "Doctorate": "None", "Key Skills": ["SIDE", "GIT", "HP data protector", "Debugging", "e2e testing", "Javascript", "Database", "Unit testing", "SQL", "CSS3"]}