{"Job Title": "Urgent Opening For Azure Data Engineer", "Company": "Abzooba India Infotech Private Limited", "Experience": "2 - 6 years", "Salary": "Not Disclosed", "Location": "Kolkata, Pune", "Job Description": " Selecting and integrating any Big Data tools and frameworks required to provide requestedcapabilities Implementing the Ingestion & ETL/ELT processes Monitoring performance and advising any necessary infrastructure changes Required Experience, Skills and Qualifications: MUST have HANDS-ON experience on Hadoop tools/technologies like Spark (Strong in Spark),Map Reduce, Hive, HDFS. HANDS-ON expertise and excellent understanding of big data toolset such as Sqoop,Spark-streaming, Kafka, NiFi Proficiency in any of the programming language: Scala, Python or Java with total of 4yearsexperience Must have experience in Cloud infrastructures like MS Azure, data lake, data bricks etcGood working knowledge in NoSQL DB (Mongo, HBase, Casandra) Must have experience of designing, developing and deploying big data project/s intoproduction Implemented complex projects dealing with the considerable data size (TB/ PB) and withhigh complexity in the production environment.Desired Candidate Profile Bachelor's degree or higher in a quantitative/technical field (e.g. Computer Science,Statistics, Engineering) and software development experience with proven hands-onexperience in Big Data technologies Experience in developing/architecting environments in the Hadoop ecosystem using HDPand HDF Demonstrated strength in data modelling, ETL development, and Data.Experience in designing and implementing an enterprise data lake Experience in Big Data Management and Big Data GovernancePerks and Benefits ", "Role": "Technical Support Engineer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Admin/Maintenance/Security/Datawarehousing", "UG": "B.Tech/B.E. in Any Specialization", "Doctorate": "None", "Key Skills": ["Business Intelligence", "Big Data Analytics", "Azure", "Hadoop", "Big Data", "pyspark", "Spark", "Python"]}