{"Job Title": "Junior Java Developer", "Company": "Version 1", "Experience": "2 - 7 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   Job Description   Version 1 have a great reputation for Digital Applications delivery. Due to our growth trajectory, we are now seeking a number of talented, driven and ambitious Java Developers to help drive innovation and product delivery within one of our key clients.   This is an exciting opportunity for a Java Developer to not only work with some of the best developers in this area, delivering critical new applications and integration solutions but you will also have the opportunity to enhance your skills and development expertise. You will be working with thought leaders in the API space and in the Azure Cloud platform and you will be constantly learning from these experts. Further to this you will have exposure to the Apigee platform which is one of the leading API platforms in the market place.   The ideal candidate will have experience of delivering Java solutions across enterprise level projects/programmes.   It is a position with excellent career prospects, suitable to someone looking to make the next step up in their career and that is seeking to work with new technologies and drive our ambitious development team members to new heights.   Version 1 designs, implements and manages a range of Azure and digital solutions on behalf of our clients. We are searching for a motivated, driven person with a strong fit to our Core values and with the ability to apply their technical knowledge and experience to our client s programme of work and teams.   The successful candidate will be responsible for the development of cutting edge Distributed Systems and API s. You will be working with a range of technical experts as well as with knowledge leaders from the business, giving you exposure to an industry sector embracing innovation and evolution. You will be responsible for:    Being a key player in this client s Digital Transformation.     Developing new and be-spoke features as well as working on large scale integrations.     Working in an Agile environment where you will be challenged and motivated.     Building Front-Office applications to be utilised by leaders within their field.     Introducing a new technology stack to the business.     Gaining exposure to Microsoft Azure and Apige.   Qualifications    A minimum of 2 years hands on Java development experience.     Knowledge of JavaScript and NodeJS is highly desirable.     You will have worked in an Agile environment and be comfortable with fast-paced Sprint Cycles.     Previous experience building API s is key for this role.     Any experience with Microsoft Azure is desired.    Additional skills we are looking for include:    Spring Framework     GIT     Jenkins     Maven     Groovy     Spock     Powershell Scripting   ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["IT services", "Maven", "Front office", "GIT", "Powershell", "Javascript", "Agile", "microsoft azure", "Customer service", "Oracle"]}