{"Job Title": "Web Application Developer", "Company": "Palnar Transmedia Pvt Ltd.,", "Experience": "7 - 12 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru, Trivandrum/Thiruvananthapuram", "Job Description": "    Work with designers and SME s to develop and deliver fully functional web applications     Translate designs into the proper web technologies needed to meet the requirements of the applications     Ongoing support of web applications     Competencies Experience Required/Desired     Bachelor s degree in computer science,  information technology,  interactive media,  or related field     7+ years experience developing web applications using the latest technologies (Angular,  React,  HTML5,  JavaScript and J2EE.)     Experience using D3,  ChartJS,  HighCharts,  or other JavaScript charting libraries     Experience working with microservices and API gateways     Full- stack development experience,  with deep understanding of databases and data structures     Extensive experience developing modular components and utilizing microservices and API gateways to acquire and populate data     Experience working within Agile methodology and using corresponding tools (Jira,  Azure DevOps,  etc.)     Strong problem- solving capabilities. Results oriented. Relies on fact- based logic for decision making.     Ability to work with multiple projects and work streams at one time. Must be able to deliver results based upon project deadlines.     Willing to flex daily work schedule to allow for time- zone differences for global team communications     Strong interpersonal and communication skills     Additional Skills:     Experience utilizing the Tableau JavaScript API     Experience in demonstrating the challenges and recommendation to leadership team in a precise manner     Experience in visualization tools     Experience in developing basic data science models using Python or a similar language     Having AWS or Azure certification is a plus  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "data science", "Javascript", "Flex", "Data structures", "J2Ee", "Agile methodology", "JIRA", "Information technology", "Python"]}