{"Job Title": "Software Engineer -Product Development -3D", "Company": "Scanpoint Geomatics Limited", "Experience": "1 - 4 years", "Salary": "Not Disclosed", "Location": "Ahmedabad", "Job Description": "Roles and Responsibilities Dear  Candidate,  Greetings  from Scanpoint Geomatics Limited.! Scanpoint Geomatics  Ltd. (SGL) : SGL is CMMi Level 3, ISO 9001 & 27001 Certified Company.  A national leader and pioneer in the Indian Geomatics industry. SGL developed the  very first indigenous Integrated GIS and Image Processing Software, with an aim to provide a cost effective technology for  global users of Geomatics. We are proud to have a product development joint  venture with ISRO (Indian Space Research Organization) for  continuing research and development of our indigenous IGiS technology.  The IGiS technology aims to elevate and support the  global Geomatics industry significantly. We are specialized  in developing diverse enterprise solutions for: Agriculture | Defense | Disaster Management | Forestry | Land  Information | Mining | Power | Smart City | Urban Planning | Utilities |  Location Based Services | Mapping Kindly visit following links to know  more about us.  Company Website URL:-https://www.sgligis.com/ Link of Corporate Video:  - https://youtu.be/ycu2Bxdr2Rw (must  watch)  Detailed  Job Description: Designation:Software  Engineer  Department:Product  Development  Location: Ahmedabad-Gujarat (Corporate Office)  Experience:2 + Role summary:  Software Engineer -3D will be  responsible for researching, development and testing on Product features in  Product Development department to develop new features or enhancement in  existing features of the products.  What you’ll do? / Responsibilities:  Execute full software       development life cycle (SDLC) Develop flowcharts, layouts       and documentation to identify requirements and solutions Write well-designed,       testable code Produce specifications and       determine operational feasibility Integrate software components       into a fully functional software system Document and maintain       software functionality Troubleshoot, debug and       upgrade existing systems Deploy programs and evaluate       user feedback Comply with project plans       and industry standards Ensure software is updated with latest features. ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Electronics/Telecommunication, Any Specialization, Mechanical, Computers", "PG": "M.Tech in Computers, Any Specialization, Electronics/Telecommunication, Mechanical", "Doctorate": "Doctorate Not Required", "Key Skills": ["Product Development", "WebGL", "3D", "CSS", "Software Engineering", "Javascript", "Software Engineer", "HTML"]}