{"Job Title": "Business Intelligence Developer", "Company": "Version 1", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  Job Description   As part of our developing Business Systems function, we have a new opportunity for an experienced BI Developer to join our team dedicated to supporting out Commercial (Sales) function. This role is focused on supporting the function transition to a full data-driven, digitally enabled organisation unit, where the provision, consumption, interpretation and analysis of internal and external data drives all aspects of our current and future operational management activities. As a key provider of quality data and insights to our sales operations, sales enablement and sales performance organisational units, this role is pivotal in enabling our sales function drive the ambitious growth of our business over the coming years.   You will join a 1300 strong, 150m revenue business. Career development opportunities abound, working across functions and geographies, across industry sectors and customers. This is an exciting opportunity for an experienced developer of large scale data solutions. A permanent position, you will join a team delivering a new generation of business applications to support the aggressive growth plans of our business. The role is highly varied and agile and will evolve over time as the Commercial Operations function matures. It will enable you both build deeper and wider technical competence and gain broad experience across commercial & sales operations. It will provide you with the opportunity and potential to develop into a key Version 1 technical leader as our business grows.   The ideal candidate will have a proven track record in implementing large scale business intelligence solutions. We are seeking someone with deep technical skills in a variety of technologies to play an important role in developing and delivering early proofs of concept and production implementation. In addition, this individual will be instrumental in driving our automation & machine learning agenda.   Your main responsibilities will be:    Designing and implementing business intelligence technical solutions.     Data modelling and data architecture design and implementation.     Analysis of requirements and production of specifications and reports.     Documentation of solution (e.g. data models, configurations, and setup etc.).     Working within a project management/agile delivery methodology.     Engaging with the commercial function to identify POC s and new insights to bring value to the business.     Engaging with the commercial function to drive high value opportunities to effect increased automation and leverage of machine learning enabling increased success levels of sales personnel and the function     Ability to engage and communicate effectively within a high-performance team.   Qualifications   You will ideally have a good background in building solutions using modern business intelligence tools and reporting technologies:    Excellent BI and Analytics professional experience across a range of technologies including Microsoft PowerBI, Python and SQL development, with deep experience in building complex PowerBI dashboards.     Hands on experience with business intelligence tools, data modelling, data staging, and data extraction processes.     Experience in the application of machine learning tools and techniques to solve real business problems.     Experience and demonstrated competencies with multi-dimensional design, star schemas, facts and dimensions.     Expertise in logical and physical data warehouse database design and performance optimisation.     Experience with Microsoft SQL Server, SQL Server Reporting Services and SQL Server Integration Services will be an advantage     Strong BI presentation layer or usability design capability an advantage     Business intelligence and analytics certification an advantage.  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Automation", "Talent acquisition", "Database design", "Project management", "Agile", "Customer service", "Oracle", "Business intelligence", "Analytics", "Python"]}