{"Job Title": "DevOps Engineer / Cloud Engineer", "Company": "Cogneesol", "Experience": "2 - 7 years", "Salary": "Not Disclosed", "Location": "Mohali", "Job Description": "  Job description      Skills:     - Linux: In depth Linux/Unix fundamentals, various Linux kernel subsystems (memory, storage, network etc) fundamentals.    - Fundamentals: DNS Networking Fundamentals, TCP/UDP, IP Routing, HA Load Balancing Concepts    - Cloud: AWS, Azure (Extensive experience with AWS, including EC2, EBS, S3, VPC, ELB, CloudWatch    - Application Stacks: Nginx, Apache etc    - Datastores: SQL/RDBMS Fundamentals, MySQL, NoSQL, Replication/Clustering concepts, Solr, Elasticsearch, Redis/Memcached, Aerospike    - Configuration management : Ansible, Puppet, Chef    - Tools/Utilities: ELK Stack, Nagios/Zabbix, New Relic, App Dynamics, DataDog etc.    - Container Technologies : Docker, Kubernetes clusters, AWS ECS/EKS    - Databases : Knowledge of AWS RDS, Dynamo DB, Amazon Aurora, MySQL etc.    - Past experience working in variety of source control platforms such as Git, Bitbucket, SVN is mandatory     Responsibilities:     - Implement CI/CD pipelines to automate deployment and scaling    - Assist development teams with any infrastructure needs technical support    - Perform root cause analysis for production errors    - Implement security philosophies to build a bulletproof system    - Review, monitoring and set up alerts for all the various services    - Help with cost optimizations of infrastructure    - Design and develop large scale infrastructure projects (AWS, Azure)    - Manage cloud environments    - Identify and implement AWS services to be used in cloud based application    - Identify and implement other services to be used in the application    - Manage cloud environments     Minimum requirements:     - Hands on experience with AWS services is a must have (EC2, ECS, VPC, RDS, CloudWatch and others)    - Experience in web server application server configurations    - Inquisitive nature Self-starter who can implement with minimal guidance    - Experience with DevOps techniques and philosophies    - Hands-on experience with scripting languages is a good plus (high five on python and/or shell)    - AWS Certified Solutions architect would be given preference, Azure certification is a plus.     Qualification requirements:     - Bachelors in Computer Science Engineering or relevant field    - 2-3 years' work experience as a DevOps Engineer or similar software engineering role.  ", "Role": "Technical Support Engineer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Admin/Maintenance/Security/Datawarehousing", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Unix", "Computer science", "TCP", "Configuration management", "MySQL", "Apache", "Technical support", "Monitoring", "SQL", "Python"]}