{"Job Title": "Azure DevOps Engineer", "Company": "IBN Technologies Limited", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "   A minimum of 2-3 years experience in Azure Devops   Design and implement Continuous Integration, Continuous Delivery and Continuous Deployment (CICD) pipeline from source to live production of various cloud services and architecture components of our platform by collaborating within and across product engineering groups   Developed and maintained scripts using Power Shell, ARM templates/ Terraform scripts for Infrastructure as a Code.   Deep domain expertise of cloud application development solutions (e.g. IaaS, Serverless, API Management) Container orchestration (e.g. Kubernetes etc.)   Design and Deploy Software architecture and practices (design/ development /deployment, Agile, SCRUM, ALM)   Provide technical mentoring to other engineering members to build a high performing and inclusive team of talented individuals that learns and grows together   Monitor and troubleshoot issues while following downtime procedures   Provide visibility on application health by defining dashboards, metric log aggregation mechanisms   Document the standards and procedure   Evaluate new technologies and provide proof-of-concept     Required Candidate profile     Graduation/ Post graduation or equivalent. B. Tech/ MCA preferred   Should have knowledge on Docker(Swarm) & Kubernetes   Deep knowledge of Microsoft Azure DevOps Tools (Pipelines, Release pipelines, Azure DevOps Boards)   Knowledge of Web and database servers   Well versed with cloud networking such as set up load balancers, gateways, vNETs, endpoint management, private/public networks, Management groups, Azure policies, AKS, key vault, Application Insights, Application Gateway   Proficient in managing CICD tools for each stage of pipeline TeamCity, Jenkins, Unit testing, Code Coverage, Static and Dynamic analysis, Compliance, Vulnerability etc. along with version control tools for source code and binaries like Git and Artifactory   Working knowledge of orchestration tools like PuppetChef is a plus   Working knowledge of Big data analytics and streaming technologies such as Kafka, Kinesis, ElasticSearch, ELK   Must have strong Ansible & terraform skills   Azure Devops Certification will be preferred   Ability to identify problems, mediate issues, develop solutions, and implement appropriate courses of action   Excellent oral and written English communication skills with a high attention to detail and impeccable time management skills.   ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Product engineering", "Version control", "GIT", "orchestration", "Networking", "devops", "Application development", "Vulnerability", "Unit testing", "ITES"]}