{"Job Title": "WordPress lead developer", "Company": "Mundrisoft Solutions", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "   Do you want to work for clients like Microsoft, Intel, 3M       We are looking for   Senior developers and Project Leaders for WordPress   who can work with our awesome team. Our clients are top fortune 100 international technology companies.   All WordPress projects are for international clients.      Required skills:      Experience in developing high performance WordPress, React, Angular, HTML websites at scale    Strong knowledge and experience in HTML(5), CSS(3), Advanced JavaScript    Experience in WordPress customization, Theme Customization, Plugin Customization.    Experience of writing modular/reusable code and using JS frameworks like React, Angular, Node.js etc.    Experience in of serverside technologies and SQL/NoSQL.    Experience with advanced CSS programming using LESS or SASS is a plus.      Responsibilities      Collect requirement, plan the delivery approach, define key milestones, dependencies, and provide effort estimate timeline.    Provide solutions to the problems to the solutions faced by clients.    Responsible for developing and implementing new features and functionalities ensuring high performance availability.    Custom develop and/ or integrate existing plugins with CMS.    Own the website architecture and back end development including the database.    Build user interfaces for websites and web applications.    Work closely with designers, front-end developers to create engaging, visually appealing, functional and intuitive websites.    Strengthen and improve development and release processes within the team    Collaborate with the team and communicate effectively.      Opportunity to:      Work on projects of fortune 100 international clients    Work on latest technologies and various JavaScript frameworks.    Work on mobile, tablet and desktop web applications    Amazing grown path. Learn, grow and help team members grow    Be part of our awesome team       ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Front end", "NoSQL", "PDF", "Wordpress", "CMS", "microsoft", "international clients", "Analytics", "SQL"]}