{"Job Title": "SOFTWARE DEVELOPMENT ENGINEER IN TEST", "Company": "McAfee Software (India) Pvt. Ltd", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "    Role Overview:        We are looking for a Software Development Engineer in Test (SDET) to join the Global Security Data Services team at McAfee Bangalore.      About the Role :      You will be part of a scrum team that is responsible for the cloud based services that enable protection at the endpoint products on a continuous basis.    You will work with your assigned team to design, develop and maintain automation solutions that meet business needs with respect to functionality, performance, scalability, security and reliability.    You will be responsible for assisting in the creation of project backlogs and estimating project tasks, and for participating in the overall solution design in terms of testability.    You will be required to write automated tests using Python, or other languages as required.    You may be required to maintain existing automated tests ensuring compatibility with any newly developed platform features.    You will be required to build automation workflows that execute and report on the success of testing as part of an Agile development lifecycle.    You will input into the project plan from a quality assurance perspective    You will have ownership and responsibilities for key components relating to quality assurance within the systems.    You will participate as part of the team in the technical strategy discussions, and be an advocate for quality.        About You      2Years of Automation test experience.    Experience developing automation frameworks and tests in a Python environment (similar experience in another relevant language will be considered).    Experience working with a product development team in an Agile environment.    Some experience and knowledge of automation tools, technologies and best practices.    Some experience in cloud based technologies and services is highly desirable.    Excellent troubleshooting skills in a complex environment.    Willingness to learn and adapt to new technologies in a dynamic environment.      Good to Have      Knowledge of Agile methodologies, particularly SCRUM.    Knowledge of Software Build tools (such as Jenkins) is highly desirable.    Experience of public cloud providers such as Amazon Web Services or Microsoft Azure, particularly AWS based services e.g. EC2, S3, DynamoDB, AWS Lambda etc.     ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["data services", "Manager Quality Assurance", "Web services", "Diversity and Inclusion", "Cloud", "Agile", "microsoft azure", "Scrum", "Troubleshooting", "Python"]}