{"Job Title": "SOFTWARE DEVELOPMENT ENGINEER", "Company": "McAfee Software (India) Pvt. Ltd", "Experience": "6 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "    Role Overview:       Develops software as the primary job function; Designs, develops, debugs tests complex software in any field e.g., systems software, software development tools, applications, drivers, numerical methods, UIs, web. May work directly with companies developing and optimizing compilers, operating systems, and other software technologies. Usually holds an academic degree in Computer Science, Computer Engineering or Computational Science.    About the Role:     Candidate should have good design skills and have good skills in the Microsoft web development technologies.   Strong Object Oriented Programming principles. Thorough understanding and practicing SOLID principles.   Participate in code reviews and provide and accept reviews.   Interact with Peer teams in other GEOs and with other teams present locally.   Candidate must have an excellent analytical skills   Should be able to review PRDs, analyze and implement solutions.   Candidate will develop / support internal tools   Analyze all the solution options in a given project, and ability to identify the ease to maintain / high performance solutions and implement.   Gain familiarity with managing product releases and tracking issues.   The candidate is expected to collaborate closely with program management, QA and other development teams.   Good communication skills, having worked with multiple teams in offsite locations a plus     About You:     Exposure to developing Web based applications with 6 to 8 years of experience   Familiarity in .Net: C#, ASP.Net, XML, XSL, JS, TSQL, SQL Server.   Exposure to writing SQL and SQL optimization for high volume databases   Exposure to Big Data is beneficial.   Development experience in MVC and WebAPI   Must have the passion to work with technology and complex systems   Show enthusiasm in analyzing requirements, able to understand impact on existing systems and come up with an all-encompassing solution   Passion to work with demanding customers   Good written and verbal communications skills and must be a strong team player.   Able to adopt to coding best practices and standards   Able to clearly document, user stories/use cases, functional specification and design   Able to convert a problem statement to a design and implementation.   Ability to interpret architecture and provide implementation documents.   Excellent problem solving skills.   Able to document details of functionality, design and architecture of a component.   Able to participate in weekly code reviews with engineers.   Is able to understand impact of code changes- both programmable and logical changes.   Is able to piece together relevant existing functionality and quickly come up with a prototype or solution.   Facilitate or host reviews on Application source code and technical documentation.   Ability to work independently working with a team of Engineers locally and peer teams abroad with minimum guidance.   Out of box thinking     Nice to have Skills:     Quick learning on software source control systems such as ACCUREV is preferred.   Quickly adapt to Experience in working in Agile methodology knowledge on Scrum principles.    ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Coding", "XML", "Web development", "Scrum", "Agile methodology", "MVC", "microsoft", "SQL", "Technical documentation"]}