{"Job Title": "director software development engineering", "Company": "Fiserv India Pvt Ltd", "Experience": "15 - 20 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "\n\n•A seasoned technical and people leader with payment domain knowledge.  Person will be accountable for all development,  Testing,  production support and implementation related activities (Planning,  analysis,  design,  development,  quality assurance,  non- functional testing and release management) for projects in Cards division (Debit,  Credit and Digital areas).  \n\n•Responsible for integration with multi- location (geographically distributed) and multi- role teams to ensure timely delivery \n\n•Responsible for program planning (including infrastructure and manpower),  execution,  governance,  team management oversight \n\n•Interact with BU and project teams to prepare and publish project scope,  objectives,  project plan and schedules; develop detailed work plans and status reports.  \n\n•Ensure timely and quality delivery of features.  \n\n•Design and deployment of processes in compliance with FISERV standards and corporate governance/ audits \n\n•Facilitate strategic planning sessions with clients and management to determine the scope and objectives \n\n•Responsible for financial governance on the engagement \n\n•Should have led and managed delivery teams of 50 to 150 associates \n\n•Should have strong exposure in designing techno- functional solutions,  integrating and deploying Payments solutions \n\n•Solid understanding of architecture,  design principles,  usage of technology and end to end solution designing.  \n\n•Should have demonstrated ability to handle multiple projects at the same time in fixed cost and managed services model maintaining excellent margin and profitability \n\n•Should have ability to handle teams,  inspire them while meeting needs of business partners/ clients \n\n•Appreciation of CMMI Level 5 process and effective application of the same in the projects \n\n•Experience of managing communication,  progress reporting,  dashboard,  risk and issues to relevant internal and external stakeholders \n\n•Exceptional ability to balance strategic,  tactical,  and operational thinking and execution in a dynamically evolving business environment \n\n•Agile,  adaptable mind- set that enables effective complex problem solving and understanding the trade- offs between the ideal solution and pragmatism \n\n•Strong business and financial acumen \n\n•Experience in implementing follow- the- sun approach in production support projects \n\n•Ideally someone who has heads down development and enterprise architecture background,  preferably with J2EE,  Mainframe and Tandem technologies before transitioning in to Leadership role.  \n\n•Should have led and managed delivery teams of 50 to 150 associates \n\n•Should have strong exposure in designing techno- functional solutions,  integrating and deploying Payments solutions \n\n•Solid understanding of architecture,  design principles,  usage of technology and end to end solution designing.  \n\n•Should have demonstrated ability to handle multiple projects at the same time in fixed cost and managed services model maintaining excellent margin and profitability \n\n•Should have ability to handle teams,  inspire them while meeting needs of business partners/ clients \n\n•Appreciation of CMMI Level 5 process and effective application of the same in the projects \n\n•Experience of managing communication,  progress reporting,  dashboard,  risk and issues to relevant internal and external stakeholders \n\n•Exceptional ability to balance strategic,  tactical,  and operational thinking and execution in a dynamically evolving business environment \n\n•Agile,  adaptable mind- set that enables effective complex problem solving and understanding the trade- offs between the ideal solution and pragmatism \n\n•Strong business and financial acumen \n\n•Experience in implementing follow- the- sun approach in production support projects \n\n•Ideally someone who has heads down development and enterprise architecture background,  preferably with Mainframe,  Tandem and J2EE technologies before transitioning in to Leadership role.  \n\n", "Role": "Team Lead/Technical Lead,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Application support", "git", "Manager Quality Assurance", "Production support", "Coding", "Functional testing", "testing", "j2ee", "Director", "LAN", "CMMI", "agile"]}