{"Job Title": "Lead Software Development Engineer", "Company": "VertMarkets, Inc.", "Experience": "10 - 20 years", "Salary": "Not Disclosed", "Location": "Mumbai, Pune, Bangalore/Bengaluru", "Job Description": "DESCRIPTIONFuel your IT passion with a diverse mix of web-based development projects.Feel like you're stuck in a career rut? Unable to leverage your core web development skills and desire to master new technologies and grow your career? This is the place for you!Vertmarkets, a 30 year old US-based company, is looking to expand their software development team in India. We are looking for a dynamic individual with leadership skills, who will help build and manage the team in India. You will be responsible for the development team in India, ensuring that projects are completed to specification, within an established timeframe and be the primary liaison with the US team as they build and support applications using cutting-edge   technologies. You'll work with the stakeholders, architects and senior developers directly, enabling new features and functionality to web applications for state-of-the-art code using open-source tools and cutting-edge technologies. Our talented development team provides the right environment for you to   continue to learn and build your career.Vertmarkets uses a lot of Microsoft technologies such as Azure DevOps, Azure Sql alongside Angular,  Elastic Search or MongoDB. All new development is done using .NET Core, C#, Typescript and Angular or VueJS. You're the ideal candidate if you have a desire to improve yourself and your skills, if development is not just   a job for you but a passion, and are looking to join a team where you can   make a difference. POSITION REQUIREMENTSIn addition to a Bachelor's Degree in Computer Science,   Software Engineering, or Information Systems, candidates must have the following core skills and experience: At least 10 years of overall current experience developing web applications / hands-on development Experience with ASP.Net (4.0 or .Net Core preferred), C# Experience with Azure Sql, or Sql Server 2012 or higher  Experience with Typescript, JavaScript, and CSS General understanding of the software development process using Agile technologies  Collaborate in an interactive team environment, both conforming to standards and conventions while helping to evolve them Strong analytical skills based on research, best practices, and problem solving Clear, concise communication skills Preferred skillsThe list below is a set of technologies thats used on a regular basis. The ideal candidate will have experience in one or more of these technologies, but more importantly, have the desire to   learn and eventually master the rest. Angular or VueJS or any other   SPA Bootstrap MongoDB, Entity Framework WebAPI, WCF Azure or AWS cloud technologies Masters degree preferredYou get to be an integral part of a small, bright team. You get to pair-program with some of the best   developers in the industry. Sounds good so far? There's more.We offer a generous compensation package. In addition to a competitive salary, you'll enjoy: 13 company-paid holidays Company provided laptopVertmarkets Inc.   Ph: (993) 0993 565    E-mail: kpasko@vertmarkets.com", "Role": "Team Lead/Technical Lead,", "Industry Type": "Internet, Ecommerce,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Freelance/Homebased", "Role Category": "Programming & Design", "UG": "B.Sc in Computers, BCA in Computers, Diploma in Computers, B.Tech/B.E. in Computers", "PG": "M.Tech in Computers, MS/M.Sc(Science) in Computers, MCA in Computers, PG Diploma in Computers, Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["C#", "Angularjs", "SQL Server 2012", "Software Development", "Typescript", "Javascript", "Agile", "Bootstrap", "Entity Framework", "VueJS", "AWS", "CSS", "Azure", "Web Technologies", "ASP.Net 4.0", "Cloud technologies", "Lead Software Developer", "Azure SQL", ".Net core", "WebAPI", "Web Application", "ASP.Net", "MongoDB", "WCF", "Elastic Search"]}