{"Job Title": "Senior Software Development Engineer - Site Reliability Engineer", "Company": "RANDSTAD INDIA PVT LTD", "Experience": "5 - 10 years", "Salary": "₹ 7,00,000 - 15,00,000 P.A. ", "Location": "Pune", "Job Description": "Roles and Responsibilities  We are looking for a Site Reliability Engineer with a Dev Ops mindset to engage in the development of our cloud native platforms, build our CI/CD pipeline and lead us in DevOps automation and best practices. This position requires a thorough knowledge of what it takes to develop Scalable, Resilient, highly responsive and high-performance applications from the ground up.•\tEngage in and improve the whole lifecycle of servicesfrom inception and design, through deployment, operation and refinement. •\tDevelops & maintains CI/CD pipelines, Release automation workflows, Repositories, Access Control•\tPerform Quality Inspections and Walkthroughs throughout the SDLC including Requirements Review, Architecture Review, Design Review, Code Review and Security Review to ensure compliance with MasterCard standards. •\tManages Environments (within scope) for issues, planned activities, outages, vulnerabilities•\tManages Releases with creation of implementation plans, SRE functional test-cases, communication templates, Change Tickets & striving to zero-downtime deployments using B/G tactics.•\tEnsure operational criteria like system availability, capacity, performance, and monitoringMaintain services by measuring and monitoring availability, latency and overall system health.•\tScale systems sustainably through mechanisms like automation and evolve systems by pushing for changes that improve reliability and velocity.•\tTake a holistic approach to problem solving, by connecting the dots during a production event through the various technology stack that makes up the platform, to optimize mean time to recover•\tWork with a global team spread across tech hubs in multiple geographies and time zones•\tSelf-starter who works with little direction, constantly seeks and advances new ways of doing things, keeps abreast of relevant technologies and trends Desired Candidate Profile  •\tFull stack engineering experience in a production environment •\tProficiency in Software Development Best Practices (ATDD/BDD, Unit tests)•\tDeployed Consumer-facing software into a Production Environment•\tContribute to development, code review, and testing of applications•\tExperience with Spring Cloud, Spring Boot, Redis, Mongo, Kafka, Spock, Jenkins, Maven, Groovy, JMeter, Splunk or similar, Cloud (PCF), Webservices, Splunk, Dynatrace.•\tUnderstanding Software Development Best Practices such as BDD, TDD, SOLID ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Software Development", "Reliability Engineering", "Devops"]}