{"Job Title": "International Banking Process - Manyata Uk Shift Sal 28K\n", "Company": "Job Shop    ", "Experience": "0 - 5 years", "Salary": "₹ 2,00,000 - 4,50,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": " Call Job Shop - 7406026000Job Opportunity For International Banking Voice process@ manyata Uk Shift Sal 28kWe are currently hiring experience candidate for INTERNATIONAL VOICE PROCESS @ Manyata Tech ParkJob Description,Fresher : Customer Support -Level-1Excellent Communication skillsImmediate JoiningExcellent Verbal / Written skillsCandidates flexible working in shiftsCustomer Support with Experience :-Customer focused, Catering to customers queries and providing apt resolutionsExperience in International BPO with a Voice ProcessAbility to work in UK kind of work environment with night shifts and Rotational offsKnowledge of Banking Industry will be an advantageQualification - Undergraduate/Graduate Excellent Communication skillsExperience - Minimum 6 months with International Voice Process (Added Advantage)Note- B.E/B.Tech, M.Tech, MCA,BSc( CS/IT) and MBA are not eligible for this profile.Should be able to join immediately or 15 days.Sal upto 25k+3k inc5 Day work2 day Rotational off1 way CabUk Shift(max Log out 2:30)work Location Manyata Tech parkKindly carry any gov. Id proof, resume & print out of the call letter. Please report to me after your arrival at the following address:For More Details Contact:Call Job Shop - 7406026000********* ************ **********We are hiring Graduate fresher's and Undergraduates for Voice Process Salary Upto 4lac Call Job Shop - 7406026000Dear Candidate,rWe are hiring Graduate fresher's and Undergraduates for Voice Process.rrSemi-tech Support Associate I /Semi-tech Support Associate II: -Inbound Customer Service.Interface with Customers via Inbound or Outbound calls over the Internet for the purpose of passively assisting the customers.r r Roles & Responsibilities: -r *Greet Customers in a courteous, friendly, and professional manner using agreed upon procedures.Clarify Customer requirements; probe for and confirm understanding of requirements or problem.Support Customers across Telecommunication, Financial Services & Healthcare vertical.Conduct needs-based selling by using non-scripted probing techniques to determine Customer needs and to offer the most appropriate product or service to address their needs.r Candidate Profile-r *Any Graduate Fresher OR Under-Graduate / drop out.Excellent verbal and written communication skills.Flexible with 24/7 Environment.Salary up to 26k & attractive Incentives amount.Additional Benefits-r *Two way A/C cabs.Medical insurance worth 1 lakhs.Term life insurance worth 3.62 lakhs.Group Term Life Insurance / Group Personal accident Insurance worth 5 lakhsGratuityEducation Assistance plan - Annual entitlement of up to INR 24,000.Employee / Corporate discounts at majority of Retail Chains / Hospitals / Laboratories2.Technical Support Associate I / Technical Support Associate II: -Inbound Technical Support.Interface with Customers via Inbound or Outbound calls or the Internet for the purpose of resolving routine problems with products or services like Internet, DTH, Desktop, laptop and Printers.r Roles & Responsibilities:r *Greet Customers in a courteous, friendly, and professional manner using agreed upon procedures.Clarify Customer requirements; probe for and confirm understanding of requirements or problem.Support Customers across Telecommunication, Financial Services, Healthcare and Technology vertical.Troubleshoot Customer issues related to internet broadband, cable, DTH, modem, router, mobile handset etc.r r Candidate Profile-Any Graduate Fresher OR Under-GraduateExcellent verbal and written communication skills.Flexible with 24/7 Environment.Salary up to 26,500 & attractive Incentives amount.Additional Benefits-rTwo way A/C cabs.Medical insurance worth 1 lakhs.Term life insurance worth 3.62 lakhs.Group Term Life Insurance / Group Personal accident Insurance worth 5 lakhsGratuityEducation Assistance plan - Annual entitlement of up to INR 24,000.Employee / Corporate discounts at majority of Retail Chains / Hospitals / Laboratories.rFor telephonic interview or to inquire about more job openings, please connect withLeena 6363796881Get the best start to your career with world-class communication training, coaching and support. has the best in industry transport facility and all employees get home-pick & home-drop facility. For excellent career-growth opportunities & best-in-industry salary package.HR TeamCall Job Shop - 7406026000********** ************* *******Looking for Day shift ?5 Day's Working- BPO is hiring for CSR | Salary 25k | Call Job Shop - 7406026000Job DescriptionEXCELLENT GROWTH AND LEARNING OPPORTUNITIES FOR CANDIDATES WHO TAKE INITIATIVE. AMONGST THE FASTEST PROMOTIONS IN THE INDUSTRY FOR HIGH PERFORMERSAbout the Job: The job requires interacting with customers of from around the world primarily over Phone calls to ensure all issues are resolved to customer's satisfaction. Job requires you to understand the customer's problems accurately, follow the established procedures to investigate and resolve the problem, and communicate with the customers. You would be working in multi-tasking environment working on multiple customer servicesAs a Technical Support Executive, you will be dealing with our customers from around the world. As a company we take great pride in the level of customer service we deliver to the customers. Therefore we hire only the best Tech support professionals.Requirements:Excellent command overwritten and spoken English& hindi(NO EXCEPTIONS) and technical background .An opportunity to work in a voice technical customer support process to troubleshoot hardware and basic software issues.The position may also require to carry out challenging roles & responsibilities based on business requirement.Skills Required:Excellent communication skillsLanguages required: English & HindiExcellent command over the languageWhat we Provide:- Laptop- Job in Top MNC- Fixed Day Shift ( 9:30am to 6:30pm-5 Day's Work- with Sunday Fixed Off & 1 weekly Rotational Off- General day shift- Telephonic Interview- Immediate Joining- Salary upto 25k Take home plus 5k incentivesSalary:up to Rs. 3.20 LPA-----------------Additional Basic InfoThe position is open both for Technical Support (0-2 Years of Experience) as well as Senior Technical Support Executives) with over 2 years of experience.The open positions are for:Voice ProcessPerks and Benefits Perks and Benefits++ Bonus, Incentives, Mediclaim, Accidental Insurancesalary: Not Disclosed by Recruiterindustry:bpo / Call Centre / Itesfunctional Area:ites, BPO, KPO, LPO, Customer Service, Operationsrole Category:voicerole:associate/senior Associate -(technical)employment Type:full Time, Permanent ****************** ******************** *****************hiring FOR E-commerce Company FOR International Voice Supportfor voice positions one must have excellent communication skills, average computer skills, and the ability to solve the customer's queries quickly. For this they are also required to have good listening skills and having a eaccent will only help. Having a neutral accent is nothing but having a clear voice without any influences from the mother tongue that you may have.almost all international BPO jobs for voice process will have night shifts. instancethere is always a monitoring process wherein your calls will be monitored for determining your productivity.handling customer queries and solving them effectively.good career growth.communication Skills should be Excellent to get hired in Leading Bpoqualification Mandatory : 12th /graduates (freshers and upto 2yrs are welcomed)working days :5 days working 2 days rotational off and it is rotational shiftperks :will receive upto 4k incentives +client incentives2 Way CABS will be given for free of costwork location :marathahallijob Role Bpo/customer Support Executivesub Roles Incoming, Outgoing, Domestic, International, Voice, Supportexperience required 1 - 5 yearsjob Type Full Timejobs Skilled in MS Excel Requiredlanguages known Fluent Englishage Criteria :18 upto 31yrs (cut off)should also carry all previous documents like relieving letter ,salary slips and offer letter Documents required Proof of Aadhaar Card,driving License,voter ID Card Education 12th Certificate Original Mandatoryany one who matches the above criteria kindly Call Job Shop - 7406026000 ******* ************ ******** *********** ********inside Sales Specialist For Nobroker.com ( Work From Home)job descriptionjob Summary:( Minimum 6 month experience in BPO Sector is mandatory)the employee will be responsible for providing assistance to our customers who are interested in availing rented properties. Hence the employee has to coordinate with buyers and Sellers. The agent needs to maintain utmost professionalism while interacting with both team . Should be able to convince the customers to afford the membership cardsresponsibilities:provide clarity on quotes and negotiate on the same.follow up on open leads till confirmation is received from the customer.coordinate with internal teams and vendors for closing the issue at the earliest.meet call/email quality standards.ensure details are shared with the customer with regards to quotes.required Knowledge, Skills AND Benefits:graduate Mandatorygood English (At least 50% verbal communication skills in Hindi, & Other regional Languages.good at comprehending situations and coming up with acceptable solutions.day shift,6 days working ,package up to 4 lakhs (including variables) Free food(veg&non veg supreme quality) yearly 4 times salary hike (for performers) 2 times designation.call Job Shop - 7406026000 ", "Role": "Associate/Senior Associate -(NonTechnical),", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Graduation Not Required", "Doctorate": "None", "Key Skills": ["Inbound Customer Service", "Communication Skills", "Customer Support", "Technical Support", "ITES", "UK Shift", "Call Center", "International BPO", "International Voice Process", "Outbound Calling"]}