{"Job Title": "E-Commerce Support / Banking / International Voice - Sal Upto 30K", "Company": "Black and White Business Solutions Pvt Ltd  ", "Experience": "0 - 5 years", "Salary": "₹ 2,00,000 - 4,50,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": " Dear Candidate,Greeting from Black and White Business Solutions Pvt Ltd..!!   Huge Openings with TOP BPO MNC's for Sr. Customer Support  / Sr. Process Associate / Technical Support -  Voice Support (International) Spot OFFER in a Day Interview process Walk-in at Black and White Business Solutions Pvt Ltd @ IndiranagarE-commerce - Customer support associate.Contact Details:HR : Rachel 9739199898Email - hr9898@blackwhite.in!!!!!! Candidates From BANGALORE Location Are Preferred !!!!!!!!We are looking for technically skilled candidates with excellent  interpersonal skills for the Technical Support position. Technical Support Officers troubleshoot technical issues, provide             timely customer feedback, and support the roll-out of new applications, among other duties.Moreover, Technical Support Officers need to talk to customers /Clients to resolve technical issues.Technical Support Responsibilities:Identifying hardware and software solutions. Troubleshooting technical issues. Diagnosing and repairing faults. Resolving network  issues. Installing and configuring hardware and Networking related problems. Speaking to customers to quickly get to the root of their problem. Providing timely and accurate customer feedback. Talking customers through a series of actions to resolve a problem. Following up with  clients to ensure the problem is resolved. Replacing or repairing the necessary parts. Supporting the roll-out of new applications. Providing support in  the form of procedural documentation. Managing multiple cases  at one time. Testing and evaluating new technologies. Shifts :UK / US / Australian Shift / Pilot Process / Graveyard Shift / Rotational Shifts NOTE : Candidate should have Very Good Communication (Must)Venue:Address:721, Chinmaya Mission Hospital Rd,Binnamangala, Stage 1,Indiranagar, Bengaluru, Karnataka 560038Landmark : Opp to M.K Retailnext to Andhra BankFor more quires CallH : Rachel 9739199898Email - hr9898@blackwhite.inRequired Candidate profile One day interview process - Fresher / Experienced can apply  Desired Candidate Profile  * Possess good communication skills, both oral and written *Have a good attitude - should be committed to the work.* Any graduates can appear with Technical Experience.* Should be flexible with Any shift. ********PLEASE DO REFER YOUR FRIENDS LOOKING FOR BPO JOB'S*********", "Role": "Associate/Senior Associate -(Technical),", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["E-commerce", "Voice Process", "International BPO", "BPO", "BPO Officer", "CSR", "Non Voice", "US Healthcare", "Customer Service Associate", "Process Associate", "CSE", "Technical Sales", "Customer Support Associate", "Customer Care", "senior process associate", "Associate", "CSO", "International"]}