{"Job Title": "Chief Technology Officer - Software Development Lifecycle", "Company": "Catalyst", "Experience": "7 - 12 years", "Salary": "Not Disclosed", "Location": "Middle East, Dubai", "Job Description": "Roles and ResponsibilitiesWe are looking for an CTO to guide business and technical strategy, lead people, make key architectural decisions and help develop our software, mobile, and data systems. You will assume management of the existing backend, frontend, and data team. You will also have the budget and opportunity to hire more engineers while working closely with cross functional teams including designers and product owners. This is your chance to have a significant and direct impact on the business and our growing customer base.The ideal candidate will have prior leadership experience in eCommerce or with a software application company. All technology, software engineering, and systems architecture will be overseen by you, though you will be expected to dedicate 60-70% of your time to code development and review. This will evolve as the team reporting to you grows.You will also be responsible for improving the software delivery process by minimizing development time, rework, and overheads. Ensuring scalability is also something you will think and act on regularly which involves understanding and contributing to our business growth strategy and ensuring that the technology enables it. This is an exciting time for this role as you- ll be building the team, which is set to grow significantly in the next 12 months. You'll also be spearheading other projects which include heavy automation of our fulfilment division, developing a mobile application, and establishing our data services.Accountabilities, Goals, and Outcomes- Business Impact - Clear business metrics and working towards ambitious goals- Productivity - MVP mindset, continuous improvements of team ways of working- Systems Health - Defining and delivering towards clear metrics and SLAs- Team Health - Team members are engaged and complement each other in achieving common goals autonomously- Stakeholder Happiness - Managing dependencies and expectations, building trust with allstakeholders and delivering on commitmentsWhat You'll Need :- 5+ years of direct people management in technical teams- 8+ years of software development lifecycle experience- Excellent software development skills- You have excellent PHP 7.2/Laravel, Symfony, or Lumen and MYSQL experience (minimum 5 years)- Experience with DevOps (Kubernetes /Kubectl/ Docker/AWS) would also be a plus- Experience with VueJS/NUXT/ ECMAScript would be a plus- Excellent people management skills- Coaching, developing and managing teams within each functional area of technology- Can communicate complex problems in a simple and effective way in order to influence others- Setting and executing the vision- Has developed and led on the technical strategy for a product- Has been the point of contact for providing guidance and recommendations on large project implementations- You have experience in working in an agile and fast-paced environment- Bachelor's degree in computer science, computer engineering, or similar", "Role": "Head/VP/GM-Technology(IT)/CTO,", "Industry Type": "Banking, Financial Services, Broking,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Senior Management", "UG": "B.Tech/B.E. in Computers", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["Product Strategy", "Symfony", "MySQL", "Lumen", "Project Implementation", "PHP", "Laravel", "SDLC", "CTO"]}