{"Job Title": "Senior Software Engineer - Backend Development", "Company": "e-Hireo Global Pvt Ltd", "Experience": "5 - 8 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad, Chennai, Bangalore/Bengaluru", "Job Description": "Roles and ResponsibilitiesResponsibilities : - As a Senior Product Developer you will design and implement multi-tier (DB, services and web) software applications, and document, test, fix and enhance systems when needed. - In your agile team, you will closely work with engineers, architects, managers, design, QA and operations teams, and create solutions that meet business requirements. - You will spend most of your time developing clean code with limited abstraction. - In this role, you will also lead and mentor team members across functions. - You will also implement and support compliance with Client compliance and information security processes. Requirements: - - Advanced understanding of OOPS- Knowledge of SDL (Software development Lifecycle) - Experience of working in Agile environment - Good at Code review and design review - Ability to design for scale and Performance - Solid problem solving skills - Experience with hands-on programming - Expertise in data structures and algorithms - A background in Engineering with sound oral and written communication skills Experience/Desired Skills (but not all required): - - Degree in Computer Science or equivalent practical experience - Experience with large-scale systems - Intermediate knowledge of Ruby on Rails - Prior experience with AWS - Experience with open-source projects - Experience troubleshooting in a SaaS environment with an assertive deployment schedule- Experience in leading engineering team ", "Role": "Team Lead/Technical Lead,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Sc in Computers, BCA in Computers, B.Tech/B.E. in Computers", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["Application Designing", "Applications Implementation", "Open Source", "OOPS", "SaaS", "Algorithm", "AWS", "SDLC", "Data Structure"]}