{"Job Title": "Software Development Manager - Tech Startup", "Company": "HyrEzy Talent Solutions", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": " Job Role : MANAGER, SOFTWARE DEVELOPMENT Location : Gurgaon The Role :The  Technology team at Our client designs and manages our entire suite of  cloud-based applications. They are looking for an experienced  professional who can work with the product and support teams to  understand the business and customer requirements, help design engaging,  secure and scalable cloud-based applications and platforms, and lead a  team of engineers with a strong passion for technology.The  Manager, Software Development will have the responsibility of managing  critical applications in our comprehensive suite of applications,  including taking responsibility for the overall quality of what goes  into production and build the processes and infrastructure needed to  monitor the performance of the product after deployment. Other responsibilities include :- Contributing to design and architectural decisions- Collaborate closely with Product Managers to clarify, understand, prioritize and refine customer requirements and scenarios-  Web application development using languages such as Java, Scala,  Python, and TypeScript and frameworks such as Spring Boot 2, Flask,  Express, React/Vue/React-Redux. Reacting quickly to emerging  technologies- Data storage technologies such as Postgres, MySQL, Redis, Memcached, Kafka, S3, and MongoDB - Web analytics, software monitoring, and error tracking softwareExpertise supporting a variety of SDLCs- Ability to communicate technical concepts to technical and non-technical audiences- Monitor project health with Unit Test case and SeleniumThe role is based out of our Gurgaon office.Ideal Candidate Profile : -  An ideal candidate for the role will have at least 5-6 years of  experience building large scale web applications, social platforms, or  transaction systems; well versed in modern technologies with good  interpersonal skills, analytical mind, get-things-done attitude, and  passion for engineering excellence. - As a product company, we  will need the candidate to be very hands-on with programming, and  candidates whose skills are more towards team management may not fit-in  with our engineering-focused culture.- Bachelor's or Master's degree in Computer Science, Computer Engineering or related technical discipline-  Strong knowledge in Computer Science fundamentals in object-oriented  design, data structures, algorithm design, problem-solving and  functional programming - Knowledge of professional software engineering practices & best practicesfor  the full software development life cycle, including coding standards,  code reviews, source control management, build processes, testing, and  operations- Good written and verbal communication skills with  the ability to present complex technical information in a clear and  concise manner to a variety of audiences.In addition to skills,  They are looking for a team member who brings to the team a huge passion  for technology and a willingness to learn. Also, we work very hard on  tight resources and timelines and will expect the Software Development  Manager to lead the engineering team with example. Skills required:Language: Java, Scala, Python, NodeJs (Any two)Framework: Spring Boot 2, Microservices, Spring Cloud, Spring Security (Any two)Web Framework: Express and React/VuejsTesting: Unit Testing and Selenium ", "Role": "IT/Networking-Manager,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Admin/Maintenance/Security/Datawarehousing", "UG": "B.Sc in Computers, BCA in Computers, B.Tech/B.E. in Computers", "PG": "M.Tech in Computers, MCA in Computers, MS/M.Sc(Science) in Computers", "Doctorate": "Doctorate Not Required", "Key Skills": ["Java", "Express", "MySQL", "Redis", "Spring Boot", "MongoDB", "Spring Security", "Microservices", "Spring Cloud", "Memcached"]}