{"Job Title": "Take Appointment, Collection/Sales Associate Required @ Paisa bazaar", "Company": "THR Consultants", "Experience": "0 - 3 years", "Salary": "₹ 1,00,000 - 3,00,000 P.A. ", "Location": "Gurgaon/Gurugram", "Job Description": "Hello Guys, Take Appointment.... Limited Openings !! To Fix up the interview schedule (Pls fix your interview schedule before walk-in): Call to Sakshi Arora - 8958110011 Interested candidates can coordinate with me for fix their interview (11AM -5PM). ** Single Day Interview Process with multiple process choice** Applicant Eligibility: Graduates/Post-Graduates/MBA (Preferred) with 0.6-3 year of experience in relevant field can apply for a better salary & Future. Company - Paisa Bazaar Position Title: Collection Executive / Associate Sales ConsultantProduct- Credit cards & Loans  Language Required- English Reports to: Team Leader Function: Operations Location: Gurgaon, Haryana, India    Job Description-   Leads will be from interested customers. Day shift (10am to 7:00pm) - Fixed timings. Its a 6 days working company. The candidates will be given 1 weekly off as per the roster which means there will be no fixed off. Fixed salary + High incentives. Office location at 10 minutes walking distance from Huda City Center Metro Station. Other monetary incentives to the employees (confidential)   Knowledge, Skills and Attitude:    Should be comfortable in English.Must have Home loan Sales Experience. Should have very good convincing and selling skills. Should have good English communication skills. Graduate/P.G./MBA will be preferred. Should be very confident and presentable. Energy levels should be high.  Compensation & Benefits: Rs. 15,000 - Rs. 25,000(CTC)  per Month + Incentives; will be decided based on qualification, experience and interview. ESIC, PF & Gratuity, as per applicable law. Group Insurance, Cover.", "Role": "Fresher,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Other", "UG": "Graduation Not Required, Any Graduate in Any Specialization", "PG": "Post Graduation Not Required, Any Postgraduate in Any Specialization", "Doctorate": "Any Doctorate in Any Specialization, Doctorate Not Required", "Key Skills": ["voice", "bpo", "cold calling", "crt", "customer relationship", "loans", "personal loans", "customer service", "customer support", "inside sales", "financial products", "calling", "telesales", "outbound sales", "customer care executive"]}