{"Job Title": "Analyst II, QA", "Company": "ELLIE MAE INDIA PRIVATE LIMITED", "Experience": "4 - 6 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "Roles and ResponsibilitiesEllie Mae is the leading cloud-based platform provider for the mortgage finance industry. Ellie Mae’s technology solutions enable lenders to originate more loans, reduce origination costs, and reduce the time to close, all while ensuring the highest levels of compliance, quality and efficiency. Visit to learn more.The QA Analyst I will reports to a QA Manager. He/She will be responsible for creating Test Plans, Test Cases, performing Functional Testing, Integration testing, System testing, and Regression testing to ensure product quality.Responsibilities Design complex Integration test cases that exercisesEncompass Setting such as Personas, Roles and Loan templates.Encompass Business and DDM rules.Various loan products, programs and transaction types using realistic loan data.Validate the life cycle of a loan, included ordering all required services, and bring loan through to closing & funding.Documents clear and detailed defect reports including steps to reproduce actual and expected results.Present defects in triage calls with project team and drive them to resolution.Works closely with Developers, QA and other project team members to analyze test results, locate problems, identify root causes and develop solutions.Work closely with Automation Engineers to ensure the test cases are automated as documented and in a timely manner.Participate on scrum teams to define or execute integration and End to End Test where neededResponsible for staying up to date on latest environment changes.Work primarily under the direction of Sr QA Manager and/or Staff Analyst.Flexible to work on different project based on company needs.May require overtime or off-peak hours to meet commitments.Basic skills and requirements Computer Science Degree or equivalent from a fully-accredited college or university.? 4+ years’ experience working as a Manual Tester or a Business Analyst? 2+ years’ experience working in the Mortgage Domain preferable on a Loan Origination System.? Prior experience working on Ellie Mae applications is a plus.? Strong knowledge of Mortgage LOS data from initial loan boarding through funding & shipping intothe secondary market.? Understand various test levels such as unit testing, functional testing, integration testing, regressiontesting and end to end testing.? Understand and implement Risk Based Testing as needed.? Demonstrated knowledge of the Software Development Lifecycle (SDLC) and manual testing.? Ability to effectively communicate relevant project information with coworkers, peers, andmanagement through written and verbal communication.? Ability to communicate and effectively collaborate with internal departments and other outside partiesin a professional manner.", "Role": "Testing Engineer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - QA & Testing,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers, B.Sc in Computers, BCA in Computers", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Software Development Life Cycle", "Regression Testing", "QA Analysis", "Integration Testing", "System Testing", "Manual Testing", "Functional Testing", "QA Management", "Test Cases", "SDLC"]}