{"Job Title": "DevOps engineers", "Company": "Aristocrat IT Solutions Pvt Ltd.", "Experience": "4 - 7 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": " As an ERP Developer, you will work on a team, under the direction of the Director of Technology Solutions. You will work to gain an understanding of the client?s business requirements and customize an ERP database to meet their needs. The Developer serves as the technical expert for the team and provides gap programming to extend system functionality to meet client?s specific requirements. . All work given by team leads has to be completed on time and should be willing to work with other teams, meet the death lines and co ?ordinated accordingly.   Requirements  Typical Responsibilities for devOps Engineers Include:    building and setting up new development tools and infrastructure   understanding the needs of stakeholders and conveying this to developers  working on ways to automate and improve development and release processes   testing and examining code written by others and analysing results   ensuring that systems are safe and secure against cybersecurity threats   identifying technical problems and developing software updates and ?fixes?  working with software developers and software engineers to ensure that development follows established processes and works as intended  planning out projects and being involved in project management decisions.   Graduates may start out in a ?graduate devOps engineer? or ?associate devOps engineer? role, before progressing to ?senior devOps engineer? and ?principal devOps engineer? roles with experience.    Employers of devOps Engineers Include:    Specialist software development companies   Websites and any organisation that manages websites   Technology consultancies   Telecommunications companies and broadcasters   Retailers   Public sector organisations.   DevOps engineer jobs are advertised online, by careers services and by recruitment agencies.    Qualifications and Training Required    DevOps engineer roles typically ask for a degree in a technical or a STEM (science, technology, engineering and mathematics) field, with some requiring applicants to have a masters degree.    Strong degree results (at least a 2.1) are also usually desired by recruiters.   As you progress, employers may require you to attain a professional qualification. The BCS (British Computer Society) offers certifications in devOps and in Agile (a set of practices related to devOps).    Similarly, you may choose to gain certification in a particular technology that the employer uses, such as AWS or Azure cloud services.    Key Skills for devOps Engineers  Useful Skills for devOps Engineers Include:    Excellent teamworking and communication skills   Knowledge of programming languages   Strong problem-solving skills   Good attention to detail   Excellent organisational and time management skills, and the ability to   Work on multiple projects at the same time   Awareness of devOps and Agile principles.  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - ERP, CRM,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["ERP", "Software design", "Technical Expert", "devops", "Programming", "Director", "Database", "Technology solutions"]}