{"Job Title": "Director of Engineering", "Company": "ibaset india software private limited", "Experience": "20 - 25 years", "Salary": "Not Disclosed", "Location": "Ahmedabad", "Job Description": "Work Location: Ahmedabad, GujaratJob Description:Director of Engineering manages and oversees multiple software development (including quality assurance) teams, technical architects and development projects while ensuring that all engineers follow the best practices around software development. This position requires a highly motivated individual to work closely with the product owners, business analysts, QA, and technical teams in developing our highly configurable application. It is also required to participate in architecting and designing complex enterprise applications, developing core application framework components, writing specifications for other development teams, reviewing team's work. The candidate is expected to lead the teams for delivering high-performance, multi-tier, multi-threaded clustered software solutions, writing clean code, well-tested and advocate for best practices and exceptional quality.In addition, the Director of Engineering, under the direction of CTO, is responsible to make sure that engineering staff is well informed with technology and product roadmap.Responsibilities/Duties:Manage and lead software development managers, technical leads, software architects and/or a team of technical staff within the organization.Perform roadmap planning for long-term product evolution; supporting architecture and design, experimental prototyping with hands-on development, and technology transfer to product development teams; mentoring and oversight of product development transition and on-going development; hands-on involvement in application monitoring, diagnostics, and forensics, for both product team and customer deployments.Define prototypes, design, and implement system and application architecture.Provide vision, problem anticipation, and problem-solving ability to organization.Ensure that the technical architecture satisfies technical, market and business goals of the product.Transform business requirements to align with IT architecture and infrastructure competencies.Interact with prospects, customers, business partners, as well as senior management and other stakeholders in all stages of software development life cycle.Research, investigate, and perform analysis of technology approaches to short-term tactical as well as long term strategic product requirements. Future product directions include SaaS, multi-tenancy, alternate user and API interfaces, new deployment models, and broadened functional footprint.Train and mentor other staff in design patterns and general best practices, architecture, design and implementation of specific product capabilities, and software development life cycle.Provide mentoring and direction to analysts and software developers. Expected to stay abreast of current technology, new technological advances, and company standards.Perform a variety of tasks and display a wide degree of creativity and latitude.Pre-Requisites:15+ years of experience in leading and managing large software development teams.Extensive experiences in goal driven resource management, technical recruitment, project management.Good mix of business and technology experience with global mindset.Substantial experience in developing multi-tier systems.Strong professional level experiences in different SDLC and methodologies.Excellent written and verbal communication skills. Is a team player.Experience with complex, discrete manufacturing and Manufacturing Execution Systems (MES) or/and ERP/PLM is highly desirable.Architectural level Mindset  extensive experience in translating high level requirements into high-level and detailed implementation design alternatives with pros and cons.Deep knowledge of modern Java programming best practices for object-orientation, dependency injection, thread concurrency, performance tuning, and API design, as well as test-driven development for unit and integration testing.Development experience with Java frameworks such as Spring, Hibernate, and Maven.Development and expertise in respective assigned area (e.g., RDBMS, J2EE Dev, JavaScript Frontend Dev, DevOps, Containers, etc.)Experience with cloud native infrastructure such as container, container management systems and microservices architecture.Ability to prototype and evaluate solutions, write technical specifications, and lead and review other development teams.Experience with Integration patterns, technology, and infrastructure such as XML, JMS/MQ, web services, REST API's is a plus.Bachelor's or higher-level degree in Computer Science is strongly preferred but your commercial and open-source programming experience may be considered.Physical Requirements / Work Environment:Usual office working conditions.Must be able to travel up to 20% of time.", "Role": "Head/VP/GM-Technology(IT)/CTO,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Senior Management", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["SAAS", "Service Delivery Management", "cloud native infrastructure", "MES", "People Management", "java frameworks"]}