{"Job Title": "Program Manager - Software Development Projects  - Ecommerce/retail", "Company": "Talpro", "Experience": "5 - 8 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": "PROGRAM MANAGER (BUSINESS SEGMENT: PRODUCT MANAGEMENT)As a Program Manager, you will manage multiple projects end-to-end, ensuring that we build high quality features and deliver on time to delight our customers. This role is inherently cross-functional - you will work closely with product teams, engineering teams, operations & business users, external vendors and partners. As a Program Manager, you will anticipate bottlenecks, make trade-offs, and balance customer and business needs versus technical constraints. An ability to take large, complex projects and break them down into manageable pieces, and then deliver them in a successful and timely manner is expected. Understanding of business goals, ability to identify and track dependencies, maturity, high judgement, negotiation skills, ability to influence, analytical talent, and leadership are essential to success in this role. Required Candidate profileQUALIFICATIONS - Total 5 - 8 years of experience with 3+ years- experience in program management - Experience in managing software development projects - Experience coordinating cross-functional teams including external partners and vendors. - Experience building agile processes, project management, and managing release schedules - Experience managing multiple, fast-paced, inter-dependent projects - Strong interpersonal, communication, and writing skills - Bachelor's/Master's degree in engineering, computer science or a related technical discipline", "Role": "Program Manager,", "Industry Type": "Internet, Ecommerce,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Senior Management", "UG": "B.Tech/B.E. in Any Specialization", "PG": "M.Tech in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["IT Program Management", "IT Jobs in Retail", "IT Project Management", "IT Product Development"]}