{"Job Title": "Director , Global IP Development", "Company": "Avtex", "Experience": "10 - 15 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "  The Director Global IP Development is responsible for building Avtex s Global IP Development team to support Global product development initiatives. In this role, you will collaborate with North America IP team and contribute your knowledge of SDLC to support the continued success of Avtex s IP area. In depth knowledge of software development practices, build & deployment (Agile/CI/CD), support, automation, proactive monitoring, and systems security is required to be successful in this position.      You will be responsible for leading a high performing team of Development, Support, Product Management, QA and DevOps engineers that excel at a variety of tooling that supports cloud-native and legacy premise applications. Ensure appropriate operational planning is effectively executed within budget and cost constraints.      You should be passionate about all software development activities including cloud computing, infrastructure-as-code and security. You will be working on software engineering tasks such as design, development, and support of new and existing products to increase reliability, scalability and reduce operational overhead through automation. You will work with application delivery teams on the shared full stack ownership of a collection of services and/or technology areas.     Responsibilities    Understand Avtex 360 value proposition and contribute to solution story which incorporates Avtex innovation along with key platform solutions we offer.      Collaborate with North American leadership to ensure development practices, processes, and quality standards are met      Manage, direct and lead all India based development resources.      Build out the IP development organization incorporating resources to support all aspects of SLDC including Product Management, Architecture, Development, Testing, Automation, Dev Ops, and Support.      Develop standards for internal global communication on updating on status, plans, and plans for improvement.      Ensure application design to manage and maintain data security and integrity.      Mentor managers to implement best practices to motivate and organize their teams.      Guide design and architecture developments to ensure solutions are meeting market needs.      Participate in interviewing as well making final hiring decisions.      Guide and provide input to all strategic and technical planning for entire software projects.     Requirements    Must possess the ability to demonstrate the ROI of improvements recommended throughout the product lifecycle.      Fluent in Agile development methodologies with a focus on SCRUM.      Proficient with Microsoft Azure, PowerPlatform, Microsoft .NET development platform, Dev Ops, and Cloud programming practices      Must possess the ability to manage India development team      Ability to provide feedback, coaching and mentorship to a team with the goal of fostering a positive, results-oriented team.      Bachelors or Masters in Computer Science or Business-related field or equivalent work experience      10+ years experience required in developing enterprise software solutions      7+ years experience required in product management      5+ years experience required in managing a application development team of at least 20 people      Experience with contact center solutions strongly preferred      Experience with Microsoft CRM, Salesforce CRM, and/or the Genesys platform would be beneficial but not required      Agile/SCRUM certifications, training, and project management certifications a major plus  ", "Role": "Product Manager,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Product management", "Computer science", "Cloud computing", "data security", "Project management", "Application development", "microsoft", "Operations", "SDLC", "Monitoring"]}