{"Job Title": "Fullstack Developer", "Company": "Eloquent Studio", "Experience": "1 - 6 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "  As a Full Stack Engineer, you ll be responsible for end-to-end development fo products and services. You will develop fully functional web applications that align with business objectives.   You will grow your skills, work with cutting edge technologies and introduce new tools and techniques to the team.    You ll work in an environment that encourages creative thinking and limits red tape.    You ll collaborate with fellow engineers, product management, clients and end users.    You ll come up with ways to do things more quickly and more effectively while maintaining a laser focus on quality.    In a nutshell, you ll create software that makes our business grow, and help explore new possibilities both in-terms of technology and operations.     Roles Responsibilities:       Requirement Gathering from BusinessStakeholders   Ask relevant questions to clarify the business requirements.   Estimations Task Planning   Must be well-versed with the project management tool.   Coding, Debugging, Unit Testing Documentation of Code and Application   Optimise the website after checking through benchmarking tools like www.gtmetrix.com or Google Page Speed   Project Deployment Maintenance      Mandatory Skills Knowledge:          Minimum 1 years of development experience with any full stack framework.   Good understanding of js   Good understanding and experience of HTML CSS Javascript.   Solid development version control practices (GitHub, Source Tree).   Experience in developing and consuming REST web services.   Thorough understanding of the Software Development Lifecycle (e.g. Requirements, Design, Development, and Testing).   A communication pro - must be able to pleasantly explain technical issues to a non-technical person.   Exhibit strong analytical and problem-solving skills.   Knowledge of AWS services like S3, EC2 would be of great value.   Understanding of Agile and CICD would be beneficial.  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Product management", "Backend", "Version control", "Coding", "Project management", "Analytical", "Debugging", "Agile", "HTML", "Unit testing"]}