{"Job Title": "Full Stack Developer", "Company": "Cogneesol", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Mohali", "Job Description": "  Job description      Technical and Soft Skill sets required:     - As a full stack developer, you should be comfortable around both front-end and back-end coding languages, development frameworks and third-party libraries. You should also be a team player with a knack for visual design and utility.    - Familiarity with common stacks    - Develop and maintain cutting edge web-based PHP/JS applications using Laravel/JS frameworks.    - Knowledge of multiple front-end languages and libraries (e.g. HTML/ CSS, JavaScript, XML, jQuery)    - Knowledge of multiple back-end languages (Preferred) and JavaScript frameworks (e.g. AngularJS, ReactJS, VueJS, Node.js etc.)    - Familiarity with databases (e.g. MySQL, MongoDB), web servers (e.g. Apache) and UI/UX design    - Ideally, familiarity with CSS pre-processors, bundlers, and associated languages/syntaxes/libraries ( e.g., Sass, Less, and webpack )    - Good understanding of asynchronous request handling, partial page updates, and AJAX    - Lead the entire web application development life cycle right from concept stage to delivery and post launch support    - Document the development process, architecture, and standard components    - Coordinate with co-developers and keeps project manager well informed of the status of development effort and serves as liaison between development staff and project manager    - Keep abreast of new trends and best practices in web development    - Previous working experience as a PHP / Laravel developer for 3+ years    - BS/MS degree in Computer Science, Engineering, MIS or similar relevant field    - In depth knowledge of object-oriented PHP and Laravel 5+ PHP Framework    - Hands on experience with SQL schema design, SOLID principles, REST API design    - Software testing (PHPUnit, PHPSpec, Behat etc.)    - Strong understanding of JavaScript, its quirks, and workarounds    - Strong understanding of web markup, including HTML5 and CSS3    - MySQL profiling and query optimization    - Creative and efficient problem solver    - Strong knowledge of git and code sharing platforms     Qualification requirements:     - Any Graduate/ Postgraduate - in Computer Science  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["jQuery", "Coding", "XML", "MySQL", "Web development", "PHP", "HTML", "Apache", "SQL", "Ajax"]}