{"Job Title": "Senior Software Development Engineer", "Company": "SONICWALL TECHNOLOGY SYSTEMS INDIA PRIVATE LIMITED ", "Experience": "7 - 9 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Responsibilities:Design and implement high performance and scalability models for Hosted systemsDesign and implement secure automation solutions for development, testing, and production environmentsDesign, develop, improve and maintain new & existing Email Security componentsAnalyze Hosted systems issues, recommend and implement solutionsWork on kernel patches and security vulnerabilities Secure, scale, and manage variety of virtual & cloud computing platforms like VMWare, AWS, G Suite and Hyper-VWork in a cross-functional team environmentWork on Rapid prototyping of Hosted and On-premise solutionsRequirements: BS, BE, B.Tech. in CS/CE/ EE or equivalent, MSCS, MCA 7+ years of experience developing commercial enterprise-level products using C/ C++/C#/ Java or similar object orient programming languagesStrong programming and debugging skills on Linux; Windows a plusExperience in high scalability projects involving cloud-based infrastructure design and implementation is highly desirableExperience with Microsoft O365 technologies and APIs a plusStrong understanding of micro-services, containers and related architecturesExperience with email protocols and standards including SMTP, POP3 and IMAP is desirableMultithreaded programming and debugging Ability to quickly isolate and troubleshoot issuesExperience with Git, JIRA, ConfluenceComfortable multi-tasking in a fast-paced, agile team environment Proficiency in scripting languages including Bash, Python, and JavaScript a plusExperience with CI/CD pipelines and virtualization tools like RKT, Docker, AMI, Hyper-V a plusExcellent written and oral communications skills.", "Role": "Software Developer,", "Industry Type": "IT-Hardware & Networking,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Sc in Computers, B.Tech/B.E. in Electrical, Computers", "PG": "MS/M.Sc(Science) in Computers, MCA in Computers", "Doctorate": "None", "Key Skills": ["C#", "Java", "Software Development", "C++", "C", "Git", "Javascript", "Programming", "Bash", "JIRA"]}