{"Job Title": "Senior Software Engineer (UI ReactJS Development)", "Company": "PEOPLESTRONG TECHNOLOGIES PRIVATE LIMITED  ", "Experience": "5 - 10 years", "Salary": "₹ 5,00,000 - 15,00,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": "Roles and Responsibilities  You will be responsible for Meeting with the development team to discuss user interface ideas and applications.Reviewing application requirements and interface designs, Identifying web-based user interactions.Defining and implementing highly responsive user interface components using React concepts.Writing application interface codes using JavaScript following React.js workflows, Solving problems interface software and debugging application codes.Crafting and implementing front-end architecture to support user interface concepts.Leading and improving front-end performance, Detailing application changes and developing updates.Desired Candidate Profile  You must have BE / B.Tech / MCA / ME / M.Tech with minimum 5+ years of UI Developer experienceIn-depth knowledge of JavaScript, CSS, HTML and front-end languages.Knowledge of REACT tools including React.js, Webpack, Enzyme, Redux, and Flux.Experience with user interface design and browser-based debugging and performance testing software.Excellent troubleshooting skills and data structure libraries (e.g., Immutable.js)Familiarity with RESTful APIs and knowledge of modern authorization mechanisms, such as JSON Web Token, Familiarity with DevOps, versioning tools, build pipelines, and UI testing automation", "Role": "Technical Architect,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "MCA in Any Specialization, M.Tech in Any Specialization", "Doctorate": "None", "Key Skills": ["Front End", "Software Engineering", "Debugging", "Problem Solving", "Javascript", "React.Js"]}