{"Job Title": "Business Development Executive", "Company": "Uni Browsewire Consulting", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Mohali", "Job Description": "E- 51- First Floor, \n\nPhase VIII,  Industrial Area, \n\nSAS Nagar,  Mohali, \n\nPunjab- 160059 \n\nThis box is for spam protection -  please leave it blank: Looking for Business Developers We are looking for the enthusiastic employees who knows how to draw the business by understanding the customer s diverse & specific needs of their business by applying product knowledge to meet them to client s satisfaction. You should be able to gel the client s need with the company s resource & do the planning for sales and development activities by collecting all the required information to analyze and evaluate existing or proposed systems. Somebody on this profile must be intelligent enough to know how to develop the effective sales plan utilizing sales methodology along- with identifying & developing new business through networking,  courtesy & calls,  as & when required,  to generate new business leads. \n\nWe feel networking is the best way to get the business , as one word of appreciation on work from mouth is more satisfying & fruitful then 100 ways to advertising your service,  with the existing customers in order to maintain links & promote additional products and upgrades. You would be responsible for a well communicated,  effective & responsible channel between Clients,  Analysts,  Management & the technical development team & able to achieve the pre- set Organizational Sales targets set by the team mutually or independently along- with the contribution to the team as well. \n\nAll we need is somebody who feels the responsibility towards the work not because not because it is a part of their duty/ profession but coz he/ she enjoys doing it & your work makes you happier.\n\nSummary 0.6- 1.5yrs Any Graduate -  Any Specialization PG -  Any PG Course -  Any Specialization,  Post Graduation Not Required IT- Software/  Software Services Role : \n\nGood Communication (verbal & written)-  Must Have \n\nTakes responsibility of the team & achieve the preset goals \n\nFeels responsibility for the growth of company,  shares the goals of the organization & works to achieve them \n\nPast Work- Ex as Web developer with MVC,  E- Commerce preferred \n\nHands on experience with Online Bidding portals like ODesk,  Elance,  Guru,  Freelance \n\nLooking forward to a long term relationship with organization \n\nMust have at least 6 Month experience int the profile \n\nCan join asap Contact Details Address : E- 51- First Floor, \n\nPhase VIII,  Industrial Area, \n\nSAS Nagar,  Mohali, \n\nPunjab- 160059 \n\nfor Business Developers Please enter any two digits with no spaces (Example: 12) \"They were pleasure to work with. Their quality of work was excellent and clearly a Magneto expert. In addition I found them a very pleasant and accommodating to work with. They will be my first choice for ecommerce projects in the future.\" - - - - Oliver Hayns \n\n\"I am amazed every single time at how they can take my explanation of my need and convert it to the end product. These guys have been spot on and get it done very quickly. I have been use to waiting two weeks for anything to get done and some more difficult things took even longer than that with my local web guy,  but these guys turn around what I ... \n\n\" In a project where requirements were altered a number of times,  team did these well and met all the challenges. Communication was pretty good and we only had relatively minor misunderstandings. I would use them again for further projects. \" - - - - David Harrison \n\n\"I have used many developers on Odesk before,  some have been good and others have been poor. Browsewire team was excellent! I will definitely be using them again in the future. Thanks again for your hard work. \" - - Julia Reed \n\n\" Satyam is responsible and hard- working developer. She is good in understanding,  communication. She could do what I asked her. I recommend her for any further employers.\" Zaur \n\nCertain websites require more of usual designing approach. So when it comes to design an e- Commerce website it requires more innovative and artistic flare. When Cigars- Now came to us,  we were confident to design an entirely new online website based on PHP and OsCommerce. Our focus was on creating full ranging shopping cart for all products and a... \n\nMassively Undervalued: - Status reports - Contact notes - Emails asking for decisions. - Walking around the office Massively Overvalued. - Slack - IM Chat - Conference calls - Texting colleagues - Video calls", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["OSCommerce", "Sales", "Networking", "SAS", "Machine learning", "PHP", "Business Development Executive", "MVC", "Software services", "New business development"]}