{"Job Title": "iOS Developer", "Company": "Magneto IT Solutions", "Experience": "1 - 6 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "Job Opening for Jr PHP Developer (6 Months - 1 year) in Pune. For For Jr PHP Developer \n\n Job Title: Jr PHP Developer \n\n Location: Pune \n\n Vacancy: 1 \n\n Experience:6 Months - 1 year \n\n Qualification: Graduate from any discipline \n\n CTC: as per industry norms \n\n Working Days:5 days in a week (Every Sat- Sun off) Technical Skills \n\nPHP 5.2/ 5.3 / 5.4 \n\nSQL /  My SQL 5. X (cluster configuration and My SQL optimization) \n\nJavaScript /  j Query (UI) \n\nCore PHP \n\nHTML and CSS \n\nLaravel Job Responsibility: \n\nStrong Analytical Skill \n\n Team Handling Skill \n\n Ability to work in a team environment with the willingness to share skills & systems knowledge,  best practices,  standards etc.,  with other team members. \n\n Ability to work under minimum supervision and with self organizing teams. Excellent troubleshooting and debugging skills. \n\nSolid organization,  verbal /  written communication & presentation skills. \n\nExperience working on Agile/ Scrum team environment \n\nStrong analytical skills (macro and micro) and process orientation \n\nStrong sense of personal accountability for results \n\nExcellent Compensation \n\nProfessional Development \n\nFlexible time \n\nRetention Bonus \n\nJob Satisfaction Candidate Form This is the Form for Candidate Who Have Apply Online \n\nSkills Functional Area Relevant Exp In Month Current Salary Expected Salary Notice Period \n\n Linked In Profile Link \n\nAccepted file types: docx,  pdf,  doc,  txt. \n\n Reason For Leaving Previous Job \n\nThe crowd rates us 5.0 out of 5.0\n\nUnited States of America United Kingdom United Arab Emirates American Samoa Antigua and Barbuda Bosnia and Herzegovina British Indian Ocean Territory British Virgin Islands Burkina Faso Cape Verde Caribbean Netherlands Cayman Islands Central African Republic Christmas Island Cook Islands Costa Rica C te d Ivoire Cura ao Czech Republic Dominican Republic El Salvador Equatorial Guinea Falkland Islands Faroe Islands French Guiana French Polynesia Guinea- Bissau Hong Kong Isle of Man Marshall Islands New Caledonia New Zealand Norfolk Island North Korea Northern Mariana Islands Papua New Guinea Puerto Rico R union Saint Barth lemy Saint Helena Saint Kitts and Nevis Saint Lucia Saint Martin) Saint Pierre and Miquelon Saint Vincent and the Grenadines San Marino S o Tom and Pr ncipe Saudi Arabia Sierra Leone Sint Maarten Solomon Islands South Africa South Korea South Sudan Sri Lanka Svalbard and Jan Mayen Timor- Leste Trinidad and Tobago Turks and Caicos Islands U.S. Virgin Islands Vatican City Wallis and Futuna Western Sahara land Islands Get latest update on IoT,  eCommerce \n\nand Mobile application!\n\nThanks for signing up.\n\nWe respect your privacy. Your information is safe and will never be shared.\n\nWe're Online!\n\nHow may I help you todayMagneto it Solutions Pvt Ltd -  Live Chat", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["SAN", "French", "PDF", "Coding", "SAT", "Debugging", "Javascript", "PHP", "HTML", "Troubleshooting"]}