{"Job Title": "Software Development Engineer ( Senior, Lead)", "Company": "Sapical Consulting Services Private Limited", "Experience": "5 - 10 years", "Salary": "₹ 16,00,000 - 30,00,000 P.A. ", "Location": "Hyderabad/Secunderabad, Pune, Bangalore/Bengaluru", "Job Description": "Hiring Permanent position for one of our reputed client (USA based MNC, 1000+ employees, Product & Services both) having development centers in Bangalore, Pune, Hyderabad. Dear Candidate, We are hiring for Senior, Lead Software Engineers at various location across India ( Bangalore, Pune, Hyderabad, Gurgaon, Chennai) and we are also offering long-term WFH options on most of the vacancies: Hiring for following skill sets: 1. UI / Front-end professional - React is must 2. Backend Professional - Java or node.js or Angular is must 3. Full Stack DevelopmentRoles and Responsibilities  Ability to work individually or mentor a small group in an Agile developmentenvironment.Communicate effectively with global customers and collaborate well within a teamenvironment to drive results.Embrace new technologies and work with various tools and technologies toachieve desired functionality.Work on problems of diverse scope, develop solutions to technology challengesand deliver the requirements before the deadlines.Follow standard practices and procedures in analyzing situations or data fromwhich answers can readily be obtained.Contributing to your BU/Practice by Documenting your learnings from the current work and engaging in the external tech community by writing blogs, contributing in Github, Stackoverflow, meet-ups/conferences etc.Keep updated on the latest technologies with technology trainings andcertifications .Actively participate in organization level activities and events related tolearning, formal training, interviewing, special projects etc.Desired Candidate Profile       B.S. or above degree in Computer Science or related technical field5 - 14 years hands-on experience developing Real-time/ Enterprise scaleapplications as UI / Backend / Full Stack Developer Strong software development skills in detailed application design, databasedesign, object oriented concepts, and Abstraction/Dependency Injection patternsFocus on customer experience and build product features that delight usersPassionate about exploring new technologiesKnowledge of application server configurations, memory/connection managementStrong problem solving skills and the ability to make sound technical decisionsExcellent communication skills with all levels. Proven ability to lead andcommunicate orally, in written documents, and in formal presentations is requiredPerks and Benefits As per market Standard 30-35% hike on CTC up to 30 LPA ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "M.Tech in Any Specialization, MS/M.Sc(Science) in Any Specialization, MCA in Any Specialization", "Doctorate": "None", "Key Skills": ["Angularjs", "Java", "HTML", "Spring Boot", "Node.Js", "JQuery", "Spring", "Core Java", "Mean Stack", "Javascript", "MongoDB", "React.Js", "AWS"]}