{"Job Title": "Senior Manager - Strategy & Business Development", "Company": "Innovantes IT Solutions LLP", "Experience": "4 - 9 years", "Salary": "Not Disclosed", "Location": "Chandigarh", "Job Description": "   Responsibilities:        Identifying new business opportunities, lead generation & pre-sales for international clients through multiple channels including emails, inside sales, LinkedIn and other digital channels.        Able to conduct Primary / Secondary research through LinkedIn and other professional platforms to generate newer leads, potentials clients.        Target Database building/ updating/calls, follow-ups, client presentations, proposal creation, RFP/ RFI, sales collaterals, closures etc.        Maintaining Timeline, tracker sheet for leads generated, closures etc.        Brainstorm new and creative growth strategies.        Build and deliver a strong business pipeline by contributing heavily to the top of the sales funnel.        To meet the quarterly revenue targets.          Education:        An engineering background (B.E/B.Tech) with specialisation in Computer Science or Information Technology with a strong technology acumen.        MBA in Sales and Marketing preferred but not an essential requirement.        Pre-requisites:        Minimum 4 years of experience in International Business Development or Strategy in reputed   IT services organisations only, preferably with experience in selling custom mobile and web solutions.         Up-to-date with the latest trends and best practices in the digital space.      Sound knowledge of upcoming technologies, platforms, Cloud, AI and Analytics.        Fresh and passionate with very strong communication skills, both verbal and written, including the ability to represent Innovantes at various platforms.        Strong presentation skills.    Capable of handling C level conversations.        Strong business acumen.    Self-starter with entrepreneurial qualities and ability to work effectively with team, partners and clients at multiple locations with minimal supervision.        Burning desire to achieve results and exceed expectations.    Strong business ethics- Non-negotiable.    ", "Role": "Sales/Business Development Manager,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "Sales, Retail, Business Development,", "Employment Type": "Full Time, Permanent", "Role Category": "Corporate Sales", "UG": "Any Graduate in Any Specialization", "PG": "MBA/PGDM in Marketing", "Doctorate": "None", "Key Skills": ["IT services", "Computer science", "Sales", "Database building", "RFP", "Information technology", "international clients", "International business development", "Analytics", "Secondary research"]}