{"Job Title": "Android Application Developer", "Company": "Scogo Networks Pvt. Ltd.", "Experience": "2 - 7 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "location (Relocation support will be provided)who is interested to work in a fast - moving startup culture with cutting edge technology stack. You will be architecting and developing the core application for a very unique use case. Who are we: Scogo Networks is an internet startup and is on a mission to disrupt $25 Billion service industry in India with its globally unique and unmatched business model. We are on a bandwagon to transform the entire service industry through our unprecedented business logic together with automation.\n\nWhat we are looking for : Minimum 2 years of relevant experience in Android App Development Have published at least one original Android app Experience working with Android SDK and different versions of Android and screen sizes Familiarity with RESTful APIs to connect Android applications to back - end services Comfortable working with Google Location Apis, Cloud Message API, Push notifications (FCM) Knowledge of the open - source Android ecosystem and the libraries available for common tasks Good understanding of the full mobile development life cycle Strong knowledge of Android UI design principles, patterns, and best practices Roles and Responsibilities : Translate designs and wireframes into working Android App Plan and development of Android applications from scratch. Unit - testing code for robustness, including edge cases, usability, and general reliability Understanding, Enhancing and bug fixing of existing applications. Continuously discover, evaluate, and implement new technologies to Ability to understand business requirements and translate them into technical requirements Benefits : Relocation support will be provided if you are willing to relocate to Pune Competitive salary and health benefits Be an integral part of the core team with early starter preference Be at the cutting edge of the technology Startup culture: Learn Fast, Break Fast, Grow Fast The company provided technical and soft skills training every quarter This position is open for full - time employees only for", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["Automation", "Mobile development", "User interface designing", "Soft skills training", "Service industry", "Manager Technology", "Unit testing", "Android SDK", "Open source", "Android"]}