{"Job Title": "React Native Developer", "Company": "Scogo Networks Pvt. Ltd.", "Experience": "1 - 4 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "Scogo Networks Pvt. Ltd. is a search for a React Native Developer in Pune location (Relocation support will be provided) having expertise in React.JS and interested to work in a fast - moving startup culture with cutting edge technology stack. You will be architecting and developing the core application for a very unique use case.\n\nScogo Networks is an internet startup and is on a mission to disrupt $25 Billion service industry in India with its globally unique and unmatched business model. We are on a bandwagon to transform the entire service industry through our unprecedented business logic together with automation.\n\nWhat we are looking for : 1 - 4 year of relevant experience in React Native Application Development Have published at least one original React Native App Comfortable with Redux / JS / CSS Familiarity with RESTful APIs to connect App to back - end services Comfortable working with Google Location Apis, Cloud Message API, Push notifications (FCM) Knowledge of the React ecosystem and the libraries / components available for common tasks. Good understanding of the full mobile development life cycle. Strong focus on app performance Strong knowledge of Mobile UI design principles, patterns, and best practices. Roles and Responsibilities : Translate designs and wireframes into working Mobile App (React Native) Plan and development of Mobile App from scratch. Understanding, Enhancing and bug fixing of existing applications. Continuously discover, evaluate, and implement new technologies to Ability to understand business requirements and translate them into technical requirements. Relocation support will be provided if you are willing to relocate to Pune. Competitive salary and health benefits. Be an integral part of the core team with early starter preference. Be at the cutting edge of the technology. Startup culture: Learn Fast, Break Fast, Grow Fast. The company provided technical and soft skills training every quarter. This position is open for full - time employees only for for us but havent found a suitable roleAbout Scogo Networks In 21st century business scalability demands state - of - the art technology infrastructure, delivery and support to the remotest part of the country. Their velocity of growth is being fuelled by financial inclusion, ubiquitous, smart and digital ecosystems. In such a fast pace world, monolithic and stagnant service providers could not support your growing technology needs necessary for your business.\n\nWe at Scogo Networks have identified use cases for IT service delivery and help you grow your business without borders. Scogo Enterprise Platform is our offering that provides automated service delivery, anytime, anywhere, through ever growing Scogo Partner Network.\n\nYour business deserves a change, let that change be Scogo.", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - eCommerce, Internet Technologies,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["Automation", "Usage", "Mobile development", "User interface designing", "Financial inclusion", "Soft skills training", "Service industry", "Manager Technology", "Application development", "IT service delivery"]}