{"Job Title": "Front End Developer", "Company": "Neptune Ubicom Pvt. Ltd.", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "  As a Front End Developer, you will design, create, and analyse solutions to various project tasks daily. Your day involves brainstorming and knowledge sharing amongst your teammates. You will learn and develop your skills by creating unique solutions daily.       What do you get to do       End to End Software Design which will involve creating components and features that are directly accessed by a user through the front-end of a website along with documentation, and testing. Your focus will be mostly on the visual layout, user interface/interaction, and the user experience.    You will be a part of a functional development team   You will be assigned a project based on your choice and skill set   You will get the opportunity to work on a complete product development cycle   You will be involved in the daily scrum and functional discussion meetings with your German counterparts      Technologies you know and get to use with us    :      Expert proficiency and hands on experience of minimum 2 years in Angular   Expert proficiency in JavaScript and TypeScript   Good understanding of UX and should come up with better standard or custom components   Good experience with UI layouts, SASS, LESS, Bootstrap, and the CSS GRID system   Profound knowledge of HTML5 and CSS3   Experience in using a complex REST API from the client-side   Passionate in creating mock-ups using any tools such as Balsamiq, Figma, etc.   Good understanding of GIT, Mercurial, or SVN   Good understanding of asynchronous request handling, partial page updates, and Ajax   Experience of debugging using JavaScript-based tools like Chrome Developer Console           What makes you a good fit          You have a minimum of 2 years of hands-on experience in Angular.       You are someone who wants to explore new horizons for their career and have a prior experience as a Front End Developer.     You possess a Bachelor?s Degree in Engineering with specialisation in CS/IT or equivalent.     You have excellent knowledge and experience with the technologies listed above.     You have great programming skills     You have demonstrated a passion for coding through various projects, challenges, or extra-curricular activities. Having a programmer portfolio is a major plus.     You have the potential to develop a keen understanding of our culture. And to imbibe it, and be the ambassador of our culture.     You enjoy the challenge of taking part in complex technical projects and delivering iterative solutions that provide value at each step of the way.     You enjoy working closely with partners across the business and within your team to solve problems and share knowledge.     You are a great communicator who is focused on discovering and delivering solutions facilitating meaningful discussions and building consensus.   ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization, B.Tech/B.E. in Production/Industrial", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Software design", "Front end", "GIT", "Coding", "Javascript", "German", "Scrum", "Ajax", "CSS3", "Recruitment"]}