{"Job Title": "Business Development", "Company": "Droom Technology Pvt. Ltd.", "Experience": "2 - 7 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": "Want to be a part of the most disruptive,  innovative mobile commerce start- up in India with world- class team,  long- term vision,  and top global investors backing it up? Want to make an impact? Want to get 360- degree exposure,  accelerated learning in a hot start- up,  and use your skills and passion in a highly challenging environment?\n\nOverview Management Associate Program (MAP) is a leadership program at Droom Technology for business graduates. Through MAP,  Droom allows fresh business graduates (or MBA student with up to two years of experience) to work on various important and challenging roles at Droom with core leadership team,  and eventually take up leadership roles at Droom. This is a full- time job and offers a bright career track to be one of future leaders at Droom. We will be providing unlimited growth opportunity,  a fun start- up culture and enhanced training development experience.\n\nProgram Highlights Indias most trusted motorplace to buy and sell used and new automobiles. Four months of rotation program,  followed by an impactful role Get 360- degree exposure of the functioning of Droom Work closely with core leadership team Get opportunity to be a future leader Stock options from the Singapore holding company A true Silicon Valley style start- up Disruptive rebellious culture Push your limits accelerated learning Highly innovative disruptive product company Change how automobiles are bought and sold in India How does it work? Droom picks 20- 30 business graduates from the leading MBA programs across the globe to join Droom on full- time basis. These business graduates join Droom and start a four-  month long rotation program taking two assignments of two months each. Upon the completion of four months of MAP program,  these graduates can choose to work at Droom in one of the two areas of their rotation.\n\nFollowing functional areas are available in MAP program at Droom: \n\nMarketing Business Development Product Management Strategy Competitive Analysis Business Manager in CEO Office Finance or HR Operating Roles in Services e.g. Catalog,  Customer Support Category Management Pricing Analytics Skills,  Background,  and Experience High energy,  passion and entrepreneurialism Highly developed skills for problem solving and strategic thinking MBA from a top- tier school Excellent communication skills Ability to collect,  analyze,  and synthesize data and present it in actionable manner Customer focused Ability to collaborate across different departments Experienced in taking initiatives and leadership roles Result oriented and ready to take ownership Long term approach Prior experience in E- Commerce is preferred Comfortable in working directly with senior management team Thrive in chaotic start- up environment and comfortable in dealing with ambiguity Always willing to solve tough problems and accept challenging assignments Quickly learn and contribute in a rapidly evolving environment Who Should Apply? We are seeking applications from the second year MBA students from premier management institutes globally or with up to 2 years of experience post MBA.\n\nAt Droom,  passion,  energy,  innovation,  and customer centric approach are always welcomed. We are passionate about building mobile consumer centric technologies,  enabling automobile sellers to sell online,  and offering the world- class mobile shopping experience.\n\nDroom Culture Droom is non- formal,  fun,  collegial,  non- hierarchical and high- energy environment. At Droom,  you can deliver the best work of your career without having to worry about work politics,  delays,  biases or slowness.\n\nWhy Droom? You can do the best job of your life without having to worry about work politics,  biases,  favoritism and slowness Opportunity to closely work with the founder and the leadership team Make impact,  push your limits and get new challenges every day Get opportunity to learn,  evolve and develop in an extremely fast evolving environment Be part of consumer Internet and mobile Commerce revolution in Gurgaon in a true Silicon Valley start- up Duration 4 months of rotation program followed by a permanent role. Start and end date depends on the college/ universities schedule.\n\nLocation Gurugram,  Delhi NCR.\n\nCompensation Droom offers competitive compensation,  stock options,  great learning exposure,  and merit based career path. Your career growth will be in your hands and your role will be what you carve out.\n\nContact Information email: map@droom.in | careers@droom.in \n\nAbout Droom Droom is India's first and only online marketplace for buying and selling new and used automobiles. At over 65% of the automobile transactions market share online,  Droom is the largest auto portal in India. Droom is not only the largest online automobile platform in India but also the 4th largest E- commerce company in India in terms of GMV. The automobile platform is category,  seller,  price,  condition,  and geography agnostic. \n\nDroom platform has four marketplace formats i.e. B2C,  C2C,  C2B and B2B,  and three pricing formats -  Fixed Price,  Best Offer and Auction. The platform offers wide range of categories from bicycle to plane and all automobile services such as warranty,  RSA,  insurance and auto loan. Droom uses data science to build trust at scale with a US Patent technology called Full Circle Trust Score. Droom has also built the de- facto pricing standard for used vehicles in India OBV,  which has a US patent. Droom has built the entire ecosystem for India so that the transaction for used automobiles can take place with least degree of information asymmetry and morale hazard. \n\nIt has built tech and data science heavy tools to create the entire ecosystem around used automobiles,  including OBV (Pricing Engine),  Eco (121 Points Vehicle Inspection),  History (20 Cr Vehicle History Records),  Discovery (dozens Of Pre- Buying Tools) and Credit (India's first and only marketplace for used vehicles loans). \n\nDroom is currently doing $626 Mil+ in annualized GMV growing at the rate of 350% Y/ Y,  185K+ auto dealers (Largest Auto Dealer Platform in India),  presence in 500+ cities across India (Largest Hyper Local Marketplace),  31.3 Mil+ monthly visitors,  nearly 6.3 Mil+ app downloads and 5.5 Mil+ Facebook community. \n\nDroom has the best unit economics as compared to any other E- commerce platform in India. The company spends less than 5% of GMV to run marketing and the entire cost of the company is less than 4% of GMV in terms of the net burn. Droom is the only E- commerce platform which has successfully built the cost advantage and sophistication of the tech platforms with the strong data science layer,  nobody else has been able to do it in India. \n\nDroom is founded by Sandeep Aggarwal,  who previously founded ShopClues at his house in California in Oct 2010,  which became 5th Unicorn in India by January 2016. Droom is a Singapore Holding Company with its subsidiary in India and United States. Droom has so far raised close to $95 million dollars in four rounds of funding. Droom is head quartered in Gurgaon,  India with a team size of 270+. \n\nMore Information About Droom For more details you can visit us at: droom.", "Role": "Head/VP/GM/National Manager -Sales,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "Sales, Retail, Business Development,", "Employment Type": "Full Time, Permanent", "Role Category": "Senior Management", "UG": "B.B.A / B.M.S in Management", "PG": "MBA/PGDM in Marketing", "Doctorate": "None", "Key Skills": ["Product management", "Loans", "Competitive analysis", "C2C", "Customer support", "Silicon", "HTTP", "Management", "Analytics", "mobile commerce"]}