{"Job Title": "SENIOR PHP DEVELOPER", "Company": "Brainstorm Forc", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "Job Openings | WordPress | PHP | Brainstorm Force Pune INSPIRING HEALTHY AND HAPPY CULTURE JOIN OUR BRAINSTORM FAMILY Career at Brainstorm Force \n\nIf you are seeking for a place where creativity & innovation is at the core,  then Brainstorm Force is the only place to be.  Our DNA revolves around problem solving,  exploration and passion for making Internet a better and beautiful place.  Our culture is about fun.  We work hard and party harder. \n\nWhat do we do? \n\nWe have developed a series of WordPress themes,  addons and plugins,  being used by WordPress developers and site owners across the globe.  We are among the few Power Elite authors on Envato Marketplace,  an online store where we sell our themes and plugins.  We make a great team and present world class products and support that makes us a well-known face to have developed popular products like the Ultimate Addons for Visual Composer & Beaver Builder,  the fastest WordPress theme Astra,  Convert Plus,  Convert Pro and WP Schema Pro and many more. \n\nWe promise you've never worked with anyone like us before.  Besides competitive salaries,  we offer\n\nNO DRESS CODE WORK FROM HOME FLEXIBLE VACATION POLICY SEARCHING FOR YOUR FIRST JOB? \n\nSENIOR PHP DEVELOPER Do you know WordPress inside out? Are you friendly with action & filter hooks?\n\nAre you an avid reader who loves writing as well? Did you spot a few grammar and typo errors on this website?\n\nWORDPRESS SPECIALIST WRITER Help us write documentation,  landing pages for our products,  blog posts,  emails and marketing verbiage. \n\nKeen on finding errors and getting them fixed? You can help us examine our products and build a bug-free solution for users. \n\nFRONT END DEVELOPER Are you obsessed about HTML,  CSS,  JavaScript and other common client-side technologies?\n\nMAKE AN IMPACT \n\nKnown for quality products and top notch services,  Brainstorm Force has over 30, 000+ happy customers spread across the world. \n\nCome,  be a part of our knowledgeable team that makes an impact by touching thousands across the globe. \n\nHAVE FUN AT WORK \n\nWhether it be games,  outings,  birthday celebrations,  quizzes,  competitions or fun hosted on Slack,  we are a bunch of chirpy,  energetic and joyful people who love to have fun at work.  We work hard,  but play harder!\n\nYou could be the one winning the next game,  a competition or planning an outing with us!\n\nLEARN SOMETHING NEW EVERYDAY \n\nWe at Brainstorm Force are dedicated to learn and adaptable to change! We foster new techniques,  ideas,  tools with an attempt to push boundaries in all we do.  New concepts are shared through internal communication media,  wikis or blogs and the regular knowledge sessions. \n\nWe believe every individual is a source of knowledge.  You can share your bit.", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["SIDE", "Front end", "Web technologies", "Wordpress", "Web development", "Schema", "Javascript", "PHP", "HTML", "Open source"]}