{"Job Title": "PHP Developer", "Company": "Computer Ware India Pvt Ltd", "Experience": "2 - 4 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "  We are an IT Solutions and service providing company based in South Delhi ( since 1987)building Bespoke Customised Web Presence and Web Applications and web based collaborative solutions.   Weare looking for a Full Stack PHP/ Laravel Developer    Job Profile Full Stack PHP/Laravel developer:     Design & Build web site, web apps, Portals & products ( frontend and backend)     Build core modules and develop code, script, algorithms to optimise processes     Protype, Document, Deploy     Research, prototype, implement new technologies and concepts     Co-ordinate with team , following project plans to deliver modular scalable solutions using latest technologies     Be actively involved in and contribute knowledge building in the company.     Salary as per skills and knowledge    Location : Green Park, Adjacent to Green Park Metro St. on Yellow line   Vacancy : 2   Full time Job. Alternate Saturdays are OFF    Candidate Profile  :   Qualification : (BTECH / BCA/ MCA/ BSC IT )|  Experience : 18 to 36 months   Experience at working both independently and in a team-oriented, collaborative environment is essential.    Proficient in programming skills, PHP, Laravel, HTML/CSS, AJAX, XML, javascript,     Knowledge of relational database design, MySQL, OOPS, MVC     Knowledge of Magento/Joomla/Drupal/WordPress would be added advantage.     Current on best design practices around varying device viewports     Comfortable in troubleshooting     Strong debugging skills with ability to read and modify existing code     Logical analytic skills     Strong organisational skills to juggle multiple tasks within the constraints of timelines and budgets with business acumen     Ability to work and thrive in a fast-paced environment, learn rapidly and master diverse web technologies and techniques. .     Decent English communication skills ( will be interacting on skype/ email with international clients)  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["SAN", "Prototype", "French", "Database design", "XML", "MySQL", "Javascript", "PHP", "HTML", "Ajax"]}