{"Job Title": "Software Development Engineer (ElasticSearch Developer)", "Company": "American LegalNet Inc.", "Experience": "4 - 8 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad, telangana", "Job Description": "   THE POSITION?S PURPOSE:     The Elastic Search Developer serves as an integral part of both the Software Development and Database team. The ElasticSearch Developer will be an important will support software product development, automation, and operations for release to ALN clients with a specific focus on Elastic stack and related technologies. This developer will be an important member of .Net based program development and will also be utilized for DB engineering tasks such as data conversions, process optimization and database development.     ESSENTIAL FUNCTIONS / MAJOR OBJECTIVES / DELIVERABLES:     Elastic search experience is a MUST and required. ElasticSearch Developer will work closely with architects, engineers, and integrators to assess customer requirements and to design and support an Elasticsearch Stack solution to ensure compliance with the overall application and dashboard data requirements.     AWS Cloud Architecture certification preferred    Design and implement highly scalable ELK (ElasticSearch, Logstash, and Kibana) stack and ElastiCache solutions    Architecting data structures using Elastic Search    Design, development, administration, and delivery of Elastic Search / ELK based reporting solutions. Build reports using APIs that leverage ElasticSearch and ElastiCache    Analyze and improve application performance while searching for simple and robust solutions to complex tasks    .Net Developer (Web Forms, MVC, JavaScript, Angular 2+ versions, SQL    Angular version 2 or higher required    WebAPI required    Write windows services, web applications and desktop application in .net    Interact with UI libraries in Javascript, JQuery HTML5    Write CSS and front-end code.    SQL Server Development (Query Optimizations, Writing Stored Procedures)    Experience in Data Transformation Services like SSIS,    T-SQL: Analyze data sets and determine how information relates to an information system.    Perform ad-hoc queries using SQL.    Optimize queries for performance.    Adhere to project timelines and deliverable, effective communication of changes or disruptions to the schedule with a focus on expectation alignment.    Proven Web N-Tier application development experience.    Gathering and documenting business requirements from Clients.    Work closely with clients to identify business needs.    Providing production support of related systems and operations.      EDUCATIONAL QUALIFICATIONS / SKILLS / EXPERIENCE:      1 full and complete implementation of Elastic Search (AWS or other)    AWS Cloud Architecture certification required    Understanding of business requirements and create appropriate indexes and documents    Proficient in elastic query for data analysis    2 yrs experience in Angular 2+ (Angular 8 helpful)    8 year?s experience in C#, .NET    4 Year?s experience in WebAPI using c#    2 year?s experience in .NET Core    5+ years of application programming experience using industry standard development tools.    Proficiency with C#/VB, JavaScript/HTML, JQuery, ASP.Net (Web Forms and MVC), CSS, HTML5    Expert at creating and consuming web services using technologies such as SOAP, REST, WCF, WebAPI, Generic Handlers, etc.    Experience with Web Services/Cloud Technologies such as Azure or AWS, SAAS    Agile/Scrum project development.    Strong problem-solving skills required.    Have strong and confident communication skill set in customer support and presentation.    Have background in engineering and reverse engineering system logic.    Be able to work in a team environment.    Strong Organization skill in Smart Sheet and Microsoft project necessary.    Telecommuting not available.    ", "Role": "Software Developer,", "Industry Type": "NGO, Social Services, Regulators, Industry Associations,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Software Development Manager", "Javascript", "JQuery HTML5"]}