{"Job Title": "Senior Software Development Engineer- UI", "Company": "Enquero", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "    Job description     Responsibilities      As a Senior SDE in Enquero?s Products IP BU, the ideal candidate is one who is conversant with and can work on multiple technologies in their primary role and lead the team and learn new technologies in their secondary role.     Your passion for programming and design combined with your ability to work on issues where analysis of situation or data requires review of relevant factors.      You will exercise independent judgement within defined policies and procedures to determine appropriate action. As well as lead a small team to an outcome while being a role model for your team.     Your demonstrated ability to consistently achieve this while building and leading effective teams and diversifying your own knowledge in the areas broader than your programs/assignments will define success in this role.      Must understand System Analysis and Design with understanding of Algorithms (implementation in any language is okay)     Design optimal and performant solutions for product backlog items spanning technologies     Work with Product Owner/Project Manager and UX lead for providing LoE estimates for Jira backlog items     Lead and own delivery or work items (for self and team)     90% hands-on work items (self), 10% team responsibility     Must be willing to learn new technologies, processes, business functions       Qualifications         REQUIRED        5-10 years of relevant experience     Must understand and conversant to code on at least One (or more) of these technologies       Angular             Javascript             Typescript             ElasticSearch             MySQL/Oracle           PREFERRED         Version Control - Jira/Bitbucket/Git           Working with Containers, dockers           Build Tools - Maven/SBT/Gradle           Security            Agile/Scrum methodology            Should be able to create and review designs/documents            Must be able to clearly articulate situations, problems and communicate ideas and solutions.        ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Maven", "Version control", "GIT", "Agile scrum", "MySQL", "Javascript", "Oracle", "JIRA", "System analysis", "Data architecture"]}