{"Job Title": "Opening For Audience Acquisition Executive _ Mumbai", "Company": "EIGENSCHAFT MARKETING SERVICES PRIVATE LIMITED", "Experience": "0 - 5 years", "Salary": "₹ 70,000 - 1,50,000 P.A. ", "Location": "Mumbai", "Job Description": "Connecting with the relevant individuals (as per defined database) to brief them on upcoming conferences, sessions, etc.Only work on business to business campaign for the IT market placeGuide and help the participants in the process like registering, logging-in on the portal by carrying out the intelligent conversation, sharing appropriate information with registrantsMaintaining and analysing reports of discussions and call history RequirementsRequired Candidate profilePreferably a graduate from any stream / undergraduate also welcome.Good English communication skills.Knowledge of Excel A person ready to take on responsibilities at all times.Smart and pleasing personalityPerks and Benefits P.F, Gratuity, Esic, Bonus Job LocationOur company is located at a distance of 10 mins walking from Andheri (East) and Andheri Metro Station.In case you are looking for a job in the area and are interested in above job description, then share your resume with us on on hr@eigenschaft.net or call on the below mention contact details.Looking forward to hearing and building a mutually beneficial relationship.RiyaEmail : hr@eigenschaft.netContact no. : 91 22 2836 7045 / 42", "Role": "Telecalling/Telemarketing Executive,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "Doctorate Not Required", "Key Skills": ["cca", "telecaller", "international calling", "csr", "cce", "customer service", "tele sales executive", "customer care associate", "tme", "customer support", "fresher", "cse", "telesales", "telecalling", "tele marketing executive", "Domestic Calling", "Associate", "telemarketing", "customer care executive"]}