{"Job Title": "Software Development Engineer III", "Company": "Tophatter", "Experience": "2 - 6 years", "Salary": "Not Disclosed", "Location": "Remote,India", "Job Description": "  Were looking for highly motivated, strong and experienced senior software engineers to join our growing Seller Engagement team in India.   The Seller Engagement teams mission is to build, shape and scale the Tophatter platform for our sellers all over the world to enable them to they can sell anything, and build and control their business with sustainable economics.    The team works in tandem with other teams globally, whore focused on the buyer side of the business.   We are a fully distributed team, all over the country (current team members are in Andhra Pradesh, Karnataka, Kerala, Maharashtra, Tamil Nadu).    Required Experience and Skills     Bachelors degree in Computer Science and Engineering. Bonus: Masters degree.     6 years of total full-time work experience, preferably shipping SaaS applications.     Startup experience strongly desired and comfortable wearing multiple hats.    Proficiency in    Ruby, Ruby on Rails, Mysql, Linux, Git, AWS, CI/CD, NewRelic.     Broad range of internet technologies and applications.     Knowledge of frontend technologies and frontend development experience is prized and a plus. We use React and React Native for our web app and mobile apps respectively.     Keep high quality performance, scalability, availability security in mind to build, extend, and maintain web front end, mobile, and backend components of an evolving, real-time application     Write bug free clean, elegant, testable code that scales well, and is delivered on time.     Mentor junior members of the team.     Very curious and self driven.    Responsibilities     Completing highly complex projects containing fair amount of ambiguity with little or no oversight   Providing guidance/oversight to other engineers, helping them to develop good judgement on solving technical problems   Removing most blockers individually and proactively escalate or seek assistance to become unblocked quickly   Partner effectively with product and business stakeholders to help ensure were utilising our resources in the most impactful way for the business  ", "Role": "Software Developer,", "Industry Type": "Internet, Ecommerce,", "Functional Area": "IT Software - eCommerce, Internet Technologies,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Computer science", "SAN", "Backend", "GIT", "Linux", "MySQL", "Venture capital", "Silicon", "Merchandising", "Ruby on rails"]}