{"Job Title": "Medical Coder CPC Online Certification", "Company": "Yogam BPO", "Experience": "0 years", "Salary": "Not Disclosed", "Location": "Sivakasi, Namakkal Rasipuram, Valasaravakkam Padi, Nagercoil Madurai, Omalur Gugai, Villupuram Neyveli, Tiruvannamalai Arani, Nanganallur Tnagar, Tuticorin Nagercoil", "Job Description": "MEDICAL CODING DOESN'T REQUIRE A POST GRADUATION DEGREE.WHILE SOME JOBS HAVE HIGH BARRIERS TO ENTRY DUE TO THE EXPENSIVE DEGREES REQUIRED TO OBTAIN THEM, MEDICAL CODING DOESN'T.ALL THAT'S NEEDED IS A LIFE SCIENCE GRADUATION.WHATS-APP@ 9789004777Required Candidate profileTo get started in Medical Coding you just have to complete an online course.Launch your career by completing CPC in Medical Coding.Ethical Intelligent Online training given with course certificate.Perks and benefitsLEARN ABOUT JOB, EMPLOYMENT OUTLOOK, SALARY TRENDS", "Role": "Fresher,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Other", "UG": "Graduation Not Required, BFA in Any Specialization, BVSC in Veterinary Science, B.Sc in Optometry, Food Technology, Home science, Bio-Chemistry, Biology, Microbiology, Botany, Nursing, Chemistry, Dairy Technology, Zoology, B.Ed in Education, B.A in Any Specialization, Diploma in Any Specialization, MBBS in Medicine, B.El.Ed in Any Specialization, Any Graduate in Any Specialization, B.Pharma in Pharmacy, BHM in Hotel Management, B.Tech/B.E. in Any Specialization, B.Com in Commerce, Other Graduate, BHMS in Any Specialization, Homeopathy, BCA in Computers, BAMS in Any Specialization, Ayurveda, B.Arch in Architecture, B.U.M.S in Unani Medicine, Any Specialization, BDS in Dentistry, B.P.Ed in Any Specialization, LLB in Law, B.B.A / B.M.S in Management, B.Des. in Any Specialization", "PG": "Integrated PG in Any Specialization, MDS in Dentistry, M.Ch in Any Specialization, Any Postgraduate in Any Specialization, M.Pharma in Pharmacy, Post Graduation Not Required, Other, CS in CS, M.Com in Commerce, MCA in Computers, M.Des. in Any Specialization, MFA in Any Specialization, M.A in Any Specialization, CA in CA, MS/M.Sc(Science) in Nursing, Zoology, Veterinary Science, Bio-Chemistry, Biotechnology, Microbiology, DM in Any Specialization, Medical-MS/MD in Any Specialization, MBA/PGDM in Any Specialization, MVSC in Veterinary Science, PG Diploma in Any Specialization, M.Ed in Education, ICWA (CMA) in ICWA (CMA), M.Arch in Architecture, M.Tech in Any Specialization, LLM in Law", "Doctorate": "Doctorate Not Required, Ph.D in Advertising/Mass Communication, Any Doctorate in Any Specialization, M.Phil. in Advertising/Mass Communication", "Key Skills": ["bsc nurse", "fresher", "pharmacy", "Revenue Cycle Management", "Community Medicine", "Public Health", "bpt", "gnm", "microbiology", "Tai Chi", "Anatomy", "biomedical", "dentist", "Dietician", "ICD - 10", "medical coding", "HCPCS", "medical transcription", "biochemistry", "CPC", "medical billing", "life sciences", "physiotherapist", "zoology"]}