{"Job Title": "Software Development Engineer - Java", "Company": "Bloom Consulting Services", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  Job description          Responsibilities      Conceive and develop software applications to extend and improve on TSS product offerings.    Develop, maintain and enhance web applications (Java/J2EE);    Understand the client requirements and prepare technical artefacts;    Work with team members on integration and application deployment;    Interact with crossfunctional groups including product manager, customer support and marketing to develop new functionality and support existing customers.    Work with Onsite team, UI designers, Business analysts and the team to create a compelling application with great user experience.    Other duties as assigned.      Desired Skills and Experience      BE or Equivalent degree (CS preferred) from a reputed institute [IIT, NIT, BITS etc.    3 years to 5 years of software development experience in Java/J2EE environment.    Strong knowledge of Data structures and Algorithms, Threads, Core Dumps and Memory Management.    Experience of working with servers like Tomcat, JBoss and/or Weblogic/Websphere.    Strong knowledge of Object Oriented programming with handson experience on Hibernate, Spring and RDBMS.    Knowledge of design patterns with hand-on experience on Struts or Spring or other MVC frameworks    Full SDLC experience from gathering client requirements, turning requirements into design specs, and developing high quality, scalable applications.    Self-motivated to explore new technologies, applications and environments.    Strong oral and written communication skills.    Candidates with experience on Web services and Service Oriented Architecture will be preferred.   ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Hibernate", "Tomcat", "JBoss", "RDBMS", "Weblogic", "Struts", "Data structures", "J2Ee", "MVC", "SDLC"]}