{"Job Title": "Talent Acquisition Specialist - India Staffing - Immediate joiners", "Company": "DISYS INDIA PRIVATE LIMITED ", "Experience": "0 - 3 years", "Salary": "₹ 3,50,000 - 5,50,000 P.A. ", "Location": "Pune( Kharadi )", "Job Description": " We are looking for serious professionals; would prefer some one who can join us on short notice or Immediately. WORK from Pune OFFICE highly preferred ; we will prefer someone who can work from our Pune Office Based at WTC (Kharadi)ABOUT THE COMPANY : Digital Intelligence Systems - DISYS, LLC is a global technology and business services consulting firm specializing in Business, IT Consulting and IT/Non-IT Staffing Services. DISYS has been in business since 1994 and is headquartered in the US (McLean, VA).DISYS is ranked as one of the Largest US IT and Non-IT/ Professional Staffing Firms, Largest US/Canadian MBE-certified Staffing Firms, as well as Top 100 Consulting Firm globally. DISYS Global Delivery Centers span 29 locations in the US and 18 more across the world, in countries like Canada, India, Brazil, and across EMEA and APAC.DISYS services include IT and non-IT/Professional Staffing, Payrolling, RPO, BPO, as well as Managed Services with focus on Cognitive Services (RPA, Artificial Intelligence and Machine Learning), Digital Transformation (Artificial Intelligence and Machine Learning), and Infrastructure Support Services (work place transformation, storage, network, systems, data center management, etc). We offer flexible working schedule and offer best compensation in the staffing industry. We are growing & expanding at fast paced so it's a great opportunity to grow and advance in your career with our fast track advancement programs. - We also offer best in industry incentive & bonus structure. We offer continues training & development for our employees which help them professionally & personally both.  Qualifications:Candidate should have 1-2 years of experience in recruitment. MUST to have India/Domestic IT contract staffing experience.1+ years of deep sourcing/recruiting experience for passive candidates1+ years- direct HM contact and partnershipPossess a proven track record of providing support in the areas of Sourcing, Screening, and Scheduling Prospective candidatesClosures, ability to develop new strategies of recruitment, etc.Candidate should possess excellent written & verbal communication skills, development of his/her own pipeline, excellent sourcing skills from social sites with good & healthy networking.Bachelor's degree or equivalent professional work experience. We will consider Fresher or entry level candidates who has good IT academics background; and looking to have Career in HR & Talent management.  Key Skills:Good knowledge & understanding of Staffing industry ( India Market)Should have capability to create Job Descriptions based on requirementsAbility to understand Job Descriptions & tweak the strategy for closuresKnowledge of sourcing and mining techniques within the recruiting spaceAbility to multi-task within a fast-paced environmentAction-oriented and results-driven individualSelf-starter with ability to effectively manage multiple candidates, searches and projectsAbility to collaborate and work effectively in partnership with others Job Responsibilities & key requirementsDevelop recruiting strategies designed to identify candidates through various recruiting toolsExcellent Sourcing Skills from Professional Networking Sites, Blogging, Social networking sitesExpertise in portal sourcing using Naukri, Monster and other Job Portals.Expertise with LinkedIn Sourcing. ( Must have good networks ; high number of connections from the industry)Excellent Tech Screening Skills and responsible for detail evaluation of candidates against specific IT requirementsExtraction of suitable candidates depending on the requirement from various channels of sourcesPhone screens via phone or video conferenceInteraction with the candidates & scheduling them for an Interview based on panel availabilityTrack daily status reports on conversions & closuresMaximizes profitability by negotiating pay rates with consultants based on position requirementsDemonstrates ability to manage own workflow and resolve questions and problems with supervisor.Maintains good communication and organizing skillsSelf-starter with ability to effectively manage multiple candidates, searches and projectsAbility to collaborate and work effectively in partnership with othersExecute market trend analysisDemonstrates ability to manage own workflow and resolve questions and problems with supervisor.Maintains good communication and organizing skills", "Role": "Recruitment Executive,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "HR, Recruitment, Administration, IR,", "Employment Type": "Full Time, Permanent", "Role Category": "HR/ Recruitment / IR", "UG": "Diploma in Computers, BCA in Computers, B.Tech/B.E. in Computers", "Doctorate": "None", "Key Skills": ["Staffing Services", "IT Recruitment", "Artificial Intelligence", "Digital Transformation", "Fast Track", "Technical Recruitment", "Talent Acquisition", "RPO", "Training", "Talent Engagement", "Screening", "IT Staffing", "Compensation", "Non It", "Data Center Management", "Infrastructure Support"]}