{"Job Title": "Senior Technology Developer/Java/J2EE", "Company": "OnProcess Technology India Pvt. Ltd.", "Experience": "7 - 10 years", "Salary": "₹ 8,00,000 - 12,00,000 P.A. ", "Location": "Kolkata", "Job Description": "POSITION DESCRIPTION Position:\tSenior Technology Developer\tDept:\tBTS Reports to:\tTeam Lead / Manager, App Engineering\tClassification:\tExemptSummary OnProcess is a trusted advisor to many of the world’s leading technology, medical device, wireless, broadband, manufacturing, and logistics companies. Founded in 1998 and providing services in 26 languages and operating in seven global facilities, OnProcess delivers a follow the sun model, with global headquarters in the greater Boston area.  We have made significant investments in technology platforms, analytics, and artificial intelligence capabilities to support our go to market services.The OnProcess Technology team is a 100+ organization that is tasked with the creation and support of all technology needed to provide world class level services in the service supply chain field. The team is global in its execution with members based in Ashland, Massachusetts, Kolkata, India and Sofia, Bulgaria.  The technology environment is based on a mobile and cloud first approach; with hybrid Azure based Cloud Services and Microsoft based technologies providing the foundation for all development.Duties –•\tDesign, build, test, and deploy Cloud (preferably Azure or AWS) based software solutions that provide high availability, scaling and predictable support costs.•\tWork independently and as part of project teams delivering mission critical applications.•\tBuild proof of concepts using new technology as part of maintaining and evolving a best-in-class technology architecture.•\tMentor junior members of the team though code reviews, design sessions and regular interactionsSkills –•\tBe disciplined and reliable, trusted to work with minimal supervision.•\tHave a keen sense of innovation, with valuable suggestions of new ideas, ways of working and technologies.•\tAble to communicate and interact effectively with a distributed team of other technical experts, many of which have English as their second language.•\tDevelop highly interactive, dynamic, scalable product platforms or customer facing applications.Qualifications –Required –•\t8+ years as a professional software developer•\tIn depth understanding •\tUnderstanding of basic OOAD design principles and standard design pattern and their application in effective modular and performant code development•\tStrong software development skills using Opensource Technology stack (Java/J2EE, Node.js etc.) and SQL/NoSQL databases (MS SQL Server, MongoDB or others) and Cloud environment (AWS or Azure)•\tPractical experience building Adaptive-Responsive Web applications through implementation of Microservices framework (Spring Boot or others) with REST APIs and integrations over any flavors or enterprise messaging platforms (open source or proprietary Message Bus, MQ etc).•\tPractical experience designing and developing rich omnichannel web application leveraging HTML5, JavaScript tools/libraries (JQuery, Angular, Bootstrap or ReactJS)•\tExposed to Agile methods of Delivery models (Scrum, Kanban etc) and familiarity with associated tools (like JIRA or IBM ALM) and processes/procedural standards.•\tWell versed with TDD style of software development through a ‘test first fail fast’ approach through automated unit testing, integration testing and performance testing.•\tThorough and conversant in using CI/CD (DevOps and/or DevSecOps) technologies and frameworks (like Kubernetes, Maven, Gradle etc.) especially in containerized (Docker, Kubernetes cluster etc.) Cloud (Azure/AWS) deployment environment.•\tHave prior experience in Salesforce CRM and/or Service Cloud and its associated marketplace delivery components through APEX framework.Preferred –•\tExperience in Python and/or Node.js for server-side development.•\tAny prior experience in BPM tools like jBPM, Mulesoft, Pega etc.•\tExperience using any industry standard data integration tools like Knime, Pentaho, Informatica or others.•\tPractical experience in any industry grade enterprise event or messaging platform. •\tPractical experience in API level integration with external systems (e.g. SAP, SFDC, Oracle ERP, ServiceNow etc.).•\tExperience working in an Agile environment. Work Environment –•\tOffice hours are overlapping with US EST with opportunity based on project and team members participating, to shift schedule.•\tGiven the nature of working remote as part of international teams, use of video conferencing and video presentations will be a daily occurrence. ", "Role": "Other,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "Other,", "Employment Type": "Full Time, Permanent", "Role Category": "Other", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Any Doctorate in Any Specialization", "Key Skills": ["Java", "Azure", "cloud aws", "J2Ee", "reactjs", "Angular"]}