{"Job Title": "Quality Engineer", "Company": "Successive Pvt Ltd", "Experience": "3 - 7 years", "Salary": "Not Disclosed", "Location": "Noida", "Job Description": "  Role:   Quality Engineer   Quality Engineer   Role:   Quality Engineer   Qualification:   B.Tech(CS-IT)   Experience:   3-7 years Desired Skills:     Experience in Automation Tools, Selenium WebDriver with Java.    Hands on experience on Web Service Testing.    Experience in TDDBDD Framework.    Working experience in Agile Methodology.    Experience in Page Object Model Framework.    Hands on experience on API testing using Postman.    Experience with any test management tools like Jira, Test Rail & Test Link etc    Good to have Technical Skills:    Experience in GIT, Jira etc.    Experience on API testing using Postman.    Working experience in Agile Methodology            Core Responsibility Areas:     Possesses extensive knowledge and experience in testing, functional, system, regression, integration etc.    Well versed with sdlc (software development life cycle) and stlc (software testing life cycle). Experience continuously deploying and scheduling tests using bamboojenkinsgit Design test cases and execute functional, integration and end-to-end tests on a variety of platforms.    Create detailed, comprehensive and well-structured test plans and test cases.  Work closely with the agile team across all phases of a project to constantly test and provide feedback on the quality of the product.    Participate and contribute effectively in daily stand-ups, sprint review, sprint demo and retrospective meetings.    Liaise with internal teams (e.g. . Please reach out to find answers to your queries.          ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - QA & Testing,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["TDD", "Test management", "Agile", "Scrum", "Scheduling", "Agile methodology", "Selenium", "Test cases", "JIRA", "SDLC"]}