{"Job Title": "Senior QA Automation Engineer", "Company": "Morningstar", "Experience": "4 - 6 years", "Salary": "Not Disclosed", "Location": "New Delhi", "Job Description": "   The Role:    We provide three sets of solutions to three different user groups: end-clients, advisers/practices, and licensees. Morningstar believes in fullstack QA approach where a QA engineer can do manual testing, write test automation, do performance testing and manage application monitoring systems.     As this role requires both individual contribution and some level of initiative management, you should have:    Deep understanding of the overall Quality Assurance process.   Good communication skills - Written and verbal to understand the current application and working with the Product Manager, Technology Manager, developers and other QA engineers to understand the current and future testing needs of the application.   Willingness to learn the functional aspects of the application to ensure test cases are domain-oriented and maximum test coverage is attained using minimum no of test cases.   Experience in defining best practices and providing technical mentorship to other members of the QA team.   The ability to build good working relationships within the team by communicating clearly, both verbally and in writing.   Experience and understanding of Agile Development methodologies especially Scrum.   Fast learner, open to learning new technologies when needed.        Requirements:       Technical abilities showcasing a breadth and depth of technical knowledge:    Good understanding of how modern web apps are architectured with Javascript driving the application flow and APIs as the backend.   Good experience in building test strategies and writing good test cases.   Good understanding of how modern test automation projects are developed that include not only Selenium/Webdriver based web testing but also the experience of using Javascript for testing AngularJS/Vue/React-based web applications.   Experience in API testing.   Experience in performance testing through JMeter, LoadRunner, etc.   Experience in security testing through Burp Suite will be a plus        Basic Qualifications      Minimum Bachelor's Degree in Computer Science or a related field.   Minimum 4+ years of professional experience in software testing.   Computer Science fundamentals in object-oriented design, data structures, algorithm design, problem-solving, and complexity analysis.   Proficiency in at least one of the programming languages: Java/JavaScript.          Preferred Skill Set      Experience in building test strategies and writing extensive test cases for relatively large and complex web application systems.   Experience in building automation suites using Selenium etc.   Knowledge of professional software engineering practices & best practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations using cutting edge methodologies.   Ability to take a project from scoping requirements through actual launch of the project.   Experience in communicating with users, other technical teams, and management to collect requirements, describe testing strategy, test features, and technical designs.   Experience in mentoring junior QAs.   Experience in performance testing.   Morningstar is an equal opportunity employer      ", "Role": "Quality Assurance/Quality Control Executive,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - QA & Testing,", "Employment Type": "Full Time, Permanent", "Role Category": "QA/Testing/Documentation", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Automation", "Manual testing", "Manager Quality Assurance", "Coding", "Javascript", "Performance testing", "Data structures", "Scrum", "Selenium", "Test cases"]}