{"Job Title": "Full Stack developer", "Company": "Rudram Phronesis InfraZ Pvt Ltd ", "Experience": "3 - 7 years", "Salary": "₹ 3,00,000 - 7,00,000 P.A. ", "Location": "Chennai", "Job Description": "Hey Full Stack Software developers, We are Hiring.   Rudram is looking for a Full Stack Software engineers to exposure and innovate on emerging technologies. We have AI, IoT Engineers working together on innovative solution for ease of living and increase in operational values of industries.Join our team to learn and have hands-on cutting edge technology stacks.Skills: * Developing front/back end architecture. * Designing user interactions of application * Ensuring cross-platform optimization for mobile phones. * Ensuring responsiveness of applications. * Designing and developing APIs. * Collaborate with Front-end and Back-end developers to integrate user-facing elements with server side logic * In-depth understanding of the entire application development process (design, development and deployment) * Designing scalable, high availability, high performance server systems * Build reusable code and libraries for future use * Troubleshoot and debug applications * Perform tests to optimize performance * Developing ideas for new programs, products, or features by monitoring industry developments and trends * Familiarity with GIT source management Technology requirements: * Proficiency with fundamental front end languages such as HTML, CSS and JavaScript, XML, jQuery * Proficiency with multiple back-end languages like Python, PHP * Proficiency with frameworks Django, Flask, Angular, React, Node.js * Hands-on GraphQL, socket.io, Sequalizejs * Familiarity with common stacks * Hands-on with databases like MySQL, Mongo etc * Hands-on with Websockets / Secure web sockets * Understanding of Microservices architecture and API gateway experience, REST API etc * Hands-on Cloud deployment preferably AWS * Kubernetes and Containerization using Docker * Create security and data protection settings Qualification: * Proven experience as a Full Stack Developer or similar role * Experience developing desktop and mobile applications * Bachelor/Masters in computer science or equivalent * Ability to take raw product requirements and create software architectures and designs to bring them to life * Demonstration ability to mentor other software developers to maintain architectural vision and software quality * Document and communicate designs, estimates, and implementation plans to program stakeholders * Experience working in an Agile/Scrum environment * Good understanding of Micro Services architectural design. Personal Attributes: * Customer and business focused product development  * Good interpersonal skills * Highly self- driven and self-motivated  * Build good relationship with the team, stakeholders and across other business and technical teamsOur Culture at Rudram: Being part of a startup that's turning out to be a game-changer, you will be blessed with:  1. A young and energetic workplace where new ideas are always welcome. The crazier, the better. 2. Freedom to try new things; failure is not censured 3. Exposure to learn new concepts related to deep learning, computer vision and their application in augmented reality 4. Working with an enthusiastic team where growth and learning shall be taken care of.5. 5 days working. Fixed Saturday & Sunday Off.6. General shift.Preferred Immediate Joinee or Short notice(15 days or less than one month)Experience Required : 3-7 yearsWork Location : Taramani , Chennai.Forward your profile to  menaka.s@infrazanalytics.com", "Role": "Technical Architect,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "Doctorate": "None", "Key Skills": ["Django", "Angular", "Python"]}