{"Job Title": "Backend Developer", "Company": "Rudram Phronesis InfraZ Pvt Ltd ", "Experience": "3 - 7 years", "Salary": "₹ 3,00,000 - 7,00,000 P.A. ", "Location": "Chennai", "Job Description": "Job descriptionHey Backend Software Engineers, We are Hiring.Rudram is looking for a backend software developer to exposure and innovate on emerging technologies.We have AI, IoT Engineers working together on innovative solution for ease of living and increase in operational values of industries.Join our team to learn and have hands-on cutting edge technology stacks.Skills:Collaborate with Front-end developers to integrate user-facing elements with server side logicIn-depth understanding of the entire web development process (design, development and deploymentDesigning scalable, high availability, high performance server systemsBuild reusable code and libraries for future useTroubleshoot and debug applicationsPerform tests to optimize performanceDeveloping ideas for new programs, products, or features by monitoring industry developments and trendsFamiliarity with AWS and GITTechnology requirements:Hands-on Python, PHPHands-on Django, Flask frameworksHands-on GraphQL, socket.io, SequalizejsDeep understanding of HTTP and RESTHands-on with databases like MySQL, MongoUnderstanding JavaScript, Node JS,ReactJS, HTML5, CSSHands-on with Websockets / Secure web socketsUnderstanding of Microservices architecture and API gateway experience, REST API etcHands-on Cloud deploymentKubernetes and Containerization using DockerWebRTC understandingQualification:Bachelor/Masters in computer science or equivalent.Ability to take raw product requirements and create software architectures and designs to bring them to lifeDemonstration ability to mentor other software developers to maintain architectural vision and software qualityExperience working in an Agile/Scrum environmentGood understanding of Micro Services architectural designPersonal Attributes:Customer and business focused product developmentGood interpersonal skillsHighly self- driven and self-motivatedBuild good relationship with the team, stakeholders and across other business and technical teamsOur Culture at Rudram:Being part of a startup that's turning out to be a game-changer, you will be blessed with:1. A young and energetic workplace where new ideas are always welcome. The crazier, the better.2. Freedom to try new things; failure is not censured3. Exposure to learn new concepts related to deep learning, computer vision and their application in augmented reality4. Working with an enthusiastic team where growth and learning shall be taken care of.5. 5 days working. Fixed Saturday & Sunday Off.6. General shift.Preferred Immediate Joinee or Short notice(15 days or less than one month)Experience Required : 3-7 yearsWork Location : Taramani , Chennai.Forward your profile to menaka.s@infrazanalytics.com .", "Role": "Other,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "Other,", "Employment Type": "Full Time, Permanent", "Role Category": "Other", "UG": "B.Tech/B.E. in Any Specialization", "Doctorate": "None", "Key Skills": ["Django", "PHP", "Python", "CSS", "Front End", "Html5", "MySQL", "Socket.Io", "Javascript", "Web Development", "Flask"]}