{"Job Title": "Job Vacancy for SEO, PHP Developer", "Company": "BlueBit Systems", "Experience": "2 - 7 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": "SEO Expert having 6 months to 2 yrs of experience.\n\nSkills: \n\n Excellent verbal and written communication skills\n\n Self- directed when confronted with support issues\n\n Ability to manage details,  overall flexibility and efficient work habits\n\nQualifications: \n\n Excellent Internet and computer skills\n\n Knowledge of online marketing and search engine optimization\n\n Clear understanding of SEO On- page and Off- page strategies\n\n Knowledge and experience with HTML and Excel\n\nMajor Responsibilities/  Activities \n\n Should be able to organize and improve web- marketing initiatives & content management using creative content writing,  search engine friendly copy writing,  proof reading,  and editing\n\n Content rephrasing\n\n Identify directories,  forums and websites that could be potential link building.\n\n Researching and resolving HTML code and content,  link architecture and navigation issues\n\n Creating unique write- up after research and re- phrasing\n\n Analyzing and maintaining SERP positions for the keywords\n\n Create copy for websites,  marketing collateral,  marketing blogs,  marketing mails,  etc\n\n Assist with monthly SEO reporting\n\n Researching keywords\n\nWordpress Developer having 1- 3 Years of work Experience\n\nMajor Responsibilities/  Activities: \n\n•Experts in HTML To Wordpress themeing \n\n•Plug in Creation and Management \n\n•Able to develop theme. Mastery of HTML,  CSS,  PHP and jQuery; \n\n•Experience with object- oriented programming \n\n•Experience with mobile platforms. \n\n•Experience with Wordpress is mandatory,  other CMS/  framework experience will be an added advantage. \n\n•Experience with Wordpress Theme,  Widgets and Plugin customizing and developing new wordpress themes,  Plugin modification/  development and widgets development. \n\n•Expert knowledge in Wordpress installation,  configuration,  Administration,  security,  and optimization. \n\n•Desired Experience in customizing existing 3rd party themes,  Plugin. Essential Duties & Responsibilities: \n\n•Copy writing,  editing,  reporting,  creative and feature- writing articles and daily news stories. \n\n•Conceptualizing content for blogs and websites. \n\n•Developing/   Editing News Reports,  Articles. \n\n•Developing original,  SEO Friendly content for websites. Skills: \n\n•Good command over language and grammar. \n\n•Should have flair of writing with fresh ideas without any approach of copying or rewriting others. \n\n•The candidate should be able to write content on variety of subjects,  proficient in technical and non- technical writing. Mumbai candidates preferred.\n\nResponsibilities: \n\n• To sell the web based solutions like website design,  development,  SMO,  SEO,  PPC ,  Google Adwords to the domestic market. Serve as Digital Lead for developing and driving revenue and focus on multi- platform digital initiatives. \n\n• Understanding Client's advertising objectives to define digital communication strategies. \n\n• Creating marketing proposals for sales pitch to big ticket clients. \n\n• Managing sales /   day- to- day client relationships through conference calls and presentations. \n\n• Designing and delivering online media plans /   presentations for clients. \n\n• Preparing formats for Quotation,  Performa Invoice,  Proposal,  etc. \n\n• Resolving customer's issues related to products,  post- sale services,  etc. via emails in co- ordination with Technical Dept. \n\n• Managing Inbound Leads and convert them into Sales. Experience: \n\n2- 3 years of experience in Business Development- Digital marketing/  online space sell \n\nHave primarily sold Google Ad Words/  online ads/   online listings. \n\nVery good communication and verbal skill. \n\nPreference will be given to Google Ad Words certified candidates. \n\nMust be from Agency Background. \n\nMust have experience into digital/  internet sales. \n\nUnderstanding of dynamic online marketing domain,  search market,  PPC strategy,  social media market \n\n", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Content management", "PPC", "Technical writing", "Wordpress", "PHP", "HTML", "Content writing", "Link building", "SEO", "Proof reading"]}