{"Job Title": "Senior Devops Engineer", "Company": "Exzeo Software Pvt. Ltd.", "Experience": "3 - 7 years", "Salary": "Not Disclosed", "Location": "Noida", "Job Description": "   JOB DESCRIPTION-    We are looking for a   Build and Release Engineer   responsible for maintaining our deployment processes. Attention to detail and taking ownership of the product is a must!    Responsibilities:     Work collaboratively with software engineering teams to deploy and operate our applications.     Automate/streamline operations and processes.     Build and maintain tools for deployment, monitoring.     Design, automate, and build a continuous integration (CI) environment with continuous delivery (CD).     Ability to troubleshoot complex systems.     Must have good communication skills and problem solving skills.     Requirements:     Strong background in Linux/Windows administration, usage and bash scripting.      Accustomed to implement cloud-based solutions (AWS preferred) with significant work experience in public cloud technologies.     Hands on experience in both designing and maintaining cloud infrastructure.     Experience in implementing DevOps practices and DevOps-tools in areas like CI/CD using Jenkins environment automation, and release automation, virtualization, infra as a code.     Experience with Containers and container orchestration platforms such as Kubernetes. Building and deploying Micro Services on Kubernetes.     Hands-on experience in Docker container and orchestration based deployments in Kubernetes.     Experience with Logging, Monitoring and reporting solutions such as : Prometheus Grafana, Kibana (ELK), Nagios, New Relic etc.     Very good understanding of enterprise infrastructure development. This includes but is not limited to design, architecture, administrative considerations, and infrastructure security.     Automate create and configuration of infrastructure using Terraform, cloud formation, CLI, API.     Hands on experience in DevOps tools configuration on different environments.     Knowledge in one scripting language (Perl, Python, Shell or PowerShell etc.) Hands-on experience on Jenkins pipeline scripting.  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Automation", "Software design", "Linux", "Social media", "Consulting", "Perl", "HTTP", "Virtualization", "Monitoring", "Python"]}