{"Job Title": "Manager Operations - Customer Engineering", "Company": "InnovAccer", "Experience": "2 - 6 years", "Salary": "Not Disclosed", "Location": "Noida", "Job Description": " We at Innovaccer are looking for a    Manager Operations-Customer Engineering   to improve the efficiency and productivity of our vertical. we re searching for a candidate to work closely with our executive team. From day one, as a Manager Operations-Customer Engineering will have an immediate impact on our productivity, streamlining strategic initiatives, overseeing program management, and communicating objectives between departments.The ideal candidate will have proven experience in a project management role, with a special focus on executive-level advising and interdepartmental collaboration.    A Day in the Life    Serve as liaison between staff, executives, senior leaders, and Business Head, regarding team culture, project updates, proposals, and planning.   Oversee strategic business initiatives from development through successful execution under the guidance of senior leadership and departmental heads   Review, design, and execute on improvements to org structure, find knowledge and skills gaps and help address them   Report and track the portfolio level KPIs for the customer implementation across regions    Work closely with Product and Engineering team to ensure customer priorities are embedded in the product roadmap, Track the roadmap adherence across products    Build and develop relationships with all employees for increased efficiency and effective responsiveness into existing operations, and help to define new operational strategies, working with Business Heads and executives on special projects   Assist the human resources department with new hires, ensure seamless onboarding experience for the new joiners    Oversee daily operations through collaboration with senior management and department leaders and healthcare customers   Conduct regular training need analysis for the department and ensure the implementation of the same with LD    Serve as a subject matter expert, handling inquiries and developing action plans to address them, and assisting with the preparation and dissemination of communications   Assist and communicate with executives in decision-making, program management, and initiative implementation   Improve current processes and coordinate organizational procedures for optimized efficiency and productivity   Operate strategically and tactically. Work on strategy and help set direction while staying on top of the day to day software development and its implementation    What you need    Experience with Project Management/ Program Management   Consulting experience with a focus on operations management   Proven success in a project coordination role and cross functional team management.   Nimble business mind with a focus on developing creative solutions   Strong project reporting skills, with a focus on interdepartmental communication   Experience with Project Management tools - JIRA, HubSpot , MixPanel     Preferred Skills  :    Agile Scrum    Project Management Tools   Cross Functional Team Management   What We Offer      Industry-focused Certifications:   We want you to be a subject matter expert in what you do. So, whether it s our product or our domain, you will dive straight in and be certified by the best in the world.     Quarterly Rewards and Recognition Programs:   We foster learning and encourage people to take moonshots. When you achieve your goals, we recognize and reward your hard work.     Health Benefits:   We cover health insurance for you and your loved ones.     Sabbatical Policy:   We encourage people to take time off and rejuvenate, upskill and pursue their interests so that they can generate new ideas for innovating at Innovaccer.     Pet-friendly office   and open floor plan. No mundane cubicles      ", "Role": "Sales/Business Development Manager,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "Sales, Retail, Business Development,", "Employment Type": "Full Time, Permanent", "Role Category": "Corporate Sales", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["SAN", "Health insurance", "Team management", "Project management", "Management consulting", "Training need analysis", "Healthcare", "JIRA", "Operations", "Analytics"]}