{"Job Title": "IoT Engineer", "Company": "Contus", "Experience": "4 - 9 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "   We are looking for a iOT Engineers to produce scalable software solutions. You will be part of a research and development team that aims to develop an open cloud-based testbed for sensors, medical devices, activity trackers, and other cost-effective Internet of Things (IoT) devices. You will be working closely with various stakeholders to develop IoT and mobile (both smart phones and wearable devices) sensors and applications that leverage upon the testbed platform      Required Skills:    Candidate must possess a recognised Bachelor s degree in computing, engineering, science, or a related discipline.    Minimum 4+ years of software engineering experience would be advantageous.    Proficient in one or more object-oriented programming language such as Java, Swift and Objective-C.    Strong working knowledge of native mobile app development with iOS and/or Android.    Working knowledge of IoT device management and the associated protocols such as OMA-DM and OMA-LWM2M as well as device data collection and the associated protocols such as MQTT, CoAP and HTTP.    Familiar with multi tier architecture, Service-Oriented Architecture and Microservices Architecture.    Appreciation of the importance of good User Experience (UX).    Working knowledge of software testing, distributed revision control such as Git and software configuration management.    Excellent team player and committed individual.    Good interpersonal communication skills (verbal and written).      Key Responsibilities:    Conduct background research on existing IoT-related applications and delineate industry best practices.    Analyse the functional requirements specification of each application.    Design the applications.    Implement the applications according to approved designs. Successful candidate must be able to develop native mobile applications on iOS and/or Android as well as one or more IoT development platforms such as AWS IoT Platform    Conduct rigorous testing of the applications.    Deploy the applications to cloud computing infrastructure and app stores.     ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Cloud computing", "Medical devices", "GIT", "SOA", "Development Manager", "Software configuration management", "Data collection", "HTTP", "Sensors", "Android"]}