{"Job Title": "Web Developer Full stack", "Company": "Aristocrat IT Solutions Pvt Ltd.", "Experience": "4 - 7 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "   Create website layout/user interface by using standard HTML/CSS//PHP practices Integrate data from various backend services and databases , Gather and refine specifications and requirements based on technical needs .   Be responsible for maintaining, expanding, and scaling our site.   Stay plugged into emerging technologies/industry trends and applies them to operations and activities Cooperate with web designers to match visual design intent skills.    All work given by team lead has to be completed on time and should be willing to work with team, meet the death lines and co -ordinated accordingly    Responsibilities and Duties:    Development of HTML5, CSS3, Javascript app   Create and execute Unit Test casesDebug and fix existing issues   4+ years? experience with PHP, Modern Backend Framework (CakePHP, Laravel, Symfony, etc.), Modern Front End Framework (Vue, jQuery, Angular, etc.), HTML5, MSSQL/MYSSQL CSS   A communication pro - must be able to pleasantly explain technical issues to a non-technical person. (we are always in contact with stakeholders)   Highly attentive to details, able to cross all the t's and dot all the i's and help others do the same   There is direct project oversight, but you are expected to take ownership of your work and your projects, establish deadlines, and communicate progress proactively   Eager to research and learn in a self-directed way (always improving)   ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Other,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Software design", "Backend", "CSS", "Web technologies", "PHP", "HTML", "Visual Design"]}