{"Job Title": "IT - Software Development - Lead UI Developer", "Company": "Dell International Services IndiaPrivate Limited", "Experience": "9 - 11 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "Roles and ResponsibilitiesJob Title: Software Development UI LeadJob Description Summary:The candidate will be part of the team which is responsible to re-define the back office products within Dells IT order management, supply chain and Finance domains. As part of the team candidate will be responsible for evaluation of new open source technologies and innovating and enhancing user experience. He should be well versed with the various architectural principles and also hands on and ready to work on new generation technologies and should drive adoption of cloud based technologies. He should also be ready to take up a mentor role or lead the agile product team and drive the team’s strategy and define the success parameters for the team members and Dells business. Also candidate shall be able to work with product managers and other stake holders to coordinate well and to drive requirements understanding, and to have design thinking in building end to end solution products. Expectation from the candidate is for strong technical, programming and analytical skills.About Business Unit:Dells Digital IT organization, Global Corporate Business Systems (GCBS) team is hiring a Technical Lead - to design and develop our Flexible Billing solution product for the sales business enablement. Responsibilities will include understanding business requirements, product backlog grooming, define solution design and product development. Flexible Billing IT team is an essential part of the Dell Order Management Platform - building solutions that allows our sales business to onboard complex product offerings, attractive pricing models for Dell’s customers, and also to provide highly responsive services for customer care platform.We are looking for a highly skilled lead developer on UI technologies and good knowledge of back end integrations with micro services. Primary responsibility to work along with UX designers and develop complete UI application with rich user experience, designing front end web architecture, ensuring the responsiveness of applications and working alongside UX designers for web design features, among other duties.Full Stack Developers will be required to see out a project from conception to final product, requiring good organizational skills and attention to detail.Key Responsibilities:Developing full stack applications using modern web technologies.Embrace pair programming and Agile development.Developing front end website architecture using Micro FrontendDesigning user interactions on web pages.Developing integrations with back end website applications.Ensuring cross-platform optimization for web applications.Ensuring responsiveness of applications.Working alongside UX designers for web design features.Seeing through a project from conception to finished product.Designing and developing APIs.Meeting both technical and non-functional needs such as security, high performance and availabilityStaying abreast of developments in web applications and programming languages.Essential Requirements: Education: UG -B.Tech/B.E. - Computers9+ years of IT software design and development experienceIn-depth experience in developing UI applications using React JSExperienced with Javascript, TypeScript, CSS and jQueryHands-on experience with developing REST micro services and integration with UI application.Experience with deploying the applications using Cloud Foundry.familiarity with server-side languages such as Python, Java.Familiarity with database technology such as Oracle and Elastic Search and Redis.Excellent verbal communication skills.Good problem solving skills.Attention to detail.", "Role": "Team Lead/Technical Lead,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["TypeScript", "Java", "CSS", "UX", "Front End", "JavaScript", "UI Development", "JQuery", "Software Design", "React JS", "Python"]}