{"Job Title": "QA Engineer Manual", "Company": "AIT GLOBAL INDIA PRIVATE LIMITED", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "India", "Job Description": "   Job Description:     Primary Skills:      Proficiency in Software Quality Assurance, Functional Testing, Automated Testing, Performance Testing, Security Testing, Cloud Testing.       Proficiency in design of software testing approach and review, planning and executing test cases.       Review and update manual tests for missing functionality, details and verification points.       Good knowledge of any defect tracking system and any test management tool like JIRA or HP ALM        Basic knowledge in Test Automation (Selenium with JAVA, Cucumber, TestNG, Maven) would be preferable.        Proficiency in transforming manual scenarios into automation scripts using selenium and cross browser testing.       Adequate experience building Testing frameworks for Web application.       Basic knowledge of performance testing tools like JMeter, Load runner is preferable.        Ability to work with any test documentation and to create test documentation like test cases/test scenarios.       Ability to estimate effort on assigned tasks and create/update test cases according to identified scope.       Understand user requirements by studying the requirement document and soliciting further clarifications as needed.       Provide accurate and timely data to be used for test plans, estimates and metrics.       Experience in Agile development methodologies preferable.       Basic knowledge of JAVA, HTML, XML, JSON and JavaScript.       Good knowledge of SQL and Databases. Should be able to write and execute basic SQL queries.       An understanding of the software development life cycle as well as the business approach for the product.       Analytical skills & Decision-making ability       Ability to interact across various teams (Onsite/Offshore).       Secondary Skills:      Good interpersonal, communication (both written and verbal) and team working skills.   ", "Role": "Quality Assurance/Quality Control Executive,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - QA & Testing,", "Employment Type": "Full Time, Permanent", "Role Category": "QA/Testing/Documentation", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Maven", "Automation", "Testing tools", "XML", "Functional testing", "Javascript", "Performance testing", "HTML", "JSON", "Selenium"]}