{"Job Title": "Web Developer", "Company": "BAJAAO Music Private Limited", "Experience": "3 - 5 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": "You will work side by side with a prestigious vertical e-commerce company to improve your skills and advance the company as a whole. We listen to your ideas and use them. You can take on any design-related challenge while learning new skills and upgrading existing ones. Create an e-commerce experience that tells a story, builds a community, and sells products.     What you will work on:       Strong Hands on experience of Php & Magento.  Module development, customization & installations.Strong understanding of the Magento System Architecture, Design, Theming, Functionality Enhancements, Configuration. Follow a user-centered design process, UI UX integration experience.  Excellent knowledge of Frontend technologies like XML, HTML, CSS, Javascript, JQuery etc. Use Business Processes in Magento such as Structure of catalog, indexes, promotions, price generation logic, Architecture of checkout, paymentshipment methods, salesorder processing   MySQL Database experience   Good understanding of Zend framework preferable.   Design and development of native iOS and Android apps a big plus   Experience working in a team environment.            What we are looking for:     BEBtechBsc or Ms in Computer Science or equivalent.  3 years of software engineering or development experience with 2 years of recent coding experience in two or more of the following languages: Java, JavaScript, CC++, C#, Objective-C, Python, PHP.  knowledge of Magento and Php  Extensive understanding of Social Media application architecture  Experience working in a fast-paced environment   Excellent documentation and communication skills  A thorough understanding of cross-browser compatibility issues  Systems development, implementation, upgrades and analyses   Knowledge of enterprise coding standards.   Hands on experience in writing more complex code.   Knowledge of software methodologies.   Ability to  i) learn new and emerging technologies.   ii) lead a group to consensus, solve problems, and accomplish tasks.   iii) mentor and train.   iv) adapt to change.   General business knowledge and concepts.   Communication skills.   Team player  An ability to multi-task on multiple projects and tasks at the same time      ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - eCommerce, Internet Technologies,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["C++", "jQuery", "Coding", "XML", "MySQL", "Javascript", "PHP", "HTML", "Android", "Python"]}