{"Job Title": "Big Data Engineer", "Company": "Amantya Technologies", "Experience": "10 - 12 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": "  Qualifications   :    Bachelor s Degree or Master s Degree with 6 to 10+ years of experience in Computer Science or related field.   Strong experience in ETL and expertise in SQL.   Hands on expertise in Big Data Ecosystem with experience in Hadoop, Hive, Spark, Strome, Cassandra, NoSQL DB s, Spark, Scala.   Experience in distributed programming, scripting and writing SQL   Cloud Development experience like AWS   Experience in building scalable/highly available distributed systems in production.   Understanding of stream processing with knowledge on Kafka.   Knowledge of Software Engineering best practices with experience in implementing CI/CD, Log aggregation/Monitoring/alerting for a production system.   Good level of Expertise in production support related activities (issue identification, resolution)   Excellent communication skills   A self-motivated learner and mentor with strong customer focus and obsession with quality     Responsibility :     Develop high performance and scalable solutions that extract, transform, and load big data.   Design, build, test and deploy cutting edge solutions at scale, impacting millions of customers worldwide drive value from data at Client Scale   Experience performing root cause analysis on data and processes to answer specific business questions and identify opportunities for improvement.   Experience building and optimizing big data data pipelines, architectures and data sets involving petabyte and terabyte of data.   Interact with Client engineering teams across geographies to leverage expertise and contribute to the tech community.   Engage with the engineering team to provide seamless production support.  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Root cause analysis", "NoSQL", "PDF", "Production support", "cassandra", "SCALA", "big data", "Monitoring", "SQL"]}