{"Job Title": "Lead QA Engineer", "Company": "Droom Technology Pvt. Ltd.", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": " Want to be part of the most disruptive,   innovative mobile commerce start-  up in India with world-  class team,   long-  term vision,   and top global investors backing it up Dont just dream it.  droom it !As Lead QA Engineer,   you will be responsible for developing manual and automated testing strategies,   executing of test plans,   mentor other members of QA team,   developing management dashboards for reporting software quality metrics and trending. As an engineering resource at droom,   you will work on new challenges on daily basis,   you will focus on problem solving,   and you will interact with our Silicon Valley based technology team on a regular basis.  We will operate in world-  class and very fast-  paced engineering environment and you will be learning new things and making huge impact at the same time. An ideal candidate will possess following:  Engineering/  M. C. A in Computer Science or equivalent Experience in developing Android apps to work with low bandwidth networks. \t3 years of experience in testing,   test methodologies and automation tools. \tMust have experience of open source test automation tools. \tMust 2 years of hands-  on experience in testing web applications,   preferably implemented in PHP/  Java. \tKnowledge of Databases and Knowledge of Networking Concepts is preferable. \tKnowledge of Linux Based User Command preferable. \tExcellent verbal and written communication skills. \tExperience with bug tracking systems like bugzilla,   mantis,   Jira,   etc. \tFull understanding in software development process and prior experience in Agile or Extreme programming Methodology. \tExtremely good communications and interpersonal skills. \tAbility to collaborate across departments. \tResult oriented and ready to take ownership. \tDesire to make impact and high work ethics. Any Post Graduate Any Graduate", "Role": "Quality Assurance/Quality Control Executive,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "QA/Testing/Documentation", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["assembly language", "Six Sigma", "PMP", "Lead QA Engineer", "C", "JavaScript", "Real Time Operating Systems", ".NET", "HTML", "Oracle", "Python", "SQL"]}