{"Job Title": "Senior Engineer, Enterprise Business Systems", "Company": "Monotype Imaging", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Noida", "Job Description": " The Sr. Engineer will partner daily with members of SAP support team (internal or external) for upkeep of SAP environment as per the best practices and to resolve application issues, develop solutions and implement projects as per the organization requirements.       You will have an opportunity to:      ERP activities      Carry out reviews of technical specifications and program code for quality and adherence to best practice development standards   Develop and adapt technical solutions/options into detailed technical design documents, ensuring all functional requirements are met in the technical design   Adhere to procedures and documentation standards for ensuring proper transfer of changes from the development to test and production environment   Assist with system upgrades and support pack application and resolution   Implement system program corrections (Point upgrades, Patches, Notes, etc.)   Develop interfaces between systems applications   On-call support for production issues with a focus on quality and timeliness.   Operate, maintain and upkeep SAP landscape from BASIS perspective including system patches, DB management and overall technical architecture.        If you have:      Demonstrated success modifying, enhancing, and/or developing new functionality for business applications and interfaces (includes function modules, reports, data load programs, user exits, external applications, etc.)   Ability to Support systems by implementing, solving break/fix issues, and by providing design and development   Ability to troubleshoot, design and present solution alternatives   Collaborate and coordinate with other internal developers and outside consultants (on-shore and off-shore) to develop and maintain SAP landscape   Lead outside consultants in application development   Sound knowledge of SAP BASIS and ABAP technical knowledge.        Qualifications and Experience      Prior experience of ABAP language to deliver quality SAP solutions   Prior experience integrating SAP with other applications like CRM, Analytics using the various integration techniques   Prior experience with BASIS Administration   Prior experience developing in an MS-SQL Server environment   Prior experience providing technical support for SAP production environment   Resourcefulness and strong problem solving and troubleshooting skills with the ability to exercise mature judgment.   Self-starter with an ability to work independently as well as collaborate with large teams across multiple disciplines, orgs and geographies in a fast paced environment   A willingness to learn and understand business challenges in all cycles of the ERP environment from GTM to Finance   Experience in heavily integrated complex environments that include Salesforce, BW and Power BI is preferred.  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["ERP", "MS SQL", "SAP", "SAP Basis", "Application development", "ABAP", "Technical support", "Analytics", "CRM", "Salesforce"]}