{"Job Title": "Software Development Engineer II Frontend", "Company": "Zeta Inc.", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "    Software Development Engineer II Frontend         Zeta intends to replace many legacy systems in use by banks for processing payments. Banks need to leapfrog into an era of connected devices and omnipresent commerce. Banking should become an integral part of the commerce and enterprise systems, thereby enabling seamless consumer and business transactions. The average number of interactions an account holder may have with a bank would increase to 12-15 per day in the near term from the current average of 3-4 transactions per month.        These could grow to an unimaginably large number in future. Most banking systems aren t designed for this scale. In many ways, these systems are limiting the imagination of possibilities. We want this changed fundamentally, in an interoperable and regulatory compliant manner.      We build large-scale transaction processing systems that can work with many current and future payment networks. We build applications that help banks realize the value of this new approach early. We help banks to rapidly deliver the value of these applications to their customers.          We are looking for Front end developers to lead our web development projects @ Zeta. As a Front end developer, you will be a part of a passionate team of developers and work towards creating clean and artful design, translate high-level requirements into interaction flows and artifacts, and transform them into beautiful, intuitive, and functional user interfaces.     What is the job like    Designing and building a first of its kind web ecosystem that drives the business, engages and inspires our community of consumers and enthusiasts, and meets the functional needs of our customers and partners      Rapidly building prototype web user interfaces      Driving improvements in usability and interactivity of Zetas web properties      Implementation of a pixel-perfect UI/UX with a focus on driving customer engagement and creating beautiful and unobtrusive user flows      Collaborate across engineering, marketing, product management, customer support and design groups    Who should apply for this role    Candidates with 2 years of experience      Love programming and you are good at designing the user experience across platforms      Aware of various product design, functional design and usability factors in designing.      Well versed with visuals, typography, fonts etc      Rich experience in native JavaScript / JQuery / Bootstrap      Well versed with HTML5 CSS3      Handle UI integration with REST-APIs      Pro with cross-browser compatibility    Bonus Points for:    If you use SASS / LESS / POSTCSS      You use Git for everything possible      If you have published UI/UX related open source libraries      You have a good following on CodePen where people love your implementations      You speak Klingon, Elvish or Na vi    ", "Role": "Software Developer,", "Industry Type": "Internet, Ecommerce,", "Functional Area": "IT Software - eCommerce, Internet Technologies,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Product management", "jQuery", "Front end", "Bfsi", "SOC", "Web development", "Javascript", "Customer support", "Open source", "CSS3"]}