{"Job Title": "Python Support Engineer and Trainer", "Company": "QUOVANTIS TECHNOLOGIES PVT LTD", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Delhi / NCR", "Job Description": "Experience: 3-5 YearsIs software engineering your passion? Are you always hungry for challenges? Do you like totake risks? Do you always crave to learn more and more? Do you like to help others solve theirproblems? Do you like to solve complex problems by simple methods?We have: Culture to promote learning and growth by relentless focus on innovation A team of aces to work with Streamlined engineering processes woven around Agile methodology with the helpof tools Design led engineering focus. Opportunity to work on B2B and B2C products in various domains like healthcare &education Opportunity to work on new age domains like AWS, Healthcare, IoT, Data Analyticsetc.The ideal candidate should be a mid-level software engineer having worked with technologiessuch as Python, Postgres, SQL and other web engineering technologies. He or she should alsohave a passion for making the consumer healthcare experience better using communicationtechnology.Duties and Responsibilities:• Analyze and provide detailed defect reports and feature requests• Support Django app• Provide technical product support to customers as well as internal staff, through webinterface, via email and phone when appropriate• Document problem resolutions in our defect tracking system• Provide guidance to non-technical team members researching technical issues• Work with development, testing and documentation teams during product developmentcycle to ensure quality control• Investigate, develop and present formal and informal training on ms4 and ms5 products andsupport issues• Co-author training plans and support new product team members as well as key customers• Experience troubleshooting mobile applications and operating system problems Skills, Abilities, and Experience:• High level proficiency in Python language with at least 2+ years of professional experience inPython• Proficient in SQL and experienced in building data products• Proficient in Django• Python and SQL profiling/tuning experience• Good command over advanced Python concepts such as iterators, generators, listcomprehensions• SQL query writing and experience working with ORMs such as SQL Alchemy• Hands-on experience in SQL (Postgres)• Proficiency on the LINUX (CentOS) command line and in UNIX shell scripting• Working knowledge of OOP and Relational DB• Professional experience using RabbitMQ, Celery, Redis, and SQLAlchemy", "Role": "Technical Support Engineer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Admin/Maintenance/Security/Datawarehousing", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Python", "Linux", "Postgresql", "Django", "MySQL", "Unix Shell Scripting", "Redis", "Sqlalchemy", "SQL"]}