{"Job Title": "Software Development Engineer", "Company": "Jumbotail", "Experience": "3 - 5 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Software Development Engineer Jumbotail        We are looking for Software Development Engineers to form our initial core team to design and develop our marketplace platforms from scratch. These include scalable backend platform for customer & seller apps,  brands platform,  demand generation platform,  supply chain & logistics platform,  credit platform and several cross platform software components. This is an opportunity to fundamentally change the food and grocery ecosystem in India,  and impact billions of people through technology,  mobile,  and data science.  Location: Koramangala,  Bengaluru Requirements  Strong in problem solving,  object oriented design,  data structures,  algorithms and other computer science fundamentals. Strong coding skills. Professional experience in developing production- quality software in Java/ C++/ Scala. Expertise in Web Services,  Service- oriented architecture,  Databases,  NoSQL,  Distributed systems,  Cloud Technologies. Extreme software engineering skills to design and develop low- latency,  high availability,  internet- scale web services. Solid understanding of the full software development life cycle and software engineering best practices. Ability to understand business requirements and translate them into technical requirements. Own software design and development end to end from requirements to launch. Ability to collaborate with cross- functional teams to define,  design,  and ship new features. Have a startup mindset An athlete who can run at breakneck speed of a startup,  yet someone who can bring method to madness through processes suitable for different stages of the company early stage prototyping and rapid experimentation,  before product/ market fit,  after product/ market fit,  and scaling. Familiarity with Agile development,  Scrums,  continuous integration,  and test driven development processes Data driven product development strong focus on data backed engineering decisions. Ability to develop products incrementally in fast iterations. Ability to do collaborative problem solving and design/ build chaos resilient systems. Strong focus on software quality. Mentor junior developers,  and help build an excellent engineering team. Be a talent magnet attract great talent to join the core team. BE/ BTech in Computer Science from a top engineering school. 3- 5 years of professional software development experience.  If you  are strong on CS fundamentals and have great technical skills love solving real world problems using technology can apply first principles thinking to solve problems can envision a great future that you want create want to create the future you want to live in have the fire in your belly to get out of your cube and do something about your vision and passion work with some really smart people,  and still raise the bar for all of us can have fun and help your colleagues have fun doing all of the above  we would like to hear from you..", "Role": "Software Developer,", "Industry Type": "Media, Entertainment, Internet,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Supply chain", "Computer science", "Object oriented design", "Software design", "Algorithms", "Coding", "Software Development Manager", "Data structures", "software quality", "Logistics"]}