{"Job Title": "MTS Software Development Engineer", "Company": "Advanced Micro Devices, Inc", "Experience": "7 - 12 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "What you do at AMD changes everything \n\nAt AMD, we push the boundaries of what is possible. We believe in changing the world for the better by driving innovation in high-performance computing, graphics, and visualization technologies building blocks for gaming, immersive platforms, and the data center.\n\nDeveloping great technology takes more than talent: it takes amazing people who understand collaboration, respect, and who will go the extra mile to achieve unthinkable results. It takes people who have the passion and desire to disrupt the status quo, push boundaries, deliver innovation, and change the world. If you have this type of passion, we invite you to take a look at the opportunities available to come join our team.\n\nWhat Youll Be Doing But Not Limited \n\nResponsible for developing Gigabit Ethernet Device Driver for Client, Server & Embedded Platforms \n\nOptimization of drivers   What We Need To See \n\nStrong programming skills in C \n\nExcellent communicator, both written and verbal; \n\nExperience in Windows Driver development Experience.   Ways To Stand Out From The Crowd \n\nGigabit Ethernet Driver development is a good Plus.  REQUIREMENTS:  \n\nExperience in developing Ethernet Drivers in the Windows 10 Environment preferably on X86 Platform \n\nExperience on NDIS, Microsoft WDM, WDF Frameworks \n\nHighly proficient in C \n\nGood Debugging Skills & Usage of Microsoft Debugging Tools   \n\nBachelor's/masters degree in Computer Science/Computer Engineering, or equivalent  Must have 7+ years of strong software development experience\n\nLI-KS1\n\nJob Function:Software Engineering Find similar jobs: \n\nWe noticed that you are already a member of our Talent Community. Please enter your password to continue.\n\n required field\n\nSign in We noticed you have accounts in our Talent Community\" and Application\" systems. We take security seriously and need to verify your identity to synchronize your accounts.\n\nAccount Email:  Please follow these steps to synchronize your accounts. \n\n1. Reset your password: The \"reset password\" link will open in a new browser window. Return to this page to enter your new password.\n\n2. Enter your NEW password here: Account Verification 2. Enter your NEW password here: Your accounts have been successfully synchronized. Use your new password when accessing our systems.", "Role": "Software Developer,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["WDM", "server", "development", "c", "software", "Debugging", "usage", "developing", "Windows", "it", "microsoft", "tools", "Graphics", "Computer science", "Ethernet", "X86", "Gaming", "embedded", "Member Technical Staff", "programming"]}