{"Job Title": "Customer Support Officer - Admission Support ( International Process )", "Company": "Waterleaf Consultants Pvt. Ltd. ", "Experience": "0 - 3 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "ROLE SUMMARYThe Admissions Officer supports the Admissions Officer who is based out of the University campus.The Admission Officer is responsible for creating the student profile on the Student Database.Review documents submitted by students and reach out to students to obtain missing/correct documents. Send appropriate letters to the student regarding Application Fee Instructions, Conditional/Unconditional Offer Letters etc.Set and monitor standards within their own work area, with scope for improving operationalKEY ACTIVITIES &  RESPONSIBILITIESUnderstanding in detail the entry requirements and hold knowledge of qualifications as per courseAssess all applications efficiently and accurately in line with the University Admissions policiesPreparing and sorting student documents for data entryEntering data into student database (SYS) and checking to ensure the accuracy of the data that has been inputtedResolving discrepancies in information and obtaining further information for incomplete documents by efficient communication with recruiters/students/other required stake holdersResponding to information requests from authorised membersEnsuring conditional/unconditional offers letters sent to students/recruiters on time", "Role": "Telecalling/Telemarketing Executive,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["BPO", "Communication Skills", "International Call Center", "Customer Care", "Non Voice", "International Process", "International BPO", "International Voice Process", "Freshers", "Interpersonal Skills"]}