{"Job Title": "Medical Coder CPC Online Certification", "Company": "Yogam BPO", "Experience": "0 years", "Salary": "Not Disclosed", "Location": "Vellore, Nellore, Chennai Villupuram, Cuddalore Hosur, Chittoor Chennai, Chittoor Tirupati, Coimbatore Erode, Coimbatore Hosur, Chittoor Vellore", "Job Description": "Online Training available. Healthcare facilities prefer to hire candidates who have completed formal training and passed exams with quality for professional certifications. Completing online certification program will improve your employment prospectRequired Candidate profileTRAITS AND STRENGTHS NEEDED TO BE SUCCESSFUL IN MEDICAL CODING CPC WILLING TO WORK IN HEALTHCARE INDUSTRYDETAIL-ORIENTEDACCURATE IN WORKGOOD AT ANALYZINGLEARNING NEW SOFTWARE PROGRAMS+ TRAININGPerks and benefitsLEARN ABOUT JOB, EMPLOYMENT OUTLOOK, SALARY TRENDS", "Role": "Fresher,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Other", "UG": "BHM in Hotel Management, B.Arch in Architecture, B.El.Ed in Any Specialization, BHMS in Any Specialization, Homeopathy, Other Graduate, B.A in Any Specialization, Diploma in Any Specialization, B.Sc in Optometry, Food Technology, Home science, Bio-Chemistry, Biology, Microbiology, Botany, Nursing, Chemistry, Dairy Technology, Zoology, BAMS in Any Specialization, Ayurveda, BVSC in Veterinary Science, B.B.A / B.M.S in Management, B.Des. in Any Specialization, B.Com in Commerce, BDS in Dentistry, B.Tech/B.E. in Any Specialization, BFA in Any Specialization, B.Pharma in Pharmacy, B.P.Ed in Any Specialization, B.Ed in Education, Any Graduate in Any Specialization, BCA in Computers, MBBS in Medicine, B.U.M.S in Unani Medicine, Any Specialization, Graduation Not Required, LLB in Law", "PG": "DM in Any Specialization, Integrated PG in Any Specialization, CS in CS, M.Arch in Architecture, MVSC in Veterinary Science, LLM in Law, Medical-MS/MD in Any Specialization, M.Com in Commerce, Any Postgraduate in Any Specialization, M.Des. in Any Specialization, M.Ch in Any Specialization, CA in CA, Post Graduation Not Required, MCA in Computers, PG Diploma in Any Specialization, MFA in Any Specialization, MDS in Dentistry, Other, M.Pharma in Pharmacy, MS/M.Sc(Science) in Nursing, Zoology, Veterinary Science, Bio-Chemistry, Biotechnology, Microbiology, ICWA (CMA) in ICWA (CMA), M.A in Any Specialization, M.Ed in Education, M.Tech in Any Specialization, MBA/PGDM in Any Specialization", "Doctorate": "Ph.D in Advertising/Mass Communication, Doctorate Not Required, M.Phil. in Advertising/Mass Communication, Any Doctorate in Any Specialization", "Key Skills": ["microbiology", "biochemistry", "pharmacy", "Organic Farming", "Biology", "Plant Pathology", "fresher", "Botany", "medical billing", "life sciences", "physiotherapist", "Bioinformatics", "Dietetics", "Nutrition", "bpt", "gnm", "bsc nurse", "biomedical", "dentist", "Dietician", "ICD - 10", "medical coding", "Home Science", "CPC", "zoology"]}