{"Job Title": "Medical Coder CPC Online Certification", "Company": "Yogam BPO", "Experience": "0 years", "Salary": "Not Disclosed", "Location": "Nagercoil, Ooty, Thanjavur/Tanjore, Chennai( Madhavaram, Arakkonam, Perambakkam, Venus Colony, West Tambaram, Ponneri, Porur ), Namakkal Rasipuram, Nagercoil Erode, Erode Namakkal, Erode Tuticorin, Erode Tirunelveli", "Job Description": "Online Training available. Healthcare facilities prefer to hire candidates who have completed formal training and passed exams with quality for professional certifications. Completing online certification program will improve your employment prospectRequired Candidate profileTRAITS & STRENGTHS NEEDED TO BE SUCCESSFUL IN CPC MEDICAL CODING WILLING TO RELOCATE AND WORK IN HEALTHCARE INDUSTRYDETAIL-ORIENTEDACCURATE IN WORKGOOD AT ANALYZINGLEARNING NEW SOFTWARE PROGRAMSPerks and benefitsLEARN ABOUT JOB, EMPLOYMENT OUTLOOK, SALARY TRENDS", "Role": "Fresher,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Other", "UG": "B.B.A / B.M.S in Management, B.Des. in Any Specialization, BFA in Any Specialization, B.Arch in Architecture, BDS in Dentistry, BVSC in Veterinary Science, BCA in Computers, B.Ed in Education, B.Tech/B.E. in Any Specialization, B.P.Ed in Any Specialization, B.Sc in Optometry, Food Technology, Home science, Bio-Chemistry, Biology, Microbiology, Botany, Nursing, Chemistry, Dairy Technology, Zoology, B.Pharma in Pharmacy, B.A in Any Specialization, BAMS in Any Specialization, Ayurveda, BHM in Hotel Management, MBBS in Medicine, Other Graduate, LLB in Law, BHMS in Any Specialization, Homeopathy, B.Com in Commerce, B.El.Ed in Any Specialization, Any Graduate in Any Specialization, B.U.M.S in Unani Medicine, Any Specialization, Graduation Not Required, Diploma in Any Specialization", "PG": "ICWA (CMA) in ICWA (CMA), CS in CS, PG Diploma in Any Specialization, M.Ch in Any Specialization, M.Des. in Any Specialization, DM in Any Specialization, Medical-MS/MD in Any Specialization, M.Pharma in Pharmacy, M.Tech in Any Specialization, MCA in Computers, MBA/PGDM in Any Specialization, CA in CA, MS/M.Sc(Science) in Nursing, Zoology, Veterinary Science, Bio-Chemistry, Biotechnology, Microbiology, M.Ed in Education, MVSC in Veterinary Science, Post Graduation Not Required, MFA in Any Specialization, Any Postgraduate in Any Specialization, MDS in Dentistry, Other, M.A in Any Specialization, M.Arch in Architecture, LLM in Law, M.Com in Commerce, Integrated PG in Any Specialization", "Doctorate": "Doctorate Not Required, Any Doctorate in Any Specialization, M.Phil. in Advertising/Mass Communication, Ph.D in Advertising/Mass Communication", "Key Skills": ["microbiology", "bsc nurse", "biochemistry", "Vegetables", "Tai Chi", "Teaching", "Lecturer Activities", "fresher", "physiotherapist", "Mutual Funds", "bpt", "gnm", "biomedical", "dentist", "Dietician", "ICD - 10", "medical coding", "University", "Child Psychology", "Insurance", "medical transcription", "CPC", "pharmacy", "College", "zoology"]}