{"Job Title": "Medical Coder CPC Online Certification", "Company": "Yogam BPO", "Experience": "0 years", "Salary": "Not Disclosed", "Location": "Madurai, Mamandur, Kanchipuram, Chennai Perambur, Chennai Madipakkam, Chennai Salem", "Job Description": "Online Training available. Healthcare facilities prefer to hire candidates who have completed formal training and passed exams with quality for professional certifications. Completing online certification program will improve your employment prospectRequired Candidate profileTRAITS AND STRENGTHS NEEDED TO BE SUCCESSFUL IN MEDICAL CODING CPC WILLING TO WORK IN HEALTHCARE INDUSTRYDETAIL-ORIENTEDACCURATE IN WORKGOOD AT ANALYZINGLEARNING NEW SOFTWARE PROGRAMSPerks and benefitsLEARN ABOUT JOB, EMPLOYMENT OUTLOOK, SALARY TRENDS", "Role": "Fresher,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Other", "UG": "BFA in Any Specialization, B.P.Ed in Any Specialization, B.A in Any Specialization, BHMS in Any Specialization, Homeopathy, B.El.Ed in Any Specialization, Other Graduate, Diploma in Any Specialization, B.Arch in Architecture, B.Com in Commerce, B.Ed in Education, Graduation Not Required, BCA in Computers, MBBS in Medicine, LLB in Law, BHM in Hotel Management, BAMS in Any Specialization, Ayurveda, B.Tech/B.E. in Any Specialization, BDS in Dentistry, B.Sc in Optometry, Food Technology, Home science, Bio-Chemistry, Biology, Microbiology, Botany, Nursing, Chemistry, Dairy Technology, Zoology, B.Pharma in Pharmacy, Any Graduate in Any Specialization, B.Des. in Any Specialization, B.B.A / B.M.S in Management, B.U.M.S in Unani Medicine, Any Specialization, BVSC in Veterinary Science", "PG": "M.Des. in Any Specialization, PG Diploma in Any Specialization, Integrated PG in Any Specialization, M.Pharma in Pharmacy, ICWA (CMA) in ICWA (CMA), M.A in Any Specialization, Post Graduation Not Required, Medical-MS/MD in Any Specialization, M.Ed in Education, MFA in Any Specialization, M.Com in Commerce, M.Tech in Any Specialization, MBA/PGDM in Any Specialization, MDS in Dentistry, MS/M.Sc(Science) in Nursing, Zoology, Veterinary Science, Bio-Chemistry, Biotechnology, Microbiology, CS in CS, CA in CA, Any Postgraduate in Any Specialization, MVSC in Veterinary Science, LLM in Law, DM in Any Specialization, M.Arch in Architecture, Other, MCA in Computers, M.Ch in Any Specialization", "Doctorate": "Any Doctorate in Any Specialization, Doctorate Not Required, M.Phil. in Advertising/Mass Communication, Ph.D in Advertising/Mass Communication", "Key Skills": ["fresher", "life sciences", "bsc nurse", "Poultry", "Tai Chi", "medical billing", "Agriculture", "physiotherapist", "bpt", "gnm", "microbiology", "biomedical", "dentist", "Dietician", "ICD - 10", "medical coding", "HCPCS", "medical transcription", "biochemistry", "CPC", "pharmacy", "Animal Husbandry", "Animal Health", "Veterinary", "zoology"]}