{"Job Title": "Software Development Engineer-II Fullstack(Product Engineering)", "Company": "Exotel", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   What we are looking for   We are looking for technically very strong candidates, with a strong understanding of computer systems.    We want people who love designing and building infrastructure components and large complex services.    We are looking for engineers driven by a passion to create applications systems that can redefine the contact center communication space.     What you will do   You will be a part of the Product Engineering team at Exotel.    Specifically, we are looking for full-stack engineers for building and operating web apps and dashboards that help customers use Exotel in a variety of ways.    Responsibilities include end-to-end software engineering aspects: Designing and plan systems, services, and dashboard products Development Testing Deployment Instrumentation, dashboarding, and monitoring Debugging production issues and handling production incidents Stakeholder management Mentoring and technical evangelizing     Must-Haves    3+ years of full-stack development experience in product engineering organizations.    Bachelor / Masters Degree in Computer Science or equivalent.    Very strong in Computer Science fundamentals    Experience scripting in at least one of PHP / Ruby / Python / NodeJs    Expert in JavaScript, HTML, CSS with an understanding of CSS preprocessors including Sass, and LESS.    Good knowledge and experience of full-stack frameworks such as React.js, Angular.js, node js    Experience in full-stack development - ie, building the web API backend that would power your frontend.    Knowledge of different data stores, data modeling, and scaling them    Excellent written and verbal communication skills, with strong attention to detail and a head for problem-solving.    Team-player, flexible, and able to work in a fast-paced environment     Good-to-Haves    Experience / Interest in UX design and use of design tools    Experience in one of the languages like Java / Go / Scala / C++ / C / C#    Knowledge of Linux   Exposure to databases like Mongo, Redis, Mysql, or other relations DBS   Exposure to Concepts of Microservice design and distributed architecture   Exposure to telephony protocols, ISDN, SIP, WebRTC others like TCP/UDP, etc.    Exposure to build and deploy pipeline and tools    Knowledge of web services / REST APIs / SOAP / RPC. A \"DevOps\" mindset.    You own what you will develop.    Experience in using RDBMS (MySQL, Postgres, etc), NoSQL (Elastic, Redis, Aerospike, etc).    Communication skills - excellent written and oral communication to present complex ideas/concepts in a clear and concise manner; communicating with key stakeholders with work/project progress.  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["TCP", "C++", "Linux", "Data modeling", "RDBMS", "MySQL", "PHP", "HTML", "CRM", "Python"]}