{"Job Title": "MidLevel .Net Software Development Engineer", "Company": "Mitratech", "Experience": "2 - 4 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   Essential Functions       Responsible for object-oriented programming (OOP) and computer science foundations, such as memory management and low-level algorithm performance.     Responsible to design and optimize SQL Server 2008/12/16 JSON, Stored Procedures, Views, Triggers and Functions.     Responsible for developing and maintaining data warehouse comprising complex queries, stored procedures, views, and their tuning for the best run.     Responsible for developing and maintaining intuitive dashboards and reports over meaningful business data points using business intelligence tools.     Designing and working with n-tier architectures (UI, Business).     Maintain strong skills in Logic Layer, Data Access Layer along with some experience with service-oriented architectures (SOA).     Passionate about building high-quality systems with software implementation best practices while working as a self-motivated and responsible team player.     Deep knowledge of the .NET 3.5/4.0/4.5/4.6 Framework, including Visual Studio 2015, ASP.NET MVC, WCF, WEB SERVICES, REST WEB APIs and ADO.NET.      Good to have Skills:      Hands-on experience on any business intelligence tools, preferably Dundas BI.     Knowledge on PostgreSQL.     Knowledge on VueJs, IOC and design patterns.     Knowledge on warehousing concepts.       Required Skills and Experience      Constructively work together as a team, sharing ideas and resources.     Should possesses remarkable resilience and leadership skills.     A high degree of analytical and problem-solving abilities.     Excellent communication skills both written and verbal.     Candidate should be a self-motivated, independent, detail oriented, responsible team-player and exhibit exceptional relationship management skills     Think out of box, study the requirement, and do research on best practices     Should be ambitious     Strong knowledge on SOLID Principles      Education       Bachelor s degree from an accredited educational institution     Years of exp: 2-4 years    ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "SOA", "Memory management", "Postgresql", "JSON", "WCF", "Visual Studio", "Stored procedures", "Business intelligence", "Software implementation"]}