{"Job Title": "Medical Coder CPC Online Certification", "Company": "Yogam BPO", "Experience": "0 years", "Salary": "Not Disclosed", "Location": "Perambalur, Pudukkottai, Rajapalayam, Sivakasi, Srirangam, Tambaram, Tirunelveli, Tiruchirapalli/Trichy, Thoothukkudi/Tuticorin", "Job Description": "Online Training available. Healthcare facilities prefer to hire candidates who have completed formal training and passed exams with quality for professional certifications. Completing online certification program will improve your employment prospectRequired Candidate profileWHY BECOME A MEDICAL CODING / CPC PROFESSIONAL?WITH YOGAM BPO'S MEDICAL CODING CPC ONLINE TRAINING PROGRAM, YOU CAN LEARN FOUNDATION KNOWLEDGE WITH INSIGHT INTO THE COURSE.Whats-App  9789004777Perks and benefitsLEARN ABOUT JOB, EMPLOYMENT OUTLOOK, SALARY TRENDS", "Role": "Fresher,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Other", "UG": "B.U.M.S in Unani Medicine, Any Specialization, B.Des. in Any Specialization, Graduation Not Required, Diploma in Any Specialization, B.B.A / B.M.S in Management, LLB in Law, BHMS in Any Specialization, Homeopathy, B.Sc in Optometry, Food Technology, Home science, Bio-Chemistry, Biology, Microbiology, Botany, Nursing, Chemistry, Dairy Technology, Zoology, B.Pharma in Pharmacy, B.A in Any Specialization, B.Com in Commerce, B.Arch in Architecture, BAMS in Any Specialization, Ayurveda, BCA in Computers, MBBS in Medicine, Other Graduate, B.P.Ed in Any Specialization, Any Graduate in Any Specialization, B.Ed in Education, BFA in Any Specialization, BHM in Hotel Management, B.El.Ed in Any Specialization, B.Tech/B.E. in Any Specialization, BVSC in Veterinary Science, BDS in Dentistry", "PG": "MS/M.Sc(Science) in Nursing, Zoology, Veterinary Science, Bio-Chemistry, Biotechnology, Microbiology, M.Des. in Any Specialization, MDS in Dentistry, CA in CA, ICWA (CMA) in ICWA (CMA), M.Ed in Education, MFA in Any Specialization, CS in CS, M.Arch in Architecture, Post Graduation Not Required, M.Ch in Any Specialization, M.Tech in Any Specialization, MVSC in Veterinary Science, Integrated PG in Any Specialization, Medical-MS/MD in Any Specialization, MBA/PGDM in Any Specialization, M.Com in Commerce, Other, Any Postgraduate in Any Specialization, LLM in Law, DM in Any Specialization, M.Pharma in Pharmacy, MCA in Computers, M.A in Any Specialization, PG Diploma in Any Specialization", "Doctorate": "Any Doctorate in Any Specialization, M.Phil. in Advertising/Mass Communication, Ph.D in Advertising/Mass Communication, Doctorate Not Required", "Key Skills": ["Zoology", "biomedical", "biochemistry", "Tai Chi", "fresher", "medical billing", "life sciences", "physiotherapist", "HCC Coding", "US Shift", "bpt", "gnm", "microbiology", "bsc nurse", "dentist", "Dietician", "ICD - 10", "medical coding", "Non It", "medical transcription", "CPC", "pharmacy", "College", "Night Shift", "ITES"]}