{"Job Title": "Senior Software Development Engineer in Test", "Company": "Cloudreach Technologies India Private Limited", "Experience": "5 - 8 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "Job DescriptionWhat will your role be?The Senior SDET is responsible for defining and implementing strategies that enforce a high degree of diligence and confidence across Cloudreach software products. To achieve this they will work closely with both Product Management and Development teams to ensure the correct development and release controls exist and are mandated. The Senior SDET will also be responsible for designing and architecting automated testing solutions and processes. They will also actively mentor software engineers and more junior SDETs.Key ResponsibilitiesDesign & Architecture of automated frameworksDesign & Architecture of testing environments and dataTesting & Defect Management strategy formationJunior engineer mentorshipSDET Community promotionWhat are we looking for?Organization - Able to define roadmap items and specific tasks to achieve themIndependence - Able to operate with autonomy at a strategic engineering level and proactively maintain relationships with SDET stakeholdersTooling - Advanced uses of common test frameworks, BDD, TDD and codified test environment creationFunctional Testing - Experienced in defining efficient testing needs at system, integration and unit levels. Non-functional Testing - Experienced in definition and execution of security and load testing.Technical Writing - Advanced technical writing/reporting experience (dissertation or similar)Experience Required: Degree in Computer Science or technical discipline", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - QA & Testing,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Sc in Computers, B.Tech/B.E. in Computers, BCA in Computers", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["Software Development", "Bdd", "Defect Management", "Cloud Services", "SDET", "Computer Science", "Automation Testing", "Load Testing", "System Integration", "Technical Writing"]}