{"Job Title": "Software Development Engineer  -  Ad Tech", "Company": "Hotstar", "Experience": "4 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": " Software Development Engineer  -  Ad Tech    Bangalore, Karnataka   1. Engineering Ad Tech   Full time    About the Role     At Hotstar, we have 300 million users and capture close to a billion click stream messages daily. The engineering team at Hotstar is at the center of the action and is responsible for creating unmatched user experience. Our engineers solve real life complex problems and create compelling experiences for our customers.     In this role, you will form part of a team that will build infrastructure to process and stream video at scale. You will work closely with our product team to build new and compelling experiences for our customers!   The pace of our growth is incredible if you want to tackle hard and interesting problems at scale, and create an impact within an entrepreneurial environment, join us!  Your Key Responsibilities    You will build robust secure and scalable micro - services to power Hotstar applications     You will be responsible to implement RESTful services with a metric - driven API Gateway     You will ensure sub - second server response and will be responsible to implement relational, document, key, object or graph data - stores, index stores and messaging stores as needed     You will take ownership to run and maintain Cloud infrastructure     You will continuously evaluate relevant technologies, influence and drive architecture and design discussions   What to Bring    B.Tech/B.E. in Computer Science from a reputed college or related technical discipline with 4 - 8 years of experience in software development with strong expertise in Java     Experience with micro web frameworks like Play, Spring MVC, Node js, reactive programming     Exposure in building RESTful APIs with monitoring, fault tolerance and metrics (with something like Hystrix)     Experience with MySQL, NoSql (Cassandra, Redis, DynamoDB)      Experience in server - side services using ElasticSearch and ESB  -  Camel, ActiveMQ     Experience in JEE, Spring, Hibernate     Hands - on with AJAX and Javascript     Experience with AWS stack     High adaptability in a dynamic start - up environment  ", "Role": "Software Developer,", "Industry Type": "Internet, Ecommerce,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "activemq", "Hibernate", "Spring mvc", "NoSQL", "cassandra", "MySQL", "Spring", "Monitoring", "Ajax"]}