{"Job Title": "Project Manager", "Company": "KRDS Software Development Pvt Ltd.", "Experience": "3 - 5 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "   Your responsibilities    Strong process orientation and the ability to interface with cross- functional and geographically dispersed teams.      Write and maintain documentation of client s calls and requirements      Able to thrive in a fast paced, high energy and fun work environment that is agile (i.e. Scrum) and deliver value incrementally and frequently      Proven ability to take leadership role in projects that span multiple teams, ability to deliver on time working in a fast paced agile environment.      Articulate technology solutions to both technical and business audiences during conference calls, presentations and UAT release.      Quickly learn complex new ideas, technology and customer s requested features      Maintain close working relationships with Customers and in- house developers; champion application delivery, and provide technical consulting support      Conduct demonstrations (face to face / WebEx / Skype) and educate prospects on the capabilities of organization s services, as well as demos of the software developed by the inhouse teams      Gather Client s Application requirements, and coordinate with development, design and front end team to the scope and estimate effort required.      Technical Account Management: communicate on a regular basis with assigned customer accounts to identify any potential new opportunities for product sales and/or services.     Your profile    Preferably 3- 5 years of experience and 2- 3 years experience in handling International clients      Candidates with Digital Marketing and Social Media Agency background preferable   Excellent communications skills written as well as verbal      Good presentation skills      Knowledge on latest web technology and social media integration experience will be an added advantage      Ability to distill complex requirements into clearly defined application features, and actionable insights.      Understand customer s goals needs and articulate them into application features to achieve client s goals.      Comfortable spending after hours time to help customers, and coordinating with development teams.      Technical background experience (Mobile, PHP, XML, HTML, CSS, JavaScript) a plus      The ideal candidate will have strong analytical skills and troubleshooting skills and attention to detail      Creative solution seeker with Go- get- it- done attitude!   ", "Role": "Project Manager-IT/Software,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "Site Engineering, Project Management,", "Employment Type": "Full Time, Permanent", "Role Category": "Project Management", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Social media marketing", "Front end", "Social media", "Consulting", "Management consulting", "PHP", "Account management", "HTML", "Digital marketing", "Troubleshooting"]}