{"Job Title": "RPA Developer - Chatbot", "Company": "Contus", "Experience": "1 - 6 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": " We are looking for a RPA Developer - Chatbot to produce scalable software solutions. You ll be part of a cross-functional team that s responsible for the full software development life cycle, from conception to deployment.    Required Skills:    Any UG / PG in Computer Science / Information Technology    At least 1 year of experience required as a Robotic Process Automation developer    Experience in PHP, MySQL, Python, ASP.Net, JavaScript, VBScript, Excel, SOAP / REST Services    Certified or trained in UiPath / Automation Anywhere / Blue Prism    Strong Problem-Solving and Analytical Skills    Experience with one or more RPA technology (e.g. UiPath, Automation Anywhere, Blue Prism) apigee, etc.,    1 to 3 years of professional experience in programming (including scripting /coding), SQL, relational databases, and application development    Experience with Process Analysis, Design, Implementation, Business Technical Requirements, Problem-Solving, System Testing (UAT) and Bug fixes    Should be able to prioritise and handle multiple portfolios      Key Responsibilities:    Automate the process assigned    Work with clients to understand requirements and implementation of APIs    Integrate and develop various APIs and system to build logic flows for process automation    Work with various software development tools    Participate in code reviews, automated functional testing and other aspects of our quality assurance process    Fully participate in a scrum-based, agile development team    Up-to-date knowledge of technology standards, industry trends, emerging technologies and software development best practices    Candidate should possess excellent communication Analytical skills     ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Coding", "Functional testing", "MySQL", "Javascript", "PHP", "Application development", "Scrum", "Information technology", "SQL", "Python"]}