{"Job Title": "Senior Android Developer", "Company": "Contus", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": " We are looking for a Sr.Android Developer to produce scalable software solutions. You ll be part of a cross-functional team that s responsible for the full software development life cycle, from conception to deployment.    Required Skills:    Good analytical and programming skills in Java, Android 2.2 + SDK/NDK Development (Web Services APIs, LBS, UI, and XML, Layout Design, Social Network Integration, Content Providers, etc.), XML, JSON, SQLite3 and MySQL.    A handful of experience in tools like Android Studio, Eclipse and analytical tools like Find Bugs and PMD.    Basic knowledge about Hybrid Applications and ideas on publishing applications in the Android Market.    Knowledge of PHP-driven CMSes versioning tools like SVN will be an added advantage.    Should be able to do Client Interaction    Expertise in design and development of applications to Android devices/platform.    Maintain quality and ensure the responsiveness of applications.    Hands on experience with Android Studio, APIs and Database usage.    Expertise in automated test tools for Android applications.    Exposure to UI design principles and best practices.    Knowledge of the open-source Android ecosystem and the available libraries.    Experience in NDK/C++/Java/Android framework.    Hands-on experience with SCM tools and services such as Git, Gitlab, Gerrit, SVN, others    Familiarity with open-source toolchains.    Other GUI design tools and framework experience desirable.      Key Responsibilities:    Develop Android applications for mobile phone and tablet devices    Facilitate architecture discussions for new features and the overall app    Establish coding best practices and review regularly    Perform code reviews    Track app performance and optimize bottlenecks    Monitor key business metrics and root cause any declines    Create and maintain automated reports to ensure adequate test coverage    Work closely with other developers, QA, and project managers to ensure alignment of priorities, deliverables and deadlines    Collaborate with UX to ensure the app has a native look and feel, and closely follows the Material Design guideline    Reach consensus with the backend developers on data models and communication protocols using JSON, and implement according to specification.    Establish cross-team procedures to ensure backend API s are properly documented, and any changes are always backwards compatible with existing app versions    Promote the mobile team within the organization, and increase awareness of innovative mobile-only features we can deliver to adapt to the shift towards mobile while staying ahead of the competition    Be an enthusiastic and positive representative of our team as you interact with a variety of business partners     ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["C++", "Coding", "XML", "Eclipse", "MySQL", "PHP", "JSON", "SCM", "Open source", "Android"]}