{"Job Title": "Looking For QA Analyst - Manual Website testing", "Company": "POWER STORES E COMMERCE PRIVATE LIMITED", "Experience": "1 - 2 years", "Salary": "₹ 1,50,000 - 2,50,000 P.A. ", "Location": "Panaji/Panjim, Pune, Bangalore/Bengaluru", "Job Description": " POSITION FUNCTION:This is an important position at Webware. The job entails meeting the high testing standards set for our platform, reporting & working closely with the QA manager and the development team. Knowledge and/ or experience of E-commerce platforms would be an added advantage. We are looking for some amazing people to be a part of the Webware. The type of person we are looking for would want to be a part of something special and is self-motivated!TECHNICAL SKILLS REQUIRED:Diploma in software testing from any institute of repute. ISTQB is preferred.Highly proficient in manual testing (Different types of testing: Regression, Sanity, Smoke & Functionality related)Knowledge of software development lifecyclesKnowledge of defect reporting & bug trackingAbility to verify fixesMaintaining support documentationKnowledge & experience with writing test cases & test plansShould have successfully completed a software testing courseExperience or knowledge of the following would be an added advantage:Automation Tools: such as Selenium, QTP (Quick Test Pro)Bug Tracking Tools: such as JIRA, BugzillaLoad testingHTML, CSSExposure to CMS (Content Management Systems) + E-commerce platformsDUTIES & RESPONSIBILITIES:Work closely with the QA team & the development team for testingEnsure that testing methods are of high quality, and conducted in an efficient mannerUnderstanding the requirement for the project and deriving Test casesDeriving and preparing test dataExecuting Test Cases and finding bugs, bug reporting & trackingAbility to meet timelines for individual projects/ tasks assignedESSENTIAL SKILLS AND QUALIFICATIONS:Strong communication skillsAttention to detail and thoroughnessAbility to multitask and fast track work tasks to maintain schedules & requirementsAbility to work well in a group setting and as an individualAbility to prioritize work and execute tasks accordingly", "Role": "Technical Architect,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["manual website testing", "QA Analysis", "Manual Testing", "Manual Functional Testing"]}