{"Job Title": "Sr Angular Developer", "Company": "Translate By Humans", "Experience": "3 - 5 years", "Salary": "Not Disclosed", "Location": "Ahmedabad", "Job Description": "      We are looking to extend our talented web development team by bringing on board a highly experienced Angular Developer who enjoys a fast-paced, innovative environment where the team strives to push the limits of traditional software development daily. Our ideal candidate will create rich, interactive front-end solutions that fulfil our business requirements and further our brand mission.          Requirements         3 years of experience in using Angular to develop dynamic, highly interactive user interfaces              You have thorough understanding of Angular and its core principles              Familiarity with one or more JavaScript libraries (jQuery, Prototype.)              You have expertise in REST APIs development, the document request model, and offline storage              You have thorough and in depth knowledge of HTTP protocol and its working              You have experience in integrating applications with other applications which are having different authentication mechanisms like SAML/OAuth2/OAuth, etc              You have experience working and developing applications using services of cloud platforms like GCP/AWS/Azure              Build modular, testable, and reusable frontend modules in an innovative product line              Familiar with testing frameworks (Ex. Jasmine)              Test runner framework (Ex. Karma)              Keep yourself updated with new releases in Angular        ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["jQuery", "Prototype", "Front end", "GCP", "Web development", "Cloud", "Javascript", "HTTP", "AWS", "Testing"]}