{"Job Title": "Associate - PMO", "Company": "Analytics Quotient", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  Responsible to streamline application maintenance and deployment processes, workflows etc under the guidance of a project manager.   Manage a set of team members in their day-to-day tasks, planning, project support operations.   Create Standard Operating Procedures (SOPs) for repetitive tasks and ensure process adherence among team members.   Custodian of documentation and KT during project transitions from development to support phase.   Handle client communication, stakeholder management.   Continuously strive to mature processes to improve efficiency collaborating with project manager.   Excellent verbal and written communication skills.   Should have knowledge about sdlc and ways of working in an IT automation and/or maintenance and support environment.   Technology skills (not mandatory, good to have) - exposure to any BI platform; basic querying in SQL, basics of R, python etc.    QUALIFICATIONS    A minimum of 2-5 years post-MBA experience, candidates with management consulting or market research backgrounds with quantitative and team management skills are also welcome.   Experience in analytics, management consulting or software development project is also relevant.   Master s Degree in Business Administration from a Premier business school.   Salary including benefits will be based on prior experience qualifications and will match industry standards.   ", "Role": "Associate/Senior Associate -(NonTechnical),", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "B.B.A / B.M.S in Management", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Automation", "Team management", "project support", "Management consulting", "Market research", "Stakeholder management", "Analytics", "SDLC", "SQL", "Python"]}