{"Job Title": "Android Developer", "Company": "Droom Technology Pvt. Ltd.", "Experience": "2 - 7 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": "Want to be part of the most disruptive,   innovative mobile commerce start-  up in India with world-  class team,   long-  term vision,   and top global investors backing it up Dont just dream it.  droom it !\nAs a developer,   you will be responsible for developing some of the innovative and cutting edge,   highly scalable applications on Android. \nAs an engineering resource at droom,   you will work on new challenges on daily basis,   you will focus on problem solving,   and you will interact with our Silicon Valley based technology team on a regular basis.  We will operate in world-  class and very fast-  paced engineering environment and you will be learning new things and making huge impact at the same time. \nAn ideal candidate will possess following: \n\n2 years of experience in developing highly interactive Apps on android. \t\nExperience in developing Android apps to work with low bandwidth networks. \t\nStrong understanding of user interface and UIX on android. \t\nHave knowledge of Core Java\t\nExperience in working with remote data via REST and JSON\t\nDemonstrable experience in managing medium to large project and deliver it on time and quality. \t\nMust have passion for technologies and goes out of the way to keep updated with innovations in web technologies. \t\nAttention to detail and ability to conceptualize a concept. \t\nFull understanding in software development process and prior experience in Agile or Extreme programming Methodology. \t\nExtremely good communications and interpersonal skills. \t\nAbility to collaborate across departments. \t\nResult oriented and ready to take ownership. \t\nDesire to make impact and high work ethics. \t\nThis role requires working directly with senior management team.Any Post Graduate Any Graduate", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["assembly language", "Android Developer", "Six Sigma", "PMP", "C", "JavaScript", "Real Time Operating Systems", ".NET", "HTML", "Oracle", "Python", "SQL"]}