{"Job Title": "PHP Developers", "Company": "Contus", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "JOB SUMMARY \n\nWe are searching for outstanding web developers to be responsible for developing innovative, reusable web- based tools for progressive activism and community building. A Successful Candidate will have demonstrable experience building real applications in Good work environment and will be able to make a meaningful contribution from day one. You will be comfortable working with team members at all levels and departments within the organization. This is a Perfect Opportunity for young Developers looking to play a key role in creating enabling technology for a leading Web and Mobile based Company in Chennai. \n\nRESPONSIBILITIES \n\nKnowledge of software development life cycle. \nWork closely with Project Managers and other members of the Development Team to both develop detailed specification documents with clear Project deliverable and timelines and to ensure timely completion. \nDetermine appropriate architecture, technical solutions and make relevant recommendations to clients. \nCommunicate to the Project Manager and Team Leaders with efficiency and accuracy in any progress and / or delays. \nEngage in outside- the- box thinking to provide high value- of- service to clients. \nAlert colleagues to emerging technologies or applications and the opportunities to integrate them into operations and activities. \nBe actively involved in and contribute regularly to the development community of the CMS (Magento / Joomla / Drupal / Wordpress / Zend Framework / Cake PHP) . \nStrong debugging skills and ability to easily and quickly read and modify existing Code. \nStrong communication skills. \nKnowledge of other e- commerce is added advantage (prestashop, Shopify, OS commerce, OpenCart, etc...)", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["development", "technical", "software", "documents", "wordpress", "cms", "mobile", "specification", "joomla", "developing", "tools", "operations", "drupal", "web", "service", "debugging", "zend", "applications"]}