{"Job Title": "US IT Recruiter", "Company": "Zynom Technologies Pvt Ltd", "Experience": "2 - 3 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "2- 3 years,  Also open to new grads/  freshers with excellent communication skills! (English:  10/ 10 in reading,  writing and speaking)  Excellent communication skills- both written & verbalQualification:  Any Graduate Salary:  Open Job Description:  Role:  We work in Pacific (California)  Time Zone (Night Shift)  Evaluate candidate for the requirements on the basis of skills,  functionality,  domain,  experience,  qualifications.  Conduct 1st round of interview to assess communication skills,  fitment issues,  reason for change etc.  Build & sustain the network of potential candidates.  Negotiate rate or salary.  Maintain the database as per the skills,  experience,  location.  From long- term relationships with candidates.  Review and understand technical job requirement.  Review applicants to verify if the position requirements are met.  Format resumes,  meet client expectations.  Research on new technologies and terminologies.  Preferred skills to have:  Candidates should have technical recruitment experience in contract OR permanent staffing.  Experience in entire U. S.  Recruitment life cycle from sourcing,  screening,  selection,  salary/ Rate negotiation.  Source candidates from various sources like portals (Monster,  Dice CareerBuilder etc. ) ,  database,  networking,  references etc.  Also open to new grads/  freshers with excellent communication skills. :  (English:  10/ 10 in reading,  writing and speaking) .  Excellent communication skills- both written & verbal.  Self- motivated,  Confident,  Aggressive,  Target- oriented and a Go- Getter.  No of position:  5Apply Now Work Location: Whitefield,  Bangalore Experience/ Fresher: 2- 3 years,  Also open to new grads/  freshers with excellent communication skills! (English:  10/ 10 in reading,  writing and speaking)  Excellent communication skills- both written & verbal Qualification: ", "Role": "Recruitment Executive,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "HR, Recruitment, Administration, IR,", "Employment Type": "Full Time, Permanent", "Role Category": "HR/ Recruitment / IR", "UG": "Any Graduate in Any Specialization", "PG": "MBA/PGDM in HR/Industrial Relations", "Doctorate": "None", "Key Skills": ["Technical recruitment", "Target", "Staffing", "Writing", "Database", "Night shift", "Recruitment", "Open", "Verbal"]}