{"Job Title": "Database Developer", "Company": "Insigno Quipment Technologies (India) Private Limited", "Experience": "3 - 5 years", "Salary": "Not Disclosed", "Location": "Ahmedabad", "Job Description": "BE (Computers /  IT),  MCA,  M.Sc. or any equivalent degree Job Description : \n\nHand on experience on PGSQL/  PostgreSQL (minimum 1.5 2 years) & MS SQL (2005,  2008,  and 2012) Database Development\n\nDatabase Programming (Stored Procedures,  Triggers,  Functions,  SQL Jobs,  Packages etc.)\n\nDatabase and Server Management & Administration\n\nData migration between different Database Server\n\nGood understanding of Postgres MVCC Architecture\n\nStrong experience with PGSQL and MSSQL database administrator Task,  like database backup and restore plan,  database monitoring in aspect of high performance and high resource availability\n\nExperience with database high availability and load balancing concepts\n\nExperience with PGSQL table partitioning and its management\n\nExperience with PGAgent scheduled job\n\nExcellent troubleshooting skills for database transaction lock,  deadlock & blocked transaction\n\nGood in optimized query writing and database performance optimization\n\nRequire Skills : \n\nStrong understanding of database structures,  theories,  principles,  and practices\n\nUnderstanding of,  and experience with,  server- client computing and relational database environments\n\nGood understanding of the organizations goals and objectives\n\nGood interpersonal,  written,  and oral communication skills\n\nTechnical documentation skills\n\nAbility to present ideas in user- friendly language\n\nSelf- motivated and directed,  with keen attention to detail\n\nAble to prioritize and execute tasks in a high- pressure environment\n\nExperience working in a team- oriented,  collaborative environment\n\nGood written and oral communication skills\n\nExperience with data management and data processing flowcharting techniques\n\n\"In my experience with almost 5 software companies,  I have found this company to be the most competitive. Dave Smith,  Developer \n\n", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - DBA, Datawarehousing,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["MS SQL", "Data migration", "Data management", "RDBMS", "Postgresql", "Stored procedures", "Troubleshooting", "Monitoring", "SQL", "Technical documentation"]}