{"Job Title": "Software Engineer - Frontend", "Company": "Chowbotics", "Experience": "2 - 7 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": " Chowbotics is looking for a high-caliber frontend software developer to join its growing software team. The suitable candidate will have a go-getter attitude, strong computer science fundamentals, and a passion for delivering a great user experience.   RESPONSIBILITIES    Contribute to the frontend development for our Web and mobile applications.     Write clean, efficient, well-documented, and reliable code.     Write unit tests and automate execution of test cases to ensure that code quality meets a minimum set standard before it is handed to the software testing team.     Collaborate with the various stakeholders throughout the software development cycle to ensure timely delivery of high-quality software to our customers.     Debug customer-reported issues, identify bottlenecks, and design and implement solutions.    QUALIFICATIONS    Bachelor s or master s degree in CS/CE/IT or a related field.     Strong foundation in computer science and engineering: algorithms, programming, design patterns, MVC architecture, etc.     2+ years of experience as a software developer with fluency in frontend technologies: Javascript, Ajax, JQuery, Bootstrap, HTML5, and CSS3.     Working knowledge of one or more Javascript frameworks: React/React Native/Angular.     Good understanding of Web standards and best practices: RESTful Web services, CORS, JSON, HTTPS, etc.     Familiarity with Android- and iOS-based development is not required but would be a plus.     Experience in implementing unit tests and testing automation, and excellent debugging skills.     A team player with ability to work well with remote team members, including in overseas locations.     Excellent English communication skills and a flair for working in a fast-paced and results-oriented environment.  ", "Role": "Software Developer,", "Industry Type": "Food Processing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization, CA in CA", "Doctorate": "None", "Key Skills": ["jQuery", "Front end", "Chef", "Javascript", "JSON", "Customer support", "Test cases", "Ajax", "Android", "CSS3"]}