{"Job Title": "Software Development Engineer", "Company": "Fiddich Consulting", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Position Responsibilities: \n  Work closely with senior engineers to design,  implement and deploy applications that impact the Amazon.in business with an emphasis on Mobile,  Payments,  and e- Commerce website development. \n  Own the delivery of an integral piece of a system or application. \n  Management and execution against project plans and delivery commitments \n  Assist directly and indirectly in the continual hiring and development of technical talent. \n  Create and execute appropriate quality plans,  project plans,  test strategies and processes for development activities in concert with business and project management efforts. \n The ideal candidate will be a leader,  quick learner and be able to work independently. He/ she should be able to operate in a very fast paced environment where time to hit market is super critical. The candidate will need to balance technical leadership and savvy with strong business judgment to make the right decisions about technology choices.BASIC QUALIFICATIONS\n\n A Bachelor s degree in Computer Science or equivalent combination of technical education and work experience;\n 5 to 10 years of Software Development experience;\n Experience designing highly interactive web applications with performance,  scalability,  accessibility,  usability,  design,  and security in mind. If you don't have all of these,  that's ok,  but be excited about learning the few you don't know.\n Strong,  object- oriented design and coding skills (C/ C and/ or Java preferably on a UNIX or Linux platform).\n Solid software development background including design patterns,  data structures,  test driven development.\n Experience with distributed (multi- tiered) systems,  algorithms,  and relational and no- sql databases.\n Familiar with building complex web applications using Javascript /  AJAX,  XHTML,  CSS.\n Experience with or knowledge of jQuery,  Java,  Struts,  and other website technologies.\n Knowledge of Perl or other scripting languages a plus\n Software development experience in building highly scalable applications.\n Any previous experience in working with Big Data or leveraging machine learning in improving consumer experience is desirable.\n Excellent verbal and written communication skills.\n\n\n PREFERRED QUALIFICATIONS\n\n Master s degree in Computer Science,  Computer Engineering or related technical discipline\n Experience in eCommerce and Deep hands- on technical expertise\n Ability to handle multiple competing priorities in a fast- paced environment\n Experience working with service oriented architectures and web based solutions.", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["Unix", "jQuery", "Linux", "Project management", "Javascript", "XHTML", "Data structures", "Perl", "SQL", "Ajax"]}