{"Job Title": "ML Software Engineer", "Company": "Cargill India Pvt. Ltd.", "Experience": "3 - 5 years", "Salary": "Not Disclosed", "Location": "karnataka", "Job Description": "    KEY ACCOUNTABILITIES    The Machine Learning Software Engineer will develop software solutions with and for our business partners and customers, to digitize our products lines. We seek a creative professional who can build software prototypes to help our business partners interact and innovate with working software.     Collaborate with internal and external partners to understand and evaluate business requirements.      Provide designs, prototypes and implementations incorporating software engineering best practices, tools and monitoring according to industry standards.      With full-stack engineering capability, write well-designed, testable and efficient code.      Integrate software components into a fully functional software system.      Independently solve moderately complex issues with minimal supervision, while escalating more complex issues to appropriate staff.      Other duties as assigned     Qualifications   MINIMUM QUALIFICATIONS   PREFERRED QUALIFICATIONS   KEY BEHAVIORS    Bachelor s degree in a related field or equivalent experience      Fluent in English      Skills in a variety of programming languages and tools including Java, JavaScript, C, Python, Ruby (on rails), Grails, R, etc., with a preference toward open source technology.      Working experience with continuous integration and delivery practices      Knowledge of public cloud services (AWS, preferably) and application programming interface      Ability to travel up to 10%      Minimum of 4+ years of related work experience      Other minimum qualifications may apply      Bachelor s degree in science, engineering or computer science, Master's degree in computer science      Training certifications in software development      Five or more years in the software engineering and information technology solution delivery      Experience with mobile development technologies such as: Xamarin, Swift, jQuery, Bootstrap, Iconic, etc.      Create new and better ways for the organization to be successful.      Anticipate and adopt innovations in business-building digital and technology applications.      Hold self and others accountable to meet commitments.         Job       Information Technology        Primary Location       India-Karnataka        Schedule       Full-time   MINIMUM QUALIFICATIONS   Bachelor s degree in a related field or equivalent experience   Fluent in English   Skills in a variety of programming languages and tools including Java, JavaScript, C, Python, Ruby (on rails), Grails, R, etc., with a preference toward open source technology.   Working experience with continuous integration and delivery practices   Knowledge of public cloud services (AWS, preferably) and application programming interface   Ability to travel up to 10%   Minimum of 4 years of related work experience   Other minimum qualifications may apply   PREFERRED QUALIFICATIONS   Bachelor s degree in science, engineering or computer science, Master's degree in computer science   Training certifications in software development   Five or more years in the software engineering and information technology solution delivery   Experience with mobile development technologies such as: Xamarin, Swift, jQuery, Bootstrap, Iconic, etc.   KEY BEHAVIORS   Create new and better ways for the organization to be successful.   Anticipate and adopt innovations in business-building digital and technology applications.   Hold self and others accountable to meet commitments.  ", "Role": "Software Developer,", "Industry Type": "Food Processing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "jQuery", "Application programming", "Machine learning", "Javascript", "Manager Technology", "Open source", "Information technology", "Monitoring", "Python"]}