{"Job Title": "Principal Engineer (Java) - Inventory Order| Fortune 500 Client", "Company": "ANSR GLOBAL CORPORATION PRIVATE LIMITED", "Experience": "12 - 18 years", "Salary": "₹ 55,00,000 - 60,00,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": " ANSR is hiring for one of its Fortune500 clientsThe team within Global Technology is determined to be a global leader in supply chain technology. We are passionate about the company and all it represents: limitless drive, innovation, creativity, and possibilities for collaboration. We focus relentlessly on talent and are always looking for ways to encourage growth. As a Principal Software Engineer for the team, you willBe part of a mission critical team focused on building a high-throughput, low-latency, fault-tolerant supply chain platform that drives the companys Digital transformation and growth strategies.Serve as a technical expert for the software engineering team.Rely on an understanding of scalable, highly available, and consistent distributed systems.Partner with architects and other teams to ensure that the ecosystem of services remains loosely coupled and independently scalable.Design RESTful APIs following domain-driven design.Utilize experience in using inversion of control and creating infrastructure via code.Remain current with industry trends and lead development of key innovation features.Have strong communication skills, ability to manage up and down, solve complex problems, and being a supportive leader and team player is key.Successful candidates will exhibit the following:-A minimum of 12+ years software development experience-Leadership in a highly collaborative, multi-discipline development team environment-Experience working in a distributed/cloud-based environment (e.g. Amazon EC2, GCE, Rackspace, Azure etc.)-Experience in designing and implementing highly scalable web applications-Experience in micro service architecture, domain driven design, and RESTful Services using languages such as Java, Node, Scala or Python-Experience working with NoSQL data stores like Cassandra, DynamoDB, or MongoDB-Experience working with relational data stores like MySQL and Oracle-Experience with monitoring and tracing tools like Splunk, SignalFx and New Relic-Experience with continuous integration, unit testing, static analysis, and automated integration tests. Continuous delivery experience preferred-Exposure to Supply Chain domain areas like inventory management, order management, logistics management, warehouse management-Exposure to implementing or integrating with enterprise scale packages like SAP S4, IBM Sterling, Manhattan WMS-Working knowledge of Scrum and agile principles-Comfortable working in a fast-paced, results-oriented environment-Comfortable working with globally distributed and diverse teams-Commitment to and hands-on experience in performing technical code reviews-Excellent verbal and written communication and collaboration skills to effectively communicate with both business and technical teams-Bachelor's degree in Computer Science, Information Systems, or other relevant subject area, or equivalent experience. ", "Role": "Technical Architect,", "Industry Type": "Food Processing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Team Management", "Java", "NoSQL", "Cloud", "New Relic", "Splunk", "AWS"]}