{"Job Title": "Expert Sofware Engineer (Data Science)", "Company": "Colruyt IT Consultancy India Pvt. Ltd.", "Experience": "8 - 13 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "      Expert Sofware Engineer (Data Science)   Overall 8 years of experience    Handson experience in Python   Excellent SQL skills   Experience in SAS ,R   Experience in Java/Java script   Experience in Big Data technologies (Hadoop,Spark ,Scala,Kafka)   Data gathering and wrangling    To have expert knowledge of the data structures and to be able to build data flows and data sets for analysis.   Can be creative to transform new analyzes of Data Scientists into more widely deployable and robust structures for analytical solutions. Has intuition about when this can yield added value.    Analysis integration skills    General understanding of Data Science projects and workflows   Strong technical knowledge in areas such as:    Data architectures / database systems   Specifically Linux / Unix as operating system database systems   Distributed computing concepts in a data science context (eg avro; parquet; ... )   Computer networks   Software engineering: general programming knowledge (including code testing approaches; DRY coding ; concepts of software development service oriented)   Service development (building and maintaining APIs and interactive dashboards   Knowing and mastering the open source mentality   Version control (eg Git knowledge / gitlab runners / branching strategy   Knowledge of the advanced technologies related to big data in order to be able to use the most adequate technology in function of the need   To be aware of the best practices in data engineering     Business aware data science engineering:    Thinking along and developing E2E automated AI platforms (and everything needed for this) to build insights and bring them to the customer in an insightful and efficient way.   Together with the Buniness Analyst, the Data Scientist and the contact persons at specific business partners, responsible for building and prioritizing a longterm analytical roadmap.   Support the Data Scientists in translating their needs into specific research questions and hypotheses that can be addressed in a data science project (trajectory).   Responsible for the correct handling of the structure of an analytical base table.   Responsible for making the results of the analyzes correctly available   Rigorous in the control and stability and reliability of the produced code that must be output correctly.   Responsible for the delivery and follow-up of the analytical solutions within the lifecycle management.   Responsible for general support for my business partners in order to guide them on the path of data integration and data ownership.   Jointly responsible for the quality of the work and the professionalism of my team members.   Contact with business partners to identify business opportunities and priorities; building a good customer relationship   Translate business opportunities and priorities into data architecture   Collecting, understanding and integrating data in the context of supporting business opportunities   Making basic analytical tables that can serve as input for performance watch actors.   Making the results available to the performance watch actors using techniques for data manipulation and techniques for visualization.   Making available and maintaining Analytical platforms and the solutions built on them.   Work closely with Data Scientists to industrialize data science solutions by supporting the entire Data Pipeline and integration   Apply techniques of software engineering in data preparation, apply quality control of data science solutions   Industrialization of algorithms in processes   Infrastructural thinking in the design and architectural integration / optimization of the analytical platforms and related (Data Reservoir)   ", "Role": "Software Developer,", "Industry Type": "Food Processing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Unix", "data science", "Linux", "Architecture", "Coding", "Analytical", "Data structures", "Customer relationship", "SQL", "Python"]}