{"Job Title": "Fresh and tasty food delivery", "Company": "FreshMenu", "Experience": "1 - 3 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Fresh and tasty food delivery 77702EBA- B1E3- 402E- B98C- D4E65B6AC6A6 You might also like Mobile Application Developer IOS  FreshMenu is looking out for some awesome Android aficionados who ve developed the coolest apps on planet earth! If you ve had peeps go gaga over your app We d love to meet you asap!!!  Design and build advanced applications for the Android platform. -  We d love to sit by and see how you do it! Collaborate with cross- functional teams to define,  design,  and ship new features. -  innovation is what we utterly love! Work with outside data sources and API-  s. -  Our realm is just too big! Unit- test code for robustness,  including edge cases,  usability,  and general reliability. -  We love to taste our app before we serve it! Work on bug fixing and improving application performance. -  We like the app seamless like our food! Wish we could get better! Continuously discover,  evaluate,  and implement new technologies to maximize development efficiency. -  Madness over our app is what we d love to see,  hear and feel!  Desired Skills  1- 3 years experience in the Objective c . Minimum Bachelors in CS or equivalent experience. Expert in developing on the iOS platform,  Previous start- up experience is a plus. Should be good in object oriented design /  Java amp; IOS and custom UI components Experience working in Locations based Apps or Ecommerce   FreshMenu is at the core a food delivery platform that is on a mission to make your meal time experience simpler,  more pleasant,  and delightful. We believe everyone deserves to work in a welcoming,  respectful,  and empathetic culture. We live by our values and hire accordingly.   Launched in April 2014,  FreshMenu is one of the fastest growing food applications in India and is used by thousands of people every day. FreshMenu's investors include Lightspeed Venture Partners and Zodius Capital. We currently have three offices in India,  Bangalore,  Mumbai and Gurgaon.   Ensuring a diverse and inclusive workplace where we learn from each other is core to FreshMenu's values. We welcome people of different backgrounds,  experiences,  abilities and perspectives. We are an equal opportunity employer and a fun place to work. Come do the best work of your life here at FreshMenu.", "Role": "Sales Executive/Officer,", "Industry Type": "Food Processing,", "Functional Area": "Sales, Retail, Business Development,", "Employment Type": "Full Time, Permanent", "Role Category": "Institutional Sales", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Object oriented design", "Time", "Unit testing", "IOS", "Application", "Business Executive", "Asap", "life", "Android", "SIT"]}