{"Job Title": "Test Lead (WEB & Mobile Automation)", "Company": "Colruyt IT Consultancy India Pvt. Ltd.", "Experience": "8 - 13 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "  Responsibilities:     Design robust test automation scripts using Selenium, Cucumber and Java   Mastery of quality modeling and Test Automation using Selenium and Java   Expert in automation frameworks such as JUnit, Selenium, Appium, Cucumber   Develop and execute maintainable automation tests for functional, and regression test cases using Seetest (Appium Driver) and Webservices.   Hands on experience in test automation with Mobile Automation ,should be able to work on Selenium/Java Projects also with build tools like Gradle and Maven   Very Strong Knowledge on Java OOPS Concepts   Capable of creating framework, fixing framework, fixing and writing scripts    Mastery of quality modeling and Test Automation using Selenium/Java and Protractor/JavaScript   Expert in automation frameworks such as JUnit, Selenium, Appium, Cucumber   Having Experience working in Behaviourdriven development and Test-driven Development environments (BDD TDD) tools like Cucumber    Experience testing services using RESTAssured, SOAPUI.   Experience in developing test environments and configurations   Familiar with relational database design and good working knowledge of SQL.   Experience in testing enterprise solutions/products and databases   Having experience in creating end to end CI/CD (Continuous Integration/Continuous delivery) solutions using tools Jenkins   E-commerce domain will be plus   Adherence to the organizational guidelines and processes   Excellent verbal and written communication skills   Proven ability and desire to deliver projects on time with high quality   ", "Role": "Software Developer,", "Industry Type": "Food Processing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Maven", "Web technologies", "Database design", "TDD", "Javascript", "Test Lead", "test driven development", "Selenium", "Test cases", "SQL"]}