{"Job Title": "Solution Integrity Analyst for IBP", "Company": "Cargill India Pvt. Ltd.", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "karnataka", "Job Description": "           Position Purpose & Summary       The   Solution Integrity Analyst   ensures the   IBP application   functional/technical areas are well understood and managed from an end-to-end perspective and in alignment with the center-led portfolio roadmap(s), and region and global business priorities. This position will develop and maintain a deep understanding of the   IBP application   (or suite of applications) and will partner with Portfolio Solution Architects to facilitate alignment with global portfolio architecture and enterprise-wide architecture standards. This position is entrusted to proactively identify data requirements, application requirements, security/privacy requirements as well as infrastructure requirements and/or impacts and work with Technical Architects to address.         Utilizing a strong expertise in Demand, Inventory, Response & Supply Planning business processes and the   IBP   application that supports these processes, this position ensures solutions developed/procured are aligned to enterprise architecture standards and principles, leverage common solutions and services, and meet the financial targets (cost and benefits). This position is accountable for solution evaluation and early-phase project estimates which contribute to the business case.           The SIA is also responsible for staying current with emerging business and technology trends, promoting the art of the possible , and driving innovation investments throughout the assigned regional portfolio(s). This role is able to facilitate the difficult conversations involving balancing corporate strategies and local business requirements. This requires an ability to see multiple perspectives, steer discussions towards fact-based comparisons, and drive significant net value for the enterprise.                Principal Accountabilities              50%   Solution Definition, Confirmation,    and Development            Owns the conceptual, logical and Physical Architecture for an application (i.e.   IBP & APO  )             Responsible for ensuring the security architecture meets the requirements provided via TGRC             Responsible for the technical architecture for solutions within their scope             Key contact for the vendor(s) of your application(s) (including open source distribution vendors)             Responsible for ensuring Cargill roadmap items are included in vendor of your application(s) roadmap (including open source distribution vendors)             Support end-to-end application architecture integrity and the functional relationship across multiple projects and/or applications              Identifies key integration requirements to other solutions, understands the end-to-end flow of data, and ensures the integrity of data as it moves across the solution landscape             Develops solution conceptual designs and solution blueprints              Provides support and consultation for detailed design, deployment, testing and production support.              Responsible for maintaining solution integrity through the course of the project including controlling scope, managing solutions for change requests and clarifying solution capabilities during all delivery phases             Acts as part of the broader Cargill Architecture community to define and execute architecture processes.             Partners with the Center-Led Portfolio Solution Architect(s) to understand the application architecture for all capabilities within the OSC portfolio (meaning the application portfolio, key APIs, transactions, etc.) and the associated roadmap              Ensures region application architecture aligns with portfolio architecture and Enterprise Architecture standards/principles             30%   Business Partnership                Work with regional BRMs and businesses to establish clear connections between business goals and strategies and the process, data, and technology investments required to achieve them.                 Provide consultation and recommendations for business capabilities, business process design, business intelligence design, software development design/architecture, application frameworks, and/or interfaces during the design and ongoing care of solutions.                 Regularly interface with other architects, business analysts, process designers, application portfolio managers, business relationship managers, and enterprise subject matter experts to understand and evaluate application(s) capability needs.                 Responsible for the definition of the architecture and technology opportunities of the application based on new and emerging technologies. Independently establish priorities and strategies, ensuring they are consistent with business goals and economic viability.              20%   IT Innovation & Delivery              Drives improvement of architecture methodologies and services. Supports implementation, improvements, and proper utilization of architecture tools. Ensures the quality of architecture assets, and keeps them up-to-date. Develops and maintains architecture metrics.                Maintain knowledge of industry trends and utilize this knowledge to educate both IT and the business on opportunities to build better target architectures that support and drive business decisions.               Drive the definition of the architecture and technology opportunities of the application(s) based on new and emerging technologies.               Demonstrate knowledge of a wide variety of technology disciplines.               Participates in routine and non-routine construction, automation, and implementation activities, ensuring successful implementation with architectural and operational requirements met              Assist in the design of new testing methods and resolves routine and non-routine technical issues with minimal assistance. With minimal guidance, monitors systems capacity and performance.              Participates in disaster recovery activities and contributes to disaster recovery planning.         Qualifications          Education, Experience, Skills                  Minimum Requi  r  ed Qualifications              Bachelor s / Master degree in Business Administration, Computer Science or Management Information Systems;      OR equivalent experience            6 years experience with diverse operational, development and technology roles   in planning solutions   and hands-on experience in IBP application implementation                4 years experience with business process and solution design and improvement; knowledge of Demand, Inventory, Response & Supply Planning processes and solutions               Experience collaborating with regional teams to define business requirements and deliver solutions that meet business goals              Experience in developing integrated solutions involving process, data, and technology             Experience with business case development             Strong conceptual, strategic thinking, problem solving, technical and analytical skills            Leadership and interpersonal skills including teamwork, facilitation and negotiation           Ability to influence peers and leadership stakeholders             Strong written and verbal communication skills             Strong project management, planning and organizational skills             Proven ability to work effectively within a large organization that operates using matrix management structures             Ability to quickly comprehend the functions and capabilities of new technologies           Ability to travel, including internationally, up to 20%         Business fluency in English           P  r  efer  r  ed Qualifications           Working knowledge of     IBP & other Planning      Application like APO, llamasoft etc          Business strategy development           Knowledge of all components of enterprise architecture              Industry certification (Examples include ITIL, APICS, six sigma, etc.)        ", "Role": "Technical Architect,", "Industry Type": "Food Processing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Process design", "Business process", "Analyst", "Architecture", "Enterprise architecture", "Project management", "Manager Technology", "application architecture", "Business strategy", "Business intelligence"]}