{"Job Title": "Executive  Online QC", "Company": "PEPSI FOODS PRIV LIMITED", "Experience": "3 - 5 years", "Salary": "Not Disclosed", "Location": "Mathura", "Job Description": "  Main Purpose –    Vertical startup of green field plant with right quality product & building a quality culture in the plant.  Stabilization of shift quality operations in new green field plant.  Ensuring shifts KPIs such as WIP/ Leakages/ Zero red complain  Ensuring best quality of product and minimum customer complaints through stringent on-line quality control checks and finished product inspection  Implementing right quality control systems/standards for the processes, physical systems and environment.  Trouble shooting during online production to minimize wastage and ensure quality.  Responsible for maintaining GMP, GHK GLP and internal / external audits (HACCP, AIB, Personal Hygiene, Process audit).  Train and development of quality checkers.  Ensure quality of potato issued for production.   Scope– list in priority order the main accountabilities/deliverables of the role, including key measures. These should be clearly the responsibilities of the JOB HOLDER.  Ensuring that the quality of potatoes issued for production is as per the standard specifications   Conducting online quality checks in the process area to ensure that all Pepsico standards of quality are followed during the production process in shifts  Conducting visual inspection;  Ensuring that all key operating parameters of machines are in the specified range  Conducting analytical tests for  Deciding whether blanching is required - Hunter Color Test  Ensuring optimum utilization of fryer oil  Conducting 4 hourly checks on oil being used for frying for FFA, OV, PV, foreign materials, taste, odor and specific gravity  Comparing test results against gold standards oil usage charts  Deciding the mix of fresh and blended oil to be used for frying operations  Checking the fried chips after every hour for TPD parameters like PA, percentage oil in the chip, % of soft centered chips, blisters, dark flakes, clusters etc.  Measuring parameters like bulk density, moisture, seasoning and dimension for Non-PC products  Taking corrective actions to resolve problems thrown up by the tests   Conducting online quality checks and finished products’ inspection in the packaging area to ensure compliance with Frito Lay standards of quality  Conducting analytical tests  Communicating concern areas and corrective actions to the concerned operator, shift in-charge and production manager promptly  Consulting the quality manager in case of criticalities  Ensuring that the corrective action is implemented   Monitoring machines in the process and packaging area specifically for their effect on quality and ensuring minimum waste due to machine related factors  Filing these reports on a daily basis  Filling the Weak Link Form to record the results of the oil tests  Making a Daily Quality Report for the Quality Manager  Updation of reports  Ensuring that the operators make quality relevant entries in their log books after every  hour  Conducting regular quality wall meetings with the production and engineering personnel for discussing quality defects detected online and then deciding the measures to rectify the problems  Coordinating a “Take Action Wall” meeting  Comparing the product with the gold standard for appearance, flavor, texture and recording the ratings given to the product (ratings will vary between 0-10)  Deciding on appropriate action for the product on the basis of the test scores  Coordinating a Mini Wall Meeting after an hour of the Take Action Meeting to ensure that the recommended action has been carried out and the problem has been rectified  Calling for a “Hot Wall” meeting in case there is a critical problem  Conducting a weekly housekeeping audit to ensure implementation of safety and hygiene practices  Handling the hold material for minimizing wastages  Ensuring adherence to statutory laws (Weights and Measures & PFA )  Increasing awareness about statutory laws  Maintaining accurate statutory records  Effective resolution of customer complaints  Assisting the quality manager in analyzing root causes of complaint and developing a forward action plan  Implementing the action plan  Ensuring the complaint does not occur again  Participating in TPM activities for increased involvement in the functioning of the plant  Practicing a work culture that promotes company growth  Ensure compliance with SOX and perform all roles and responsibilities as a Control Owner of I2C process  Documenting all quality procedures, systems, standards, findings, hazards and corrective actions    Qualifications/Requirements    B.E / B.Tech ( Food Tech)    Exposure to food safety systems and ISO systems / 3 to 5 years exp.    Preferably Knowledge of FSSAI /HACCP/AIB and TPM.    Relocation Eligible: Eligible for Standard Relocation  Job Type: Regular    ", "Role": "Quality Assurance/Quality Control Manager,", "Industry Type": "Food Processing,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Quality", "UG": "B.Tech/B.E. in Production/Industrial", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Housekeeping", "Supply chain", "Analytical", "Consulting", "Packaging", "GLP", "Food safety", "GMP", "Monitoring", "Logistics"]}