{"Job Title": "Software Developer", "Company": "Syncfusion, Inc", "Experience": "0 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "We are conducting walk-in on March 24, 2021 for .NET Developers, 2020 Graduates (Freshers) Please find the details below:Software Developers: A unique opportunity at a product companySyncfusion is looking for hard working budding developers who are looking for challenging roles to transform their careers. If you like working on simple and repetitive tasks you will find our work environment challenging (to put it mildly!). As part of your job you will have opportunities to build world class products utilizing the latest technologies including .NET(WPF, Silverlight, ASP.NET, ASP.NET MVC, Windows forms, Windows Phone and WinRT), JavaScript, Xamarin, iOS, Android, Java and Big Data. The journey will be tough but after a couple of years working with us your career will become recession proof and can withstand any adverse job markets.Job Description:Develop and maintain components and applications for the web, desktop and mobile platforms.Work with some of the best UI/UX designers in the world to craft Stunning user interfaces.Regular appraisals to ensure quick growth if you deliver on the job.Eligibility Criteria:2020 Graduates with minimum 65% in UG & PG75% in SSLC & HSCNo gaps of any kindQualification :BE/ B.Tech, ME/ M.Tech, M.Sc, MCASkills Required:Expertise in one or more of the following platforms or languages - C#, JAVA, C++.For any clarifications please contact the Recruitment team email id: recruitment@syncfusion.com", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "M.Tech in Any Specialization, MS/M.Sc(Science) in Mechanical Engineering, Computers, Data Informatics, MCA in Computers", "Doctorate": "None", "Key Skills": ["C#", "Windows Phone", "Software Development", "Xamarin", "Windows Forms", "Winrt", "Silverlight", "Bold BI", "Javascript", ".Net", "ASP.Net MVC"]}