{"Job Title": "Immediate Requirement in Software Developer & Tester For Freshers", "Company": "Triotend Solutions", "Experience": "0 years", "Salary": "₹ 2,00,000 - 3,50,000 P.A. ", "Location": "Coimbatore", "Job Description": "Roles and Responsibilities :Immediate openings for Freshers Software Developer and Tester From 2015 to 2019.We are currently hiring freshers who want to build their career in the IT field.If you looking for an Entry in IT Field or People who are working in Non-IT Field also can apply.We are hiring People for Software Developer and Tester.Immediate joiners are prefered. Freshers and Non-IT experience candidate can apply for this job.Any graduate who passed out from 2015 to 2020 can apply for this job.Interested Candidates can Share Your Resume To My Id: giri@triotend.comHR RecruiterGiriprasath.M9994785066Desired Candidate Profile Qualification: BE, BTECH, BSC ,MSC, BCA, MCA, ME.Passed out Year: 2015 to 2020.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "BCA in Computers, B.Tech/B.E. in Electrical, Electronics/Telecommunication, Energy, Environmental, Instrumentation, Marine, Mechanical, Metallurgy, Mineral, Mining, Nuclear, Paint/Oil, Petroleum, Agriculture, Plastics, Automobile, Aviation, Production/Industrial, Textile, Bio-Chemistry/Bio-Technology, Other Specialization, Biomedical, Ceramics, Chemical, Civil, Computers, B.A in Maths, B.Sc in Electronics, Maths, Chemistry, Physics, Computers, Statistics, Dairy Technology", "PG": "MS/M.Sc(Science) in Chemistry, Physics, Computers, Electronics, Petroleum Engineering, Data Informatics, Systems Architecting and Engineering, Mechanical Engineering, Marine Engineering, Electronics & Embedded Technology, Chemical Engineering & Materials Science, Mechatronics, Civil & Environmental Engineering, Electrical Engineering, Industrial & Systems Engineering, Bio-Chemistry, Maths, M.Tech in Mineral, Chemical, Mining, Civil, Nuclear, Computers, Electrical, Petroleum, Electronics/Telecommunication, Plastics, Energy, Production/Industrial, Environmental, Automobile, Textile, Instrumentation, Other Engineering, Marine, Bio-Chemistry/Bio-Technology, Mechanical, Biomedical, Metallurgy, Ceramics, MCA in Computers", "Doctorate": "None", "Key Skills": ["Software Development", "Software Testing"]}