{"Job Title": "Software Developer", "Company": "fusionPOINT India Private Limited", "Experience": "0 - 4 years", "Salary": "₹ 3,00,000 - 7,00,000 P.A. ", "Location": "New Delhi, Delhi / NCR", "Job Description": " Seeking B.Tech/BCA/MCA graduates for a German MNC, with a complete understanding of application development, cloud services and support on various internal and/or Customer projects. The role will require the candidate providing the required support to customer along with development and consulting activities.Roles and Responsibilities  Desired Candidate Profile Technical Skills:Mandatory : Computer Graduate  or Experienced (0-4 years of experience) in Application Development.Strong understanding of Software Development with strong programming and Data Structures concepts.Knowledge of C#, ASP.Net, Node and/or Angular is preferred.Knowledge of Scripting with Javascript, Shell and/or VB.Good knowledge of SQL and/or NoSQL query language.Candidate should be able to work on both Windows and Linux environments. Good to have:Experience on working  with MEAN stack.Knowledge and/or experience of cloud management tools (Azure/AWS).Understanding of Databases (Relational/Non Relational)Understanding of Service Management/ Application Performance Monitoring will be an advantage.Others:Strong English language skills. Excellent Customer Service SkillsWilling to work in European hours or extended shifts as per requirementThe role would also require the person to be involved in other IT development processes along with regular trainings and hence should be open for learning new technologies  and tools. Job LocationCentral Delhi / Work from HomeAbout amasolHeadquartered in Munich, amasol AG is a specialized IT system integrator that supports well-known national and international companies such as BASF, Volkswagen, Porsche Informatik and Deutsche Telekom in successfully mastering the challenges of digital transformation.fusionPOINT India is one of the international office of amasol located in Delhi.As an IT system integrator, amasol supports its customers in optimizing and agile-izing their central IT services and in verifying these services internally and externally using specific measurement data.amasol pursues a multi-tier management approach consisting of:       Technology business management       IT infrastructure management       Application performance management       IT operations analyticsamasol's added value for its customers:       On the market since 1999,       Assumption of overall responsibility for the selection, procurement, implementation and successful operation of IT solutions,       Supervision of the entire life cycle of a solution in the form of operational support through to managed service,       Support with project tenders based on many years of project experience,       Manufacturer independence and solution neutrality,       Partner on the market for leading manufacturers such as CA, Dynatrace, Apptio (formerly Digital Fuel), Extrahop or Moogsoft       amasol sees itself as an \"advocate for customers\" in contact with manufacturers,       High self-resolution quota in support and thus short response times as well as effective escalation at the manufacturer in the event of serious problems,       \"Partner delivered\" support through the highest certification level with the manufacturer partners. amasol is entitled to provide \"partner delivered\" support for manufacturer partners, which requires the highest level of know-how and constant certification from the manufacturer.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization, BCA in Any Specialization", "PG": "MS/M.Sc(Science) in Any Specialization, M.Tech in Any Specialization, MCA in Any Specialization", "Doctorate": "None", "Key Skills": ["Application Programming", "Software Development", "Performance Management", "Database Development"]}