{"Job Title": "Platforms Software Developer", "Company": "Qualcomm Technologies, Inc", "Experience": "2 - 7 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  Key Responsibilities:     Ability to multitask in a paced environment   Capability to comprehend and capture accurate requirements   Define tasks and create work breakdown including estimation of tasks   Ability to prioritize requests and communicate priorities   Develop and test software of major scale and complexity to agreed timescales   Maintain firmware software components including defect investigation   Conduct software peer reviews   Create relevant documentation following the department s processes   Track hardware changes and understand impact on firmware   Design firmware components that require to be enhanced and adapted to existing design   Deliver high-quality firmware in line with the department s processes   Contribute to continuous development of the department s processes     Required skills     Excellent C and/or C programming skills with proven experience of writing efficient code for low powered and memory constrained systems   Knowledge of embedded platforms peripherals such as UART, SPI, I2C, I3C etc.   Knowledge of RTOS based environments required. Exposure to working with QP (Quantum Leap framework) or FreeRTOS is highly desired.   Strong understanding of ARM architecture especially Cortex-M series   Excellent trouble shooting and analytical skills that may be applied to resolve potential system issues   Strong communication skills with ability to evaluate and create design documentation detailing complex features and relationships   2-15 years of relevant industry work experience   Bachelors degree in Engineering, Information Systems, Computer Science, or related field   Extensive on-chip application development experience with a clear understanding of chip development life cycle and exposure to SoCs, peripherals and embedded environments.   Knowledge of realizing low-power use cases, sensors in the world of smart watches will be an asset.   Experience with chip bring up and sound knowledge of digital hardware along with ability to read board schematics.   Knowledge of IPCs, thread safe programming, memory management systems, SCONS based build system   Exposure to working on FPGA based emulation setups, debugging tools and use of utilities like logic analysers, oscilloscope, JTAG interfaces over Lauterbach/J-Link.   Ability to provide work breakdown for new features with feasibility study, effort estimates and risk mitigation   Knowledge of hardware sensors like Accelerometer, Gyro, Magnetometer, PPG, ECG etc. and software\\algorithmic sensors like Pedometer, Display sensors, Motion Detection etc. required.   Exposure to Qualcomm s SEE sensor architecture would be highly desirable.  ", "Role": "Software Developer,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["RTOS", "Computer science", "JTAG", "FPGA", "Debugging", "oscilloscope", "Application development", "Firmware", "Sensors", "SPI"]}