{"Job Title": "SOFTWARE DEVELOPER, CLOUD", "Company": "McAfee Software (India) Pvt. Ltd", "Experience": "5 - 12 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "    Role Overview:       Develops software as the primary job function; Designs, develops, debugs tests complex software in any field e.g., systems software, software development tools, applications, drivers, numerical methods, UIs, web. May work directly with companies developing and optimizing compilers, operating systems, and other software technologies. Usually holds an academic degree in Computer Science, Computer Engineering or Computational Science.     About the Role :     Develop solutions using AWS services that will be consumed across multiple services, devices and platforms.   Implement backend architecture that can scale to a large number of concurrent users.   Operate in Agile/Scrum methodology, building the service platform   Ensure reusable, testable and efficient code using Java and other related technologies   Develop automated unit test cases and functional test cases for all delivered, to be integrated to Automation framework and delpoyable to post-build test runs   Conduct code review with and for peers   Contributes to the development and achievement of organizational goals and objectives       About You :        5-12 years of experience in Java/J2EE, Spring boot, Spring security, Spring Framework, Rest API   Deep understanding of Design Patterns, OOPs concepts, Java and JEE technologies. Experience in Hibernate and Micro services   3 years of cloud/AWS development experience   Experience working with Amazon Web Services (AWS)/Azure/GCP   Experience with Cloud virtualization, Containers and Container orchestration (Docker) technologies, Kubernetes (NTH)   Experience with message brokers such as Kafka, RabbitMQ   Experience working in an Agile team environment where you have actively participated in all phases of the software development lifecycle including analysis, design, development, testing and implementation   Experience with deployment orchestration, automation, and security configuration management (Jenkins, Ansible, Terraform, CloudFormation)   Knowledge of user authentication and authorization between multiple systems, servers, and environments   Understanding of fundamental design principles and trade-offs behind scalable applications   A deep understanding of Networking and Systems programming    ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "automation framework", "Hibernate", "Automation", "Networking", "Configuration management", "Agile", "Software development life cycle", "Test cases", "Virtualization"]}