{"Job Title": "Sr. Software Developer", "Company": "Decision Point", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": " Role and ResponsibilityCandidate must have managed end to end tech projects in the analytics space. He/ She must identify scope change and lead efforts to develop, estimate, and communicate budget and schedule impacts of the project. He/ She should be perceptive, collaborative and strongly customer-orientated with demonstrated ability to build strong relationships with clients and internal stakeholders to ensure successful project implementation.Role and Responsibility What makes you a great fit ?  2+ years of experience in software development and hands on coding  Excellent Knowledge of Python  Familiar with REST api based application development.  Strong OOPS concept.  Strong knowledge of data structure and algorithms  Ability to write complex SQL (Familiar with all sort of Joins and window function for example)  Familiarity with Test driven development and Continuous Integration (CICD)  Strong knowledge and hands-on with code development tools (Pycharm, VS Code, Eclipse, GIT, Jenkins, Unit Testing Frameworks)  Familiar with Software development methodology like Agile methodology  Desire to learn and develop new tools and techniques and share with the team  Knowledge of JavaScript, AngularJS and Java would be a plus  Knowledge of Unix and shell scripting would be a plus  Knowledge of micro-services and serverless development would be a plus  Good analytical, debugging and tracing skills. Should be well-versed with clean code principles (SOLID, DRY, KISS). Exposure to secure coding is beneficial   Key reasons to Join Decision Point Development as a Subject Matter Expert in FMCG sales & marketing analytics domain, working directly with one of the top 5 global FMCG brands Work extensively with clients/ direct client interaction - There will be direct client interaction which will fasten your learning process and will enable you to master traits of strategy consulting i.e. from understanding business objective to analyzing data in a methodical way culminating with final output to be delivered to client Leave the lasting Impact on Business: You will also get to witness the impact of implementing of your recommendations/strategies as you will be working very closely with clients on day-today basis FastTrack Career Growth: DP provides you to choose your own career path; We have Fast-track career path for people who love challenges, are ambitious and wants to push their limits. This means high reward, challenging role where candidate can get promoted every year with handsome raises Young and dynamic culture: the average age here is about 25 years. There is a lot of energy flowing all the time. We work hard and party harder. Our work environment is very flexible, and we understand your work life balance. We take off to mountains or beaches to recoup at least once a year and ensure we get together at the end of each quarter.  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["algorithms", "Software Developer", "software development", "OOPS", "data structure", "REST api", "SQL", "application development", "Python"]}