{"Job Title": "Software Developer-Andriod & WebApp", "Company": "INTUITION PAYMENT SYSTEMS LLP", "Experience": "2 - 5 years", "Salary": "₹ 2,25,000 - 4,75,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": "                   We are looking for an Android & Webapp Developer and Software Tester to join our team of developers! We want a developer that possesses passion for pushing mobile technologies to the limits. You will work with our team of talented engineers to design and build the next generation of our mobile applications. And As an Application Developer, you will design and code functional programs and applications. You will work both as part of the team and individually. And As a Software Tester at our company, you will have the opportunity to work on new and exciting projects and develop your career.Roles & Responsibilities:Design and build advanced applications for the Android platform.Collaborate with cross-functional teams to define, design, and ship new features.Work with outside data sources and API's.Unit-test code for robustness, including edge cases, usability, and general reliability.Work on bug fixing and improving application performance.Continuously discover, evaluate, and implement new technologies to maximize development efficiency.Understand clients' applications requirements Identify key application featuresWork with other IT professionals to set specifications for new applicationsDesign creative prototypes based on specificationsWrite high quality source code to program complete applications within deadlinesPerform unit and integration testing before launchTroubleshoot applicationsFind bugs and offer timely solutions Test existing applications, identify deficiencies and offer solutions.analyzing users stories and/use cases/requirements for validity and feasibilitycollaborate closely with other team members and departmentsexecute all levels of testing (System, Integration, and Regression)Design and develop automation scripts when neededDetect and track software defects and inconsistenciesProvide timely solutionsApply quality engineering principals throughout the Agile product lifecycleProvide support and documentationDesired Candidate Profile:BS/MS degree in Computer Science, Engineering or a related subject2+ years of software development experience2+ years of experience in designing and building applications2+years of Android & App developmentHave published at least one original Android appExperience with Android SDKExperience working with remote data via REST and JSONExperience with third-party libraries and APIsWorking knowledge of the general mobile landscape, architectures, trends, and emerging technologiesSolid understanding of the full mobile development life cycleCritical thinker and problem-solving skillsTeam playerGood time-management skillsGreat interpersonal and communication skillsPerks & Benefits:commuter subsidyReferral bonusOccasional lunchesOccasional Company outingsAndroid equipmentWork in a team of experienced and highly skilled professionalsFlexible working schedule", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Mobile Applications", "Mobile Development", "Android SDK", "Application Development", "Rest", "Software Development", "Use Cases", "Integration Testing", "JSON", "Product Life Cycle"]}