{"Job Title": "Ios Software Developer", "Company": "Enkify Solutions Private Limited", "Experience": "2 - 5 years", "Salary": "₹ 3,00,000 - 6,00,000 P.A. ", "Location": "Pune", "Job Description": " Job DescriptionEnkify is a European origin software development company based in Bangalore, India. We are a promising and fast-growing company, and our vision is to create a unified platform and a holistic approach for the hospitality industry. We are looking for a talented and aspiring iOS developer, that will share our thirst of excellence and be able to give innovative ideas in order to enhance our goals and create new standards of our iOS applications mainly, for the hospitality industry products.Your primary focus will be the development of iOS applications and their integration with back-end services. You will be working along-side other engineers and developers working on different layers of the infrastructure. Therefore, commitment to collaborative problem solving, sophisticated design, and creating quality products is essential. The successful candidate will evidence a passion for delivering adaptive and creative solutions to update or create new applications, by staying up to date with best practices and emerging trends in software development.ResponsibilitiesDesign and build applications for the iOS platformEnsure the performance, quality, and responsiveness of applicationsCollaborate with a team to define, design, and ship new featuresIdentify and correct bottlenecks and fix bugsHelp maintain code quality, organization, and automatizationIntegration of data storage solutions (mostly SQL)SkillsProficient with Objective-C Experience with iOS frameworksKnowledge of advanced app architectures (e.g. MVVM).Experience with offline storage, threading, and performance tuningFamiliarity with RESTful APIs to connect iOS applications to back-end servicesKnowledge of other web technologies and UI/UX standardsUnderstanding of Apples design principles and interface guidelinesKnowledge of Apple Push Notifications service (APNs)Knack for benchmarking and optimizationSolid understanding of full development life cycleProficient understanding of code versioning tools  GitFamiliarity in unit/UI Testing Development", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Ios Development", "Objective C"]}