{"Job Title": "Software Developer", "Company": "SITA", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "New Delhi", "Job Description": "  As a Software Developer, you a part of our integration services team. You will be accountable for connecting the needs of businesses with the new possibilities that come with technological progress.    Reporting to the Software Development Manager, you will be a part of the integration services team responsible for getting new applications ready for rollout, and ultimately guiding customers to select and implement the right technologies to transform their businesses.     What you will do     Develop applications using Java technologies.    Analyze the business users? needs, then design and develop an application or leverage existing technology with customized enhancements to provide a solution.   Develop application modules, applying standards for programming, naming, security, and performance.    Provide proper code documentation and implement configuration changes to    Packaged software applications to meet business requirements.    Document and assist in defining requirements, creating documents to ensure the applications meet their expectations.    Maintain and repair applications to keep them performing in accordance with technical and functional specifications.     Who you are      Passionate about solving problems and love every aspect of the full-stack software development life cycle.    Able to pivot and iterate quickly to implement the solution, and also share the learnings with the partnering teams.    Highly collaborative and great at building strong partnerships with the business stakeholders, product managers, and engineering teams.    You have experience with Java and its ecosystem of frameworks and build tools    You have hands-on experience in using Azure DevOps    You have a working knowledge of DevOps tools (Git, Jenkins, Sonar, Nexus/Artifactory ?)    You have a working knowledge of cloud computing and storage, including public cloud vendors (AWS, GCP, or Azure).    You have experience in agile development, software design patterns, continuous integration, test-driven development, and version control.   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Cloud computing", "Software design", "Version control", "GIT", "Aviation", "GCP", "Software development life cycle", "test driven development", "Information technology", "Operations"]}