{"Job Title": "Senior Software Developer _C & networking", "Company": "Hewlett Packard Enterprise", "Experience": "6 - 12 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  Analyzes, designs, programs, debugs, and modifies software enhancements and/or new products used in local, networked, or Internet related computer programs, primarily for end users.    Using current programming language and technologies, writes code, completes programming, and performs testing and debugging of applications.    Completes documentation and procedures for installation and maintenance.    May interact with users to define system requirements and/or necessary modifications.     Education and Experience Required:       Bachelors or Masters degree in Computer Science, Information Systems, or equivalent.   Typically 6 years experience.       Required Knowledge / Skills and Abilities     BTech/MTech/MS degree from a reputed college  - Expected industry experience 6-12 years.  - Very good programming experience with   C   - Good in system programing in Linux Environments (multi-threading/socket programing/shared memory/system calls/synchronizations)  - Good Knowledge and Understanding of Embedded software design and Debugging Techniques.   - Hands on experience with standard debugging forensic tools to isolate the problem  - Absolute hands-on and can-do attitude is expected.  - A fast learner and quick thinker is desired  - Ability to question the status-quo  - Solid grasp of computer science/software engineering concepts around data structures,   algorithms, object-oriented design, distributed computing and cloud computing paradigms    Desired   - Experience coding cloud applications and embedded systems strongly preferred  - Reasonable knowledge in networking fundamentals and protocols  - Experience in designing complex scalable software infra architecture.  - Experience with Python and go programming language.    ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Object oriented design", "Cloud computing", "Software design", "Linux", "Coding", "Debugging", "Data structures", "Python", "Embedded software"]}