{"Job Title": "Senior Software developer", "Company": "Siemens Limited", "Experience": "6 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   We re looking for dedicated people with the skills and vision to build a better tomorrow. Join our Smart Grids and Infrastructure team as a Software Developer and help us create the technology that will transform entire industries, cities and even countries.   Before our software developers write even a single line of code, they have to understand what drives our customers. What is the environmentWhat is the user story based onImplementation means trying, testing, and improving outcomes until a final solution emerges. Knowledge means exchange discussions with colleagues from all over the world. Join our team and enjoy the freedom to think in completely new categories.    What part will you play!         Responsible for Design of software solutions based on requirements and within the constraints of architectural /design guidelines.       Derive software requirements and software functional specification, validate software requirements, provide software feasibility analysis and software effort estimation.       Accurate translation of software architecture into design and code.       You will guide Scrum team members on all design topics implementation consistency against the design/architecture       Guide the team in test automation design and also towards implementation of the same       Use your skills to move the world forward!         You should have experience of 6 to 8 years in Advanced C# knowledge (Task-based / Asynchronous programming experience)       Good knowledge of WPF       Experience in working with XML and Windows application development.       Good knowledge in Web APIs       Work experience in unit testing frameworks       Competence in Angular, BIRT, D3 controls       Practical knowledge on Profibus or Profinet or Modbus      ", "Role": "Software Developer,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["XML", "Windows application", "Architectural design", "Siemens", "Manager Technology", "Application development", "Scrum", "Unit testing", "WPF", "Profibus"]}