{"Job Title": "Senior Software Developer I (C , Windows)", "Company": "Siemens Limited", "Experience": "5 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   Change the future with us !!!      Develops architectural designs and independently develops complex system designs that meet the product requirements.   Design, Debug , code, and maintain efficient, reusable, and reliable C code to develop application server(backend)IMM.   Consideration of the system architecture to build interfaces and the advance in software technology.   Provide technical leadership to the team, collaborators and customers.   Define, articulate, and apply and implement architectural principles and patterns; Perform architecture reviews and assessments.      Use your skills to move the world forward !!!      We are looking for professionals with 5 to 8 years in Software development   Expertise in C , Threading (Windows), synchronization, VB programming and C 11 advanced concepts.   Thorough knowledge of the standard library, STL containers, MFC, COM and algorithms.   Knowledge of low-level threading primitives and real-time environments.   Excellent code analysis and Debugging skill (Microsoft Visual Studio IDE).   Experience architecting and deploying multi-tiered applications, using, and applying Architecture and Design patterns.   Basics of Oracle Database like tables, SQL statements.   Added advantage with Know-how in QT.   Know how on VB6 and Scripting like Perl, Batch etc.   Knowledge in Static code Analysis and Unit Testing.    ", "Role": "Software Developer,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["System architecture", "Backend", "Perl", "Windows", "MFC", "Visual Studio", "Unit testing", "VB", "microsoft", "SQL"]}