{"Job Title": "Senior Manager, Software Developer", "Company": "ICF Consulting India Pvt Ltd", "Experience": "8 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Position Summary: The Loyalty & Customer Technology technical team requires an Senior Manager role to lead a team of solution architects and engineers to direct all technical aspects of one loyalty client and lead product innovations on ICF Next’s Tally platform. As the technical owner and leader of one loyalty client, you will be a client facing leader who is passionate about technology, analyzing client needs, solutioning, and driving an operationally excellent team. As the technical lead, you will have ownership over a growing team which includes solution architects, software engineers, and data team members. In addition, you will regularly interact with the client, account leads, technical project managers and business analysts leads to continue to drive innovation and deliver technology solutions on the Tally platform for the client.The successful candidate will be adept at leading in a dynamic environment, know how to deal with ambiguity, drive a team to solution and deliver and be involved in all aspects of the loyalty solution for the client.Primary Responsibilities30% Lead strategic planning for technology development and platform innovation. This will include client solutioning, application architecture, design, code reviews, build automation and gathering technical requirements.20% Build successful relationships with internal and external clients to drive adoption of technical solutions and resulting revenue streams. This is a client facing role and will be required to occasionally travel to client (<10%).20% Manage and oversee one engineering team to deliver and operate projects on time and within budget.10% Assist project managers to estimate development of application features, create a schedule for the development process, and assign resources to accomplish those tasks. Providing input into project planning working with project managers10% creating and communicating technical specifications and working in conjunction with business analysts to craft functional requirements for all projects on all work streams for the client.10% Aid in the \"hands-on\" development of technical solutions for client projects.Performance Objectives:Develop an understanding of the client and loyalty application supporting the client within 60 daysUnderstand the client and client program on the Tally PlatformUnderstand the full software stack.Ability to understand the capabilities, features, and module dependencies of the loyalty platform, including APIs.Understand Loyalty & Customer Marketing documented software lifecycle, source control and branch management guidelines, and code review processes. Document, Educate, and EvangelizeAbility to produce architectural and design documentationAbility to utilize documentation to educate and lead others in the delivery of the client requirementsAbility to articulate, coach, and mentor others on understanding the platform including both internal teams and clientsCollaborate with other parts of the Loyalty & Customer Marketing Tally Technology team to leverage and expand the use of the core Tally platform Communicate technical requirements to various audiences, including clients, project managers, business analysts, software engineers, and QA analysts.Effectively lead the team following Loyalty & Customer Marketing’s software delivery framework.Lead and work very closely with Solution Architect and Software Engineers to drive and review solutions.Drive a quality mindset within the team.Inspire innovationContinually reduce technical deck and continue to stay aligned with Tally core product roadmapRequired Qualifications: Bachelor’s degree in Computer Science, Management Information Systems, Software Engineering, or a related field, plus, 8+ years progressive, post-bachelor’s software engineering experience using Java and/or J2EE. Experience with building enterprise applications in Java, particularly REST/SOAP APIs and microservices.Experience in leading and inspiring a team to deliverExperience in a client facing rolePrior experience must include designing and developing Java and/or J2EE web applications, including developing presentation layers using Single Page Architecture JavaScript frameworks; working with Spring frameworks, web services, and microservicesStrong competency for application performance tuning.Strong competency for delivering applications with front-end technologiesExperience working with industry standard enterprise web applications and technical infrastructure, including design and performance tuning.Desired technical proficiencies:JavaSQL ServerElasticSearchKafkaContainerization – Openshift, Kubernetes, DockerJavascript Frameworks – Angular, Node, React, VueApplication Performance TuningContinuous Delivery Automation utilizing Atlassian (Jira, BitBucket, Bamboo, Confluence, HipChat)", "Role": "IT/Networking-Manager,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Admin/Maintenance/Security/Datawarehousing", "UG": "B.Tech/B.E. in Computers, BCA in Computers, B.Sc in Computers", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Java", "Rest", "Vue", "J2Ee", "Spring", "SOAP", "Web Services", "Microservices", "Angular", "Javascript Frameworks"]}