{"Job Title": "Senior Software Developer - Python (3+ Yrs) - Fast growing AI startup", "Company": "Clootrack Software Labs  ", "Experience": "2 - 5 years", "Salary": "₹ 10,00,000 - 20,00,000 P.A. ", "Location": "Kochi/Cochin, Bangalore/Bengaluru, Anywhere", "Job Description": "We are looking for a python developer to be part of our core engineering team. You will work on core modules of our application, and also would be expected to develop new modules from scratch. To apply for the role please complete the simple task here: https://forms.gle/UchxooahdVGJepfr6. The task should not take more than 15 minutes of your time.ResponsibilitiesWork closely with engineering and product managers to detail the engineering scope.Develop different modules of the product from scratchDevelop robust AI and NLP algorithms to solve customer problemsFollow coding standardsEnsure the code developed is fully functional and bug freeCollaborate with other team members and stakeholdersSkills And QualificationsYrs of experience: 3+ yrs on Python and DjangoProficient understanding and hands on experience on Python and DjangoProficient understanding and hands on experience on Data structures and algorithmsProficient understanding and hands on experience on Object Oriented ProgrammingVery good problem solving capabilities and aptitudeGood to have - Experience in Machine Learning and Natural Language Processing (NLP)Good team player with drive to achieve morePassion to be core member of a fast growing startupTo apply for the role please complete the simple task here: https://forms.gle/UchxooahdVGJepfr6. The task should not take more than 15 minutes of your time.Currently we are working remotely.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Sc in Any Specialization, BCA in Any Specialization, B.Tech/B.E. in Any Specialization", "PG": "MCA in Any Specialization, M.Tech in Any Specialization, MS/M.Sc(Science) in Any Specialization", "Doctorate": "None", "Key Skills": ["Django", "Object Oriented Programming", "Python", "Software Development", "NLP", "Algorithms", "Artificial Intelligence", "Data Structures", "Natural Language Processing", "Machine Learning"]}