{"Job Title": "Junior Firmware /Embedded Software Developer", "Company": "BreathX Technologies Pvt Ltd", "Experience": "2 - 4 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "About the roleWe are looking for a Junior Firmware or Embedded Software Developer to join our growing team. This is a remote position that can also work out of our Mumbai or Bangalore offices. As a firmware developer working on our dev team, you will work closely with hardware, software, and verification specialists throughout various stages of the development cycle. You will gain exposure to and apply various technical standards and technologies, and get to demonstrate your skills in design, development, performance tuning, and documentation. You will also be involved in: research, investigation, and definition of new areas of technology that will enhance new and existing products. Contributing to and maintaining the embedded software base Contributing to the Software and system Architecture Participating in code reviews Producing high quality design documentation Developing and executing system and unit testsRole Requirements: Computer Engineering / Computer Science Bachelor's Degree Familiarity with the design, test and integration with embedded firmware, FPGA/RTL, PC based software Knowledge of system verification and validation methodologies. Knowledge of computer hardware, BIOS, Linux/Linux development, networking protocols and system design. Knowledge of IPMI/Advanced TCA systems and firmware systems. Strong C / C++ programming experience a must, MATLAB experience is highly desired Must have demonstrated experience in microcontroller-based platform Knowledge of DSP or wireless communication systems is beneficial Excellent analytical, problem-solving skills, with strong attention to details Excellent communication skill and ability to work as a team player Strong technical writing and documentation skills including documentation protocols for  regulatory certifications standards such as IEC and ISO Hard working and independent, self manages own time and can be counted on to deliver Excellent communication skills; verbal, written, listening (English)We offer a competitive package as well as an opportunity to be part of a team that has the potential to change healthcare and positively affect millions of lives.If you feel you would make a good candidate for this position, please respond to this posting.Roles and Responsibilities ", "Role": "Firmware Embedded,", "Industry Type": "Medical Devices / Equipments,", "Functional Area": "Electronics,", "Employment Type": "Full Time, Permanent", "Role Category": "Not mentioned", "UG": "B.Tech/B.E. in Computers", "Doctorate": "None", "Key Skills": ["Electronics Hardware Programming", "Firmware", "Embedded C", "Embedded Software Development"]}