{"Job Title": "Engineer, Software Development UI", "Company": "True Influence", "Experience": "3 - 5 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": " Job Summary    This role requires a User Interface Developer who can drive strategy and implementation of a complex set of processes and solutions.    The role requires an individual who wants to perform cutting edge work in Agile, Behavior Test-Driven Development, and DevOps.    You will help to lead develop User Interfaces in Angular 2+ by converting wireframes and mockups into Angular code, following best practices for performance optimization, conducting hands on testing and writing test cases, while working with other developers, testers and stakeholders.    Duties Responsibilities    Be an individual contributor as well as team player in an RD development team.   Collaborate with a group of software engineers to deliver on software projects using proven development processes (Agile/SCRUM).   Work with internal customers (Product Management and Development) to gather requirements to deliver creative solutions that meet needs with respect to functionality, performance, scalability, reliability and realistic implementation schedules.   Convert wireframes and mockups into pixel perfect Angular 2+ Code.   Should create reusable standard UI widgets.   Designing user interactions on web pages.   Follow test-driven development (TDD).   Optimize existing code for performance using various optimization technologies.   Suggest and follow best software development approaches.   Introduce and implement advanced features in Angular 2+.   Use Atlassian Bitbucket and Git for Source Control.   Participate in peer code reviews.   Follow Agile Software Development methods using Atlassian JIRA.   Seeing through a project from conception to finished product.    Skills Requirements    B.E., B-Tech, MCA or M-Tech with 3-5 years of experience in Agile development, preferably SCRUM.   Strong base in Object Oriented Concepts.   Strong experience in Angular 2+, NPM, JavaScript, HTML5, CSS, Bootstrap.   Strong experience in SOA - REST, Oauth2, JWT Authentication.   Experience in RWD (Responsive Web Design), Media Queries and creating Cross Browser Styles.   Experience in an Agile environment with test-driven development (TDD).   Experience in Web Deployment using Apache or similar Web servers.   Good to have knowledge of Java, Spring Boot, MySQL / MariaDB, Unix/Linux.   Excellent presentation, interaction and communication skills along with the ability to collaborate effectively across functional organizations.   Strong initiative and the desire to experiment with new technologies.  ", "Role": "Software Developer,", "Industry Type": "Internet, Ecommerce,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial", "PG": "M.Tech in Electronics/Telecommunication, MCA in Computers", "Doctorate": "None", "Key Skills": ["Unix", "Product management", "Linux", "SOA", "TDD", "MySQL", "Javascript", "Test cases", "Apache", "JIRA"]}