{"Job Title": "20th March'21 Virtual Drive For Software Developers", "Company": "Daffodil Software Private Limited", "Experience": "2 - 6 years", "Salary": "Not Disclosed", "Location": "New Delhi, Gurgaon/Gurugram, Delhi / NCR", "Job Description": " About Unthinkable:With Unthinkable, we help our customers to disrupt faster by decreasing time-to-market via reducing the time gap between an idea and working software. Combining our experience of building 100+ software solutions and developing products using decoupled software components to reduce redundant code, we are in a unique position to take this unconventional approach to software development. Unthinkable Solutions is a parallel business unit of Daffodil Software.About Daffodil Software: Daffodil Software is software services company, that is a technology partner to 80+ dynamic organizations across the globe. Daffodils customers range from early stage start-ups to Global Fortune 500 enterprises. Daffodils specialty lies in our ability to look beyond technologies and deliver innovative and progressive solutions. Winner of Deloitte Tech Fast 50 India, Daffodil experiments with latest technologies, design approaches and development methodologies to build cutting edge software solutions. They are known for investing in futuristic technologies, AI and Blockchain are no exception. Daffodil is also working on some very exciting ideas that can change the world, and is in process of setting up them as startups within Daffodil. Our Goal: We, at Daffodil, value innovation, ownership, hard-work and smart risk-taking attitude with continuous desire to learn and improve oneself every day.Location: Gurgaon Experience: 1-5 Years KeyResponsibilities: Responsible for successfully designing, mapping, implementing and integrating complex applications Brainstorm for possible solutions of the problems in an optimized way Relies on experience and judgment to plan and accomplish goals Ability to prioritize and multi-task Ability to work under pressure and deliver on time Troubleshooting issues with existing or developed systems and works with the appropriate resources to resolve them Participate in the testing process through test review and analysis, testwitnessingRequired Skills: Understanding of best practices for architectural and design patterns Should have excellent communication skills (both written and verbal) Constructive Attitude Should have work experience in any of the technologies based on JS Stack-Javascript / Angular.js/React.js/ES 6 versionREST Conventions HTML/CS Kindly register on below link- bit.ly/20thMarch21 ", "Role": "IT/Technical Content Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Other", "UG": "Graduation Not Required", "Doctorate": "None", "Key Skills": ["Angularjs", "CSS", "Design Patterns", "Artificial Intelligence", "Blockchain", "HTML", "Node.Js", "Angular", "Software Development", "Rest", "Software Services", "Front End", "Testing Process", "Javascript", "React.Js"]}