{"Job Title": "Senior Software Developer(PHP)", "Company": "Darshan Soft-Tech Pvt. Ltd", "Experience": "5 - 7 years", "Salary": "₹ 5,50,000 - 7,50,000 P.A. ", "Location": "Vadodara", "Job Description": " Job Summary:We are looking for talented and enthusiastic Senior PHP Developers to expand our existing development team and work on international ecommerce application.Excellent opportunities for individual to learn explore and work on the cutting edge technologies including PHP, MySQL, Smarty, Javascript, JQuery, Web Services and 3rd Party API.Roles and Responsibilities:Developing Simple to Complex Functionality for Websites and Applications.Write reusable code preferably using classes and libraries.Programming databases specially MySQL.Establishing projects from scratch or working on accessible projects.Developing front-end and back-end applications.Take on multiple projects varying in size and complexity.Desired Candidate Profile:Bachelor degree in Computer Science, Software Engineering or related discipline.4+ years of experience developing eCommerce web applications.Should be technically sound in OOPs Concepts.Knowledge of server side technologies like PHP 7/8, NodeJS, NUXTJSKnowledge of client side technologies like Javascript, JQuery, VueJS.Experience in MVC Framework, especially yii2 or laravel.Basic knowledge of HTML5, CSS, XML, JSON.Good command on PostgreSQL database and its optimization techniques.Exposure to database transactions, stored procedures and triggers.Experience working with third-party APIs and developing web services using REST/GRPC.Knowledge of Go, working with dockers, use of kubernetes as an added bonuses.Experience with SCM tools like svn/git.Ability to adapt and pick up new techniques and technology.Knowledge of web security and vulnerabilities.Ability to prioritize the work and multi-tasking.Excellent communication skills & self-motivated.Perks and Benefits :Established company with great financial stability.International luxury offices in Vadodara, Gujarat.We invest in our people by providing ongoing, world-class global training.Fast personal and career development.International travel opportunities.Service recognition awards.Market leading salary packages.Accommodation in company guest house.Regular social and team building activities.Management developed from within.Unrivalled team working dynamics.Develop ground breaking technology.Innovative forward thinking organization.Find below the office timings:Monday- 11 am to 8 pmTuesday- 11 am to 8 pmWednesday- 11 am to 8 pmThursday- 11 am to 8 pmFriday- 11 am to 8 pmA competitive salary will be offered depending on experience and suitability.Further aspects of the role are available upon application for this position.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Smarty", "CSS", "Html5", "MVC Framework", "JSON", "Node.Js", "JQuery", "Laravel", "Codeigniter", "Nuxtjs", "PHP Developer", "MySQL", "Javascript", "Yii", "PHP Programmer", "PHP", "Bootstrap", "zend", "Vuejs", "Core PHP"]}