{"Job Title": "Senior Java Software Developer", "Company": "Elements Global", "Experience": "7 - 8 years", "Salary": "Not Disclosed", "Location": "New Delhi", "Job Description": "  A revolution cannot be done alone, and we need the best and brightest talent to continue our growth into the new modern workplace. We are looking to expand our team by hiring a new   Senior Java Software Developer,   a team player who is ready to make the role their own and bring their own ideas and innovations to the table.    You will be supporting our   Technology   team, a group of brilliant minded and driven people. Our product is on pre-launch stage, so you will have a real impact on which direction the product will take from a technical standpoint. You will be responsible to write clean code, work with agile methodologies such as SCRUM or Kanban, contribute to building applications from scratch, interact and cooperate with the DevOps and Architecture team.      Key responsibilities:      Development of in-house software applications and databases, experience in .NET technologies, Node.js, Java.   Participate in building the core software architecture.   Provide day-to-day software application support and related technical advice.   Deliver on each sprint, ideally participating to peer reviews and testing processes.   Participate in full software development life cycle - requirements gathering, design, development, testing, deployment, user training and documentation.   Any other matters / projects that the management may require assistance with from time to time.       What we value:     You have 7 years of software development experience in commercial or enterprise applications.   You have 4 years of full-time experience as a Java developer on Linux platform and familiar with Test frameworks (JUnit, Mockito etc.).   You hold a bachelor or above degree in computer science or related fields.   You are familiar with the latest Java development framework and open-source tools.   You have a strong understanding of web application architectures and experience in SaaS Product Development dealing with large volumes of data.   You have a deep SQL / NoSQL database knowledge (MySQL, MongoDB, ElasticSearch, etc.) and deep understanding of container technology (Docker, Kubernetes, etc.)   You have excellent skills in communication (written and verbal) and collaboration with other functional teams (Support Engineering, Tools, Product, etc.).       What we Offer:     Opportunity to work in a fast-growing organization with the ability to make a quick impact.   Allow your inspirational ideas to come to life in a highly creative and executional environment.   Ability to work in an organization with over 40 nationalities all over the world, which embraces diversity, inclusion, and belonging at its core.   The opportunity to challenge in a high performing organization and leave each day knowing you have made an impact.     ", "Role": "Software Developer,", "Industry Type": "Strategy, Management Consulting Firms,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Application support", "Linux", "Enterprise applications", "MySQL", "Agile", "Scrum", "MongoDB", "Open source", "SQL"]}