{"Job Title": "Senior Software Developer ( Java - Immediate Joining required)", "Company": "Sumati (An Elevate Business)", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Chandigarh, Delhi / NCR, Work from home, India", "Job Description": "Help us shape the future Elevate is recruiting a Senior Software Developer to play an integral role in providing service offerings to our esteemed Fortune 500 existing and prospective customers.  Specifically, you willWork on specific tickets/issues with a focus on use cases and reproducibility. Participate in SCRUM meetings with the onshore team to clarify and document use cases and steps to reproduce issues. When working on development tasks or JIRA tickets, investigate issues by developing and testing strategies in Non-Production systems to reproduce issues. Investigate issues by reviewing logs, database information, heap dumps, thread dumps, reviewing code, etc. to determine root cause with little or no supervision.Document all findings in an appropriate Ticketing system with a high level of detail.Understand the end-to-end implementation and providing technical/functional support.Pro-actively propose solutions and strategies to business challengesPerform function/unit testing of deliverables before assigning them to the quality teamCollaborate with cross-functional teams for delivering targetsExperience3 to 8 years of experience as a developer with minimum of 3 years of experience in Java developmentSkills for SuccessA quick learner with good written and oral communication skillsShould be able to take new initiative and ownership of tasksInterest in researching for finding solutions to business problems and must have excellent problem-solving skillsMust be able to work with remote teamsMust have ability to work independently with little to no supervisionMust be flexible to work in a multi-shift environmentTechnical SkillsRequired skills: Java, J2EE, XML, spring framework, Tomcat/WebSphere, MySQL/MS-SQL/Oracle, XML, SOAP/REST, Maven, Git, JenkinsGood to have experience in reporting tools (Pentaho/MicroStrategy/BusinessObjects), Linux/Putty/SSHQualificationsAny technical graduate/post-graduate from a reputed institute, preferably in information technology or computers ", "Role": "Software Developer,", "Industry Type": "Legal,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "BCA in Computers, B.Tech/B.E. in Computers", "Doctorate": "None", "Key Skills": ["Java", "Core Java", "Scrum", "Software Development", "Rest", "Ticketing", "International Customers", "Development", "Agile", "J2Ee", "JIRA", "SOAP"]}