{"Job Title": "Immediate Opening For Software Developer - Java.", "Company": "Centre for Good Governance", "Experience": "3 - 5 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "We are Looking for candidates with more than 3+ years of experience with good experience in Springs, Struts, Hibernate, Angular JS, Spring Boot, UI technologiesQualification: Should have acquired -a) B.E./B.Tech/MCA with specialization in Computers/Electronics/IT ORb) M.Sc in Computer Science/IT with One year experience in Software Development/Implementation ORc) MasterS Degree in Physics/ Mathematics/Statistics/ Operational Research/Electronics withi) Either with Post Graduate Diploma in Computer Science/DOESEC(A level) certification with One year experience in Software Development Projects ORii) Two year Experience in Software Development/Implementation Projects ORd) M. Tech/M.E/MS in Computer Science/IT/Electronics. with 60% of marks or above.Experience: Minimum 3 Yrs of experience out of which 2 years in Software Development.Skill Set:  Core Java/ J2EE/ Servlets/ JSP/ JavaScript, OOPS, Struts Framework/Spring Framework, Hibernate technologies Process methodologies - MVC, SOA Architecture Good working knowledge on Tomcat/JBoss servers Developing software using Eclipse/MyEclipse IDE Should have contributed in all phases of the development life cycle Strong communication skillsRoles and Responsibilities: Should involve and be responsible for all the stages of Software Development Life Cycle. Working closely with Project leader, business analysts, designers and other team members throughout the SDLC Actively participate in discussions with team members in design, development and implementation Evaluate and increase the program effectiveness Document the tasks assigned Testing the application in real situations", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Electrical, Electronics/Telecommunication, Computers", "PG": "MCA in Computers", "Doctorate": "Any Doctorate in Any Specialization, Doctorate Not Required", "Key Skills": ["Hibernate", "Core Java", "Tomcat", "JBoss", "JSP", "Spring Framework", "Struts", "J2Ee", "Servlets", "MyEclipse"]}