{"Job Title": "Software Developer (TRACKWISE)", "Company": "Steris", "Experience": "4 - 8 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "     STERIS is looking for an experienced TrackWise Software Developer to join our growing team. This position will be responsible for technical maintenance and support of the cloudbased TrackWise quality management system built on the Salesforce platform. Develop and Implement technical solutions that meet business requirements. Continually grow knowledge of supported technology and product areas to have a clear understanding of current / future technology requirements of the business partner. This position reports to Director, IT Operations.         Maintain the TrackWise system by assessing the impact of periodic Salesforce and TrackWise upgrades. Perform these upgrades in a controlled manner.          Implement periodic changes to the TrackWise configuration per the direction of the business team. Migrate these changes to the Production environment.           Support custom, automated integrations with other STERIS systems feeding data to TrackWise via the Salesforce Data Loader tool           Provide users with support for reports, views, and dashboards using both Salesforce and TrackWise-based tools           Provide tier-2 technical support to users submitting tickets via the STERIS Service Desk.         Maintain the validated status of the system by:         Adhering to all regulations and standards (FDA and international) regarding proper control of system changes         Maintaining separate Development, Test, Training and Production environments      Following a prescribed system development lifecycle        Review and analyze business requirements, assess risks / benefits of various options and recommend solutions         Provide input to the development of formal business requirements      Document technical processes and programs        Provide input into project / resource estimating activities including the impact of proposed changes to the project plan        Maintain the Buiseness Partnership by       Establish working relationships with technology team members and business process owners       Participate in process improvement initiatives      Manage individual workload and deliver agreed upon project milestones         Demonstrate ability to work in a team environment to help resolve issues           Provide input to staffing plans at the project-level to identify key / required skills           W        ork experience requirements     or equivalent work experience    4-8 years of relevant work experience    Strong Salesforce implementation experience    Experience with TrackWise configuration and maintenance preferred                 Experience in implementing and supporting automated quality management system processes such as Complaints, CAPA s Nonconformances, Quality Events, Document Control and Training preferred         Business process analysis and solution design           Strong analytical and documentation skills      Data Loader system integration    Domestic travel required 5-10% of time    Typical office setting    Developer, CAPA, Quality Manager, Service Desk, Cloud, Technology, Management, Quality, Customer Service   ", "Role": "Outside Technical Consultant,", "Industry Type": "Medical, Healthcare, Hospitals,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "System Design/Implementation/ERP/CRM", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Technology management", "Staffing", "Process improvement", "Analytical", "System integration", "Customer service", "IT operations", "Information technology", "Technical support", "Salesforce"]}