{"Job Title": "Senior Software Developer - Python", "Company": "Torinit Technologies Inc.", "Experience": "4 - 6 years", "Salary": "₹ 6,00,000 - 12,00,000 P.A. ", "Location": "Nagpur, Pune", "Job Description": "Job descriptionWe are looking for experienced software professional to manage, develop, and lead the engineering of diverse web applications. He/She would be a strong engineering/product leader who drives excellence in all aspects of engineering disciplines such as design, development, analytics, and quality assurance.Roles and Responsibilities:Building enterprise, robust, scalable, and maintainable applications.Debugging, Fixing bugs, Identifying Performance Issues, and Improving App Performance.Continuously discover, evaluate, and implement new technologies to maximize development efficiency.Handling complex technical issues related to web app development & discuss solutions with the team.Developing, Deploying, and maintaining Multistage, Multi-tier applications.To write high-performing code and will be participating in key architectural decisions.Project Execution & Client InteractionDesired Candidate Profile:Good knowledge of Python with 4+ years of minimum experienceStrong understanding of various Python Libraries, APIs, and toolkits.  Good experience in Django, Django REST Framework, and Flask framework.Experience with AWS, DynamoDB, Managed Services, Lambda servicesHands-on Experience in Databases like Mysql, PostgreSQL.Proficient in NoSQL document databases especially MongoDB, Redis.Stronghold in Data Structures and AlgorithmThorough understanding of version control system concepts especially GIT.Excellent understanding of MVC and OOP. Bonus for the understanding of prevalent design patterns.Excellent debugging and optimization skills", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "Doctorate": "None", "Key Skills": ["Aws Lambda", "Django", "Postgresql", "MySQL", "Redis", "Rest Api", "AWS", "Python"]}