{"Job Title": "Sr. Software Developer", "Company": "Advanced Risk Analytics Private Limited", "Experience": "3 - 8 years", "Salary": "₹ 4,00,000 - 9,00,000 P.A. ", "Location": "Pune( Hadapsar )", "Job Description": " We are looking  for 5 dynamic individual(s) who are passionate about technology; have an eye  for details and can-do attitude.   We have developed  a platform with Angular 6 front-end dashboard with Maps/Charts/Pivots/Grids, C#/.Net  business layer with SQL server in backend.Immediate Joiners Only    Experience:  3-15 years   Roles and Responsibility:  Specification, Analysis, Design, Coding, Integration using C# and ASP.Net MVCExpertise with , Angular 6/7, javaScript, HTML, CSS3, ASP .Net MVC with bootstrap dashboard, DIV based design and D3Js controls is plus Write WCF services to communicate between business objects and databases Experience with SQL server with large data or any other relational database  Hand on experience in high-performance  computing (HPC)/parallel processing would be valuableObject-oriented design and programming    Personal Profile:     Education: B Tech/B.E. - Any Specialization,  Computers / BCA - Computers / PG- Any Post Graduate - Any Specialization /  Doctorate- Any Doctorate - Any Specialization   Excellent written and verbal communication  skills   Self-starter with an ability to collaborate  actively with others in a cross-functional team   Problem solver and technology enthusiast   Creativity, innovation, and resourcefulness   Willingness to learn, and to innovate in a  rapidly changing market   Ability to deal with ambiguity and change   \"Roll-up your sleeves\" attitude to  get things done   Passionate and intimately knowledgeable about  all things web and mobile", "Role": "Team Lead/Technical Lead,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required, Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required, Any Doctorate in Any Specialization", "Key Skills": ["WEB API", "SQL Server", "ASP.Net MVC", "CSS", "Angular 6/7/8/9", "HTML", "HTTP", "WPF", "Multithreading", ".net Developer", "C#.net", "Bootstrap", "C# Developer", "HPC"]}