{"Job Title": "C++ Software Developer", "Company": "Multi Recruit   ", "Experience": "9 - 12 years", "Salary": "₹ 20,00,000 - 25,00,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": "Prototype, design, implement, unit test, and maintain Windows-based software applicationsParticipate in cross-functional project teams to develop medical device software Work with multi-discipline teams on new product introduction project while adhering to software development and source control processesDocument software, write technical specifications for interfaces and testingQualificationsBachelors degree in Software Engineering, Computer Science or related field with no less than 6+ years of experienceExperience designing and developing C++ based solutions and experience with any user interface development (MFC)Expert in Unit Testing, OOA/OOD development methodologies, and design principlesExperience in Agile development processes and philosophiesHistory of timely delivery while ensuring a quality focusAbility to work well with people and be both highly motivated and motivatingAbility to work in a fast-paced, and often ambiguous environment where continuous improvement is a way of lifeAbility to work independently and proactively with minimal direction. Nice to HaveExperience in medical device design & development is a plusExperience in IVD instrumentation, such as clinical chemistry, immunoassay, hematology, urinalysis, molecular, microbiology, or flow cytometry systems is a plusUnderstanding of software development processes for a regulated environment (ISO9000/FDA) is a plusExperience in software code and build management is a plus", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "Doctorate": "None", "Key Skills": ["C++", "Coding", "MFC"]}