{"Job Title": "Hiring For Software Developer", "Company": "ONE POINT ONE SOLUTIONS LIMITED", "Experience": "2 - 7 years", "Salary": "₹ 1,00,000 - 4,00,000 P.A. ", "Location": "Navi Mumbai", "Job Description": " Job Description: Greetings from 1 Point 1 HR Team! Hope you are doing well!  Below are the requirements for Navi Mumbai - Turbhe. Jr. Software Developer Software Developer  Sr. Software Developer  Jr.Software Developer at Turbhe location. Work from Office  -Bachelors degree in Computer Science. -0-2 years of experience. -Knowledge of basic coding languages including .net Framework 4.0 and above, Asp.Net, C#, WPF, WCF, Jquery and JavaScript. -Basic programming experience. -Knowledge of databases and operating systems. -Good working knowledge of email systems and Microsoft Office software. -Ability to learn new software and technologies quickly. -Ability to follow instructions and work in a team environment. -Detail-oriented.  Software Developer at Turbhe location. Work from Office  -Bachelors degree in Computer Science. -2-4 years of experience. -Knowledge of basic coding languages including .net Framework 4.0 and above, Asp.Net, C#, WPF, WCF, Jquery and JavaScript. -Basic programming experience. -Knowledge of databases and operating systems. -Good working knowledge of email systems and Microsoft Office software. -Ability to learn new software and technologies quickly. -Ability to follow instructions and work in a team environment. -Detail-oriented.  Senior Software Developer at Turbhe location. Work from Office  -B.A. or B.S. in computer science, information technology, or related discipline -4-8 years of job related experience -4 years of experience as software engineer -Experience with computer programming Interested candidates please WhatsApp or email me your profiles on below mentioned no. & Id with: 1. Total no. of years experience  2. Current salary 3. Notice Period 4. Reason for change 5. Salary Expectations  Please avoid doing calls, post receiving your resume I will get back you if your profile is shortlisted Ignore if not interested or already working with 1 Point 1 Solutions Ltd Request you to share this Opportunity in your network. Regards, Arti Awasthi Human Resources +91 8805315966 Arti.awasthi@1point1.in", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["C#", "Software Development", "Software Engineering", "Javascript", "Programming", "ASP.Net", "WCF", "JQuery", "WPF", ".NET Framework"]}