{"Job Title": "C++ Software Developer", "Company": "Raphe mPhibr Pvt Ltd", "Experience": "3 - 8 years", "Salary": "₹ 6,00,000 - 16,00,000 P.A. ", "Location": "Noida", "Job Description": " At Raphe, we are all innovators on a mission to strengthen our armed forces. From conquering the skies, to taming the oceans with your passion and energy, you will learn and grow, contributing to work that redefines the operations and safety of our personnel. Build your future with us.Raphe Electronics division is seeking C++ Software Developer, passionate about programming and excited to work in a multi-disciplined, collaborative engineering environment to design, develop and implement algorithms for autonomous navigation, computer vision, sensor fusion, communication, and ground control station. for a new fleet of swarm drones.Primary Responsibilities Will contribute in full life cycle of software development including requirements analysis, software design, coding, unit test, integration, and formal validations. Will be responsible for building applications that range from desktop applications to native mobile applications.Degree and experienceB.E., B.Tech., or M.Tech. in computer engineering or related discipline, and typically 3 years of related work experience in C++ Software Development.Required Skills: Should be efficient in C++ programming language and be able to analyze, debug, and handle large C++ Projects Implementation of OOPs skills in C++ programming Good understanding of algorithms and data structures Have great problem solving and debugging skills to identify bottlenecks and bugsDesired Skills/Experience Understanding of design and implementation of multi-threaded applications Experience in object-oriented design & design patterns Experience in code analysis and profiling tools Experience in shell scripting Understanding of basic physics & mathematics", "Role": "Software Developer,", "Industry Type": "Aviation, Aerospace, Aeronautical,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization, BCA in Any Specialization", "PG": "MCA in Any Specialization, M.Tech in Any Specialization", "Doctorate": "None", "Key Skills": ["C++", "OOPS", "Software Development", "Design Patterns", "Data Structures", "OOAD", "Debugging", "Programming", "SDLC", "Algorithms", "Multithreading", "Computer Vision", "Software Design"]}