{"Job Title": "Software Developer", "Company": "Astral Management Consulting Private Limited", "Experience": "2 - 4 years", "Salary": "₹ 4,00,000 - 8,00,000 P.A. ", "Location": "Navi Mumbai", "Job Description": "Roles and Responsibilities  Software DeveloperJob DescriptionWe are looking for a .NET developer to build software using languages and technologies of the .NET framework. In this role, you should be able to write code with minimum defects. You should be a team player and a good communicator. You will create applications from scratch, modify existing applications, configure existing systems and provide technical support. Your goal will be to work with internal teams to design, develop and maintain software. Candidate responsibilities:Part of a development team responsible for developing and supporting. NET-based application solutions.Write clean, scalable code using .NET programming languages (C#)Participate in requirements analysis when required.Collaborate with internal teams to produce software designTest and deploy applications and systemsRevise, update and debug codeImprove existing softwareDevelop documentation throughout the software development life cycle (SDLC)Serve as an expert on applications and provide technical supportDesired Candidate Profile Bachelors degree in a technical discipline and related skills training preferred.Good knowledge of .NET/C# and HTML5Proven 2-5 years of experience in delivering a .NET/C# based Projects.Familiarity with the .NET framework, SQL Server, and design/architectural patterns (e.g. MVC)Experience with agile and waterfall life cycle methodologyExcellent troubleshooting and communication skillsPerks and Benefits ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers, BCA in Computers", "PG": "M.Tech in Computers, MCA in Computers", "Doctorate": "None", "Key Skills": ["C#", "Html5", "ASP.Net", "Architectural Patterns", "SQL Server", "Troubleshooting", ".NET Framework", "Software Development", "waterfall life cycle", "Agile", "SL", "MVC", "Software Design"]}