{"Job Title": "Senior Software Developer Cross Platform (PWA/JS)", "Company": "Smann App By Tribetayling Pvt Ltd  ", "Experience": "4 - 6 years", "Salary": "₹ 5,00,000 - 8,00,000 P.A. ", "Location": "Mumbai", "Job Description": "About the Company:We are a Startup engaged in creating an easy & effective Hyperlocal Marketplace that connects local business with their own neighborhood. Our mission is to effectively blend online and offline shopping experience for our customers. We are here to empower small local business by providing them a digital toolkit needed for their growth. With the mission of selling and buying local.Please visit www.smann.in for more details about us OR Download \"Smann\" APP from Android Playstore.[The job status is as 'Work-From-Home' due to current situation; it may change in future]Experience: 4 to 6 YearsTHE ROLE:4-6 Years experience in Cross Platform application development using PWA, React native.Good understanding of Hybrid Apps, React Native, Native iOS and Android Architecture.Experience in building rich PWA applications.Experienced in Android and iOS development and sound understanding of architecture.Experienced in developing applications using Kotlin, Swift, Javascript, ReactJS, VueJS, NodeJS, HTML5, CSS3/CSS4 and other UI technologies.Understanding and experience with asynchronous processing, partial page refresh, DOM traversal and manipulation.Experience developing multi-channel, mobile-responsive and mobile-adaptive UI.Experience with automation testing tools, Appium, selenium.Experience building large-scale high-performance systems and sites.Have a good eye for subtle UI details.Experience working in an agile test-driven development(TDD) with continuous integration and deployment (CI/CD).Excellent communication skills.packaging and deploying the bundled binary artifactsMust have Skills:Kotlin, React, MVVM, Dagger, Hilt, REST, Progressive Web apps(PWA), Service workers and Async constructs.Add On:FOSS enthusiastCompetitive programmerInterested Candidates can send their updated Resume along with below mentioned information:Current CTC:Expected CTC:If selected how soon you can joinJob Type: Full-timeBenefits:Flexible schedulePaid sick timePaid time offWork from homeSchedule:Day shiftFlexible shiftMonday to FridayWeekendsSupplemental Pay:Joining bonusPerformance bonusYearly bonusWork Remotely:Temporarily due to COVID-19COVID-19 Precaution(s):Remote interview processVirtual meetings ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization, B.Sc in Any Specialization, BCA in Computers", "PG": "MS/M.Sc(Science) in Any Specialization, M.Tech in Any Specialization, MCA in Any Specialization, MBA/PGDM in Any Specialization", "Doctorate": "None", "Key Skills": ["Vue.Js", "MVVM", "Javascript", "Node.Js", "Dagger", "Pwa", "React.Js", "Kotlin"]}