{"Job Title": "Senior Software Developer", "Company": "AVOCATION EDUCATIONAL SERVICES PRIVATE LIMITED", "Experience": "1 - 6 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": " We're a fast-growing EdTech Startup with a mission to connect people to the world's best learning opportunities. Are you ready to unlearn the traditional ways of working and imbibe technology into your day-to-day activities? If yes, then Yocket is the place to be! Join our young and dynamic team in this journey to becoming a great company!Our Team :Engineers at Yocket are the backbone of the company. Our passion is anchored in the work that we do. Our team is empowered by building products and tools that serve lakhs of aspiring students. Responsibilities and Duties :Strong leader with the ability to lead & manage a high performing team, can creatively balance high-quality delivery with customer focus to meet business needs.Develop a meaningful vision for the team, working in concert with product managers, designers, user research and customers.Revamp our codebase from PHP/JQuery to NodeJS/VueJS in a software architecture.Build new features on Yocket using web technologies and frameworks and also integrate features and improvements that can support our large-and-growing user base.Improve and optimise the code base with best practices while ensuring reliability and security of the web application.Talk to our mobile app developers and design how an API method should work.Contribute to internal tools that help us manage our users and contentUnit-test code for robustness, including edge cases, usability, and general reliabilityAble to envision solutions for a global product, to work through complex problems with a wide variety of people while being uncompromising on execution. Technical Skills :Skilled with one or more backend technologies like NodeJS/Express, Python, MySQL, Postgres or proficient with front-end technologies like CSS, Javascript and libraries like VueJS, React, Next/Nuxt, TailwindGood understanding of software architectures, microservicesProficient with version control software like Git.Comfortable with development on Linux / Ubuntu OS and familiar with the CLIMust know how the web works, HTTP and TCP/IP and what a good API looks like.Strong CS fundamentals: data structures, algorithms, internet security.Good at writing understandable, testable code with an eye towards maintainability.Experience of Amazon Web Services (AWS) like EC2, Lambda, SNS, SQS is an added advantageBehavioural Skills :Excellent Communication SkillsManagement SkillsHighly motivated individual with ability to thrive in a fast-paced environment.Strong analytical ability to create innovative solutions, logical and problem-solving approach on complex issuesCuriosity about how things work and willingness to work in a startup environmentEager to learn, flexible to pivot when needed, savvy enough to thrive in a dynamic environment and should possess a growth mindset!Needs to be aligned with our vision of helping people connect with the best learning opportunities in the worldPerks, Benefits and Culture :We're a small & young team - with the average age being around 24.We work for 5 days a week :)Culture can be dened as an ambitious young team who works hard when it's required and balances it with rest so that long-term stability can be achieved!Too many projects are ongoing, and too many objectives are yet to be achieved! But we ensure, your journey with us will be fun :DCome, join us, and be a part of our amazingly energetic & ambitious team! ", "Role": "Software Developer,", "Industry Type": "Education, Teaching, Training,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "Doctorate": "None", "Key Skills": ["MySQL", "Javascript", "Node.Js", "Postgres", "React.Js", "AWS", "Python"]}