{"Job Title": "Software Development Engineer II ", "Company": "Apptio INC", "Experience": "4 - 7 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": " You: A fearless and dynamic engineer on an upward path:    You have ambitious career goals and are looking for a company and team where these goals will be fulfilled.   You are not afraid to take risks.   You are computer science literate and can demonstrate competency in the qualifications you put on your resume.   You can quickly figure out how things work.   You can read code and learn from it; you can write code so others can learn from it.   You can quickly integrate into a team and start contributing.   You are comfortable working in multiple code bases and languages.     What we want you to do:     You will work with a talented team to deliver a market-leading IT Business Management product.   You will be a part of a team that has end-to-end ownership of the entire product, from design, development, deployment to operations and interacting with customers.   You will collaborate with other teams in Apptio to integrate our product within the overall Apptio ecosystem.    Basic Qualifications:    4 - 7 years of proven experience developing enterprise level software, testing and supporting software applications.   Proficiency with Java is essential.   Proficient with REST APIs   Demonstrable computer science literacy: algorithms, data structures   Experience with relational databases, schema design, SQL   Proven application development skills with web or enterprise scale software.   Strong knowledge of data structures, algorithms, object-oriented programming   Excellent communication skills, collaboration across teams and critical thinking.   Bachelor s degree in Computer Science or equivalent experience.   Must be willing to scale up on the UI side development also as a full stack developer through required coaching and mentoring     Preferred Qualifications:    One or more of the following areas:    Work experience with system design, software defined infrastructure, microservices.   Experience with AWS and/or other public cloud technologies.   Experience with JavaScript and one or more modern JavaScript UI frameworks (e.g. React, Angular).   Database implementations (query optimization, index generation, caching) or NoSQL DBs a plus   Experience with distributed source control systems such as Git and Mercurial.   Experience with test-driven development and frameworks (e.g. JUnit).   Experience working in a DevOps model.  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Software Development Engineer II", "Billing", "Javascript", "System design", "Data structures", "Application development", "test driven development", "SQL"]}