{"Job Title": "Software Developer ( PHP, Node.js, Full Stack Developer )", "Company": "Petpooja", "Experience": "1 - 6 years", "Salary": "₹ 3,50,000 - 8,50,000 P.A. ", "Location": "Ahmedabad( Prahlad Nagar )", "Job Description": "Roles and Responsibilities As a software developer your responsibilities are as below. Working with team/individuals based on the functionality assigned. You are working as a full stack developer either for front-end or back-end or with DB or conceptualizing architecting with the existing or new functionalities. You are responsible for making a function live and enhance based on the feedback received from the customers.You are either working with the team from Designing to Testers. You need to handle the large quantum either with database, or scaling an API or creating server less architecture based upon the feature developed and handle till last. You are supposed to create, debug and enhance the existing or new functionalities based on the requirement. You are supposed to working with engineering, functional and core teams to create a large scale applications. Desired Candidate Profile We are looking out for a bright candidate who loves to code and accept challenges. An individual who has an insight for details and able to handle the fast track journey. A candidate coming from a startup company or Product base company would be preferable.  You should having a below knowledge from day 1 of joining. Understanding of any of the PHP MVC frameworkKnowledge of jQuery and know how it works. Creating APIs and desire to work with distributed services. Working knowledge with MySQL / MongoDB.Understanding of customer persona and desire to be techno functional. Understanding of basic AWS services related to deployment. Perks and Benefits We at Petpooja, a product base company from Ahmedabad- Gujarat, are growing exponentially and we want our employees to be part of this growing journey. You will be work as a full stack engineer with the problems which appeared at a higher scale. ( considering you are working with TBs of Database and Lacs of API request on daily basis. ).We are equal opportunity employer based of Ahmedabad, Gujarat. Current we expanded ourselves with two offices in Ahmedabad (Yes. teams are working remotely. )You should get- Working with fast paced startup ( though we are 9 years old but still we work as a startup )- Working as a full stack developer ( be it a front end, backend, database, Security, DevOps etc.)- Working with a experience team. ( Average experience of current team is more than six years. )- Open Culture ( You can grab a coffee at any point of time. Imagining if covid is not present. :( )- Working remotely. ( Considering the best of the health of teams and individuals. Will resume once things are settled out. )- Continuous enhancements with growing product with more than 15000+ customers. ( You are changing wheels in the running train. :) It's really challenging if you consider.) On financially you will get,- Best remuneration as per your experience and knowledge you posses. - Medical Insurance ( For you and your spouse )On Culture, you will get,- We love enjoying playing TT and so do you. ( Sorry, but only in office. :( )-  Open culture where continuous learning and feedback. You got a right to ask questions to founders even. - Open door policy.- We are humans and understand as we all have families. The best thing is you feel the vibrancy then just words. ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Sc in Any Specialization, B.Tech/B.E. in Any Specialization, BCA in Any Specialization", "Doctorate": "None", "Key Skills": ["Node.Js", "Zend", "Laravel", "Codeigniter", "Microservices", "Software Development", "PHP MVC", "MySQL", "Javascript", "Yii", "PHP", "CakePHP", "MongoDB", "Serverless", "AWS"]}