{"Job Title": "Golden Opportunity For C Software Engineers/ Developers", "Company": "Fatpipe Networks Private Limited", "Experience": "1 - 4 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": " HI,I am Vidhya Asst HR Manager from FatPipe.We have the Golden Opportunity for C Developers/ Software Engineers to Join FatPipe.JD We are looking for a Software Developer to build and implement functional programs. You will work with other Developers and Product Managers throughout the software development life cycle.In this role, you should be a team player with a keen eye for detail and problem-solving skills. Your goal will be to build efficient programs and systems that serve user needs..Roles and Responsibilities Requirements: Proven experience as a Software Developer, Software Engineer or similar role. Knowledge of coding languages (e.g. C, C++, Python ). Knowledge of Linux kernel, hands on experience in kernel code development. Knowledge of Networking , network internals , protocols, TCP/IP stack, networking protocols BGP, OSPF. Knowledge of professional software engineering and best practices for the full software development life cycle, including coding standards, code reviews, source control management and operations. Desirable exposure to cloud technology, AWS, AZURE, KVM and containers. Ability to learn new languages and technologies and adapt. Ability to work in flexible and challenging schedule and meet deadlinDesired Candidate Profile No of Open Position - 5Shift: General Salary- Best in the industry.If your profiles suits and had got same skills and experience as mentioned above. Send your profile to email id vidhya@fatpipeinc.com to know further interview processwhile sending profiles, kindly send me whether you have all these Do you have experience in Linux programming ?    Experience of L2/L3 protocols and packet handling ?Development experience of L2/L3 protocols ?Linux program debugging (core dump, kernel dump) ?Knowledge of C programming and data structure ?Working knowledge of TCP/IP stack ?If Yes or NO, Reasons for the same is required.Perks and Benefits  Thanks & Regards, Vidhya Prakash Assistant HR Manager FatPipe Networks Private Ltd., 3rd Floor, Ragula Tech Park,Type II/16, VSI Estate ( Phase I) Thiruvanmiyur, Chennai - 600041. Landmark - Adjacent to NIFT www.fatpipeinc.com , +91 (44) 6670 7200 (30 Lines) Extn: 3225, Fax: +91 (44) 66707272 FatPipe is the inventor and holder of 8 patents with over 150 specific technology claims for products that provide the world's highest redundancy, reliability and security for WAN/Internet transmissions. FatPipe has received 40 awards for innovation and leadership. It was listed as the number 1 fastest growing company in India in the 2010 Deloitte India Fast 50, listed 14 on the 2010 Deloitte Asia 500, has been listed three years in a row on the Inc 5000 USA, as well as the Inc 500 as one of the fastest growing private companies in the US. FatPipe was also listed on the Deloitte Technology Fast 500 as one of the fastest growing companies in North America and is a six time MWCN Utah 100 Award winner, a listing of the 100 fastest growing companies in Utah. www.fatpipe.com", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "Doctorate": "None", "Key Skills": ["C++", "C", "Linux", "Python"]}