{"Job Title": "Senior Software Development Engineer in Test -  ML Platform", "Company": "Cloudera, Inc.", "Experience": "4 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "          Responsibilities      Build and maintain the test infrastructure with an eye towards efficiency,  reliability and developer productivity       Drive the quality agenda (develop test plans test cases,  write automated tests) for new features       Collaborate with developers to design and implement testing strategies covering functional testing,  customer workflow automation,  fault injection,  scale and performance testing.       Work closely with the development and support teams to triage product issues,  identify product and test gaps and work towards addressing those gaps.       Collaborate with other teams at Cloudera to build tooling and infrastructure required for test automation        Qualifications      5+ years of experience in Quality Engineering       Experience leading quality teams in design and development of tests       Strong scripting skills in Python for test automation. Familiarity with debugging tools like pdb.       Experience building scalable,  robust and secure Enterprise applications       Hands- on experience with containers and basic Linux system administration.       Self- driven and motivated,  with a strong sense of ownership and craftsmanship.       Strong written and verbal communication skills.         Pluses      Experience with data science and machine learning tools (R,  Tensorflow,  PyTorch,  Scikit,  Spark,  Jupyter,  Kubeflow)       Experience with cloud technologies (AWS,  GCE,  Azure)       Experience with microservices development (Go,  GRPC,  SQL)         ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - QA & Testing,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Product management", "Enterprise applications", "Functional testing", "Debugging", "Machine learning", "Performance testing", "Workflow", "Test cases", "SQL", "Python"]}