{"Job Title": "Backend Software Developer :Go/Python Kubernetes", "Company": "Dev Solutions ", "Experience": "6 - 11 years", "Salary": "₹ 50,00,000 - 80,00,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": "As a software engineer(backend), you will be responsible for Design, development and scalability of our backend platform. Design and development of backend services Scalability, Reliability and Security of the applications End to end ownership of the features and modules Articulate complex architecture problems, drive engineering excellence and collaborate with a cross-functional team Help scale our platform to support billions of minutes a day across thousands devices around the world Share technical practices, build development teams, and improve workflows Contribute to open source as we set the standards for video conferencing Mentorship of other team membersDesired Candidate Profile Bachelor's degree in (Computer Science/Information Technology) or equivalent practical experience At least *3+ years *of experience as Software Engineer/Developer Experience in building scalable applications Understanding ofOOPS concepts, threading Experience in building RESTful APIs with monitoring, fault tolerance and metrics Proficient in Go or Python or any other server side programming language Knowledgeable in data structures and algorithms Experience with video conferencing, Sockets, WebRTC, and realtime communication Experience with Video Streaming, HLS, Dash. Prior experience with AWS, Azure or GCP. Hands on experience with Kubernetes Ability to take on complex and ambiguous problems Ability to speak and write in English fluently and idiomatically Strong inclination to keep up-to-date with latest trends, learn new concepts, or contribute to open-source projects and would be eager to talk about ideas in internal or external forumsPerks and Benefits 50 - 80 la per annum -/+ Stock Options", "Role": "Technical Architect,", "Industry Type": "Internet, Ecommerce,", "Functional Area": "IT Software - eCommerce, Internet Technologies,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "Doctorate": "None", "Key Skills": ["Server Side Programming", "Kubernetes", "Python", "Software Development", "Algorithms", "Open Source", "Scalability", "Sockets", "Software Engineering", "Go"]}