{"Job Title": "C++ - Senior Software Engineering Developer", "Company": "Xebia IT Architects India Pvt Ltd", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": " Mandatory Skills       C++ - Mastery, C++ Certified Professional Programmer - Certified, Python  Experience with object-oriented-system design practices and principles. Experience with developing solutions in major object-oriented programming languages  relevant to the Techlog and RokDoc development environments (C++, Python). Familiar with unit-testing frameworks. Effective communication in highly collaborative sessions.Ability to break down a higher level requirement into smaller sub-componentsComfortable working in an Agile software development lifecycle approach delivering working and tested software each iteration or sprint.Qualification & EducationBachelors of Science (BSc) degree or higher in Information Technology or Computer Science.Following additional requirements:The senior developer will participate in software modeling sessions, together with Solution Architects and Subject-Matter Experts to analyze the business domain aspects of the end-solution and discover the work that needs to be done in each of the architecture components or tiers.DimensionsThe developer will provide input to architecture decisions and help determine an architecture roadmap for the product.Familiar with different application architecture approaches (e.g. Client/Server, Service-Oriented Architecture and Component-Based Architecture) and comfortable progressing work in either approach.Advanced knowledge of object-oriented-design, practices and principles and fluent in relevant object-oriented-languages (e.g. C++, Python).Understands the various programming paradigms, such as functional programming, object-oriented programming, generic template programming, etc.Ability to express software architecture and design into visual models (e.g. UML).Ability to coach and mentor more junior developers. About XebiaXebia is a Netherlands-headquartered IT company which specializes in Continuous Delivery & DevOps, Full Stack Agile Development, Agile Consulting & Transformation, Big Data/Data Science, Mobile, Cloudification and Data Centre Automation. With core software development offices in the Netherlands (Amsterdam, Hilversum), India (Delhi NCR, Bangalore, Pune), UK and the U.S. (Boston, Atlanta) we employ over 1100 people worldwide! Atlanta is our software development hub and we are looking for smart, consultative, hands-on software developers to be a part of our team's that are growing across the US including Atlanta, Denver, New York and CaliforniaTo make you more familiar about our organization , we would love to take this opportunity to introduce you to Xebia and it's culture.Our values: Xebia Group of companies operate on three distinct principles: Authority, Focus and Values. These values guide every decision made by both management and staff. Authority means becoming the best in our field, individually and as a company. It's an audacious goal that keeps us striving and fighting. We only hire people who have achieved authority, not for growth, open positions, size or value. Please browse the Xebia Values on our website.People First: You grow. We grow. Xebia puts People First, always. With a trust on personal and professional development Xebia provides a mutual atmosphere of respect, trust, responsibility and accountability that helps foster great ideas and innovation.Knowledge Sharing: A part of our DNA at Xebia is sharing knowledge. We invest in our team members for them to be sources of Intellectual capital rather than employees. We have various programs and meetups dedicated towards the same. Several Xebians have authored bestselling books on technology. Click here to have a look at Xebia Intellectual Capital. Have a look at our Xebia Knowledge Exchange Stream a fortnightly Knowledge sharing meetup, where Xebians teach their skills to each other.Interested to know more about #XebiaLife? Connect to us on LinkedIn, Twitter , Facebook and Instagram Your journey at Xebia will be focused on gaining and sharing knowledge, doing enriching and meaningful work and being a part of a tightly knit and young Xebia community spread across several countries.", "Role": "IT/Technical Content Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Other", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Software Development Life Cycle", "C++", "Express", "Software Engineering", "UML", "Software Architecture", "Client Server", "Languages", "Object Oriented Programming", "Python"]}