{"Job Title": "Software Developer - For Be/Btech/BCA/MCA Freshers", "Company": "EduBridge Learning Pvt. Ltd.", "Experience": "0 - 1 years", "Salary": "₹ 1,50,000 - 2,50,000 P.A. ", "Location": "Mysore/Mysuru, Shimoga/Shivamogga, Bangalore/Bengaluru", "Job Description": "Training & Placement Program sponsored by CapGemini. Software Developer: C++, Core & Advanced Java, VB.Net, LinuxModifying software to fix errors, adapt it to new hardware, improve its performance, or upgrade interfaces.Directing system testing and validation procedures.Directing software programming and documentation development.Consulting with departments or customers on project status and proposals.Working with customers or departments on technical issues including software system design and maintenance.Analyzing information to recommend and plan the installation of new systems or      modifications of an existing system.Consulting with engineering staff to evaluate software-hardware interfaces and develop specifications and performance requirements.Designing and developing software systems using scientific analysis and mathematical      models to predict and measure outcomes and design consequences.Preparing reports on programming project specifications, activities, or status.Conferring with project managers to obtain information on limitations or capabilities.Desired Candidate Profile BE/BTech/BCA/MCA graduate2018, 2019 or 2020 passoutCollege going participants are not allowedCandidate must be looking for a job in Bangalore ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "BCA in Any Specialization, B.Tech/B.E. in Any Specialization", "PG": "MCA in Any Specialization, M.Tech in Any Specialization", "Doctorate": "None", "Key Skills": ["Java", "Software Development", "Software Engineering", "Bca", "MCA"]}