{"Job Title": "Sr Software Engineer Mobile Developer", "Company": "Madhees", "Experience": "6 - 11 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "    Sr Software Engineer Mobile Developer   Job Description :   We are looking for Senior Software Engineer Mobile Developer with 6 Years of relevant work experience. We need our engineers to be versatile, display leadership qualities and be enthusiastic to tackle new problems as we continue to push our technology forward.\"   Job Location: Hyderabad Required Skills :   React Native, Microservices, OOPS, Data structures, Algorithms, Hybrid mobile development       Roles and Responsibilities:     Deliver across the entire app life cycle concept, design, build, deploy, test using leadingedge hybrid technologies such as React Native.   Build reusable prototypes with outof-the-box thinking   Working along with different squads to create and maintain a robust framework to support the app   Working with the front end developers to build the interface with a strong eye on user experience.   Optimizing performance for the app.   Keep up to date on the latest industry trends in mobile.   Gathering requirements, application design, technical leadership, support API design capabilities, designing Unit testing frameworks for mobile, and implementation.   Engagements will include building responsive UI on Native mobile platforms and cross platform offerings for both tablet and handheld form factors.      Mandatory Qualifications :     Strong in OOPs, Data Structures and Algorithms   6 years of overall software development experience.   2 years of development experience on Mobile using Microservices Architecture   2 years of hybrid mobile development experience using Javascript Technologies (React Native or Angular)   Experience in Test frameworks is a must (CasperJS / PhantomJS / Mocha / Jasmine.)   Experience with code versioning tools, preferably Git (Github, Gitlab etc.) and the feature branch workflow   Knowledge of CI/CD process   Experience with automation tools like Npm/Webpack/Grunt/Bower etc is a must.   Experience working in an Agile/Scrum environment   ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["github", "Front end", "GIT", "Concept design", "Mobile development", "Javascript", "Technical leadership", "Data structures", "Workflow", "Unit testing"]}