{"Job Title": "Window's Software Developer", "Company": "Talent Sketchers ", "Experience": "4 - 8 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "Roles:-Window's Software DeveloperEXPERIENCE:Develop   application software using Windows platforms. Total experience in Windows Software Application development - Minimum  4 years and Maximum  8 years.Windows Application Development  1. Should have Minimum 4 years of hands on experience   in developing Windows applications on Microsoft WPF platform2. Should have Minimum 4 year of hands on experience   in Windows applications / Enhance and Support Windows Applications on   Microsoft platform (.NET, C#, MS SQL, VB, VBA, MS Office products)Any experience with web application development and support is a added advantage.Location:- PuneQualification:- BE (IT/   Computer/ Instrumentation/ Electronics), MCA, MCS, MSc Computer or compatibleResponsibilities :- Independently will be able   to Develop / Enhance and Support Windows Applications on Microsoft platform   (.NET, C#, WPF, MS SQL, VB, VBA, MS Office products)Perform Unit Test, System   Test and Integration Test ensuring all requirements are implemented with   Good Quality, within Timeline and Budget. Window Software DeveloperShould be able to Analyze   Requirements and Prepare Requirement Understanding document. Do Impact Analysis   and raise Technical Queries. Technical Designs    strong in understanding and adopting OOP principles and implement design   patterns  Singleton, Factory, Abstract Factory and Faade Patterns etc. MVC   / MVVM Presentation pattern.Understand Project   dynamics and and adapt to changing scenarios. Raise concerns and Risks   at appropriate time and Communicate well with all stakeholdersStatus reporting and   Progress Reporting  Notice Period:- Immediate Hiring Thanks & Regards  ChetnaHR RecruiterTalent Sketchers(M)7888005328(E)chetna@talentsketchers.com(W)www.talentsketchers.com", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "MCA in Computers", "Doctorate": "None", "Key Skills": ["C#", "MS SQL", "VBA", "MVVM", ".Net", "WPF", "MS Office"]}