{"Job Title": "Software Developer (C++/python), Mumbai, Upto 35 LPA", "Company": "Credence HR Services ", "Experience": "4 - 9 years", "Salary": "Not Disclosed", "Location": "Mumbai (All Areas)", "Job Description": " Greetings from Credence HR ServicesWe are hiring for one of the leading investment bank based out of Mumbai.The primary responsibilities for this role will include:Programming: Must      have demonstrated programming experience with C++. Experience in working /      creating customized C++ libraries will be a plus.  Software      Engineering: Duties including the full-range of programming tasks  problem analysis, solution determination, code design and development,  integration, test, modification and documentationOverall, the candidate will need to work closely with teams in Asia-Pacific and/or London and/or New York and will need to be proactive to improve desk efficiencies, access and learn highly sophisticated solutions.Qualifications:B.E./B.Tech./M.S./M.Tech in Computer Science / Information TechnologyHigh level of proficiency in C++ programming; 4-5 years of hands-on experience on recent projectsHaving Python hands-on experience will be plusExperience in similar roles in Quant Research and Model Development will be an advantageHighly analytical bent of mind and quantitative  skills;  Good communication and team skills in a multi-location setupClose attention to detail and ability to work to very high standards Ideal candidates for these positions would be a graduate/post-graduate from a premier college or institute. A computer science or mathematics background will be most suitable. Interested candidates can share their resumes at alka@credencehrservices.comor call on 9410033320", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "M.Tech in Any Specialization", "Doctorate": "None", "Key Skills": ["C++", "Software Development", "Algorithms", "Multithreading", "Data Structures", "Computer Vision", "Python"]}