{"Job Title": "Senior Software Developer - PHP/HTML/CSS/Javascript", "Company": "Talpro", "Experience": "4 - 8 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": "Roles and ResponsibilitiesReporting to: Manager, TechnologyAs a Senior Software Developer, you will be a part of the technology team to build cloudbased enterprise class web applications.Responsibilities:- Contribute to the Software development and architecture team to take the development to the next level- Help introduce modern standards into the team and act as a solution architect- Meet aggressive deadlines while working under pressure, dedication to building high-quality deliverables while being thorough in all aspects of the development lifecycleRequirements:- Hands-on experience in Core PHP (5.3+) is a must. 4+ years of experience with PHP and familiar with XHTML, HTML 5, JavaScript, CSS, Ajax, jQuery etc.- Hands-on experience with Object oriented programming and thorough understanding of design patterns- Hands-off experience with TDD and Unit testing and standards based development- Thorough understanding of database modeling and at least 4 years of experience with MySQL, PostgreSQL OR any other Relational database- At least 1 year experience with one or more of the NoSQL datastores (MongoDB, CouchDB) and KV storage engines (redis, dynamodb, memcached etc.)- Exposure and understanding of distributed applications- At least 3 years of experience with one or more of the modern PHP frameworks- Thorough understanding of git and gitflow. Experience with continuous buildtest and integration systems- Understanding of payment systems, internationalization and localizationPreferred skills:- Understanding of Infrastructure and operations- Experience with AWS cloud- Experience with nodejs, angular, express and the concept of single page webapp- Good communication and presentation skillsLocation: Andheri West, Mumbai ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "BCA in Computers, B.Tech/B.E. in Any Specialization, B.Sc in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["AngularJS", "CSS", "jQuery", "Cloud", "Javascript", "PHP", "HTML", "MongoDB", "Node.js", "AWS", "AJAX"]}