{"Job Title": "MTS Software Development Engineer", "Company": "Advanced Micro Devices, Inc", "Experience": "8 - 13 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "                        Job description      Responsibilities:              Designing and developing code, hands-on debugging and resolving customer issues.        Develop software to consume latest hardware capabilities.                                    Understand Maintain the existing software and perform changes based on the field requirements.                                                  Should be able to provide the overall software design architecture.                                                                  Define and implement high performance software by demonstrating a strong understanding latest software technologies trend.                                                                                  Work with the leads, partners and customers to develop and evolve the vision and strategy for the team and then translate that into an achievable road mapaction plan                                                                                                  Collaborate closely with test team in implementing the use cases and reviewing test plan                                                                                                                 Skills:                                                                                                                           Experience with C++ language, object-oriented programming, and modern languages like Rust, Go, Swift.                                                                                                                                     Domain Expertise is highly recommended in following areas,       Manageability: Enterprise-wide administration of distributed devices      Remote access technologies: WMI, RPC, VNC, RDP        Networking concepts: DNSDHCP, HTTPSTLS, Active directory domains, networking protocols                                                                                                                                                                                Experience in developing cloud-based applications.        Understanding of system hardware components and software ecosystem (Windows Linux)        Good understanding of UI, usability user experience                                                                                                                                                                                                                    Should be well versed with using enterprise tools viz. source control, bug tracking                                                                                                                                                                                                                                  Strong communication skills with the ability to work with all levels of the organization                                                                                                                                                                                                                                                  Ability to work both individually and as part of a team.                                                                                                                                                                                                                                                                  Excellent time management skills with the ability to contribute to multiple concurrent projects.                                                                                                                                                                                                                                                                               Setup development test environment.     Proven technical leadership demonstration is a must.     Education and Experience:       MSM TechBE in Computer Engineering Electronics Electrical Engineering                                                                                                                                                                                                                                                                                                                Should have total experience of 10-12 years, with at least 8+ years of relevant experience.                ", "Role": "Software Developer,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Graphics", "Software design", "Linux", "Software Development Manager", "Debugging", "Active directory", "DNS", "Test planning", "Windows", "DHCP"]}