{"Job Title": "Sr Software Engineering  MS Dynamics CRM Developer", "Company": "Epiq Systems, Inc.", "Experience": "5 - 8 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "   Qualification Requirements:    B-Tech, MCA         Position Summary       This position entails development and modification of modification, extensions, or integrations to Epiq s MS Dynamics CRM on premise implementation for high-volume, mission critical use.      The role will primarily focus on hands-on coding of the project using the CRM SDK, HTML, and Java Script technologies.      Proven ability to organize workload and priorities and complete tasks on time to work effectively in a team environment.      Acts as a resource for other software engineers; and a liaison between department manager and other analysts, as well as the business team.       Responsibilities:            Use Agile Scrum SDLC methodologies in the full life cycle software development process including requirements analysis, software design, prototyping, programming, debugging and testing of system software production applications.      Participate in technical design and implementation.      Proactively raises issues if specification will lead to quality, system performance, or architectural issues in product.      Collaborate with fellow developers in areas of expertise as well as members of business unit.      Demonstrate self-directed and proactive approach to solving problems.      Develop, debug and deliver enterprise applications.     Demonstrate self-directed and proactive approach to solving problems.     Proactively mentor fellow developers in areas of expertise.          Job Qualifications and Requirements:         6 years of CRM SDK and Developers Toolkits   5 years UI Development (HTML, JavaScript, Silverlight, etc.)    5 years of experience developing software in C# / .NET     5+ Experience with SQL Server, with Entity Framework experience.     5+ years of experience developing web applications with experience in AngularJs/SPA/WebApi a plus.    Data migration and integration mapping experience   SQL Server   Web Development   Experience with Business Processes    Outstanding troubleshooting and technical support skills     Experience writing multi-tier components for high volume systems     Strong oral and written communications skills     Advanced degree or training in related technical field preferred   ", "Role": "Software Developer,", "Industry Type": "Telcom, ISP,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial", "PG": "MCA in Computers", "Doctorate": "None", "Key Skills": ["Coding", "Enterprise applications", "Silverlight", "Web development", "Workflow", "Troubleshooting", "Technical support", "SDLC", "SQL", "CRM"]}