{"Job Title": "Software Developer", "Company": "Power of N", "Experience": "0 - 1 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "   We are looking for a talented engineering graduate (CS,IT) with 0-1 year of experience with a passion for technology and software to join our team to build superior and high quality products and services.    Skills you must possess      Good analytical and quantitative problem solving skills   Good understanding in Computer Science - OOPS, Data Structures, Algorithms, and basic Networking.   Exposure to concepts related to API, IOT and Distributed Databases.   Strong record of achievements in academic and extracurricular activities   Additional technical qualifications, courses or certifications   Work experience as an intern in any company, in a technical capacity   Quality of college project vis a vis concept and detail   Strong communication and collaboration skills   Time management skills and attention to detail     What you will do      You will have opportunities to work on the latest technologies such as IOT, BigData, System Integrations, RPA or DevOps   You will be involved in the design and development phase of addressing real world business workflows   You will gain hands-on experience with industry leading SAAS platforms   Understand client requirements and how they translate into the software development lifecycle   Write high quality code to program applications within deadlines   Perform unit and integration testing and support in creation of technical documents and handbooks   Be flexible and show willingness to travel   Get a conducive learning environment with high level of mentoring and coaching   Receive active encouragement to seek and expand technical and executive skills    ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Executive", "Networking", "Time management", "Analytical", "SAAS", "Integration testing", "Software development life cycle", "Data structures", "Technical documentation"]}