{"Job Title": "Software Developer (UI Developer)", "Company": "Amdocs Development Center India Pvt. Ltd.", "Experience": "4 - 6 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "   You will take ownership and accountability of specific modules within an application and provides technical support and guidance during solution design for new requirements,  problem resolution for critical / complex issues   You will Ensures code is maintainable,  scalable and supportable.   You will present demos of the software products to stakeholders and internal/external customers,  using knowledge of the product/solution and technologies to influence the direction and evolution of the product/solution.   You will investigate issues by reviewing/debugging code and providing fixes (analyzes and fixes bugs) and workarounds,  will review changes for operability to maintain existing software solutions,  will highlight risks and will help mitigate risks from technical aspects.   You will bring continuous improvements/efficiencies to the software or business processes by utilizing software engineering tools and various innovative techniques,  and reusing existing solutions. By means of automation,  reduces design complexity,  reduces time to response,  and simplifies the client/enduser experience.\"       Below are the mandatory skills:    AngularJS ,  reactJS ,  JavaScript ,  HTML ,  CSS   RESTful Services   Docker/Kubernates    Secondary Skills:    Excellence in modern Javascript and HTML5   Experience - 4 to 6 Years   Ability to communicate thoroughly with all departments involved   Extensive prior experience with AngularJS,  its best practices and popular modules   Ability to create self-contained,  reusable,  and testable modules and components that build on the elements and modules of core AngularJS   Skill in maintaining clean and consistent project dependencies   Knowledge of SEO best practises for single page apps   Extensive knowledge of CSS and JS animations   Thorough understanding of the responsibilities of the platform,  database,  API,  caching layer,  proxies,  and other web services used in the system   Validating user input on the client side and implementing meaningful feedback   Skill in designing a modern build process that integrates testing and continuous delivery   Habit of documenting your code inline using JSDoc or similar ways   Experience with writing extensive unit tests using automated TDD tasks   Experience with building the infrastructure for serving the front-end app and assets   Creating e2e test suites for all components and running them with Protractor (or alternatives)   Hands-on experience with creating configuration,  build,  and test scripts for Continuous Integration environments        ", "Role": "Software Developer,", "Industry Type": "Telcom, ISP,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Automation", "Front end", "Test scripts", "TDD", "Debugging", "Javascript", "HTML", "SEO", "microsoft", "Technical support"]}