{"Job Title": "Software developer/Engineer - Java-Web application", "Company": "Hewlett Packard Enterprise", "Experience": "4 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": " Researches, designs, develops, configures, integrates, tests and maintains existing and new business applications andor information systems solutions including databases through integration of technical and business requirements. Applications and infrastructure solutions include both 3rd party software and internally developed applications and infrastructure. Responsibilities include, but are not limited to, analysis of business requirements, coding of modifications or new program, creation of documentation, testing and maintenance of applications, infrastructure, and information systems including database management systems. Works within the Information Technology function, obtaining resources and working in support of objectives and strategies. Provides required documentation and participates in architecture reviews to ensure that the solutions comply with standards and use approved technologies. Typical customers are company end users and various functional areas such as Supply Chain, Research and Development, Marketing, Finance, a business, or the company.      Responsibilities:      Participates as a member of development team or teams; may lead a small development team. Performs analysis of functional and business requirements. Prepares code stubs for others. Completes code to implement solutions.  Contributes to design activities; may design solutions.  Codes independently; participates in code reviews and may lead code reviews. Designs, prepares and executes Unit tests. Applies in-depth or broad technical knowledge to maintain one or more technology areas (e.g. Database Administration). Performs solution design. Applies the company and 3rd party technologies to highly complex infrastructure and software solutions. Independently implements end-user or enterprise infrastructure of moderate complexity or services prepared by more senior technologist for more complex solutions.     Education and Experience Required:         Typically a technical Bachelors degree or equivalent experience and a minimum of 6 years related experience or a Masters degree and a minimum of 4 years of experience.     Knowledge and Skills:             2 or more years of experience writing code (such as, and not limited to, Java, C, C , C#, VB.Net; databases like SqlServer Oracle; and Testing tools.  Experience of multiple full release cycles. Understanding of modern software development methodologies (Object).  Understanding of modern software development tools and SCM.  Understanding of Software Test methodologies, and testing tools. Strong understanding of Basic Database Administration. General Project Management (developing).  Customer Vendor Management. Business Analysis.  Good verbal and written communication skills; ability to work effectively in a team. Web Technologies  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Supply chain", "Software development methodologies", "Testing tools", "Business analysis", "Coding", "Project management", "Database administration", "Oracle", "SCM", "Information technology"]}