{"Job Title": "Senior Software Engineer (Xamarin Developer)\n", "Company": "PEOPLESTRONG TECHNOLOGIES PRIVATE LIMITED  ", "Experience": "3 - 8 years", "Salary": "₹ 7,00,000 - 17,00,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": "Job Role: Senior Software Engineer (Xamarin Developer)Job Location: Bangalore Job Type: PermanentWhat part will you play? You are responsible for research, design, coding, debug and testing of new or existing features You will be involved in designing and integrating software applications running on multiple  platform types into the overall architecture Experience in source control and collaboration tools like GIT and TFS You have strong analytical and problem-solving abilities, with quick adaptation to new  technologies and methodologies Preferred Skillset:Do you have an Engineering Degree with 4-5 years of experience in developing software solutions  with various Application programming languagesYou must have good experience in Xamarin Forms for creating the user interface. Solid grasp of the full mobile development life cycle.You should have Excellent knowledge of C#, Xamarin Forms, Xamarin Android, Xamarin iOS,  Android, iOS, .Net Framework Good understanding of MVVM design patterns and Unit Testing Strong Troubleshooting skills to resolve Technical Skills. Experience in working with GIT, Familiar with the concepts of continuous integration Demonstrate ability to apply Practices and Patterns as guided by the Architect! ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "M.Tech in Any Specialization, MCA in Any Specialization", "Doctorate": "None", "Key Skills": ["C#", "Application Programming", "TFS", "Software Development", "Xamarin", "Unit Testing", "MVVM", "Software Engineering", "Design Patterns", ".NET Framework", "Android"]}