{"Job Title": "Software Developer", "Company": "Bar Code India Ltd", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": " About the JobWe are looking for a motivated Senior Software Engineer with a passion for dealing with software, to support our growing business and some of our largest customers in respective Geographies. You will help define and architect products, algorithms, and data systems that deeply integrate core software and services to drive innovations. This role is inherently cross-functional, working with core software systems across the company to increase the efficiency of all teams internally and make the experience pleasant for all partners and users.The pace of our growth is incredible  if you want to tackle hard and interesting problems at scale, and create an impact within an entrepreneurial environment, join us! What are we looking for in the Ideal Candidate? Own, design, develop and deliver highly scalable Cloud Applications/Frameworks.Work with Product Management, Architect, Engineering groups to understand the current requirement, future roadmap and deliver forward looking applications/components.Lead feature development (end to end) and follow through with other team members to ensure high quality and predictable deliveryPerform research on various technologies and evaluate how they can be integratedEnsure high quality is maintained and each code commit is deployable to production with zero down time.Skills that must have in the Ideal Candidate:Should have 2-5 years of experience with good command on C#, ASP.Net MVC/Core, SQL Server, LINQ, JavaScript, AJAX, HTML5, CSS, JSON, JQuery, Entity Framework Core, Visual Studio 2019.Working knowledge of the general web development landscape, architecture, trends, and emerging technologies.Perform unit and system level testing on applicationsThorough understanding of Data Structures and Algorithms.Self-driven with great technical interests, should be quick learner, should have attention to details.Ability to work independently and collaboratively.Possess good communication skills and client Interaction experience.Skills that Good to have in the Ideal Candidate:Knowledge about the Agile development process.Knowledge of DevOps, mobile development.Earlier experience of working in products is preferable.Understanding of established design patterns and know when to use themAttributesProven ability to work well with others in a fast paced, iterative product definition and development environmentAble to work independently with little direct supervision and take initiative and willing to mentor and solve problems Job SpecificationsTitle: Software EngineerQualification: Bachelor degree/ Masters in Computer Science /ITExperience: 2-5 YearsEmployment Type: Permanent Job, Full TimeJob Location: Bangalore About Bar Code India For more than two decades Bar Code India Limited has been the market leader in bringing visibility and agility in the supply chain of our clients across verticals. BCI offers solutions & advanced BI tools that provide you with complete visibility of your assets and intelligence in your supply chain leading to higher value generation for you and your customers.Our solutions are deployed in mission critical processes by some of the best organizations in the world. We integrate our solutions for seamless data exchange with all leading ERPs such as SAP, Oracle, Baan and other customized applications.Our experienced team of professionals who have in-depth domain knowledge and deep technical skills help BCI to identify and understand customer problems and provide best solutions to address them.Bar Code India is a place where extraordinary people gravitate in order to do their best work. Together we craft customized solutions and experiences people once couldnt have imagined — and now can’t imagine living without! If you’re excited by the idea of making a real impact, and joining a team where we pride ourselves in being one of the most diverse and inclusive companies in the Country, a career with BCI might be your dream job!Visit us at www.barcodeindia.com  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "BCA in Computers, B.Tech/B.E. in Electrical, Electronics/Telecommunication, Computers, B.Sc in Computers", "Doctorate": "None", "Key Skills": ["C#", "ASP.Net", "MVC", ".NET Framework"]}