{"Job Title": "CMS R&D - C Telecom Software Development Engineer", "Company": "Hewlett Packard Enterprise", "Experience": "3 - 5 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  Hewlett Packard Enterprise (HPE) advances the way people live and work. We bring together curious minds to create breakthrough technology solutions, helping our customers make their mark on the world. Our Communications Media Solutions (CMS) business brings digital transformation expertise of over 30 years to telecommunications and media companies. We help communication service providers solve their most pressing business problems every day. We are driven to innovate, delivering solid solutions to an industry in constant transformation. We believe in the power of collaboration and building long term relationships with our telecommunication customers and partners. Act - Innovate - Partner are the values we live by.      Summary     3-5 years hands on experience in telecom domain mainly in mobility and subscriber data management.   Candidate should have implementation knowledge on 3GPP , LTE interfaces. He/she should have working knowledge of call processing, security (IP Sec, TLS, STCP), audit tools, and routing, using technologies like C, C , and Linux with GSM, SS7, DIAMETER, RADIUS, LDAP, and OpenSSL standards.     Responsibilities     Design, build, and maintain efficient, reusable, and reliable C code   Implement performance and quality modules   Identify bottlenecks and bugs, and devise solutions to these problems   Help maintain code quality, organization, and automation   Work closely with other engineers to develop new products       Education      Bachelors or Masters degree in Computer Science, Information Systems, or equivalent.      Knowledge and Skills:     Experience with algorithms/data structures knowledge.   Good OOP knowledge.   Software development lifecycle experience with Agile methods   Experience with Windows and LINUX.   Good understanding of TCP/IP protocol.    ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Telecom Software,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["GSM", "Automation", "Linux", "LDAP", "SS7", "CMS", "Agile", "Data structures", "Windows", "Auditing"]}