{"Job Title": "Software Developer", "Company": "VinAudit", "Experience": "2 - 7 years", "Salary": "₹ 13,00,000 - 20,00,000 P.A. ", "Location": "Hyderabad/Secunderabad, Chennai, Bangalore/Bengaluru", "Job Description": "Required experience:Must have experience designing object-oriented software at scaleMust have experience working effectively with a team of developers to launch productsMust have experience using traditional web technologiesBonus experience:Experience developing scrapers for extracting web dataExperience processing millions of records of dataExperience administering Linux/CentOS serversSoftware Stack:OS: CentOS 7Languages: Python, PHPDatabases: MySQL, PostgreSQL, SQLiteTechnologies: Apache Spark, Apache CassandaraThis role involves:Documenting technical requirements for each development project we undertake.Exploring technologies, storage schemas, and solutions to meet project requirements.Architecting classes with careful organization for scalability and maintainability.Shipping products with high quality, clean design, and fast implementation!Benefits: Profit Share, Health Coverage, Stable EmploymentThis is a very challenging role that will require someone who is able to jump in on multiple projects at once, communicate clearly with each project, and write a lot of new code each day! If you're interested, please reply with a brief summary of how your experience, your skills, and your interest might be compatible with this role.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Electrical, Electronics/Telecommunication, Computers", "PG": "M.Tech in Computers, Electrical, Electronics/Telecommunication", "Doctorate": "Ph.D in Electronics/Telecommunication, Computers, Electrical", "Key Skills": ["Software Development", "Linux", "Postgresql", "MySQL", "SQLite", "Cassandra", "PHP", "Spark", "Apache"]}