{"Job Title": "Trainee Software Developer", "Company": "Emipro Technologies", "Experience": "0 - 1 years", "Salary": "Not Disclosed", "Location": "Rajkot", "Job Description": "  Qualification:   B.E. / B.Tech / M.E / M.Tech / MscIT / MCA    Freshers Can Also Apply  Summary   We are looking for an efficient Trainee - Software Developers who are responsible for analysing, designing, developing, documenting, testing, and implementing business applications that provide solutions to support our customer s business processes add value to their business.  Job Responsibilities    Develop code, document execute unit tests, systems, integration and acceptance tests, and testing tools for functions of high complexity.     Adopt new and emerging technologies to provide solutions to client needs.     Ability to understand client requirements and translate them into suitable solution architecture.     Be flexible to work on varied technologies and cater to time difference needs.     Identify technical issues and provide resolution.     Willingness to work on client site as and when required.    Required Skills    Sound Knowledge in Object Oriented Programming, Relational Databases SQL concepts.     Exceptional analytical and problem-solving qualities.     Must be skilled in writing clean, efficient code follow best practices for programming.     A Quick Learner, very approachable, honest, and a fun team player with having Can-Do approach.     Eager to learn new things all the time.     Must have awareness of new technologies.     Should have good knowledge of HTML JavaScript.     Ability to understand client requirements and translate them into business solutions.   Working environment    Programming Language: Python Javascript     Database: Postgresql (with object-relational mapping)     Operating System: Ubuntu     Collaboration platform: GitHub, Bitbucket     Framework: Odoo (ORM, Workflows, Report Engine, BI)  ", "Role": "Software Developer,", "Industry Type": "Internet, Ecommerce,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial", "PG": "M.Tech in Electronics/Telecommunication, MCA in Computers", "Doctorate": "None", "Key Skills": ["Solution architecture", "Ubuntu", "github", "Testing tools", "Postgresql", "Analytical", "Javascript", "Business solutions", "SQL", "Python"]}