{"Job Title": "Software Development Engineer", "Company": "Alph@linx Technologies Ltd", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Field of working : IT Software Product Development Services\n\nChallenge : Candidates will have the opportunity to work in the field of cutting- edge advanced J2EE technologies and in the ERP application domain. Candidates will be fully assured of a flying career in this technology area.\n\nJob Description : Design,  Develop and customize ERP software product for Manufacturing,  University,  R&D centers and EGovernance sectors (HR/  Finance/  Materials/  Sales/  Maintenance/  Manufacturing) using Advanced Java and Open- source technologies in J2EE.\n\nCommitment : Alphalinx provides a comprehensive training on the fundamentals of design,  development and maintenance of Java Enterprise Applications. The employees would gain solid experience on both Technology and Domain fronts of Business Applications that would open- up long- term career opportunities after 3+ years of work experience with Alphalinx. Alphalinx spends considerable amount of resources,  time and money incurring substantial cost for providing a valuable experience in enterprise IT solutions.\n\nThe commitment period along with compensation for the three career stages will be as found below: A)\n\nStage- I\n\n= 6 to 9 months of on- the- job Technology based Foundation Training with fixed stipend (Min. Rs.10, 000 to Max. Rs.11, 000 per month)\n\nB)\n\nStage- II\n\n= 6 to 12 months on- the- job Industrial Domain oriented training with fixed salary (Min. Rs.1, 74, 592 to Max. Rs.2, 41, 012 per annum CTC)\n\nC)\n\nStage- III\n\n= 18 to 24 months of Productive contribution with variable salary (Min Rs.2, 22, 726 to Max. Rs.3, 82, 154 per annum CTC)\n\nStage promotion and salary increase will be based on performance.\n\nQualification : B.E./ B.Tech (CSE/ IT) or M.E/ M.Tech (CSE/ IT) or MCA passed out after 2016 from reputed University with minimum 65% of marks in Xth,  XIIth and Degree exams.\n\nLocation : Bangalore with frequent travel to customer locations across India.\n\nExperience : 0- 1years\n\nTraining /  Certification : Should have completed Training course in Java Web Application development using J2EE (JSP/ JScript/  EJB/ Serveletts)\n\nCANDIDATE PROFILE :\n\n Knowledge in Core Java (Interface,  Multi threading,  Collections,  etc., )\n\n Knowledge in Advanced Java (Servletts,  EJB,  etc., )\n\n Any one of the Javascript library (JS,  JQuery,  ExtJS,  Mootools etc)\n\n J2EE (Servlets,  JSP,  JSF etc) Framework (Struts,  Spring,  Hibernate etc)\n\n Architecture (MVC)\n\n Webservice knowledge is essential (Either SOAP /  REST)\n\n Knowledge in debugging and unit testing (JUnit)\n\n Integrated Development Environment (Eclipse)\n\n Attitude to learn advanced enterprise level technologies.\n\n Preference will be given to Male candidates willing to travel across India\n\n Preference to candidates with native place IN/ AROUND Bangalore or nearby towns/ cities within 500 KM radius of Bangalore", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["software", "Eclipse", "J2Ee", "mca", "Core Java", "java", "web", "debugging", "JSF", "architecture", "Hibernate", "development", "erp", "solid", "level", "JSP", "testing", "it", "javascript", "jQuery", "application", "Struts", "MVC", "EJB", "soap", "applications"]}