{"Job Title": "Software Developer (Security)", "Company": "Siemens Limited", "Experience": "0 - 5 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": "  What part will you play      We are looking for a Software Developer (Security) who can develop patches, test them, and deploy them for our cloud solution in coordination with development team.    You will work closely with our Product Development team as well our Cloud Operations team to help build secure and robust systems responsible for serving our customers from critical infrastructure.    The Software Developer (Security) provides coding expertise in the analysis, development, and evaluation of security solutions to secure applications.    Your primary responsibility will involve development and delivery of parts of software component(s) in projects based on the software design.   Here, you will develop differentiated tasks by translating the software design into code in accordance with the partners quality requirements.   Analyzing software requirements and software functional specification and implementation, and documentation of assigned part of component / work product based on project schedule will also be your core responsibility.   In terms of coding, you will write/ test code for part of software component/ work product, unit test the implemented solutions, ensure quality of the developed part of component(s) / work product(s) (conformance with development process) and its technical delivery.   You will ensure investigation and fixing of software defects found by test / review team to ensure product quality.   In addition to the above responsibilities mentioned, you will perform regular internal technical coordination / review to ensure risk identification and to support the initiation of risk mitigation by Project Manager and all relevant project partners.      Use your skills to move the world forward!      You have a degree in science or engineering with 2- 5 years of software development experience.   We desire you to have experience in Full stack web development using Typescript, Angular4 , HTML5 and CSS3, Spring boot, Spring Cloud, Java, and AWS   Exposure to CI/CD tools, Code Analysis, and Test automation is preferred   Must have good analytical, debugging and tracing skills. Should be well-versed with clean code principles and secure coding is beneficial.   You must have Effective verbal and written communication skills   ", "Role": "Software Developer,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Product quality", "Software design", "Coding", "Analytical", "Web development", "Debugging", "Cloud", "Siemens", "Manager Technology", "CSS3"]}