{"Job Title": "Software Development Engineer in Test", "Company": "CareerXperts Consulting", "Experience": "3 - 7 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": " As a Software Development Engineer in Test, you will work on the integration with backend services to ensure high reliability, availability, performance and operational readiness of the platform.     M.S. or B.S. in Computer Science and equivalent experience.   Experience in production software development and testing.  You have experience with one or more object-oriented programming language, like Java, C# ,C++, or Ruby.   You have hands-on experience with test frameworks like TestNG, JUnit, RSpec etc.   You re proficient in writing REST API automation tests including client generation, customizing request payloads, requestresponse logging, response verification etc.   You have CICD experience; including exposure to build tools such as Maven, Gradle, JenkinsTravis, GOCD etc.   You have sound knowledge of applying computer science concepts (efficient design patterns, algorithms and data structures).   You have a clear understanding of testing methodologies and best practices.   You re an expert in writing unit, integration tests and system level tests.   You have solid communication and collaboration skills      Responsibilities      Architect and implement automation frameworks that allow us to validate RESTful services.   Work on test tools that are leveraged across the company for test data creation, monitoring, compliance testing, etc.   Research emerging test tools, trends and methodologies and enhance existing systems and processes.   Act as test lead in various work streams working closely with PMs, devs and collaborate across teams.   Help define and improve our testing and release processes.   Mentor other SDETs on test methodologies, test automation, coding standards and best practices through code reviews and designing test plans.   Provide support for platform related issues; triage and troubleshoot issues reported by other teams to help with early resolution.   ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Medical-MS/MD in psychology", "Doctorate": "None", "Key Skills": ["Computer science", "Maven", "C++", "Backend", "Coding", "Data structures", "JIRA", "Ruby", "Operations", "Monitoring"]}