{"Job Title": "Software Developer - MRI Applications/yardi", "Company": "CBRE", "Experience": "3 - 5 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "     Job Description :         Overall Responsibility :   - The candidate would join the CBRE Software Development team and would be primarily responsible for supporting Real Estate Accounting Services (REAS) lines of business and corresponding products.          - The candidate will be comfortable in learning new technologies and have experience in supporting accounting or financial software solutions   Key Responsibilities :   - Provide day to day production support for end users.   - Troubleshoot and resolve system issues and engage other internal teams or software vendors as needed.   - Assist with maintenance of existing financial reports and creation of new financial reports as needed to address new business requirements   - Assist with the design and maintenance of existing product infrastructure.   - Design, develop, and support data integrations (SSIS, SSRS, APIs, flat files, etc.)   - ManageSupport Data Quality initiatives primarily using system reports and SQL Server   - Assess and report the impact of change requests with respect to data to product teams during the requirement analysis phase   - Participate in product scrum meetings to capture data design and architecture needs   - Support and maintain product Monitoring Logging framework   - Establish best practice standards mixed with CBRE standards for databases, process, tools, and methodologies   - Advise product teams to solve architecture technical problems that a product has encountered   - Participate in software productvendor selection for new technologies being evaluated by the support line of business          Required Candidate profileExperience : - 3 to 5 years of technical experience in information technology in various sized organizations in various roles. - 1-2 years of MRIYardi accounting or financial software system design, implementation and support. Required Knowledge & Skills : - MRI Toolkit knowledge - Yardi and MRI setup, configuration and integrating to other systems - Service Oriented Architecture - Experience writing SQL queries, stored procedures, etc. - Experience in financial report creation and maintenance (SSRS, Crystal, Tableau, Power BI, etc) - Experience in performance tuning of databases and data migration. - Experience with agile software product design principles. - Must possess strong organizational, facilitation and critical thinking abilities", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - DBA, Datawarehousing,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization, BCA in Computers, B.Sc in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required, Any Doctorate in Any Specialization", "Key Skills": ["MRI Applications", "System Design", "Power BI", "SSRS", "SQL Server", "Tableau", "Service Oriented Architecture", "Yardi", "SSIS", "Performance Tuning", "Production Support", "Data Integration"]}