{"Job Title": "Java Developer clearing software solutions", "Company": "Macquarie Global Services", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": "  Java Developer clearing software solutions    This role will see you with the business to understand their requirements as you design and develop clearing software solutions, being meticulous and thorough deliver high quality code that is fully tested and optimised, mostly based on but not limited to Java technology. You will build automated testing during the delivery of the software and also provide maintenance and enhancements to the existing code base. You ll also get the opportunity to contribute to the ongoing evolution of our platform design and tool chain and using your understanding of security policies and Tier One requirements you ll create solutions that comply with these rules.   To be successful and thrive in this role you will be a highly motivated individual with a strong background in Computer Science or Software Engineering and have excellent communication skills in order to engage with all levels of our stakeholders. In addition, you ll bring the following technical skills:    3 years of industrial experience in Java technology such as Java, Spring, Hibernate and Messaging   RDBMS and SQL experience including performance tuning and database design   Familiarity with Source Code Control tools like Git   Experience with Unix/Linux and shell script.   ", "Role": "Software Developer,", "Industry Type": "Banking, Financial Services, Broking,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Unix", "Computer science", "Performance tuning", "Hibernate", "Linux", "RDBMS", "Database design", "Investment banking", "Asset management", "SQL"]}