{"Job Title": "Software Developer (Python; Only Female candidates should apply)", "Company": "Lanim HR Solutions  ", "Experience": "0 - 1 years", "Salary": "₹ 1,00,000 - 2,50,000 P.A. ", "Location": "Mumbai", "Job Description": " Important: Given job is a 6 days a week, combination of WFO & WFH type full time job.We are looking for a software developer to join our development team. We want someone who is comfortable asking why. The ideal candidate is a divergent thinker who is comfortable with PYTHON and has experience with multiple coding languages.The ideal candidate should possess strong analytical as well as technical skills. She should be able to communicate the logic behind technical decisions to non-tech stakeholders. They will be a part of a cross functional team. They must be comfortable working in an agile environment. They should be able to troubleshoot software solutions and support issues as and when necessary. The developer will be reporting to a Senior Software Consultant and should be willing to learn beyond her role.Responsibilities- Analyze user requirements- Create innovative, scalable, fault-tolerant software solutions for our clients and customer base- Work closely with project managers, other developers, and business users- Write and test code to ensure compatibility and stability: refine and rewrite as necessary- Create clear technical specifications and comments in code to enable long term maintenance- Expand existing software to meet the changing needs of our key demographics (pharmaceuticals and SMEs)Skills and Qualifications- A Bachelors Degree in Software Engineering or Information Technology with hands on experience of PYTHON and OTHER relevant coding languages.- A basic understanding of software architecture, operating systems, and data structures- Min. 1-year software development experience in delivery of Python based projects- Fresher who has experience in PYTHON and other coding language projects also can apply provided projects expedited are live and functioning (references will be required to validate).", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "Doctorate": "None", "Key Skills": ["Software Development", "Coding", "Python"]}