{"Job Title": "Software Developer / Programmer", "Company": "CyberHuntr Pvt. Ltd.", "Experience": "0 - 5 years", "Salary": "₹ 3,00,000 - 6,00,000 P.A. ", "Location": "Lucknow", "Job Description": "Job Type: Contract / InternshipSalary: 25,000 to 50,000 per monthContract Duration: 6 - 9 monthsExpected Start Date: Between 18th March and 27th March, 2021Work Week: Monday - Friday, 5:30PM - 2:30AM (9 hours)Office Location: Aliganj, Lucknow, Uttar Pradesh This is a 6 - 9 month contract / internship opportunity, which can result in permanent full-time employment, at the end of contract, if candidate is found to be a sharp learner, and an honest person. Location of this contract / internship will be within office space in Lucknow, Uttar Pradesh. Strictly no remote work. Work timing of this contract / internship will be Monday to Friday, 5:30PM - 2:30AM IST (or 8:00AM - 5PM EDT, New York Time). Expected Start Date is between 18th March and 27th March, 2021.If you don't know all technologies listed below, it's fine, we are looking for committed, honest people, who can learn things fast.RequirementsCommitted Learner - Most ImportantPython / Node.js / JavaVue.js / HTML / CSSSQL / NoSQL DatabaseAWS / AzureStatistics / LogicGeneral Software DevelopmentModifying software to fix errors, adapt it to improve its performance, or upgrade interfaces.Software programming and documentation development.Consulting on project status and proposals.Working on technical issues including software system design and maintenance.Analyzing information to recommend modifications of an existing system.Consulting to develop specifications and performance requirements.Designing and developing software systems using scientific analysis and mathematical models to predict and measure outcomes and design consequences.Preparing reports on programming project specifications, activities, or status.Conferring with project managers to obtain information on limitations or capabilities.Tip - Best resumes are single page .pdf files. Being concise and to the point is a great skill!Thanks for taking the time to read and apply for this opportunity.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Temporary/Contractual", "Role Category": "Programming & Design", "UG": "BCA in Any Specialization, B.Sc in Any Specialization, B.Tech/B.E. in Any Specialization", "PG": "M.Tech in Any Specialization, MS/M.Sc(Science) in Any Specialization, MCA in Any Specialization", "Doctorate": "Ph.D in Any Specialization", "Key Skills": ["Software Development", "Programming", "Logic"]}