{"Job Title": "Software Developer", "Company": "Siemens Limited", "Experience": "2 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   Responsibilities:    Design, development and testing of features in the applications    Support the entire application lifecycle (concept, design, test, release and support)   Collaborate with crossfunctional teams to define, design, and ship new features    Unittest code for robustness, including edge cases, usability, general reliability and to identify malfunctions   Troubleshoot and debug to optimize performance   Continuously discover, evaluate, and implement new technologies to maximize development efficiency   Design the user interfaces precisely as per the specifications to improve user experience        Experience/Job Requirements:    Around 2-6 years of experience in software development.   Technical expert in C#, .NET framework   Strong OO design and programming skills and ability to Understand design principles behind a scalable application   Working knowledge of WPF and WCF   Debugging Tools, Performance Testing and Security considerations   Implementing automated testing platforms and unit tests   Experience in Medical Domain is an added advantage.   Well versed with agile software development methodology.   Excellent analytical skills with a good problem-solving attitude   Excellent interpersonal, communication, collaboration and presentation skills.   Familiarity with continuous integration    ", "Role": "Software Developer,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Analytical skills", "continuous integration", "Automation testing", "Concept design", "Performance testing", "Agile", "Siemens", "Healthcare", "WCF", "WPF"]}