{"Job Title": "Software Developer", "Company": "Smiths Group Plc", "Experience": "1 - 4 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "                 What makes us different:    Global leader: We impact critical systems every day with sites in 17 countries and six centres of research excellence.   Digital growth: A key part of our capability is the integration of digital technology across our business and our operations in India, Bengaluru specifically, will be critical to our continued success.   Exciting opportunities: Our growth is creating exciting opportunities to work with experts in physics, chemistry, electronics, mechanics, production, computer science, and AI/machine learning.   International environment: With some projects, work requires global collaboration and the potential to travel and grow with the business            Duties Responsibilities      What you ll do:    Designing and implementing Java/J2EE based web applications. with good understanding of REST APIs.   Translate architectural concepts into user flows, wireframes, mockups and prototypes that lead to intuitive user experiences and applications.   Creating and maintaining tools to validate, unit tests, integration tests and documentation for these components using configuration management and integration/build automation tools during application development and testing phase 8. Performing code reviews and providing suggestions for fixes and improvements.                 The Individual      What you ll definitely need:    Must have 4 years of Experience.   Proficiency in Java/J2EE from an enterprise applications perspective.   Experience in Swing, Spring, JSF/Primefaces and Motif   Good experience of TestDriven Development.   Knowledge of Agile Methodologies and Pair Programming   Knowledge of Coding Standards, version management (Git/Bit bucket or similar), Build Process, Packaging, DevOps and CI/CD.    ", "Role": "Software Developer,", "Industry Type": "Construction, Engineering, Cement, Metals,", "Functional Area": "IT Software - Other,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "GIT", "Coding", "Enterprise applications", "Configuration management", "Machine learning", "Agile", "Packaging", "Application development", "JSF"]}