{"Job Title": "Senior Software Developer", "Company": "Advanced Computer Software", "Experience": "6 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "       Role: Software Engineer      We re Advanced    Join a business that embraces innovation, gives you the scope to seize every opportunity and will help get you where you want to go. Life at Advanced begins in an unprecedented environment with a role that matters, taking you on a fast-paced journey of discovery, however big that might be.   We are one of the UK s largest and fastest growing software companies. True partnership is the defining thing that makes us different from the competition. We pride ourselves on delivering focused software solutions for public sector, enterprise commercial and health & care organisations that simplify complex business challenges and deliver immediate value.    A proven full stack Developer with around 6-8 years of strong technical experience in development of cloud-based solutions using AWS/.Net/Javascript tech stack. The person will be required to work in a product for the Healthcare Domain    Responsibilities include    o Work with development teams, product owners and product managers, subject matter experts/architects to implement software solutions on Microsoft technologies   o Provide Design solutions/ideas related to client-side and server-side architecture   o Build frameworks/Components that can be adopted by applications for Carenotes   o Work with all stakeholders like PE, Architect and Devops teams to ensure all tools are configured (CI/CD/Automation) and technical challenges/dependencies are addressed   o Understand functional/business requirements through user stories and translate into technical requirements and implement accordingly along with technical documents as required.   o Develop and manage well-functioning database/data as a service   o Write effective APIs, Troubleshoot, debug and upgrade software   o Design, develop, and unit test applications in accordance with established standards   o TDD, Test software to ensure responsiveness and efficiency   o Create security and data protection settings   o Package and support deployment of releases.   o Analyse and resolve technical and application problems.    Key Skills    o Front end: HTML 5, CSS, Advanced JavaScript, Ajax, Angular JS, jQuery, Bootstrap, Powershell   o Server side / Framework: .Net 4.x, C#, Rest API, Webservices   o Cloud: AWS, S3, API Gateway, Lambda, Knowledge of DynamoDB, MongoDB   o Database: Sql Server 2012 and above   o Implement Automated CI/CD processes using Jenkins, Harness tools   o Develop frameworks with SaaS as mindset   o Tools: Git/GitHub, Jenkins, SonarQube, Octopus    Desirable Skills    Agile, Jira, Pair programming   Good communication skills   Analytical and efficient Development skills ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Automation", "Web services", "jQuery", "Front end", "GIT", "TDD", "Powershell", "Agile", "JIRA", "Ajax"]}