{"Job Title": "Angular 4+ Developer in a well known software company@Kolkata", "Company": "Sharp Point HR Consulting", "Experience": "5 - 10 years", "Salary": "₹ 5,00,000 - 11,00,000 P.A. ", "Location": "Kolkata", "Job Description": " Greetings!!!We have an opening for Angular Developer in a Software Co@ KolkataKindly Find below Company Profile and Job Details FYI.About Company: We are not an IT/ITES/ICT Services company and do not execute customer projects. We ourselves and our Shareholders are our only customers. A game-changing eCommerce platform that includes brick-and-mortar elements, is where we begin our journey and there is already a multi-year roadmap around the same.We have employed the latest technology in building our platform grounds-upCutting edge frameworkInnovative predictive analytics based on ML/NLP/AICompletely Agile processesDevOps/CICD based automationCloud-First designDesignation: Angular DeveloperLocation: KolkataExperience: Minimum 5 Years in Angular 4+ or aboveQualifications: BE/BTechJob Responsibilities:Strong experience in AngularJS, JQuery, Bootstrap, Html 5, and CSS3. Experience in modern JavaScript MV-VM/MVC frameworks (Angular, JQuery, NodeJS).        Demonstrated experience consuming RESTful web services.        Deep knowledge of AngularJS practices and commonly used modules based on extensive work experience.        Creating self-contained, reusable, and testable modules and components. Ensuring a clear dependency chain, in regard to the app logic as well as the file system.        Extensive knowledge of CSS and JS methods for providing performant visual effects and keeping the framerate above 30fps at all times.        Thorough understanding of the responsibilities of the platform, database, API, caching layer, proxies, and other web services used in the system. Validating user actions on the client side and providing responsive feedback. Writing non-blocking code, and resorting to advanced techniques such as multi-threading, when needed.        Creating custom, general use modules and components which extend the elements and modules of core AngularJS.Interested..?Kindly send us your updated CV on kishor@sharppoint.in with below mention details.Current & Expected CTC and Notice PeriodKindly refer your friends / colleagues who are looking out for job change.Regards,Kishor Bhatt", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "BCA in Any Specialization, B.Sc in Any Specialization, B.Tech/B.E. in Any Specialization", "Doctorate": "None", "Key Skills": ["Angularjs", "Angular Material", "Angular"]}