{"Job Title": "Assistant Manager Software Application Developer", "Company": "TATA Sky Ltd.", "Experience": "4 - 6 years", "Salary": "Not Disclosed", "Location": "New Delhi", "Job Description": " Description        Proven hands-on Software Development experience, proven working experience in Angular and Python development, hands on experience in designing and developing applications using Angular8, object Oriented analysis and design using common design patterns.            Experience developing web-based applications in C#, HTML, JavaScript, VBScript/ASP, or .NET            Experience working with MS SQL Server and MySQL Knowledge of practices and procedures for full software design life cycle            Profound insight of Python3 and Django Framework.            Candidate should have good knowledge working in proxified server environment with HTTP/HTTPs.            Proficient working in Redhat Linux and should have good knowledge working with Linux commands.            Excellent knowledge of Relational Databases, SQL and MariaDB.            Experience in building APIs and services using REST/SOAP service.            Expertise with front-end frameworks like AngularJS is highly desired            Ability to ensure cross-browser and platform compatibility for developed features            Have tuned webservers to support concurrent requests in a multi-threaded environment            Knowledge of AWS Services including but not limited to EC2, RDS, S3.        Qualifications        Minimum 4-6 years of relevant experience required with B-Tech             ", "Role": "Software Developer,", "Industry Type": "Media, Entertainment, Internet,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Redhat Linux", "MS SQL", "Software design", "Front end", "VB SCRIPT", "MySQL", "HTTP", "ASP", "SQL", "Python"]}