{"Job Title": "Cloud Software Developer", "Company": "KONE Elevator India Pvt. Ltd", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "As the world's cities grow more complex, peoples need to move easily becomes even more important. Enabling urban flow requires talent and ambition. Together at KONE, we create the new urban reality. Your career is a journey, and how you travel makes a difference.It's time to make a move. Join our flow. We are now looking for a Cloud application developer for our Flow Intelligence Tribes new R&D Development team to join KONE Services and Solutions R&D in Pune, India. Flow Intelligence Tribe delivers leading People Flow sensing, analytics, simulation, and control solutions to create the best user experience and building performance in future smart cities. With these solutions, we change the way buildings are designed, used, operated, and renovated.We are now creating the foundation for new, People Flow data and analytics-based value-added services. The data is collected by smart transportation devices and sensors, and the technological core of the services is formed by IoT and cloud services together with advanced analytics and connected equipment. The service development is done in an agile and lean way in cross-functional end-to-end teams that are responsible for delivering solutions for certain customer value. For the Flow Intelligence Tribe, we are building a new end-to-end team responsible for continuous development and expanding of a completely new offering focusing on providing valuable, People Flow data-based insights for our customers. To be successful in this position, you need to have experience in developing high-volume scalable cloud solutions on Amazon AWS. You will also need to have great collaboration and networking skills to work in a global development team with experts located in multiple locations team player with capabilities to take the lead and develop own competencies around the core knowledge is a must. The Flow Intelligence Tribe and its teams consist of experts and specialists working with cloud front- and backend development, advanced analytics, simulation tools, intelligent elevator group control algorithms, data engineering, user experience and end-to-end testing.Skills, Education and Experience: B.Sc. or M.Sc. degree in information technology engineering, computer science, or a related field5-10 years of experience in working in an international environment with the ability to collaborate and perform in virtual and matrix organizationsMore than 3 years of proven experience in cloud-based software development Experience in the field of development and deployment of high-volume cloud applicationsStrong experience in software development using Java, TypeScript, and Python Experience in working with Amazon AWS platform (e.g. Lambda, CloudWatch, IAM, CloudFormation, SQS, CodeBuild, CDK development)Experience in serverless architecture designExperience in messaging solutions (Kafka or similar) and database technologies (SQL and NoSQL) Demonstrated experience from Agile ways of working, DevOps Understanding of security concepts in cloud services Very good written and verbal communication skills in EnglishStrong analytical, conceptual thinking, and problem-solving skillsPassion for great service/customer experienceIf you are interested in this position, please send your application together with salary expectations by clicking the Apply- button.At KONE, we are focused on creating an innovative and collaborative working culture where we value the contribution of each individual. Employee engagement is a key focus area for us and we encourage participation and the sharing of information and ideas. Sustainability is an integral part of our culture and daily practice. We follow ethical business practices and we seek to develop a culture of working together where co-workers trust and respect each other and good performance is recognized. In being a great place to work, we are proud to offer a range of experiences and opportunities that will help you to achieve your career and personal goals and enable you to live a healthy and balanced life. ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Other,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "BCA in Computers, B.Sc in Computers, B.Tech/B.E. in Computers", "Doctorate": "None", "Key Skills": ["Cloud-based Software Development", "AWS", "SQL", "Application Development", "Java", "Software Development", "Algorithms", "NoSQL", "Data Engineering", "Kafka", "IOT", "Python"]}