{"Job Title": "Sr Software Developer", "Company": "BNY Mellon", "Experience": "4 - 6 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "  Required:      Experience developing in Microsoft technologies: Visual Studio, C# .Net, VB .Net, ASP .Net, ADO .Net, WCF, Web Services, IIS, MS Reporting Services, MS Integration Services    Strong development experience in Microsoft .NET framework and C#.NET and database systems such as SQL Server.    Development experience using WPF/MVVM. Experience of working with ORM frameworks such as Microsoft Entity Framework. Experience of using third party UI controls preferably DevExpress.    Experience in ETL (Extract, Transform and Load) area, preferably Pentaho Data Integration or similar ETL tools like SSIS, SQL Loader, Informatica or DataStage    Experience in writing SQL Stored Procedures, Functions, packages and debugging the code.    Experience of using source control tools such as TFS.    Experience in creating documents like required document, functional/technical specs, use case, test plans, ER diagrams, data flow diagrams etc. for allotted projects.    Experience in working with multiple stakeholders, onshore/offshore model junior developers    .        Functional Expertise Required      Effectively communicate and understand project requirements    Knowledge of global financial markets: Equity, Bonds, Currency, Derivatives    Ability to self-manage development projects with good turn-around time    Experience developing software solutions in support of investment or asset servicing business processes including portfolio management, trading, portfolio administration, portfolio accounting, portfolio reconciliation, and/or custody is strongly desired        Qualification and Experience      B.Tech./B.E. degree in computer science or related field Or MCA    4-6 years development experience in .NET, MS SQL server database development, Extract, Transform and Load (ETL) technology.   ", "Role": "Software Developer,", "Industry Type": "Banking, Financial Services, Broking,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial", "PG": "MCA in Computers", "Doctorate": "None", "Key Skills": ["MS SQL", "Datastage", "Debugging", "Informatica", "WCF", "Visual Studio", "Stored procedures", "WPF", "SSIS", "microsoft"]}