{"Job Title": "Senior Software Development Engineer", "Company": "Cloudera, Inc.", "Experience": "5 - 9 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "        Primary Responsibilities       Develop high level test strategies based on feature definition including strategies for both automated testing (incorporating component,  functional,  negative,  regression,  and end-to-end testing) and exploratory testing. Write new automated tests for existing and new features.       Design and build advanced automated testing framework,  tools and automated test suites,  in Python (pytest),  Shell,  Java (TestNG/JUnit).       Build,  enhance and maintain automation frameworks for scalability,  stability and performance.       Understanding on Security tests a variety of open source big data technologies in order to offer a centralized tool for security monitoring and analysis.       Work closely with the development team to ensure that code developed is testable,  build any test hooks if required and to arrive at project schedules and resource allocation models for successful delivery.       Debug system level deployment issues,  root cause analysis,  and resolve failures.       Strong commitment to best practices in QA and software development,  including modern CI using Jenkins processes. Comfortable with Agile/Scrum processes and code review.            Requirements       BE/MS in Computer Science or related field       Strong knowledge in at least one of the following languages: Python/Java/Javascript       Strong knowledge of backend test automation. Knowledge of UI test automation is a plus.Develop automated tests for web,  APIs and performance       Strong knowledge of QA methodology and tools,  including creation of test cases and test plans.       Strong knowledge of Automation Framework Design and good at debugging       Define the optimum suites for sanity,  regression,  smoke,  deployment verification etc.,  and advanced aspects of system testing automation.       General knowledge of large-scale distributed systems and/or data management system        Knowledge of DataLake concepts,  Data Security concepts,  Data authorization,  Data authentication,  Data governance and auditing.       Development experience in Linux environments.       Excellent communication and collaboration skills.       Good analytical and problem-solving skills. Works from broad specifications to independently resolve challenging design/enhancement issues and/or troubleshooting/resolving production issues using available tools and techniques.        Working knowledge of the Hadoop ecosystem and applications is an added advantage.       Working knowledge of Amazon AWS and/or Microsoft Azure is an added advantage.       Working knowledge of Kubernetes,  Docker related technologies is an added advantage.    ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "System testing", "Linux", "Data management", "Javascript", "Test cases", "Troubleshooting", "Open source", "Distribution system", "Python"]}