{"Job Title": "Senior Software Developer at XL Dynamics India Pvt. Ltd.", "Company": "XL Dynamics India Pvt. Ltd.", "Experience": "2 - 7 years", "Salary": "₹ 15,00,000 - 30,00,000 P.A. ", "Location": "Mumbai, Navi Mumbai", "Job Description": "SALARY UP TO Rs. 30,00,000 PER ANNUM!! YOU CAN WORK FROM HOME TOO!Take a quick Online Test to see if you can meet our expectations. Only the best are successful. See how good you are by copying and pasting the link below for the online test:https://rb.gy/5m0mew KEY RESPONSIBILITIES:Analyze business requirements to design, engineer, and innovate software solutions. Responsible for end-to-end delivery of each project from gathering requirements through deployment.Work on advanced Nano-Technology and Automation-driven projects; with high levels of machine-learning capabilities.Work on Cloud-based computing and infrastructures.Develop systems in a variety of computer languages, such as C++, Java or Python and others; SQL & Oracle Databases, develop API and API integrations such as REST APIs, develop state-of-the-art User Interfaces using platforms such as React or Angular and others.Maintain high quality documentation of design plans, test plans, build and release plans, and use cases.UNIQUE OPPORTUNITIES:Direct access to the CEO, CTO and the most creative thinkers in the Industry to mentor you through your projects. Your learning will be under the best creators in the industry and not any middle-level Manager as in other organizations. They are just a phone call away when you need them.Your technology innovations will be patented.Creative freedom to work on new technologies even if you aren't trained on it or have worked on it before.Good performers will have opportunities to work onsite in the US.Our leaders are promoted from within the Organization and not hired. You will have the opportunity to apply for leadership positions when available.Get the best compensation in the industry for your work.If you are looking to make a difference, this is the place to be. If you are just looking for a job, do not apply here. Job Shift: RotationalExperience: 2 years and aboveEducation:  \"We hire based on individual talent, skill and work ethic. Formal degrees are not a material in our hiring decision\"Job Location: Navi Mumbai, Mumbai, Bangalore, Kolkata, Pune, Noida, Ahmedabad, Jaipur, Indore, Lucknow, Mysore, Kochi, Chennai, GuwahatiSalary Range: Upto  30,00,000 p.aIf you are successfully hired at XL Dynamics, we'll offer you the best compensation and will match the CTC that you expect. There is no limit for the right candidate.Please copy and paste this link for the online test now!!https://rb.gy/5m0mewYou may answer the questions in the Programming Language you are most comfortable with. You may attempt this quiz at any time, day or night. Here are Testimonials from our current developer Team:https://rb.gy/bus80thttps://rb.gy/zxvgydPLEASE NOTE: Candidates are eligible to apply only if they have spent 1.5 years of their work tenure with at least one company. Candidates who haven't worked for any one of their past or current employers for at least 1.5 years are not eligible.Candidates who have already appeared for our selection process in the last 3 months are not eligible for this opening.Candidates with additional relevant knowledge / skill / industry experience may be offered a higher package.Perks and Benefits Salary is not a constraint for the right candidate!", "Role": "Software Developer,", "Industry Type": "Banking, Financial Services, Broking,", "Functional Area": "IT Software - Other,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers, MCA in Computers", "Doctorate": "Other Doctorate", "Key Skills": ["server", "c++", "architect", "front - end", "react", "microsoft", "sql", "back - end", "IT Software - E - Commerce", "database", "java", "Javascript", "data scientist", "html", "python", "c", "oracle", "techical", "engineer", "senior", "angular", ".net", "developer", "IT Software - Middleware", "software developer"]}