{"Job Title": "Software Developer - WordPress", "Company": "Left Right Mind Private Limited", "Experience": "3 - 5 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": " We are looking for a WordPress Developer with experience in building high-performing, scalable, enterprise-grade applications using PHP with cakePHP, Joomla, WordPress or any other framework. WordPress developer roles and responsibilities include development and management of new web apps and SaaS platform updates. You will also be responsible for coding, designing and implementing new features and functionality, and layout of the websites along with aligning them to the client or the companys specifications. Qualifications:3-5 years of experience and expertise in creating WordPress websites, forms, plugin integration, custom codesCMS Development:Knowledge of WordPress , WordPress MU , Drupal , Joomla and other enterprise CMSKnowledge of Headless CMS : Strapi, Directus or any other frameworkPlugin customization and developmentTheme customization and development 3rd Party API IntegrationKnowledge of e-commerce implementation, payment gatewaysKnowledge of Server side deployments, Cloud services, Docker PHPHands-on development experience in core PHP using local development setups like LAMP, XAMPP, WAMPShould have knowledge of AJAX and APIs integration ie. Google API, Facebook APIA solid understanding of the MVC paradigm and object-oriented programmingMust have experience for HTML5, CSS3, Bootstrap, Custom Graphics using SVGHands-on working experience in MVC architecture and design patternsExperience in one or more PHP frameworks like Zend, CodeIgniter, CakePHP, Symfony, Magento, etc.Ability to build efficient, testable, and reusable PHP modulesOther Skills:Very good understanding of principles/concepts like SOLID, DRY, KISS, coding for the interfaceShould have experience of SOAP and Rest APIExperience in versioning technologies such as Git, Agile/DevOps environmentUnderstanding of the security and compliance aspects of DevOpsExperience with continuous integration/continuous deploymentKnowledge of interacting with Restful APIsMust be good in communicationStrong written & verbal communication skills.Good analytical and logical skills.BE/BTech/MS/MCA/MTech (CS/Electronics) or an equivalent degree is requiredNice to Have:Work experience in PSR - 2 StandardsWork experience in any Javascript frameworks (Angularjs, Vuejs, Reactjs, Nodejs, etc) WordPress development experience is highly desirable", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Electronics/Telecommunication, Computers, BCA in Computers", "PG": "MCA in Computers", "Doctorate": "None", "Key Skills": ["Xampp", "Angularjs", "WAMP", "Facebook API", "Google Api", "Node.Js", "Codeigniter", "Vue.Js", "Docker", "PHP", "CakePHP", "Ajax", "CSS", "Payment Gateways", "Html5", "CMS", "Rest Api", "Zend", "Joomla", "Drupal", "Symfony", "Wordpress", "Magento", "LAMP", "React.Js"]}