{"Job Title": "Software Developer", "Company": "Springer Nature", "Experience": "6 - 11 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "    About the role:      This is an individual contributor role and the incumbent will demonstrate personal commitment and accountability to ensure standards are continuously sustained and improved both within the internal teams and with partner organizations and suppliers.   This position directly interacts with the business team to understand their requirements and the added value to the business customers. This role provides exposure to the business and functional model of the company and the applications being worked on are highly businesscentric and revenuegenerating.      Role:   Software Developer    Location:   Magarpatta City, Pune.    Experience:   3 6 Years    Skill Matrix:   Extended JavaScript, XML, XSLT, InDesign Server CC 2017 or above, Java.      About the Team:    The Automated Conversion and Document Creation (ACDC) team at Springer Nature, Pune is responsible for delivering solutions related to Journals and Production Systems for Scientific, Technical and Medical Publishers (STM Publishers) and Education Publishers around the world.   Our teams incorporate the latest technologies to streamline and automate manuscript submission processes (Peer Review process), production workflows, and maintain metadata for our customers; this helps our customers to continuously improve their business response time and revenue stream.   Every project is implemented in a distributed agile environment while continuously collaborating with customers stationed at various locations around the world.      Required Skills:     3-6 years of experience in InDesign Scripting.   Extensive experience using Java/Javascripts in INDESIGN   Prepare InDesign Template (Para Char Styles, Master Pages), etc.   Create script with XML and non-XML environment   Work independently and produce well-designed, easily maintainable codes   Provide production support whenever needed   XSLT, Acrobat Professional, and Photoshop Scripting (Big Plus)     Job Responsibilities:     Template development XML-IN workflow   Develop new functionalities using JAVA scripting in InDesign   Lead/mentor developers and disseminate knowledge through knowledge-sharing presentations   Part of a small, experienced, energetic team working on a rapid and agile development schedule   Initiate self-development by being available and receptive to all training made available by the company   Provide technical support to the production team     Softer Attributes:     Proven ability to work in a fast-paced, dynamic, and entrepreneurial environment and versatility to manage multiple projects, priorities, and urgent issues successfully and simultaneously.   A self-starter, highly motivated, and able to shift directions quickly when priorities change.   Extremely detail-oriented and demonstrates an analytical approach to problem-solving, understanding how things affect one another in an overall system.   Excellent written and verbal communication skills across organizational levels and functions.      ", "Role": "Software Developer,", "Industry Type": "Publishing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["metadata", "Publishing", "Production support", "XML", "Javascript", "Workflow", "XSLT", "Business process management", "Photoshop", "Technical support"]}