{"Job Title": "Software Developer- Granite ", "Company": "Amdocs", "Experience": "8 - 13 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": "     Design, configure, install and upgrade environments through the product life cycle   Ongoing troubleshooting environment operability problems and services in critical and non-critical paths by using internal and external knowledge bases to ensure maximum environment availability   Ongoing automating existing processes, through batch files and shell scripting in order to remove team from critical path and increase efficiency.   24/7 support of applications to ensure the highest standards of availability, resilience, integrity, security and performance required by our business systems.   Provide a high level of standard deliverables and work according to company methodology.       Knowledge of   Ericson Granite   application is a MUST   Expertise in administration and maintenance of at least one middleware area -    Weblogic   Tomcat     8 years   of total experience in Middleware Technologies   Able to work in shifts and on- call on weekends   Strong in troubleshooting and process oriented   Experience with DevOps Tools and methodology   Customer facing capabilities,  coordinate with site counterparts   Good interpersonal skills,  ability to share knowledge with other team members,  ability to acquire knowledge within the team,  well suited to team work.    Ability to work under pressure   Flexible to work in Shifts /  Long hrs as per business needs          Why you will love this job     You will be challenged with design and develop new software applications   You will have the opportunity to work in a growing organization,  with ever growing opportunities for personal growth   You will have the opportunity to work with the industry most advanced technologies   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Tomcat", "Interpersonal skills", "Weblogic", "devops", "Shell scripting", "product life cycle", "Troubleshooting", "Application software", "Middleware"]}