{"Job Title": "Senior Software Developer/Principle Engineer", "Company": "Squareroot Consulting Pvt Ltd.", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "We are hiring for worlds leading platform and products which helps in connecting to the network of human knowledge. They are one of the pioneers Online, Scholarly, Academic Publications, Academic Journals, Encyclopedias, Books and transforming into eBooks, Online Journals, Databases, Textbooks, digital, and Digital Transformation.  Role: Senior Software Developer/Principle Engineer   Work Location: Bangalore  You will be working with highly motivated and extremely talented engineers on creating frontend and backend vertical services with quality, performance and scale in mind at every step of the way. We are using a Microservices based architecture composed of multiple services joined into one API. Our architecture uses Angular2/React and Node for the web and Typescript and Java on the backend.   As a Senior Software Developer/Principle Engineer you will part of a talented team of likeminded engineers in enriching the experience of our users and partners. As we grow the network of human knowledge, you will deliver software services positioned to harness it to accelerate our business.  What we are expecting from you: Minimum 5+ years experience for Senior & 7+ years for Principle Engineer Passionate about coding on Java, Spring Framework, Hibernate, Scala, Node.js, MongoDB, etc. Willing to work as an individual contributor Software development fundamentals (data Structures, algorithms, problem solving, OO design, and system architecture). Working experience on Microservices, AWS is must Good to have experience in TDD/BDD all day Designing or Architecture experience will be added advantage Should be able to clearly communicate to technical and stakeholders Someone who can take complete ownership.", "Role": "Team Lead/Technical Lead,", "Industry Type": "Internet, Ecommerce,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers, MS/M.Sc(Science) in Computers, MCA in Computers", "Doctorate": "Any Doctorate in Any Specialization, Doctorate Not Required", "Key Skills": ["Java", "Hibernate", "BDD", "Web Technologies", "Scala", "data Structures", "Digital Transformation", "problem solving", "Node.js", "Microservices", "Software Development", "Backend", "Software Services", "Front End", "Algorithms", "TDD", "MongoDB", "Springboot", "AWS"]}