{"Job Title": "Associate Developer For Software Company(Insurance)", "Company": "Sapwood Ventures Pvt. Ltd. ", "Experience": "2 - 5 years", "Salary": "₹ 9,00,000 - 15,00,000 P.A. ", "Location": "Mumbai (All Areas)", "Job Description": "Core Technologies:Programming Tools: C#, ASP.Net, MVC, ADO.net, MVC HTML5, JavaScriptDatabase: SQL ServerTools / Packages: MS Visual Studio, SQL DeveloperRoles and Responsibilities :To participate in the entire software development life cycle, debugging applications and  configuring existing systems.  Write clean, testable code using .NET programming languagesTest and debug various .NET applicationsDeploy fully functional applicationsUpgrade existing applicationsDocument development and operational proceduresA go getter attitude with the ability & desire to work in a fast-paced challenging environmentAn innovator mind-set who strives to make things betterAbility to work independently with the knowledge as well as capability to quickly grasp and  make an immediate impactGood written & verbal communication skillsDesired Candidate Profile  Understanding of object oriented programming concepts, design patterns and SOLID  principles Must have hands on experience with C#, ASP.NET, MVC, Windows Services, .NET Entity  Framework, SQL Server/T-SQL, IIS and related technologies Understanding of REST APIs and WCF Understanding of modern techniques such as Responsive Web Design, LINQ, Dependency  Injection and Design Patterns Must have hands on experience of web client technologies inclusive of HTML5, CSS3, JavaScript, AJAX, JSON and JQuery. Knowledge of various industry standard development practices (Agile methodology, OOD, TDD, BDD) Must have hands on experience of tools to enable SDLC (TFS, Visual Studio, etc.)Perks and Benefits  10% of the CTC would be a retention or performance variable. ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization, B.Sc in Computers", "PG": "M.Tech in Any Specialization", "Doctorate": "None", "Key Skills": ["C#", "ASP.Net", "MVC", "OOD", "Html5", "Debugging", "Programming", "JSON", "SQL Server", "JQuery", "Agile Methodology", "TDD", "ADO.Net", "Javascript", "Ajax"]}