{"Job Title": "Lead Software Developer", "Company": "Advance Auto Parts", "Experience": "8 - 10 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "   SUMMARY    The API Engineer will execute the API platform strategy, which involves designing and building new APIs; designing and building integrations to existing systems; designing and building API portals; and assisting with the definition of technical tasks, estimates, and dependencies. You will be empowered to innovate it is expected you will contribute to automation and the refinement of coding standards and processes that will enable product teams to release features on-demand.     Successful candidates will also take pride and ownership of his/her applications, demonstrate a penchant for design, communicate clearly, and have a consistent track record of delivering and supporting scalable, high performance enterprise-level APIs. The implementation around enterprise systems requires strong critical thinking skills and creative engineering with an eye towards customer focus.      ESSENTIAL DUTIES AND RESPONSIBILITIES:     Work with business stakeholders, project managers, business analysts, and other IT teams to understand the business needs and their requirements.   Work with a nimble team of software engineers and enterprise architects to ensure the solutions meet our business needs using Agile methodologies in a fast-paced environment.   Will function in the entire development cycle, conduct design and code reviews, and have heavy input throughout the process, from requirement gathering to production deployment.   Able to shift between priorities as needed throughout the workday.   Create technical system specifications and ensure documentation remains current throughout all phases of the SDLC.   Consistently cognizant of opportunities for enhancements and process improvements.   Research, design, define, develop, test, document, and implement new service APIs or changes to existing services. Participate in test planning, development, and execution for integration and system testing.   Learn new software tools and skills as needed. Keep up with technologies.   Support and maintain applications utilizing required tools and technologies. Ensure applications are scalable and operate efficiently in the production environment.   Ability to research issues across multiple key systems and databases. Assist customers and team members on issue resolution and problem solving.   Comfortable working in an open, dynamic, rapidly changing environment where collaboration is crucial.      The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.      Qualifications    To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.     Technical Skills     Bachelor of Science within a STEM discipline (Computer Science preferred) and 8 years systems engineering experience   8 years of experience in application development (with preference for Java, Spring, MuleSoft Experience Preferred)   At least 3 years of API development experience desired   Strong familiarity with API management and micro-services desired   Experience working in an Agile/Scrum environment   Experience with either on-line or in-store retail selling applications desired   Experience in large scale applications ? either public facing web applications or applications with large numbers of concurrent users desired   Technical hands-on experience developing in REST/JSON desired   Experience developing solutions in AWS, Azure, and/or Google Cloud Platform desired   Comfortable implementing continuous integration / continuous delivery process for applications using technologies such as Jenkins and Git desired   Experience using Unix command line and Bash/Shell/Python/Postman scripting to automate tasks, etc. desired   Experience with DevOps technologies such as Jenkins, Terraform, Docker, Kubernetes, Maven, Ant desired   Experience with relational databases (Oracle 11g or above, SQL Server, DB2, MySQL) desired   Experience with NoSQL databases including Cassandra and MongoDB desired   Experience using JUnit and Gatling to write automated tests desired   Mulesoft Experience is preferred  .      Communication Skills     Exceptional customer relationship skills including the ability to discover the true requirements underlying feature requests, recommend alternative technical and business approaches, work with architects to come to an agreed technical approach, and lead development efforts to meet aggressive timelines with optimal solutions.   Ability to work collaboratively with or lead cross-functional teams with minimal supervision.   Ability to drive consensus within a team and influence outcomes in significant technical decision-making.   Excellent interpersonal, written and verbal communication skills to work with different business groups as well as IT partners (enterprise architects, vendors, etc.) at all levels within the organization.     Problem Solving and Analytic Skills     Demonstrated critical thinking skills.   Extreme attention to detail and organization in all aspects of the system development.   A strong technical vision. Ability to understand, master, and be able to prototype with new technologies quickly. Person in this role needs to be able to quickly understand and solve unique and undocumented programming problems.   Open-minded, willing to consider multiple options, sources, perspectives, and possible solutions. Careful assessment of the importance, relevance, and validity of all options.   Inquisitive. Ask probing questions and research as a basis for making design decisions and judging quality; understand the true reason behind the request rather than just accepting an initial thought or proposed solution.   Proactive and willing to contribute ideas. Not afraid to ask questions.   ", "Role": "Software Developer,", "Industry Type": "Internet, Ecommerce,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Sc in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Unix", "Automation", "Db2", "Coding", "MySQL", "Application development", "JSON", "SDLC", "SQL", "Python"]}