{"Job Title": "Software Developer", "Company": "Kavayah IT Solutions Pvt Ltd", "Experience": "2 - 5 years", "Salary": "₹ 4,00,000 - 6,00,000 P.A. ", "Location": "Hyderabad/Secunderabad( Abids )", "Job Description": " Kavayah Solutions is looking for an software developer to join their dynamically growing team. This person will involve in development and delivery of industry leading web based solutions under the guidance of senior developers. Ideal candidate will be organized, eager to work hard and open to learning and growing with the company. Roles and Responsibilities  Participate in plan, develop, build, unit/integration test phases of software development Design, Code, Deploy and test applications according to the requirements and industry best practices.Collaborate to design and implement features.Implement assigned components as defined in the system design.Write unit and integration tests to ensure those features never break.Assist in setup and evaluation of overall architecture.Use version control to version your codeAssist in development and peer review of plans, technical solutions, and related documentation.Desired Candidate Profile  2+ years web development experienceAt least 2 year experience in .NetMust be an expert in ASP. NET, C#, MVC,MS SQL Server, CSS and Java scriptMust have advanced skills in HTML, D HTML, X HTML, CSS, Java script, Ajax to custom design & develop dynamic web applications.Strong .NET and SQL skills are MUSTShould have experience in working through entire SDLCExcellent communication skills and ability to communicate with people from various backgrounds is essential. Good communication skillsSelf-motivated, result oriented, and a team playerPerks and Benefits ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Electronics/Telecommunication, Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["C#", "CSS", "Javascript", "ASP.Net", "XHTML", "HTML", "MVC", "SQL Server", "SDLC Life Cycle", "Ajax"]}