{"Job Title": "Software Developer", "Company": "Bluelupin Technologies Private Limited", "Experience": "2 - 4 years", "Salary": "₹ 2,00,000 - 5,00,000 P.A. ", "Location": "Noida", "Job Description": "Roles and Responsibilities -: Write clean, well-designed code.Knowledge and working experience on Laravel framework 6+ Produce detailed specifications. Troubleshoot, test and maintain the core product software and databases to ensure strong optimization and functionality.Contribute to all phases of the development lifecycle.Follow industry best practices.Develop and deploy new features to facilitate related procedures and tools if necessary. knowledge of PHP web frameworks such as Laravel. Understanding the fully synchronous behaviour of PHPknowledge of Implementing product roadmap including features, RESTful APIs, and UI modifications Knowledge of object-oriented Laravel framework. Understanding accessibility and security compliance. knowledge of the common PHP or web server exploits and their solutionsUnderstanding fundamental design principles behind a scalable applicationUser authentication and authorization between multiple systems, servers, and environments Integration of multiple data sources and databases into one systemHave experience of Server operations: AWS, GoDaddy.Familiarity with limitations of PHP as a platform and its workaroundsFamiliarity with SQL/NoSQL and MongoDB databases and their declarative query languages. Understanding of code versioning tools, such as Git Passion for best design and coding practices and a desire to develop new bold ideas.Ability to translate our      customers requests into the development of new features.Excellent English verbal and      written communication skills with the ability to translate and present      complex technical information to others.Engage knowledge transfer      and document your work to for another developers & support team.Collaborate with fellow team  members to grow technical skills.Strong skill of learning. Required Experience and Qualifications: Education: Graduation with related field Experience: 1.5 - 3 years. ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Vue.Js", "Laravel"]}