{"Job Title": "Sr. Software Developer(.Net) || 4-6 Yrs || Looking For early joiners", "Company": "Broadway Infotech Pvt. Ltd.", "Experience": "4 - 6 years", "Salary": "₹ 4,75,000 - 7,00,000 P.A. ", "Location": "Noida", "Job Description": "  Job descriptionExperience in ASP.NET, C# .net 3.5 and 4.0, SQL Server 2005 and 2008Strong background in database developmentExperience in . MVC Architecture Web Api and jQuery is a must.Experience writing stored procedures for SQL Server using Transact SQLExperience in business logic development in C#/VB.NET and front end using Web Forms (ASP.NET)Knowledge of JQuery, JSON and socket programmingUnderstanding of LINQ, WCF, Web Services and AJAXKnowledge of XAML and Silverlight is preferentialShould be able to design and develop web applicationsInterpret written business requirements and technical specification documentsAble to handle standalone projectsPerform maintenance programming and correction of identified defectsMust have developed at least one productRequired Candidate profileGood communication as well as documentation skillsA good team playerStrong analytical and reporting skillsAbility to work independently as well as in a team environmentimmediate to 15 days joiner required.Perks and Benefits Dynamic Team Work Environment. Fantastic flexibility, work/life balance/fixed working hours. Only Five days working (fixed Sat/sun Off ). large, fun & friendly in-house team. Supportive managers great proximity from sector - 62 Noida/ Noida City Centre. If you feel that you're the right person for this job, willing to learn and want to be a part of market leading company, Submit your resume today to rupsha.m@broadwayinfotech.com or call 9773726735. ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "Doctorate": "None", "Key Skills": ["C#", "MVC Architecture", "XAML", "Web Api", "LINQ", "Silverlight", "HTML", "JSON", "SQL Server", "jQuery", "XML", "C#.Net", "Javascript", "ASP.Net", "XHTML", ".Net", "WCF"]}