{"Job Title": "Embedded Software Developer", "Company": "SAMNIYA AVIONICS TECHSYS PRIVATE LIMITED", "Experience": "3 - 7 years", "Salary": "Not Disclosed", "Location": "Pune, Bangalore/Bengaluru", "Job Description": " Description:   Experience: 3-10 Yrs Work Location: Bangalore / Pune Primary Requirement: Mandatory to have Automotive embedded software development experience Mandatory to have hands on experience in microcontroller (ARM, Renesas, Freescale or Infineon) based software development using embedded C/ software development experience in C++ Added advantage to have experience in low level driver implementation eg: HWIO, I2C, UART, CAN, ADC, PWM,LIN, Timers etc. Added advantage for experience of implementing CAN gateway module, UDS diagnostic Added advantage for AUTOSAR experience Added advantage for ADAS , ISO26262 experience Job Responsibilities: Automotive embedded Software Development for ECU ( Engine , Body, Chassis, Seating, ADAS Etc.) , and Device Driver Development ( UART ,SPI , I2C , CAN , CAN-FD , LIN and etc.,). Higher layer Protocols (UDS, J1939, J1850 , KWP2000, OBD etc.,) Development and Integration with Third party Software. C/C++ Embedded software development on RTOS/Non RTOS platform Use configuration management tools for code and software documents, change management tools for software error management and EA for software Design Participate peer reviews for software documents such as requirements, design, test plan and, Code reviews, etc. Involve Unit Testing, Functional and Integration Testing and System Testing Work with project lead for software deliverables, support for estimates, software metric and SQA Regular interaction to Systems, and Independent Testing team ", "Role": "Software Developer,", "Industry Type": "Courier, Transportation, Freight , Warehousing,", "Functional Area": "IT Software - Embedded, EDA, VLSI, ASIC, Chip Design,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["RTOS", "Embedded C", "System testing", "C++", "SQA", "Change management", "Software design", "Configuration management", "Unit testing", "Automotive"]}