{"Job Title": "Software Developer", "Company": "Adidas Group", "Experience": "1 - 6 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": "  Assists in the definition and management of requirements.  Uses standard techniques to elicit,  specify,  and document requirements for simple subject areas with clearly- defined boundaries.  Assists in the creation of a requirements baseline and in investigating and applying authorised requests for changes to base- lined requirements,  in line with change management policy.   Software design   Undertakes complete design of moderately complex software applications or components applying agreed standards,  patterns and tools.  Assists as part of a team in the design of components of larger software systems.  Specifies user and/or system interfaces.  Creates multiple design views to address the concerns of the different stakeholders of the design and to handle separately functional and non- functional requirements.  Assists in the evaluation of options and trade- offs. Collaborates in reviews of work with others as appropriate.   Programming/software development   Designs,  codes,  verifies,  tests,  documents,  amends and refactors moderately complex programs/scripts.  Applies agreed standards and tools,  to achieve a well- engineered result. Collaborates in reviews of work with others as appropriate.   Database design   Develops appropriate physical database or data warehouse design elements,  within set policies,  to meet business change or development project data requirements.  Interprets installation standards to meet project needs and produces database or data warehouse component specifications.   Testing   Defines test conditions for given requirements.  Designs test cases and creates test scripts and supporting data,  working to the specifications provided. Interprets,  executes and records test cases in accordance with project test plans.  Analyses and reports test activities and results. Identifies and reports issues and risks.   System Integration and Build   Produces software builds from software source code.  Conducts tests as defined in an integration test specification,  records the details of any failures.  Analyses and reports on integration test activities and results.  Identifies and reports issues and risks.   Release and deployment   Uses the tools and techniques for specific areas of release and deployment activities.  Administers the recording of activities,  logging of results and documents technical activity undertaken.  May carry out early life support activities such as providing support advice to initial users.   Application support   Assists in the investigation and resolution of issues relating to applications.  Assists with specified maintenance procedures.   Software design   Programming/software development   Database design   Testing   System Integration and Build   Release and deployment   Application support   Key Relationships:    Key Relationships:   Global IT  Respective business function (GOPS,  Finance,  HR,  Brand Marketing,  Wholesale/Retail)  HR Management  Controlling   Requisite Education and Experience / Minimum Qualifications:    Requisite Education and Experience / Minimum Qualifications:   Four- year college or university degree with focus on Business Administration or IT or related areas,  or equivalent combination of education and experience  Proficient spoken and written command of English  At least 3- year experience in IT  1 year of experience in relevant area ", "Role": "Software Developer,", "Industry Type": "Wellness , Fitness , Sports, Beauty,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Application support", "Change management", "Software design", "Test scripts", "Database design", "System integration", "Windows", "Test cases", "Information technology", "Wholesale"]}