{"Job Title": "Senior Software Developer (C , Qt/QML)", "Company": "Siemens Limited", "Experience": "3 - 7 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "    What part willyou play   Strong foundation in product development, software architecture, design, and coding of complex software systems.   Participate as a leader to define, architect and responsible for developing architecture.   Ability to serve as technical strategist, advisor, and engineering mentor, and has a natural inclination to coach the team.   Ability to actively lead technical discussions with customers, partners.   Ability to produce high-quality deliverables that can be used as architectural runway by product development teams.   Ability to quickly understand and learn new and emerging technologies.   Able to conceive ideas and prepare quick pre-development prototypes for internal review and to assess the technical feasibility of the use cases.   Preferable to have a fair knowledge of industrial automation domain and Industrial Internet of Things (IIOTs).    Strong Analytical and Problem-Solving Skills.    Useyour skills to move the world forward    Do you have an Engineering Degree with 8 years. of overall experience in design and development  Strong experience in C language on Windows / Linux OS - Advanced   Good understanding on C 11 standard and later - Advanced   OOAD, Design Principles, Design Patterns and UML - Advanced   Architecture Development Experience - Advanced   Unit Testing, Design Driven Development - Advanced   QT/QML, Valgrind, GDB Debugger - Basic   Agile Framework, DevOps - Basic     ", "Role": "Software Developer,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["qml", "Linux", "Architecture", "Coding", "UML", "Analytical", "OOAD", "Consulting", "Windows"]}