{"Job Title": "Firebase Analyst - Software Developer", "Company": "Regalix India Pvt Ltd", "Experience": "4 - 8 years", "Salary": "₹ 4,00,000 - 9,00,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": "Job Description : Work with clients and internal stakeholders to map strategic business goals.- Understand requirements, and provide technical information and solutions around applying ad products and technologies, with specific focus on Googles App advertising / analytics solutions (App Conversion Tracking, App Remarketing (Including the API), and Firebase implementation / analytics. This is to power app promotion campaigns as well as implementation support for deep-linking using android app links and universal links.Mandatory Skills :Bachelor's degree in Computer Science or related technical field, or equivalent practical experience. Experience with client-side web technologies (HTML, CSS, JavaScript), SQL, XML and HTTP protocols. Experience in a customer-facing role as a Technical Consultant, Support, Engineer or Product Manager. Experience building iOS apps using Objective-C/Swift or Android apps using Java/C++.Desirable Skills :Having as many of these specific qualifications is a plus, but transferable skills/experiences may be equally valuable - 4 years of relevant experience as a Technical Consultant or Sales Engineer, with a focus on digital advertising products. - Experience in an online advertising role, and familiarity with the advertisement serving industry and internet technologies. - Demonstrated ability to code with Java or Python, and knowledge of databases with the ability to construct complex SQL queries. - Excellent communication skills (written/verbal)Experience in years : 4 to 8 years Work Location : M.G. Road, Bangalore Skills to be evaluated on:Bachelor's-degree-in-Computer-Science-or-related-technical-field-or-equivalent-practical-experience.-Experience-with-client-side-web-technologies-(HTML-CSS-JavaScript)-SQL-XML-and-HTTP-protocols.-Experience-in-a-customer-facing-role-as-a-Technical-Consultant-Support-Engineer-or-Product-Manager.-Experience-building-iOS-apps-using-Objective-C/Swift-or-Android-apps-using-Java/C++.Android-Developer,  IOS-Developer , Firebase , Google Analytics User Designation : Software Developer - Firebase Please share your cv to VINEELAC@REGALIX-INC.COM******LOOKING FOR IMMEDIATE JOINER*******", "Role": "Software Developer,", "Industry Type": "Media, Entertainment, Internet,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Sc in Computers, B.Tech/B.E. in Electrical, Electronics/Telecommunication, Other Specialization, Mechanical, Computers", "Doctorate": "None", "Key Skills": ["firebase analyst", "Software Development", "Google Analytics", "Application Support", "Web Analytics", "firebase", "Mobile Application Development"]}