{"Job Title": "Software Developer- IO Tahoe LLC", "Company": "Centrica India Offshore Private Limited", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru( Whitefield )", "Job Description": " Software Developer (Java, C++, Kotlin, NoSQL)Io-Tahoe is seeking to hire an experienced Software Developer to join our Platform Engineering Team. Our Platform Engineering team plays a critical role in developing next-generation technologies that automate the management of data, information, and creation of knowledge. Our products need to handle information at massive scale across banking, capital markets, retail, energy, and healthcare.We are always looking for developers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing. You will work in a truly international distributed team with main hubs located across three continents: United States, Europe and Asia.You must have: 5+ years experience of designing and building successful customer facing products and micro-servicesProficient in at least one, preferably statically typed, programming language i.e. (Java, C++, Kotlin)Strong understanding of JavaScript and key frameworks i.e. Node.jsExperience with Kubernetes, Linux, CentOSData pipeline and streaming tech, e.g. Hive, Spark, Kafka, Kafka Streams Experience with Git and Github, including Github Pull Request workflowsGood Understanding of computer science fundamentals and data structuresBachelors and/or Masters degree, preferably in Computer Science, Software Engineering, Math, Statistics or equivalent quantitative disciplines. Bonus ExperienceMicroservice architecture design principlesExperience working with GraphQL for querying APIs and serving relevant dataKnowledge of SQL and NoSQL databases (MongoDB is a plus) and must have hands on experience querying databaseAmazon Web ServicesExperience with Atlassian software development and collaboration tools (JIRA, Confluence, etc.) ResponsibilitiesAs a Software Developer, you will work directly with other developers and Quality Assurance Engineers to understand feature requirements, review technical designs, design, develop, test, deploy, maintain, and enhance software solutions.With your technical expertise you will manage project priorities, deadlines, and deliverables.  About YouIo-Tahoe seeks a smart, self-motivated, hands-on, and intellectually curious Software Developer who can become a technical authority on the Io-Tahoe technology. We need our developers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.You will have the opportunity to develop yourself and others in a true DevOps agile environment, engaging in the product evolution, covering software architecture, development, quality assurance, security, operations, and IT infrastructure aspects. Benefits and PerksIo-Tahoe offers a competitive compensation package and the opportunity to participate in developing unique data science and machine learning solutions in a rapidly expanding market category.  P.S. Even if this job is not for you, perhaps you have a friend whod be a perfect fit. Send them this link. Thanks! About Io-TahoeIo-Tahoe is a global leader in Enterprise Data Automation. Our patent driven technologies significantly reduce the manual effort required for enterprise data users to better know, manage, and drive value from their data assets.Io-Tahoe enables enterprise customers to automatically discover, catalog, manage and drive business value from data wherever it is held. In doing so Io-Tahoe enables enterprise customers to automate workflows including Data Migrations, Data Quality, Data Governance and self-service Data Analytics. Io-Tahoe also provides an intuitive user experience designed to help technical and non-technical people collaborate. Our team with a deep understanding of data challenges, giving us first-hand insight and appreciation into our customers diverse and complex data needs. #KnowYourDataNO AGENCIES PLEASE. DIRECT APPLICATIONS ONLY.Io-Tahoe is an inclusive Equal Employment Opportunity employer that considers applicants without regard to gender, gender identity, sexual orientation, race, ethnicity, disabled or veteran status, or any other characteristic protected by law. 20 Rathbone Place, 4th Floor | London W1T 1HY | www.io-tahoe.com", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "MCA in Computers", "Doctorate": "None", "Key Skills": ["Java", "Software Development", "NoSQL", "Data Structures", "Artificial Intelligence", "Graphql", "Javascript", "Node.Js", "MongoDB", "Machine Learning"]}