{"Job Title": "Software Developer", "Company": "Corpow Solutions", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   Build new systems with .NET 4.0 /  ASP.NET /  VB.NET /  PHP /  MYSQL / SQL Server 2008 /  WCF Web Services /  WCF Data Services.   \n   Develop new functionality on our existing software products.   \n   Lead/ mentor developers and share knowledge through knowledge- sharing presentations.   \n   Participate in a small,  experienced,  energetic team on a rapid,  agile development schedule.   \n   All other responsibilities as assigned  \n \n \n Skills /  Attributes Required   \n \n   Three  ( )  yearsrsquo experience with ASP.NET/ VB.NET.   \n   Two yearsrsquo experience on PHP and MY SQL  \n   Fresher can also apply  \n   At least one year exposure to Database architecting.  \n   Two  ( )  years working with SQL Server  (2005/ 2008 preferred) .   \n   Deep knowledge of the .NET 3.5/ 4.0 Framework,  including Visual Studio 2008,  VB.NET,  ASP.NET,  ASMX and WCF Web Services,  and ADO.NET.   \n   Strong knowledge of software implementation best practices.   Strong experience designing and working with n- tier architectures  (UI,  Business Logic Layer,  Data Access Layer)  along with some experience with service- oriented architectures  (SOA) .   \n   Ability to design and optimize SQL Server 2008 stored procedures.   \n   Ability to adapt quickly to an existing,  complex environment.  \n   Ability to quickly learn new concepts and software is necessary.   \n   Candidate should be a self- motivated,  independent,  detail oriented,  responsible team- player and exhibit exceptional relationship management skills.   \n   Passionate about building high- quality systems with software implementation best practices.  \n   Knowledge in software design,  object- oriented design and implementation techniques and n- tier application design;   thorough understanding of design patterns and their application in software development.  \n   Practical experience designing and implementing .NET- centric,  service- oriented architecture  (SOA)  solutions and publicly- facing web services.  \n   Understanding of UML and the creation and maintenance of project work products including use cases,  data flow charts,  process flow diagrams,  software requirements document,  functional specifications document,  etc.  \n   Experience with database design,  architecture,  and implementation;   in particular,  such design,  architecture,  and implementation in support of n- tier .NET application architectures.  \n   Familiar progressive SDLC automation concepts such as continuous integration.  \n   Excellent interpersonal,  communication,  and organizational skills are absolutely required  \n ", "Role": "Software Developer,", "Industry Type": "Media, Entertainment, Internet,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["quality systems", "charts", "net asp net", "automation", "software development", "soa", "relationship management", "wcf", "sdlc"]}