{"Job Title": "Principal Engineer, Software Development Engineering (Apps)", "Company": "Western Digital", "Experience": "8 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "     Role Responsibilities            Responsible for creation of test strategies and methodologies for various end to end IOT systems (edge devices, Cloud SaaS platform, Client applications).           Creates, defines and develops system validation environment and test suites.            Identify areas for automation and implement automation frameworks.            Platform setup, troubleshooting, problem-solving and logical system level debug knowledge.          Responsible for the development of test methodologies, execution of validation plans, and issue isolation on Edge based cloud platforms.          Optimizing test data and come up with minimal but sufficient test plans.      Defining KPI s for validation and actively tracking those.     Implementing CI/CD using Jenkins.       Day to day interactions with cross-functional teams across geographies.              Qualifications          10+ years of relevant experience with Bachelors/Master s degree in Computer Science and Engineering or equivalent.            Product Testing Experience in IOT systems involving video streaming, storage, cloud multi tenancy, micro services.                    Product Testing Experience on Cloud Production, pre-production, development environments, security policies, Network isolation guidelines etc.           Hands on experience in Testing methodologies, tools for testing applications deployed on Virtualized environment and automation frameworks         Excellent scripting skills in Perl and Python         Experience with software integration, validation techniques and release methodologies.          Experience in test case design, user level testing, application testing, Product testing.           This position requires Bachelors or Master s degree in Engineering with 8-10 years of relevant experience.          Excellent attitude; Good Team player; Go-getter.          An appetite for learning        Ability and attitude to adapt to new priorities and challenges.     ", "Role": "Team Lead/Technical Lead,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial, Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Computer science", "Automation", "Application testing", "Diversity and Inclusion", "Cloud", "Perl", "Product testing", "Troubleshooting", "Test case design", "Python"]}