{"Job Title": "Software Developer, Immed joiners & latest tech skills candidates only", "Company": "Cunesoft India Private Limited", "Experience": "5 - 10 years", "Salary": "₹ 10,00,000 - 20,00,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": " Dear Candidate,We have 25 full time new roles which includes Junior, Mid and Lead Developer with 3years to 12 years of experience. We are extending our business and these are our urgent vacancies In India. We are a product based company. Salary - a decent/good hike on the current package can be expected. We, Phlexglobal are globally present in India, UK, US, Poland and Germany too.The purpose of this role is to develop software tools within the Phlexglobal Technology department for both internal and client use. This position requires strong technical and communication skills as well as both independent and team working. It involves:Designing, building and delivering code, according to company Software Development Life Cycle procedures.Actively participate and encourage others to participate in an Agile SCRUM development methodology including refinement, planning, stand-ups, retrospectives.Having a quality mindset ensuring quality code is produced by you and your team.Being accountable for the output of the members of your team and providing an atmosphere of ownership and accountability within the team.Designing scalable, robust technical application architectures.Peer-review and constructive critique of code produced by other members of the development team.Working to help improve the software development processes within Technology.Assisting with development support of Software Applications.The role includes mentoring of junior members of the development team as well as working closely with all other areas of the Development team, Technology department, Phlexglobal Operations Managers, IT Infrastructure and third party software suppliers.Key ActivitiesDesign, architect and build code across several new and existing software projectsEnsure software is delivered according to the company Software Development Life Cycle procedures, using agreed technology stacksEnsure all code produced is performant and tested prior to being handed for peer reviewProvide mentoring to members of the development teamContribute ideas and suggestions to the monthly development team meeting to help ensure we are developing code in the best way using latest technologiesTravel as required to other sites within the company for meetings and training (this is expected to be no more frequently than once a fortnight)Provide team members with one-to-one feedback and assist in appraisals.Required Skills & ExperienceCommercial experience in web development using the full Microsoft .Net development stack (specifically C#, MVC, .Net Core), SQL, front-end frameworks (jQuery, React, etc).Expertise in modern development principles (Agile, SOLID, TDD, design patterns, IoC).Experience building scalable solutions based upon robust software architecture.Commercial experience in at least some of; cloud platform development (ideally Azure), MVVM, microservices, message bus, containerisation, serverless.A passion for technology and developing your own technical skills.A results oriented individual with the ability to work to deadlines, communicate and work effectively with other team members both on site and remote.Strong analytical and problem solving skills.Self-motivated with the ability to prioritise, meet deadlines, and manage changing priorities.Able to work independently and as part of a team.Excellent communication skills.Candidates with these experience can apply for the job or send me your Cv directly to ysharun@phlexglobal.com or you can call me to discuss further at +91 78994 08367.We do not encourage agencies or consultancies to contact us.", "Role": "Software Developer,", "Industry Type": "Pharma, Biotech, Clinical Research,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["C#", ".Net Core", "Software Development", "MVVM", "TDD", "full stack developer", "dependency injection", "MVC", "containerisation", "JQuery", "Web Development", "SQL"]}