{"Job Title": "Principal Engineer, Software Development Engineering (Apps)", "Company": "Western Digital", "Experience": "6 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "                  Job Description :-             We are looking for a Flutter Expert with a proven record of successfully architecting, designing and implementing complex Web/Android/iOS applications. The ideal candidate should be proactive in doing Research & Development, has innovative ideas and passion to drive those idea to real products.            Required Skills for Flutter:         Design and Build sophisticated and highly scalable apps using Flutter.       Requires BS/BA degree or equivalent with 8 or more years of related experience       Expertise in Dart/Java/Swift/Javascript and applicable frameworks.        Build custom packages in Flutter using the functionalities and APIs already available in native Android and IOS.           Experience in creating Flutter or native apps with complex graphs/animations, Audio & Video Processing, AV synchronization, Machine Learning algorithms, Video codecs, TensorFlow, WebRTC/HLS Video players.         Translate and Build the designs and Wireframes into high quality responsive UI code.         Expert in Design patterns such as MVC, MVVM, Blocs, and good experience in designing, developing architecture and developing maintainable, testable and functional software that meets product requirements.        Explore feasible architectures for implementing new features.        Resolve any problems existing in the system and suggest and add new features in the complete system.        Suggest space and time efficient Data Structures.       Follow the best practices while developing the app and also keeping everything structured and well documented.          Document the project and code efficiently. Manage the code and project on Git in order to keep in sync with other team members and managers.           Strong in debugging Crashes & Memory leaks, Refactoring & Optimising code base with profiling, tuning the Web or Android or iOS) applications.           Strong understanding of interactive application development paradigms, memory management, File I/O, network & socket programming, concurrency and multi-threading.           Ability to code any custom, cutting edge Flutter app we design, from scratch, with minimal supervision, quickly, well-structured & with high quality.          Computer Science fundamentals in OOPS, data structures, algorithm design, problem solving, and complexity analysis.          Willing to work in agile work environment through test driven development, continuous integration and involve peer reviews.        Strong Design and Architecture skills with proven work experience.     Should have at least one strong experience on:    Web development using Javascript / Angular framework       Flutter: To build cross platform mobile apps for Android, IOS and Web. This should include from making responsive UIs to efficiently query data and also mange states in an optimized manner.        Native Android /iOS / Web: To build custom Flutter Packages.        WD is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: WD is committed           to the principle of equal employment opportunity for all employees and to providing employees with a work          environment free of discrimination and harassment. All employment decisions at WD are based on business needs,         job requirements and individual qualifications, without regard to race, colour, religion, gender, national origin, age,        disability, veteran status, marital status, pregnancy, gender expression or identity, sexual orientation, family,    ", "Role": "Team Lead/Technical Lead,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Socket programming", "Web development", "Debugging", "Javascript", "Agile", "Data structures", "Application development", "MVC", "Android"]}