{"Job Title": "Software Developer", "Company": "ALSTOM India Limited", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   Purpose of the Role :           The software developer will report to the Software Development Manager. The role is an Individual contributor role, working on building software web applications for internal Alstom customers. The primary responsibility will be on software development, building custom apps, developing a top quality software product following the Alstom coding standards industry best practices.          Main Responsibilities           Accountable for complete frontend development of assigned use case.               Responsible to adhere to the set quality coding standards, adhere to the UX.               Responsible to follow the SCRUM process, attend all meetings, accountable for timely status updates.               Accountable to provide estimates on-time delivery of assigned use case.               Be punctual, regular and a team player.           Educational Requirements:        BE or B Tech Graduation degree            Bachelor s/Master s degree in Computer Science Engineering /Technology or related field           Must Have Competenices           Total experience of 5 + years in end to end software development               Responsible for frontend development. Having worked on angular version 2 for at least 2 years with more than 2 projects.               Individual contributor and has history of being part of development team of at least 3 projects.             Good to have:             Knowledgeable of Java, spring boot, maven.               Good to have DevOps exposure build process, quality security checks.               Self-learning qualities with track record of picking up new skills while on job.             Team player ability to learn new technologies         Competences Skills          Strong hands-on experience on Angular 2 and above               Good knowledge on CSS 3, HTML 5, Bootstrap, JavaScript, RxJS, Angular Material.               Strong in troubleshooting issues providing resolutions.               Be able to design their module and suggest improvement ideas.               Can write unit test cases using Jasmine or Karama.               Aware of software build and release process.               Have designed (UX) for the module.               Well versed with working in Agile way, knows Scrum methodology.               Fluent in English. Excellent in communication.               Be able to clearly give status updates and explain impediments.               Excellent in picking up new technologies and skill set while on job. Self-learner.       ", "Role": "Software Developer,", "Industry Type": "Courier, Transportation, Freight , Warehousing,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Computer science", "Business process", "Maven", "Coding", "Javascript", "Agile", "Scrum", "Test cases", "Troubleshooting", "Information technology"]}