{"Job Title": "CW Software Developer", "Company": "Varite", "Experience": "4 - 9 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "    Job description         Gathering functional requirements, developing technical specifications, and project test planning            Designing/developing web, software, mobile apps, prototypes, or proofs of concepts.         Act in a technical leadership capacity: Mentoring junior engineers, new team members, and applying technical expertise to challenging programming and design problems            Roughly 70-85% hands-on coding            End to end engineering design, development, testing, deployment and operations            Expertise in building native applications in mobile            Resolve defects/bugs during testing, pre-production, production, and post-release patches            Work cross-functionally with various Intuit teams: product management, various product lines, or business units to drive forward results Contribute to the design and architecture of the project            Experience with Agile Development, SCRUM, or Extreme Programming methodologies           Skills         Required Skills             At least 6+ years experience developing web, software, or mobile applications         BS/MS in computer science or equivalent work experience.         Strong Mobile development skills (Kotlin Android, Swift iOS)         HTML and JavaScript (ReactJS, Relay, GraphQL/Apollo) skills is desirable         Strong experience in one of the leading Javascript Frameworks OR       Strong experience in back end programming in Java / Java EE, Springboot         Have at least 3 years for experience in Server Side Technologies         Experience in AWS and Kubernetes an added advantage         Solid communication skills: Demonstrated ability to explain complex technical issues to both technical and non-technical audiences        Strong understanding of the Software design/architecture process         Experience with unit testing Test Driven Development (TDD)         Ability to perform end to end engineering design, development, testing and deployment.    ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Other,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Product management", "Computer science", "Software design", "Coding", "TDD", "Javascript", "HTML", "Scrum", "Unit testing", "Android"]}