{"Job Title": "Sr. Software Developer", "Company": "enVista", "Experience": "5 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": " enVista Inc. is seeking energetic and talented Sr. Software Developer for its Enspire Commerce platform. Enspire Commerce is a leading provider of unified commerce solutions on a single platform in the cloud. By uniquely providing omni-channel order management (OMS), fixed station and mobile point of sale (POS/mPOS), product information management (PIM), trading partner management (EDI), omni-channel fulfillment execution (store fulfillment and vendor drop ship) and e-commerce solutions as business process objects within a multi-tenant architecture and integration framework, Enspire Commerce solutions rapidly integrate with existing retail systems to rapidly unify commerce and reduce cost of ownership.     This position requires creative thinking and the ability to apply new methodologies to design and solve complex solutions. If you love technology and want to work in a place where you can practice the art of good software design, this is a great opportunity to explore.      Responsibilities:     Technical analysis estimation of business requirements   Converting visual designs to visual elements.   Support unit and system testing of application code, as well as execution of implementation activities   Deliver commitments within timelines and quality parameters   Manage multiple competing priorities and changing requirements in a fast-paced SaaS environment   Facilitate technical meetings and communicate progress, action items, etc. to the stakeholders   Drive innovation and new ideas that help us improve our customer experience   Work in an agile environment.   Respond to production issues and coordinate with stakeholders and external teams to arrive at solutions   Ability to prioritize work and help the team assess impacts to timelines         Skills Qualifications Required:     Four-year bachelor s in computer science, engineering, or a related technical field with 5-8 years hands on development experience   Solid fundamental knowledge of JavaScript(specially asynchronous programming with JavaScript).   We expect you to have well-rounded experience of:     Working with NodeJS and a web application framework like Express.   Understanding of SPA frameworks like Angular/React/Vue.   Rest architecture and API designing.   Responsive CSS framework(s) and fundamentals like Bootstrap, Foundation etc.   Web HTTP fundamentals and optimization techniques.   Frontend building linting tools with Gulp, Webpack, ESLint etc.   Unit and integration testing with tools like Chai, Mocha Cypress etc.   Docker, Typescript and Flutter experience is a plus.   Micro-service architecture and some level of distributed system design concepts.   Experience with SQL (Any one of Oracle, PostgreSQL, MySQL)   Prior experience of Redis, Elasticsearch, AWS or other vendor web services.    Experience in Supply Chain and Order Management Solution is a plus.  ", "Role": "Software Developer,", "Industry Type": "Courier, Transportation, Freight , Warehousing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Order management", "Software design", "Postgresql", "MySQL", "Javascript", "Agile", "HTTP", "EDI", "Oracle", "SQL"]}