{"Job Title": "Software Developer", "Company": "Pentagon Consultancy Services", "Experience": "4 - 9 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": " 3 - 9 years Pentagon Consultancy Services | HR Consultants | Placement Consultants | Recruitment | job consultants | manpower consultancy | Bangalore, India Skills : Pega BPMDescription : Greeting from Pentagon.  Job Responsibilities: 1.  Be able to provide direction and lead a small development team 2.  Participate in design and estimation discussions and help lead in task prioritization for team 3.  Help translate requirements into user-stories and actively participate in scrum events 4.  Work closely with Business/ SA/ BA/ Architects to ensure requirements are well documented and clear 5.  Support team on day to day tasks to achieve business goals.  Be accountable for timely quality delivery of assigned team/ modules 6.  Perform code reviews and guide the team on best practices 7.  Provide appropriate status updates and manage project assignments on routine basis 8.  Actively participate in quality audits, projects reviews time to time Essential Skills: 1.  Min 5-7 years of experience in software development out which at least 5 years in PRPCdevelopment.  Pega 7 experience would be an added advantage 2.  Pega CSSA Certified 3.  Very good experience of application integration using Pega-PRPC 4.  Very good experience of application debugging and troubleshooting using Pega-PRPC 5.  Should have good experience in design and development of Pega projects.  6.  Experience working in at least one complete medium to large scale enterprise Pega project 7.  Must have good exposure to Agile Scrum/ SmartBPM practices and methodology 8.  Good understanding of software engineering practices and architecture guidelines 9.  Excellent verbal and written communication skills 10. Good knowledge and experience of PRPC Best Practices, Estimation, Task Scheduling, Risk Assessment, IT Quality Modify existing software to correct errors, to adapt it to new hardware or to upgrade interfaces and improve performance.  Advise customer about, or perform, maintenance of software system.  Analyze information to determine, recommend and plan installation of a new system or modification of an existing system.  Direct software programming and development of documentation.  Store, retrieve, and manipulate data for analysis of system capabilities and requirements.  Consult with customers or other departments on project status, proposals and technical issues such as software system design and maintenance.  Prepare reports and correspondence concerning project specifications, activities and status ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers, BCA in Computers, B.Sc in Computers", "PG": "MCA in Computers, M.Tech in Computers", "Doctorate": "None", "Key Skills": ["BPO", "Payroll", "Business Analyst", "Staffing", "Pega", "Scheduling", "Software", "Business Executive", "Indesign", "business process outsourcing"]}