{"Job Title": "Core PHP Software Developer", "Company": "Friday Media Tech India Private Limited", "Experience": "1 - 4 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  Description:   Harnessing your raw talent, acquired knowledge and desire to keep learning, you will utilise your Core PHP abilities to enhance our existing web products and build exciting new solutions. As a digital marketing services company, we thrive on innovation and want to add people who exhibit a high degree of technical aptitude, creativity and commitment. You should be confident to put ideas forward (and encourage others with theirs). We want problem solvers, engineers, people who consider the whole product when developing solutions. Being able to take a blank canvass and develop from scratch, without frameworks or quick hack shortcuts, is the level of talent we seek to hire.     You will be responsible for:    Maintaining and developing web applications on our Local Marketplace and Niche Marketplace platforms     Interfacing with Product Development, Project Management, Business Analysis and the Internal Development teams in UK     Coaching and mentoring junior team members when and where appropriate    Technical Skills:    You are a good match if you have experience in the below technologies and tools:    Core PHP Proficiency is a must for this role    HTML5, CSS3, PHP-FPM, ZURB Foundation    Solr, ElasticSearch or other Lucene based enterprise search engines    Linux (Cent OS), Apache, NGinx    Jira, Confluence, BitBucket, Chef, Ansible, TeamCity, Octopus Deploy, Doctrine, PhpStorm       Other skills:     At least three+ years of experience as a PHP Software Developer, being able to clearly demonstrate Core PHP proficiency is essential     Communication skills (English), both written and spoken, must be exceptional    Experience with Agile & Scrum methodologies   Experience in cloud based development and deployment    A technical expert with the ability to generate new ideas and solutions  ", "Role": "Software Developer,", "Industry Type": "Internet, Ecommerce,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["jQuery", "Linux", "Business analysis", "Project management", "MySQL", "MongoDB", "Apache", "JIRA", "Digital marketing", "CSS3"]}