{"Job Title": "Sr. Software Developer (PHP, Apache, Magento)", "Company": "Snaphunt", "Experience": "4 - 6 years", "Salary": "₹ 8,00,000 - 12,00,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": "Opportunity to work for an award-winning innovative firmWork with a highly-experienced team and learn tremendouslyDynamic work environmentOur client is an innovative firm that is providing mobile refuelling services. Founded by a team with decades of global experience in this field, they have won several awards for their personalised solutions that allow businesses to increase productivity and profits. The Job You will be responsible for : Writing well-designed, testable and efficient code.Gathering and evaluating user feedback.Working as a part of a dynamic team to deliver winning products.Providing code documentation and other inputs to technical documents.Supporting continuous improvement by investigating alternatives and new technologies and presenting these for architectural review.Troubleshooting and debugging to optimise performance.The Profile You possess a Degree/Diploma in Computer Science, Engineering or related field.You have at least 3 years experience in PHP, Apache, JavaScript (ECMA 6/7), and 2 years in Magento and LAMP.You have strong knowledge in MySQL.You have solid understanding of Magento Modules DevelopmentYou are able to develop complex and high end international web applications.You are able to create responsive design using JavaScript.You are a strong networker & relationship builderYou are a strong team player who can manage multiple stakeholdersYou are adaptable and thrive in changing environmentsRef :13870851  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Software Development", "Web Technologies", "MySQL", "Magento", "Debugging", "Javascript", "LAMP", "Net", "Oracle", "Responsive Design"]}