{"Job Title": "Senior Software Developer", "Company": "ExecBoardinAsia", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": " As their new member, you will work with a group of enthusiastic and experienced team members. Together with your team, you will be responsible for design and delivery of new product features, enhancements and supporting the enterprise product.    Your role and responsibilities:    As a Senior Software Developer .Net Full Stack, your focus will be designing, developing and implementing features and improvements to the product. Besides working closely with your colleagues in Bangalore, you will also work closely with the company teams in other countries.    Codes, tests, debugs and implements and maintains software solutions with some assistance on complex development tasks.   Supports develops, tests, debugs and implements operating systems components, software tools and utilities with limited supervision.   Develops security solutions for routine assignments progressing to assignments with increasing complexity.   Provides application software development services or technical support, typically in a defined project often learning from more experienced peers.   Develops program logic for new applications or analyses and modifies logic in existing applications, often learning on the job from more senior colleagues as size of the challenge increases.   Modifies existing internal software products to add new functions, adapt to new hardware, improve performance or enhance product usability under limited supervision.   Implements and monitors routine system improvements to ensure successful installation and increased efficiency.   Ensures that applications are compatible across multiple computing platforms and browsers.  ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Operating systems", "Hardware", "Application software", "Software solutions", "Technical support", "Supervision"]}