{"Job Title": "Senior Software Developer", "Company": "Clarivate Analytics (TRCPL Projects Pvt Ltd.)", "Experience": "6 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "         We are looking for engineers with backgrounds that span web UI, backend development, and systems engineering to join our Engineering team. Our team is creating the next generation search and SaaS applications behind the World s most effective trademark clearance tools.    You should have experience with some or all of single-page responsive webapps, algorithmic programming, microservices and distributed computing, webapp performance engineering, data processing at scale, serverless cloud architectures, and NoSQL data storage systems.       Role and Responsibilities:     Review product requirement to identify gaps and refine requirements, develop execution strategy, provide time estimates and release plan, provide testing requirements, implement and deliver the solution with your team.   Prototype product components and validate them for technical design, performance, and production readiness   Partner with product owners, data scientists and others to gather requirements; find technical strategies to meet objectives, introduce innovative technology, and deliver production code   Work with UX and Product Management to create UIs that make complex information and similarity search configuration simple, effective, and fun   Maintain, improve, and integrate existing components and applications   Follow design and delivery best practices for high-quality code, micro services REST architecture, encapsulation of legacy systems, AJAX components and fluid UI, SOLID and DRY programming, TTD, CICD, etc.   Conduct code review and advocate best coding practices.   Works for resolution of technical impediments by collaborating with appropriate stakeholders, proposing, developing and delivering resolutions.   Ensures each product meets required quality standards, identifies potential risks in quality and works with leadership in creating mitigation plans.   Leads defect triage meetings. Works with support and consulting teams in resolving customer issues. Interacts with customers as required in understanding, reproducing, and troubleshooting customer issues   Provides training, guidance, feedback, coaching and mentorship to fellow engineers. Provides technical thought leadership across organization.   Hire and develop the team.   Work in an agile, rapid development and prototyping environment where effective communication is paramount.      Skills and Experience:           Bachelors degree in Computer Science, Technology, or Engineering, (strongly preferred), or equivalent work experience.   Highly proactive, result-oriented and team player.   Hand-on with 6+ years of experience in software development of complex distributed system.    Exceptional experience in the field of developments, and deployment of high-volume applications both on-prem and on Cloud.    At least 2 years of experience in leading a small team of developers.   Strong programming experience - JavaJ2EE, Python, Perl, shell script etc   Strong experience in web technologies - Node JS, Angular, React, JQuery, JavaScript, TypeScript, HTMLCSS   Experience with search engines, e.g. Elasticsearch, Solr   Strong experience in MVC, Spring, Hibernate, Microservices, ApplicationWeb Servers.   Strong understandingexpertise in building REST APIs Micro services architecture.   Data modelling and database design experience including NoSQL DBs - MongoDynamo Helpful   Experience with GIT Hub, Maven, Gradle, Jenkins, Docker, and other CICD Platforms   Experience in building application for Amazon Web Services (AWS)   Expertise in architectural styles and design patterns   Expertise in industry best practices in SW development processes: Unit testing, Object Oriented design, code reviews etc.   Excellent communication skills (written and verbal), with specific experience and demonstrable success with the full software development lifecycle and using the Agile Development processes   Good analytical and problem-solving skills              ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Hibernate", "jQuery", "Coding", "Consulting", "HTML", "Perl", "MVC", "Troubleshooting", "Ajax", "Python"]}