{"Job Title": "Java software developer", "Company": "Mirabilis Design Incorporation", "Experience": "2 - 7 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "What s exciting about this role:\n\nThis position will be in the development of new capabilities that accelerate the design of innovative electronics products that will be deployed in 2020 and later. The candidate will be exposed to applications ranging from Artificial Intelligence,  Machine Learning,  far space technologies,  processors,  high- performance computing and automotive networks.\n\nThe candidate will be responsible for deploying new features for the VisualSim GUI; designing,  coding,  and debugging applications to develop high- quality and well- architect software; developing debugging and animation tools for VisualSim Architect and VisualSim Explorer to support electronic design workflows; providing innovative ways to capture the representation of task graphs,  integrate with SysML and developing APIs for third parties to integrate into VisualSim; leveraging state- of- the- art web UI technologies to enable building modern applications; engaging in all aspects of software development processes,  influencing requirements specifications,  conducting design reviews,  and generating innovative software design solutions; working closely with other developers,  quality engineers,  UX specialists,  and visual designers; and performing functional design,  architecture development,  and implementation of APIs and UIs using Java,  JavaScript,  HTML,  and CSS.\n\nLocation: \n\nOur top preference is to have this Developer in the Chennai,  India Metro area.\n\nEducation and Experience:\n\nMaster s degree or higher (or foreign education equivalent) in Engineering,  Computer Science,  Information Technology,  Computer Science and Engineering,  Systems Science,  or Operations Research and no experience.\n\nOR\n\nBachelor s degree (or foreign education equivalent) in Engineering,  Computer Science,  Information Technology,  Computer Science and Engineering,  Systems Science,  or Operations Research and two+ (2+) years of experience in job offered or two+ (2+) years of experience in UI design.\n\nSpecial Requirements:\n\n2+ years software development experience\n\nProficient in Java (or similar Object- Oriented language e.g. C#,  C++)\n\nExperience developing Swing (or similar code- behind GUI frameworks)\n\nDemonstrated expertise in object oriented programming using Java\n\nDemonstrated expertise in UI design and testing using Java; and integrating UI components in a text editing environment.\n\nExcellent communication skills\n\nStrong analytical and creative problem solving skills\n\nBS or MS degree or equivalent experience relevant to functional area[Expertise may be gained during Graduate program.]\n\nWhy ELC Labs\n\nIt s the chance to collaborate with bright,  passionate people. It s contributing to software products that make a difference in the world. And it s being part of a company with an incredible commitment to doing the right thing for each individual,  our customers,  and the local community.\n\nELC Labs is the development arm of Mirabilis Design,  the sole provider of architecture exploration software for the worldwide electronics industry. ELC Labs is based in Chennai India and Mirabilis Design is based in Sunnyvale,  California,  USA with over 65 customers worldwide. Mirabilis Design is privately held and has been profitable every year since its founding in 2003.\n\nEEO Statement:\n\nELC Labs and Mirabilis Design are an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race,  color,  religion,  sex,  pregnancy,  sexual orientation,  gender identity,  national origin,  age,  protected veteran status,  or disability status.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["analytical", "software", "developing", "HTML", "tools", "Automotive", "research", "Embedded software", "Software design", "java", "ui", "Coding", "web", "design", "Javascript", "programming", "architecture", "C++", "ux", "Debugging", "testing", "it", "Information technology", "quality", "Animation", "support", "applications"]}