{"Job Title": "Sr. Software Developer/Associate Technical Lead/Technical Lead", "Company": "IDeaS Revenue Solutions", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "  Job description     Summary:     The Programmer will participate in the design and development of a multi-user, multi-tenant,analytics centric application using Java EE/State-of-the-art technologies.     Major Responsibilities:     Analyzes the business and system requirements working closely with product management,product owners and others.   Designs and develops innovative solutions to business requirements   Supports new and existing software; working with technical support and customers to ensure customer satisfaction.     Requirements: (Knowledge, Skills, Abilities, Competencies, Education Experience)     At least Bachelor?s degree in mathematics, engineering or computer science.   Minimum 5+ years of hands-on experience in developing high scalability applications using    Java Technology.   Excellent understanding of OOP concepts. Command over the design principles.   Follower of TDD and good knowledge of Test Pyramid. Apt understanding of data and its management.   Understanding of Enterprise Integration Pattern.   Understanding of protocols such as SOAP, HTTP/HTTPS, FTP/SFTP and REST.     Preferences:     Should have hands-on expertise in at least two programming languages having different     paradigms.   In-depth understanding of OOP concepts.   Should have command over the design principles and patterns.   Excellent Grasp of Agile/Collaborative Development practice.   Excellent at pair programming, ?code smell? identification and refactoring techniques.   Follower of TDD and good knowledge of Test Pyramid.   Should have given presentations in technology conferences.   Should have the ability to mentor/groom the team on technical aspects.   Must be a passionate, proactive, self-driven worker with strong interpersonal skills.   Other:   Back end technologies stack include: EJB3, JPA, Hibernate, Spring, Spring-batch, Spring IO, JMS,JAXB, REST, Web Services, PL/SQL, Java 1.8   App. /Db Servers includes: JBOSS, Tomcat, MSSQL, MySQL, Mongodb   Development Practices tools include: Agile methodologies, Continuous Integration -Jenkins, Code Coverage tools like Cobertura, JUNIT, TDD, MAVEN, ANT, SVN, CVS, GIT, GERRIT.   Excellent written and verbal communication skills.   Experience in continuous build environment. Experience with SQL query tuning.   Equivalent combination of education, training, and relevant experience may be considered.  ", "Role": "Team Lead/Technical Lead,", "Industry Type": "Travel , Hotels , Restaurants , Airlines , Railways,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Software Engineer Associate", "Associate Technical Lead"]}