{"Job Title": "Team Leader / Lead Engineer – Embedded System Software Development", "Company": "GE Diesel Locomotive Pvt. Ltd", "Experience": "9 - 14 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Roles and Responsibilities  Demonstrate leadership in communicating business goals, programs, and processes, utilize your experience and expertise to solve problems, develop and execute objectives for self and others, have the ability to effect short-term and some long-term business goals.Create technical concepts, specifications for your software and implement the design, analysis, or evaluation of assigned projects using sound engineering principles and adhering to business standards, practices, procedures, and product/program requirementsProvide technical leadership to personnel supporting the assigned project Document technical data generated by the assigned project consistent with Organizational quality system practices and proceduresIntegrate the systems creating test specifications and performing software and system tests. Point of direct customer contact and like to make a variety of new solutions as well as adaptations to existing applications. Contribute to organizational initiatives towards optimizing and standardizing processes and technology improvementsProvide timely communications on significant issues or developmentsParticipate as a presenter/reviewer in technical and program reviews Participate / Support Design validation in end customer sites in India & Abroad.Desired Candidate Profile : 7 to 15 years of hands-on experience in embedded real-time software design and development of which at least 2 to 5 years as a team leader / team monitoring  in a development team . Strong technical aptitude, and expertise in applicable engineering tools and systemsProven history in delivering high quality embedded software products utilizing programming languages C/C++ (14/17), Python under embedded Linux operating environmentExpertise in object-oriented design and programming  using UML with tools like Enterprise Architect Good understanding of Network technologies (L2/L3), IT security, cryptography, Wireshark, and web development Demonstrated skills in Lua, XML, Bash, and Python.  Knowledge of Sphinx for Documenting concepts and system architectures is an added advantage Experience in all phases of the product engineering/development cycle in addition to practical experience with the SEIs CMM / CMMIExposure to Agile methodology of software development is an added advantage Effective oral and written communication skillsKnowledge of German & French is an added advantage.  Strong interpersonal and leadership skillsWilling to travel to end customer sites in India & Abroad ", "Role": "Team Lead/Technical Lead,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Embedded, EDA, VLSI, ASIC, Chip Design,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "MCA in Any Specialization", "Doctorate": "None", "Key Skills": ["Team Handling", "Lead", "Embedded"]}