{"Job Title": "Software Developer", "Company": "Symphoni HR Private Limited  ", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Roles and Responsibilities  Designs, develops and modifies software. products and/or customer applications using object oriented web development utilizing C#, JavaScript, Dojo Toolkit, XML, SQL Server 2008-2016, MVC, SVN, Web Services, Unit testing, and SOA patterns. Participates in design discussions and contribute in decision making Will work on multiple projects providing development and maintenance work.   Have knowledge of how to document program design, coding, and maintenance.  Have experience getting critical project to completion with high client satisfaction.  Applies existing guidelines and procedures to make varied decisions within a department. Uses sound judgment and experience to solve moderately complex problems. Uses independent judgment to identify problems and recommend solutions. Adheres to defined coding standards and other defined quality standards Client interaction, interpersonal communication, written communication, decision making ability, client focus.Desired Candidate Profile    Strong analytical and problem-solving skills•    Must be detail oriented and possess effective oral and written communication skills.•    The ability to understand the subject matter and customize the message according to the intended audience.•    Strong organization skills:  must be able to work on multiple tasks during the same time frame and meet deadlines with accuracy and efficiency.  Must be willing to work extended hours to meet project deadlines.•    The ability to communicate effectively, both verbally and in writing to a diverse range of audiences and settings.  •    Must have a positive attitude, be self-motivated, flexible, and a team player.•    The ability to maintain the integrity of confidential business information, our own and that of the clients.•    Be comfortable working in a distributed team environment.  Perks and Benefits ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Ed in Education", "Doctorate": "None", "Key Skills": ["C#", "Solid Principles", "Angular", "Asp.net"]}