{"Job Title": "Web Developer ( Software Engineer/ Senior Software Engineer)", "Company": "Eurofins It Solutions India Pvt Ltd", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Roles and Responsibilities TITLE:                 Software Engineer      REPORTING TO:         Manager WORKING LOCATION:     Bangalore REPORTING LOCATION:    BangaloreSUMMARY OF POSITION AND OBJECTIVES: We expect this role to contribute towards of development of secured and high performance web application. Contribute to the design, development, troubleshoot, test application including backend (server side), Web (Angular).Interact in a constructive manner with Business Analysts in order to: Estimate the complexity and the workload;Choose the most appropriate technical solution to meet the user requirements;Reach the optimal requirement artifact that will lead to a working software solution.Interact in a constructive manner with other IT teams.Troubleshoot and resolve production issues JOB DESCRIPTION: Design, develop, deploy and support web applications, solutions as per business requirements and built the services upon Microsoft Stack. Maintain, modify, optimize and extend existing solutions as a part of support and performance optimization projects. Working together with other team members (dev/QA) to ensure high quality of delivered solutions. Ensuring good practices and high quality standards are implemented and followed. Performing other related duties as assigned.EXPERIENCE REQUIRED: 3 to 5 years of experience with developing end to end solutions using Microsoft Stack of Technologies. Good understanding of design & architecture  Strong analytical, problem solving and troubleshooting skills. Collaboration with Software Architect(s) and other technical groups within Eurofins (Includes design, documentation, prototyping and validation) Strong experience in designing and working with n-tier architecture solutions Usage of Team Foundation Server (TFS)TECHNICAL SKILLS REQUIRED: Strong working knowledge on server-side development (backend - Asp.net MVC Web API, Entity Framework) Good working knowledge of MSSQL – SQL, T-SQL etc. Strong working knowledge of application development using .NET, C# Experience in designing and working with n-tier architectures Hands-on experience in unit testing (NUNIT or VS Unit Test) Working knowledge of TypeScript, Angular JS, Angular 5 or above, HTML5 and CSS3 technologies Should have worked on at least one SOA (Service Oriented Architecture) project Understanding of UML, object-oriented programming (OOP) and Object Oriented Design principles Strong knowledge of software implementation best practices Able to provide technical recommendations and solve technical problems Must be a quick learnerPERSONAL SKILLS: Excellent analytical and problem solving skills Excellent verbal/written Communication, Interpersonal and Presentation skills. And can explain complex functional/technical concepts with ease (via diagrams, flowcharts etc.,). Should be a self-motivated, independent, detail oriented, responsible team-player and exhibit exceptional relationship skills Candidate to have do-it-done attitude; the ability to think critically; enjoy working with teams spread globally and across cultures; a desire to learn in new areas; and the discipline to pay attention to deadlines, details and quality. Experience in Agile (Scrum) methodologies needed. Ability to adapt quickly to an existing, complex environment.  Ability to quickly learn new concepts and software is necessaryTechnology – Nice to have: Experience in AWS cloud platformMethodology skills AGILE Development (Scrum)PREFERED CANDIDATES:The successful candidate will have a self-motivated, get-it-done attitude; the ability to think critically; enjoy working with teams spread globally and across cultures; a desire to learn in new areas; and the discipline to pay attention to deadlines, details and quality.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Client/Server Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["Entity", "Web API", "Angular 5+", "Azure", "Design Patterns", "C# .Net", "SQL"]}