{"Job Title": "Software Engineer (Full stack Developer)", "Company": "Clairvolex Knowledge Processes Pvt. Ltd.", "Experience": "4 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   Responsibilities:        You will help and support critical analytical research which makes the IP Asset Management easy and intuitive.          As a key member of the product team, you may be developing data applications and solutions which helps management of large data sets.          You may also be involved in the developing models and analytical solutions using NLP and machine learning algorithms in java and / python.          We have an environment which nourishes creative, lateral and critical thinking where you are free to shape the next generation of advanced analytics solution which will change the way Intellectual Property in managed world over       Timely delivery of highquality software components   Contribution of re-usable software artifacts         Required Qualifications Experience:           4 - 6 years of full stack development in building multi-tier enterprise applications using web 2.0 technologies delivered through multiple channels for multiple form factors and devices       BE/BTech/BS in engineering from engineering schools of repute from around the world          Expected Competencies/Skills/Abilities:          Strong full stack development skills, with experience developing n-tier web applications using JavaScript /python and a real passion for learning more.        Good exposure to full life cycle development of micro services architecture        Experience in writing clean, modular/reusable code using modern JS frameworks/libraries React/Angular or other comparable framework or tool-kits       Advanced data layer skills to work with SQL and NoSQL data sources using python and JavaScript/NodeJS on the server side      Proficient in Algorithms, Data Structures, Problem solving      You have a deep understanding of npm/flask and experience with publishing modules         Proficiency in web application security; incorporating security into the software development lifecycle         Capabilities in code quality linters like eslint and knowledge of JavaScript testing frameworks like Jasmine         Familiar with database architecture, scalability and performance and have experience of continuous integration and Jenkins        Familiarity with distributed version control systems such as Git.      Good Linux knowledge and skills and are proficient working in bash and shell scripts.       Experience with agile development processes and maintain a philosophy of writing performant, maintainable JavaScript / python code.       Experience in TypeScript, express.js, Elasticsearch, AWS/Azure is a plus.    ", "Role": "Software Developer,", "Industry Type": "Legal,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial, Any Graduate in Any Specialization", "PG": "CA in CA", "Doctorate": "None", "Key Skills": ["Version control", "Publishing", "Linux", "Enterprise applications", "Machine learning", "Javascript", "Data structures", "Asset management", "SQL", "Python"]}