{"Job Title": "Software Developer", "Company": "VELOCIX SOLUTIONS INDIA LLP ", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "Roles and Responsibilities   Job Description Summary  We are looking for an  experienced development engineer to work on various video products with R&D  team of Velocix's Video Delivery Division. The Velocix's Video Delivery team is  developing on Video products like Content Delivery network, Video  personalization platform, Origin, Recording manager.     This development engineer role includes designing, building, implementing and  maintaining efficient and reliable code. The expected deliverables are stable,  scalable, working code and libraries. It is expected the development engineer  should define innovative strategies and drive to implement the same. One of  such activities expected in future is to implement Devops culture CI/CD model  for this development.  Job Description   Responsibilities :    -Implements the  requirements as per the guidelines provided in the system design.   -Makes sure that the  developed implementation is the most preferred and appropriate approach.   -Supports the scrum  testers for defining corresponding testcases to cover all aspects of  implementation.   -Makes sure unit tests  and component tests are well covered for every implementation.   -Participates in peer  reviews.   -Interfaces with Tech  Leads / Sys Designers to get the implementation correct/complete for a given  requirement.  Skills Summary :  Minimum of 2 to 5 years of hands on experience in   -Develop efficient,  reusable, and reliable code   -Maintains code  quality, organization, and automatization   -Agile, DevOps, and  Continuous integration and Continuous delivery  Details:    -Good C++ coding  skills with multithreading experience.   -Good experience in  usage of STL libraries.   -Good knowledge on  data structures and sorting / searching algorithms.  -Good Knowledge on the  product and the concerned component(s).   -Strong knowledge on  the programming language(s) and tools involved.   -Strong Experience in  programming languages as per product mentioned below, involving multi threading.   -Good Experience in  Linux (from a development perspective)   -Good  Experience/Knowledge in tools like GIT, JIRA etc.   -Experience/Knowledge  in Agile Methodology.   -Good Knowledge in  Video streaming methodologies.   -Good Knowledge in  protocols, refer section below based on products.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Other Graduate, B.Tech/B.E. in Any Specialization", "PG": "Other", "Doctorate": "Other Doctorate", "Key Skills": ["c++", "linux", "stl", "software development", "OOPS", "data structures", "multithreading", "threading", "heap", "programming"]}