{"Job Title": "Senior Software Engineer - Full Stack Developer", "Company": "Advanced Computer Software", "Experience": "2 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "        Role: .Net Full stack developer (AWS)     We re Advanced    Join a business that embraces innovation, gives you the scope to seize every opportunity and will help get you where you want to go. Life at Advanced begins in an unprecedented environment with a role that matters, taking you on a fast-paced journey of discovery, however big that might be.   We are one of the UK s largest and fastest growing software companies. True partnership is the defining thing that makes us different from the competition. We pride ourselves on delivering focused software solutions for public sector, enterprise commercial and health & care organizations that simplify complex business challenges and deliver immediate value.    About the role    This is a greenfield project on   Digital Business Transformation   for multiple products. Our goal is to build common frameworks that enable the process through reusability. The products are moving towards a SaaS model.   We are looking for full stack developers to produce scalable software solutions. You will be part of a cross-functional team that is responsible for the software development on AWS, building frameworks that will need to scale across multiple products.   As a full stack developer, you should be comfortable around both front-end and back-end coding languages, development frameworks and third-party libraries. You should also be a team player with a knack for visual design and utility, responsible for CI/CD with a TDD mindset and familiar with Agile methodologies.    Responsibilities     Work with development teams and product managers to ideate software solutions     Design client-side and server-side architecture     Build frameworks that can be adopted by applications for SaaS     Develop and manage well-functioning database/data as a service     Write effective APIs     Test software to ensure responsiveness and efficiency     Troubleshoot, debug and upgrade software     Create security and data protection settings     Write technical documentation     Skills     Proficient with Microsoft .NET 3.5+ development using C#     Develop in AWS using the web services      Implement Automated CI/CD processes     Develop Frameworks with SaaS as a mindset     Front end technologies     Advanced JavaScript     Bootstrap     HTML     JSON     CSS     NPM     Server side technologies     REST Web API (C#)     Programming Languages     C# , NodeJS     Backend (database)     Sql Server     EventStore (nice to have)     NoSQL (mongo, revan)     AWS DynamoDB     Cloud technologies     AWS     S3     API Gateway     Lambda     SNS     SQS     CloudWatch     DynamoDB     Serverless Framework     Others     Git/GitHub (source control)     Knowledge on DevOps tools (Jenkins, Team City, Octopus, Docker) and process  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Front end", "Coding", "Javascript", "Agile", "Healthcare", "HTML", "JSON", "microsoft", "AWS", "SQL"]}