{"Job Title": "Software Developer - Perl", "Company": "EI2Solutions", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "Software Developer Perl\n\nEi2 Is Building The Next Generation Development Platform As A Service For The Workgroup To The Enterprise. We Want To Combine Disparate Development Services From Scm (Git,   Svn),   Agile Management Tools (Trac,   Scrumworks Pro,   Teamforge),   Code Inspection,   Build,   Test,   And Deploy To Provide An Integrated,   Aggregated,   And Developer- Centric User Experience To Make Development Organizations More Agile. You Will Be Working With A Great Team,   Vision,   And Next Generation Technologies.\n\nAs A Perl Engineer,   You Should Be A Flexible,   Results- Oriented,   And Experienced Engineer. You Will Be Able To Work In An Agile,   Collaborative Environment With The Team To Implement Perl Based Applications. You Are Ambitious,   Talented,   And Driven To Make The Project Successful And Make The Best Cloud Development Platform For The Workgroup To The Enterprise.\n\nRequired Skills\n\n&Bull; 5+ Years Software Development Experience In A Web Applications Environment-  Oo Perl Experience\n\n&Bull; Linux /  Unix Experience\n\n&Bull; Mysql Experience Preferred\n\n&Bull; Javascript /  Ajax /  Json\n\n&Bull; Html And Css\n\n&Bull; Supervisory /  Management Experience\n\n&Bull; Familiar With Agile Scrum Methodology And Process\n\n&Bull; Excellent Interpersonal And Communication Skills\n\n&Bull; Experience With Git Or Svn\n\nBenefits\n\n&Bull; High Visibility Project With Ceo As Stakeholder\n\n&Bull; High Degree Of Ownership,   Autonomy,   In A Result Driven Company\n\n&Bull; Work With A Team Of High Energy And Competent Engineers\n\n&Bull; Be Exposed To New Technologies Like Nosql,   Ruby,   And Cloud Automation Platforms\n\n&Bull; Build Large Scale Applications For The Cloud,   Work With Architecture With Elasticity And Self- Healing Capabilities In Mind", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Unix", "Automation", "development", "code", "software", "HTML", "Perl", "JSON", "tools", "cloud", "Linux", "web", "service", "MySQL", "Javascript", "scrum", "developer", "agile", "SCM", "Ajax", "architecture", "applications"]}