{"Job Title": "Lead Software Development Engineer - Frontend", "Company": "Zeta Inc.", "Experience": "8 - 12 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   We are looking for Lead Front end developers for our web development projects @ Zeta. As a Lead Front end developer, you will be a part and lead passionate team of developers and work towards creating clean and artful design, translate high-level requirements into interaction flows and artifacts, and transform them into beautiful, intuitive, and functional user interfaces.    What is the Job like:    Designing and building a first of its kind web ecosystem that drives the business, engages and inspires our community of consumers and enthusiasts, and meets the functional needs of our customers and partners.     Rapidly building prototype web user interfaces.     Driving improvements in usability and interactivity of Zetas web properties.     Implementation of a pixel-perfect UI/UX with a focus on driving customer engagement and creating beautiful and unobtrusive user flows.     Collaborate across engineering, marketing, product management, customer support and design groups    Who Should Apply:    Candidates with 8+ years of experience.     Love programming and you are good at designing the user experience across platforms.     Aware of various product design, functional design and usability factors in designing.     Well versed with visuals, typography, fonts etc     Rich experience in native JavaScript / JQuery / Bootstrap     Well versed with HTML5 CSS3     Handle UI integration with REST-APIs     Pro with cross-browser compatibility   ", "Role": "Team Lead/Technical Lead,", "Industry Type": "Internet, Ecommerce,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Product management", "IT services", "jQuery", "Front end", "Networking", "Bfsi", "SOC", "Web development", "Javascript", "CSS3"]}