{"Job Title": "Software Engineer II (Backend Developer)", "Company": "Khoros India R&D Private Limited", "Experience": "2 - 4 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "ABOUT KHOROSKhoros, formerly known as Lithium + Spredfast, is the leading customer engagement platform providing Social Media Marketing, Care and Monitoring Solutions. Khoros Customer Engagement Platform is built to turn siloed knowledge into enterprise value, and customers into contributors. By connecting consumer insights across all departments, Khoros gives companies the ability to run their business with their customers, anticipating their needs and accelerating sales, loyalty, and innovation. With 2,000+ customers, including 52 of the Interbrand 100. Khoros has ten offices globally and powers approximately 500 million digital interactions every day. From social media to online communities and messaging to digital customer care, Khoros helps companies authentically connect with customers throughout their journey.ROLEWere looking to add a Software Engineer II to an already awesome engineering team. You will be responsible for building and maintaining multiple SaaS applications in the social media space. You will work in small, cross-functional teams and love delivering value to our customers through shipping code. We deploy as often as we can and would love you to deploy to production beginning day one.WHAT YOULL DO ? Develop and unit test high quality code to implement features and enhancements Perform code reviews and improve code quality Collaborate with the team, making sure deliverables areturned over on time and with high quality Exhibit end-to-end ownership of a feature/task/bug Ensure our systems are buzzing 24x7 and address customer issues effectivelyWHAT WE ARE LOOKING FOR ? A Graduate in Computer Science or equivalent degree 2+ years of experience in building applications using Java, Scala 2+ years of experience in open source technologies like ElasticSearch, Redis, MySQL etc. Problem solving skills and ability to convert product stories into high quality working code Experience of working in Github Experience with CI/CD pipelines like JenkinsWHAT WOULD ADD VALUE ? Knowledge of Kafka and related technologies. Knowledge of Docker and Kubernetes Knowledge of Ruby on RailsWHY SHOULD YOU JOIN OUR TEAM ?Awesome CulturePerformance DrivenFlexible Working hoursGreat BenefitsHealth, Dental & Visual insuranceGym AllowanceWell stocked PantryCommute and leave allowanceGenerous leave policyCompetitive CompensationAmong the best in industryAnnual bonusEqual employment opportunityOur employment practises ", "Role": "Testing Engineer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - ERP, CRM,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "Doctorate": "None", "Key Skills": ["Java", "Algorithms", "Data Structures", "Software Engineering", "MySQL", "Kafka", "Ruby"]}