{"Job Title": "Software Engineer  SharePoint Developer", "Company": "CGI Information Systems and Management consultants", "Experience": "2 - 4 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "  Relevant Exp Minimum 2yrs in SharePoint development (Good to have knowledge on PowerApps Power Automate)   Work independently under limited supervision and applies knowledge of subject matter in Applications Development.    Process sufficient knowledge and skills to effectively deal with issues, challenges within field of specialization to develop simple applications solutions.    Second level professional with direct impact on result and outcome.    Member will be responsible for migration of Workflows from 2010 to Power automate - this could mean supporting the business users to do the migration for the simple workflows themselves; for the medium workflows where the actions can be mapped they might have to use a customized tool to migrate it to Power automate and for the complex workflows they will have to manually migrate it.    Member Must be able to do POC and do the feasibility check based on the situation and client requirement wrt to Power automate or Power Apps.   Member must be able to suggest the best possible solution with respect to implementation so that the code is reusable by other teams for other WFs.   Must understand the do s and don ts within the Client environment and strictly adhere to them.   Member should have good knowledge on SharePoint 2010 to be able to understand the way the WFs are currently working and then migrate them.   Member must report to the team lead and update the progress of the work assigned on a daily basis.   Should be open to pick up challenges and work in agile environment    Should take ownership of the work assigned to them and be able to work with the team or independently.   Work as a team and elp other members if there are technical challenges.     Required Qualifications :     Candidate should have worked on development of SharePoint 2010 understands various features and functions of these O365 components.   Candidate should communicate well with client whenever required both written and oral    Candidate Should be able to understand the requirements and challenges around them and provide suggestions to overcome the issues flagged by the users or within the team.   The client is looking to migrate their 2010 Workflows (WF) to Power automate.    We are looking for candidates who have worked on SharePoint 2010 and can relate to the corresponding action to Power automate;    Should have Knowledge in Power automate and Power apps.     Skills:     .NET   C#   Microsoft Sharepoint   Microsoft Power Platform   Microsoft PowerApps   Communication (Oral/Written)  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Microsoft Sharepoint", "Agile", "Sharepoint development", "microsoft", "digital transformation", "Supervision"]}