{"Job Title": "Automotive Software Developer", "Company": "Cerence Inc.", "Experience": "2 - 6 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "   Principal Duties and Responsibilities:    We are looking for a strong and motivated software engineer. Your main responsibilities will be, however will not be limited to:    Analysis of costumer product requirements   Specification of dialogs in co-operation with the costumer   Dialog design and implementation for automotive applications   Implementation of dialog flows and logic in JavaScript, C/C++, Java and XML like language and recognition grammars in BNF   Test of dialog in development environment and on the actual infotainment system   Review and investigate issues in dialogs developed by peers   Partner closely with customers and Nuance team members to establish and maintain clear, concise communication through regular reporting, meeting participation, and follow-up   Contribute to advancing technologies and services by providing input and recommendations from project experiences       Education:   Bachelors or Graduate University degree in Electrical Engineering, Computer Engineering, Computer Science or equivalent      Required Skills:     software development experience, preferably for automotive and in connection with user interface technologies.   Experiences in programing (Java, C/C++, Javascript, XML)   Fluent in English both written and spoken   Experience with embedded system programming concepts, working with Android, Windows CE, Linux, VxWorks, or QNX.   Demonstrated ability to master new technologies and tools quickly   Strong team player and customer focus       Preferred Skills:      Experience with using source control tools like Perforce, Mercurial, Git.   Programming experience scripting languages Python and/or Perl   Experience with MS Visio    Ability to set-up and hardware equipment in support of software development tasks (i.e. configure software on target device, connect cabling/power suppliers, etc.)   Fluency in a second language (European or Asian languages preferred)   Experience following a software development process (e.g. Agile, Scrum)    ", "Role": "Software Developer,", "Industry Type": "Automobile, Auto Anciliary, Auto Components,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["VXWorks", "C++", "Linux", "XML", "System programming", "Javascript", "Perl", "Principal", "Android", "Python"]}