{"Job Title": "Senior Software Developer", "Company": "Hansen Technologies", "Experience": "3 - 5 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "      The Role              Reporting to Software Development Manager based in Pune as a Senior Software Engineer you will be responsible to develop our Customer Care and Billing product. You should have rich working experience in enterprise software industry as an experienced developer or technical lead. You need to be able to analyze requirement, design system behavior, complete programming, perform testing and future maintenance. Backgrounds in the Pay-Tv industry or business support systems are highly desirable.              How you will contribute            You will work within the Global Development Team to provide quality services to external managed service clients as well as internal business units. You may be required to participate in an on-call roster system to support our global offices and clients.          In this role you will be responsible to        Develop software solutions by studying information needs; studying systems flow, data usage and work processes; investigating problem areas; following the software development life cycle.         This job will offer you opportunities to        Work collaboratively with internal teams and various roles in Agile/Scrum methodology to meet delivery deadlines.           You will be involved in a range of activities including:           Lead design and develop new feature as well as maintain existing functionality.         Collaborate with architect on solution design and implementation.         Develop software solutions by studying information needs; studying systems flow, data usage and work processes; investigating problem areas; following the software development life cycle.         Document and demonstrate solutions by developing flowcharts, layouts and diagrams.         Improve development efficiency by conducting systems analysis and recommending changes in policies and procedures         Mentor junior and mid-level engineers by providing advice, coaching and guidance.              Our Ideal Person             Are you an experienced Senior Software Engineer who is ready for a new challenge or a Software Engineer ready to make your next career move, then as our ideal person you will have:          5 years development experience in commercial/enterprise business systems with Microsoft technologies. E.g. C# and .NET Framework.         3 years working experience as Technical Leader with excellent organizational and          leadership skills          Proficient at B/S application development and performance tuning.       Experience in web technology like WCF/Web Service/RESTful Service/WebAPI/HTML/JavaScript/ jQuery / Angular / React / Backbone / Knockout.       Experience working in a cloud environment and/or Software-as-a-Service.        Experience with Kafka, Elastic/Logstash/Kibana, Redis, PostgreSQL is a plus.       Thorough knowledge of unit test and test-driven development techniques       Experience in Agile/Scrum methodology and ability to work independently in a multi-cultural team environment.       Experience with professional software engineering best practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing and operations       Eagerness and willingness to learn new technologies    ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Performance tuning", "jQuery", "Data management", "Coding", "Postgresql", "Billing", "Software development life cycle", "Application development", "test driven development", "WCF"]}