{"Job Title": "Senior Software Engineer (Back-end) Developer", "Company": "DISPRZ", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Mumbai, Chennai", "Job Description": "Roles and ResponsibilitiesResponsibilities (not exhaustive)Build and ship reliable software practicing robust software design and in-depth code reviews.Build efficient, clean and reusable features / libraries / componentsAnalyse and optimize existing UI and Server-side code for security, efficiency and performance.Be a voice in ensuring the team stays true to the technical vision.Write clean, scalable code in Web-based programming languages and/or .NET Write SQL Stored ProceduresTest and deploy applications and systemsCollaborate with technical lead to produce software design and architectureTranslate designs and style guides provided by the UI/UX team into functional user interfaces, while ensuring cross-browser compatibility and performance. Unit-test the code across platforms and browsers, to ensure functional consistency of delivered output. Education / Skill SetEngineering / MCA degree from a top school with an excellent academic recordObject oriented programming knowledge is a must.Formal knowledge in below areas will be an added advantage.NET Core APIsAsp.net Web APISwagger Entity Framework Core/LINQ.DapperSQL DatabasesExperienceMinimum 5 years’ experience in back-end development of software products using Web-based technologiesExperience doing Full-stack development is a great plus", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "MCA in Computers", "Doctorate": "Doctorate Not Required", "Key Skills": [" swagger", " entity framework", " linq", " .net", " web api", "Senior software engineer", " full stack development", " dapper", " sql database"]}