{"Job Title": "Java Software Developer", "Company": "Dreamsol TeleSolutions Pvt. Ltd.", "Experience": "2 - 4 years", "Salary": "Not Disclosed", "Location": "morbi,amod", "Job Description": "   Skills Required:      Mandatory Technical Development Skill Set: Core Java, JSP Servlet, Spring, Spring boot, Hibernate, MVC Frameworks, Struts 2.0, AJAX, & Web services (Soap & Rest)     Good database knowledge of MySQL, MS SQL Server, Oracle RDBMS, SQL and PL/SQL     Knowledge/experience of any front-end technology like Angular or React is a plus     Experience working on different version controlling systems i.e. Github, SVN     Defining development standards for object-oriented practices, coding & testing patterns     Comfortable with UNIX/ Linux command line interface for deploying product on Linux Server and understanding of required Linux commands, preferable Ubuntu     Operating as a key member of a high performing Agile team; Scrum highly desired     Ability to convert business requirements into object-oriented design and code using Java/J2EE technologies     Develop optimized software code based on requirements and design specifications     Proficiency in programming, applying validations, perform unit testing (JUnit) of web applications and debugging/ fixing of defects reported in system/ acceptance testing     Assists in enforcement of development deadlines and schedules with the ability to multi-task, prioritize work load, and meet these milestones     Ability to work independently in a fast paced startup environment with dynamically changing requirements     Outstanding communication and documentation skills, detail oriented and go-getting attitude     Contribute to knowledge building and sharing within the team on business and technical domains  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Unix", "Hibernate", "Core Java", "MS SQL", "Linux", "JSP", "MySQL", "Struts", "MVC", "Ajax"]}