{"Job Title": "Sr Software Developer - Java", "Company": "MorgenTEC", "Experience": "3 - 5 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": "B.E / B.Tech / MCA in Computer Science or related stream 3-5 years \n\nRole and responsibilities \n\nDefines site objectives by analyzing user requirements; envisioning system features and functionality. \n\nDesigns and develops user interfaces to internet/intranet applications by setting expectations and features priorities throughout development life cycle; determining design methodologies and tool sets; completing programming using languages and software products; designing and conducting tests. \n\nRecommends system solutions by comparing advantages and disadvantages of custom development and purchase alternatives. \n\nIntegrates applications by designing database architecture and server scripting; studying and establishing connectivity with network systems, search engines, and information servers. \n\nCreates multimedia applications by using authoring tools. \n\nCompletes applications development by coordinating requirements, schedules, and activities; contributing to team meetings; troubleshooting development and production problems across multiple environments and operating platforms. \n\nSupports users by developing documentation and assistance tools. \n\nUpdates job knowledge by researching new internet/intranet technologies and software products; participating in educational opportunities; reading professional publications; maintaining personal networks; participating in professional organizations. \n\nEnhances organization reputation by accepting ownership for accomplishing new and different requests; exploring opportunities to add value to job accomplishments. \n\nDesired Skills \n\nGood knowledge of OOPS & Design Patterns Proficient in Core and Advance Java Must have strong experience in Spring framework Must have strong experience in Front end technologies including Ajax, jQuery etc. Should have sound experience on working with popular databases - mySQL, Mongo DB etc Must have knowledge of web security and risk / threat modelling and mitigation. Should have experience to work with cloud platforms e.g. AWS Should have knowledge of JSP / Servlets. Must have capable to manage mid-sized projects independently. Must have experience to develop web services Good to have experience in team and project management. Good knowledge of OWASP standards Must be willing to work at various levels & locations depending on the project requirement. Good communication and inter personal skills are necessary.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Computer science", "jQuery", "Front end", "Project management", "Intranet", "MySQL", "Web development", "OWASP", "Troubleshooting", "Ajax"]}