{"Job Title": "Senior Software Developer", "Company": "Cerence Inc.", "Experience": "4 - 7 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "   A Moving Experience.     Principal duties and responsibilities    Analysis of costumer product requirements   Specification of the application in cooperation with the costumer   Design and implementation of automotive applications   Develop Unit Tests on development environment and on the actual infotainment system   Review and investigate issues in code developed by peers   Partner closely with customers and other Cerence teams to establish and maintain clear, concise communication through regular reporting, meeting participation, and followup   Contribute to advancing technologies and services by providing input and recommendations from project experiences      Education  : Bachelors in Computer Science, Engineering, or equivalent      Minimum years of work experience  : 7 years of experience on market      Required skills  :      7 years software development experience, preferably for automotive and in connection with user interface technologies.   Experiences in programing (C/C++, Javascript, Python, Perl, XML)   Fluent in English both written and spoken   Demonstrated ability to master new technologies and tools quickly   Strong team player and customer focus       Preferred skills  :    Experience with using source control tools like Perforce, Mercurial, Git.   Experience with MS Visio    Ability to set-up and hardware equipment in support of software development tasks (i.e. configure software on target device, connect cabling/power suppliers, etc.)   Fluency in a second language (European or Asian languages preferred)   Experience following a software development process (e.g. Agile, Scrum)         ", "Role": "Software Developer,", "Industry Type": "Automobile, Auto Anciliary, Auto Components,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Infotainment", "C++", "GIT", "XML", "Javascript", "Perl", "Principal", "Automotive", "Python"]}