{"Job Title": "Senior Software Developer", "Company": "EXFO", "Experience": "4 - 9 years", "Salary": "₹ 5,50,000 - 15,50,000 P.A. ", "Location": "Pune", "Job Description": "Hiring C++ Professionals at various levels1 Title/Position  Senior Software Developer (C++ language) (5 to 10 years)As a part of the organization as a C++ Developer you will be responsible for development of one or multiple products thru Analyze, Design, development and maintaining quality standards for products of EXFOs service assurance group. You will also be responsible for efficiency gains of team and improving product quality so that minimizing customer feedbacks.What youll doInvolved in analysing requirements and gauging the complexity, efforts and volume of tasks.Actively involved in code & design reviews.Understand the design and implement as per best practices.Will be responsible for solving technical problems or issues faced by team members.Ensuring the quality of code base is maintained.Ensuring that necessary Automation, CI and CD pipelines are made available and maintained.Active participations in agile processes, identifying the process improvements and driving them.Work on latest & diverse set of technologies and domains Act as scrum team member and resolve impediments work as planned to achieve predictability.Works towards scrum team goal, not only towards individual goal.Be a motivated team member and think towards achieving end goal and not only finishing day to day task.Go getter attitude.What were looking forTechnical skillsWhat we’re looking for- Technical skills8+ years of Extensive C++ programming experience.Experienced in Agile development lifecycleTelecom domain is mandatory.Experience in protocol level work.Experienced in working on enterprise class applicationsStrong knowledge of services based (SOAP, REST) software architecturesExperienced in designing modularized code eg MicroservicesExtensive experience on Oracle DB and query optimizationsExtensive experience on working on OS like Linux and Windows.Known in completing the assigned tasks with minimum supervision with high quality and on time.Practiced and/or implemented agile development cycleDesirable to have Perl, JavaScript programming basics.Inclined towards working on problem2.  Software Developer (1 to 4 years) Technical skills (all essential skills)Excellent knowledge of SDLC,      test cycle and logical thinking on various complex use case call      scenarios.You      have extensive experience in C++/CGood knowledge of Telecom      Protocols and domain (2G, 3G, LTE, SIP, TCP/IP).Follows disciplined software development      practices.Worked on Agile scrum      methodologyYou are known in completing the      assigned tasks with minimum supervision with high quality and on time.You are known to rely on      instructions and pre-established guidelines to perform the functions of the      job. Competencies (preferred skills)Exposure to datacom domain. Meticulous and very organized.You will not hesitate to ask questions and call upon      the knowledge of your coworkers to make sure you   produce the      best possible documentation for our customers.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Sc in Any Specialization, B.Tech/B.E. in Any Specialization", "Doctorate": "None", "Key Skills": ["Software Development", "c++", "C", "Linux"]}