{"Job Title": "Compiler Verification , Software Developer", "Company": "NVIDIA", "Experience": "3 - 7 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "  What you ll be doing:      Analysis: Analyze performance degradation or functional defect of compilers, identify regression root cause, recommend corrective action, and perform reviews to continuously improve testing.      Test Automation: Automate compiler testing using NVIDIA test frameworks and by programming. Includes test execution, test reporting, results analysis and triage and automation of build and test environments. Work with software compiler developers and assist in providing automated solutions for unit testing.      Test Operations: Utilize test suites to find, report and track compiler performance changes. Work with development team to drive regressions to resolution. Generate statistics based on performance data, identify and investigate outliers and supervise performance trends. Maintain historical data and baselines for comparison.      Compiler Test Development: Develop and review test plans, implement test cases, automate tests, integrate tests into NVIDIA test management frameworks, port 3rd party testing, and author test reports. May include integrating already existing tests into the compiler test automation.      Process Improvement: Utilize current iterative planning and test development processes. Identify potential or observed weaknesses in current process, offer ideas for actions that can improve quality, and participate in quality initiatives.      What we need to see:      Bachelor s or Master s Degree or equivalent experience.      3+ years work experience in a software development or test organization.      Deep understanding of Software Development Process (SDLC), High-Performance Computing (HPC), and Software Testing Methodologies.      Compiler Domain Expertise: You should understand how compilers work and how compilers are implemented. Proven strength in problem solving and implement solutions.      Ability to work with various teams to generate a solution for performance regression and be productive under tight schedules, and have strong analytical skills with attention to detail.      You have experience writing test plans, test development, test automation, test execution and reporting in a production environment.      Programming Languages: Have experience programming and/or testing in C and/or C++ as well as scripting languages (Python, Perl, Shell)      Excellent communications skills, self-motivated and well organized.      Ways to stand out from the crowd:      3+ years experience testing production software. Preferably compiler or other system software.      Previous compiler development and/or compiler verification/test or performance analysis experience.      Experience with NVIDIA CUDA Toolkit, especially solving issues and debugging in Linux environment.      Knowledge of deep learning frameworks such as Caffe, TensorFlow, Theano and Torch, as well as many other deep learning applications will be a plus.      Experience with revision control software and management tools, such as Git, Perforce, JIRA, Confluence and Make.      Familiarity with statistical analysis tools for identifying and isolating out-of-bound behavior      We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.   ", "Role": "Software Developer,", "Industry Type": "Broadcasting,", "Functional Area": "IT Software - Embedded, EDA, VLSI, ASIC, Chip Design,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Software Developer", "Compiler Verification"]}