{"Job Title": "Senior Software Engineer/Developer (Manager)", "Company": "Southern Cross Group India Pvt Ltd", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Chennai( Tiruvanmiyur, Pallavaram, Rajakilpakkam, Perungudi )", "Job Description": "Roles And Responsibilities:Manage multiple projects. Be a single point of contact/ownership on the delivery of the projects Experience in designing and building database using MS SQL ServerProven experience as a .NET Developer or Application DeveloperExperience in ASP.NET framework, SQL Server and design/architectural patterns ( Eg Model-View-Controller (MVC))Knowledge of at least one of the .NET languages (e.g. C#, Visual Basic .NET) and      HTML5/CSS3Expertise in MVC  and entity framework, Preferable : Angular JS Node JS, C#, Coordinate with client and team members and ensure there are no gaps in understanding the requirements.Calibrate closely with client to establish release schedules and business requirements; estimate release schedules and monitor the progress of all aspects of the developmentUnderstand the functional and technical requirements of the application.Participate in design discussions.      Offer technical and functional suggestions for enhancing the application.Discuss with the client every day, work very closely with every team-member and set expectations.Ensure the client commitments are met on time with quality.Ensure there is positive working relationship between all the team members (including clients team).Gather requirements from client  regularly, divide the requirements into smaller tasks, assign to team members and track every day.Lead the SCRUM/SPRINT meetings every dayCreate Project Plans. Publish status reports. Keep track of the team effort and timesheets.Research, design and develop ASP.NET MVC application using the Best practices.Participate with team in designing conceptual model and working model and ensure consistency in architecture and design/ code practice.Develop Web based solution, Web Service/WCF and Dashboard solutions using Reporting and Business Intelligence (BI) tool and perform data operations in SQL server.Develop a cutting edge client interfacing web based systemConduct technical interviews.Update the reporting manager everyday on the progress of the project and client communication.Technical Skills:ASP.NET Web FormsASP.NET MVC.EXT.NETSQL Server DevelopmentAzure VMs and Azure servicesAngularJS, Angular 2+ and WebAPIJavaScriptC# and OOPsDeployment to IIS Desired Candidate Profile BS/MS degree in Computer Science, Engineering from reputed institutions.Must have had at least 7+ years of experience in developing .NET applications and then 3+ years of experience in team and project management.Must have managed a team of at least 10 members comprising of both Dev and QA resources.SCRUM expertise/certification.Excellent Communication skills and must be enthusiastic and must have positive attitude/outlook..Excellent Documentation skills.Ability to work under pressure.Ability to motivate, train and inspire the team members in accomplishing their goals. ", "Role": "Program Manager,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Senior Management", "UG": "M.Tech in Any Specialization", "Doctorate": "None", "Key Skills": ["Software Engineering", ".Net", "ASP.Net", "Scrum", "Agile Development"]}