{"Job Title": "Role Title Software Developer", "Company": "Myfundbucket", "Experience": "1 - 3 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": "JOB DESCRIPTION Role Title Software Developer Qualification Experience 1 +Years of experience Role Scope Develop cutting edge web- based applica-  tions and web-  site for e- commerce MS SQL technologies including SSRS and SSIS. Solid background in design and program-  ming. Knowledge of UML and modern software engineering practices. Exten-  sive experience in design and development o f applications using ASP.NET MVC,  Web Form s,  C#,  SQL,  Entity Framework,  Web Service,  Li nQ and Web technologies like jQuery,  CSS,  Aj ax,  JavaScript and HTML About MyFundBucket (MFB) MFB is a digital platform for all the banking and financial services. At MFB we match people looking for suitable loans and offers with Money lending Institutes providing loans at best interest rate. It s easy to get loan with MFB: set up an account,  upload your documents and apply for loans. MyFundBucket is a platform where user can apply,  compare and get best interest rates on loan. The whole process from collecting documents to getting loan sanctioned is electronic/ online,  so user can apply Loan on Fingertips . Key Deliverables Microsoft .NET 3.5+ development using C# Core Microsoft .Net technologies including Web Services,  WCF,  MVC Object Oriented Design programming SQL Server (2008 above) Critical Competencies for Success Superior creativity and innovative problem-  solving skills Good communications and interpersonal skills Passionate about building high- quality/ high Educational Qualification B.E.,  B.Tech,  ME,  M.Tech,  MCA in Computer Science or related field from IIT,  DCE/ DIT,  NIT,  BITS or other reputed institution. Other Mandatory Requirement Certifications (If Any) Travel Required -  As per business needs Email your resume to: info@ myfundbucket.com ", "Role": "Software Developer,", "Industry Type": "Media, Entertainment, Internet,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["c#", "server", "development", "software", "SSRS", "HTML", "mca", "it", "SSIS", "microsoft", "sql", "MS SQL", "jQuery", "UML", "web", "design", "asp.net", "Javascript", ".net", "developer", "WCF", "MVC", "programming", "applications"]}