{"Job Title": "Software Development Engineer", "Company": "RGF Professional Recruitment", "Experience": "2 - 7 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "       Job description       Role   Ensure adoption of best quality testing practices for cloud-native applications with principles of 12-factor applications adhered to.   Develop and execute test automation.   Understands automated test suites with code, front end GUI automation, service layer testing as it applies to the environment, and test data usage.   Comprehends user stories to understand task items per story in the context of all levels of testing (unit, functional, integration, and regression).   This position will be responsible for driving best practices around Quality, Functional testing, Exploratory testing, and adoption of Development services (Development Collaboration, Continuous Integration, and Delivery, etc.), acceptance test automation, quality gating reviews for promotion of software, and continuous integration.      Requirements    Domain knowledge in Core Payments specifically around Knowledge in testing real-time transactions-preferably Authorization, Clearing, and Reconciliation systems.   Experience in System and Integration testing.   Experience testing across a variety of platforms: web and mobile user interface, APIs (REST and SOAP), microservices, cloud-native.   Hands-on experience in Groovy scripting.   Experience in working in Agile Methodology.   Security Testing Tool like Fortify, Checkmarks, etc.   Exposure in building and using automation frameworks using technologies: Java, JUnit, JBehave, Soap UIPro, REST, JSON, and XML.   Ability to create good acceptance and integration test automation scripts and integrate with Continuous integration (JenkinsBamboo) and code coverage tools (Sonar, Clover) to ensure 80% or higher code coverage.   Experience in DevOps in a large enterprise environment and the ability to implement cloud-based practices. (Preferred)   Experience in working with other developers to ensure that systems are designed for reliability, performance, and testability. (Preferred)                       ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Front end", "ISO", "XML", "Functional testing", "Integration testing", "Security testing", "JSON", "software quality", "Financial services", "Recruitment"]}