{"Job Title": "Software Developer - .Net/Angular/WebApi/SQL", "Company": "PMAM IT Services Pvt Ltd. (PMAM Corp),", "Experience": "4 - 8 years", "Salary": "₹ 5,00,000 - 9,50,000 P.A. ", "Location": "Mumbai", "Job Description": " Job Title: Software DeveloperExp. Level: 4+ yrs.Work timing - 1 to 10 pmWork location: Mumbai, AndheriPMAM Corporation, a Dallas based company celebrating 21 years of success in technology is currently seeking a Technology Specialist for one of its most reputed product.The responsibilities of this position will primarily be focused on developing complex modules for HCM solution in asp.net C#, JQuery, Web API, CSS3 and SQLJob Description:Must Have: Strong knowledge in asp.net C#, JQuery, Web API, CSS3 and SQL.Good to Have: Knowledge of angular, .net core and Bootstrap 4 is added advantage.Experience on 2+ running projects based asp.net C#, Web API, CSS3.Manage ongoing maintenance, support and enhancement project(s) in existing systems, including researching new technologies/components when necessary.Provides clear communication into Code-line, work updates & documentationsTakes initiative to complete critical tasks, especially in team settings with dependencies on other people.Excellent analytical and debugging skills.Understanding of Agile/Scrum methodologies.Should be able to work independently with minimal supervision.Qualifications:Formal education level: Bachelor's DegreeMinimum 4+ years of Software Development experienceDemonstrated experience implementing new technologies.Experience working with Microsoft Suite projects, specifically Microsoft Project.Share your resumes on hr@pmam.com if you are interested in this opportunity. We are looking for candidates with shorter notice period, please apply if you can join us within 30 days.", "Role": "System Analyst,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "Doctorate": "None", "Key Skills": ["css", "consultant", "apt.net C#", "software engineer", "system analyst", "web api", "software developer", "software programmer", "jquery", "javascript", "sql"]}