{"Job Title": "Technical Software Developer", "Company": "nhance Consulting Engineers Pvt Ltd", "Experience": "1 - 5 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "      Job Description:     You will be part of a European and India based team that is developing Civil Engineering software tools. You will be initially working to develop neutral framework to transfer FEA data between established products. Our team is working as part of cloud-based open BIM platform for all the disciplines to collaborate in building projects.      Desired Profile:   We are looking for a candidate who has hands-on experience in developing solutionstools for Engineering softwares. You are expected to have good experience and knowledge of FEM software. The role is suitable for someone who is a quick learner, can work independently with little supervision, is able to manage other teams (internal and external) and keen to solve challenging problems. The candidate should be a good communicator and be comfortable to take ownership of work.   A suitable candidate should have:     Experience in developing engineer software using C++C#.    Knowledge of FEM softwares and ability to quickly learn different analysis systems.    Communication Skills to work and interact with distributed development team.    Some experience in Python and understanding of web development.           Key responsibilities:       You will be responsible for build, maintain and improve the platform and supporting tools.    Work closely with the business team and other developers to ensure high quality.    Write robust code and perform appropriate testing to ensure quality.    Work in line with time estimates and track progress as per the team practices.    Document software changes as per the team processes.    Flag opportunities for continuous improvement    Work as an effective team member and improve team's knowledge base                ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Selection process", "C++", "Coding", "Bim", "Web development", "Programming", "Continuous improvement", "Civil engineering", "Python", "Software engineering"]}