{"Job Title": "Senior Software Developer", "Company": "Tvarit GmbH", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": " Senior Software Engineer will develop information systems by studying operations; designing, developing and installing software solutions; support and develop software team.    The Senior Software Engineer will lead a team of developers responsible for building new and support existing websites.   Ability to prioritize well, communicate clearly, have a consistent track record of delivery and excellent software engineering skills.    Creative engineering balanced with high quality and a customer focus.    Must be able to work across multiple facets of the project and juggle multiple responsibilities at the same time.    Strong analytic capability and the ability to create innovative solutions.    We are looking for a highly motivated individual who is looking to grow their career in a fast-paced environment.  Key Responsibilities:    Develop high-quality software design and architecture solutions by studying information needs; conferring with users; studying systems flow, data usage and work processes; investigating problem areas; following the software development lifecycle     Determine operational feasibility by evaluating analysis, problem definition, requirements, solution development and proposed solutions     Document and demonstrate solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code     Prepare and install solutions by determining and designing system specifications, standards and programming     Improve operations by conducting systems analysis; recommending changes in policies and procedures     Update job knowledge by studying state-of-the-art development tools, programming techniques and computing equipment; participating in educational opportunities; reading professional publications; maintaining personal networks; participating in professional organizations     Protect operations by keeping information confidential     Provide information by collecting, analyzing and summarizing development and service issues     Accomplish engineering and organization mission by completing related results as needed     Support and develop software engineers by providing advice, coaching and educational opportunities and mentor junior and mid-level engineers     Collaborate with team to brainstorm and create new products     Grow engineering teams by interviewing, recruiting and hiring     Make informed decisions quickly and taking ownership of services and applications at scaleBe a persistent, creative problem -solver     Remain cool and effective in a crisis     Stay on the leading edge of development practices     Passionate about great technologies, especially open source     Understand business needs and know how to create the tools to manage them   Your Background:    Proven experience as a Senior Software Engineer     5+ years of experience as a software engineer     Extensive experience in software development, scripting and project management     Experience coding, testing and documenting including all front end functionality and templates and modules using contributed modules and developing custom modules as needed     Experience working in an agile environment     Experience building complex web systems that have been successfully delivered to customers     Experience in communicating with users, other technical teams and management to collect requirements, identify tasks, provide estimates and meet production deadlines     Experience with mission critical, 24x7 systems     Experience implementing and consuming large scale web services     Experience with professional software engineering best practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing and operations     Eagerness and willingness to learn new technologies     Be very comfortable with SOAP (XML) and RESTful interfaces (JSON), both for creating outgoing responses and incoming consumption of data from external sources     Computer Science degree preferred   Must Have:    Fluent with functional, imperative and object- oriented languages; knowledge of Python     In-depth knowledge of relational databases (e.g., PostgreSQL, MySQL) and NoSQL databases (e.g., MongoDB)     Having knowledge of Apache, NGINX, SOLR, Redis, shell scripting, and on a variety of platforms, including Unix/Linux, in physical, virtualized and cloud (Amazon/AWS) environments     Experience with cloud message APIs and usage of push notifications     Experienced with deploying applications on Docker, Kubernetes.     Experienced with cloud services like AWS, Azure.   Good to Have:    Knowledge about Service Oriented Architecture (SOA) patterns, automating business process models, API enabled gateway and multi/hybrid cloud-based services, Golang     Knowledge of Big Data technologies  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Product management", "Linux", "Postgresql", "MySQL", "Agile", "Application development", "Unit testing", "Apache", "Open source", "Python"]}