{"Job Title": "Senior Software Developer - Fullstack", "Company": "GILBARCO VEEDER ROOT INDIA PRIVATE LIMITED", "Experience": "5 - 8 years", "Salary": "₹ 8,00,000 - 12,00,000 P.A. ", "Location": "Mumbai", "Job Description": "Location: MumbaiPurpose of Position: Solving difficult problems with elegant and practical code Help define best practices and be a champion for delivering quality resultsKey Responsibilities: Work with other developers, actively participating in PRTI, design reviews, process modeling, and mentoring. Demonstrate and apply principled software engineering practices Be versatile and passionate about tackling new problems and learning new technologies Interested in applying Full-stack Cloud-based development skills Leveraging the latest cloud tools Adopt to our agile development strategies and thrive in a fast-paced environment Collaborate with peers inter-department and cross-functionally to produce game changing solutionsRelationships Interaction with Global teamEducation & Experience: The ideal candidate will have Graduation/ Degree: Qualification: BE/ B.Tech/ Computer science/ IT Graduate Experience of 5  8 yearsBackground and Skills: The ideal candidate will have Experience developing complex B2B or B2C web applications Familiar with Java, C#, Python or other object-oriented programming language Passion to become an expert in our technology stack: Java, Spring Framework, AWSSkillset UI skills on ReactJS and GWT or Angular, but preference will be ReactJS. Full stack senior developer with strong Java/J2EE development experience (desired with cloud experience) Experience in development of SaaS (Software as a Service) enabled multi-tenant application using Springand Hibernate Framework. Experience in UI technologies like JavaScript, ReactJS, GWT, Angular, JSP etc.. Experience in SQL in Oracle, MySQL and other RDBMS. Experience working in fast paced Agile SCRUM based product development and support. Has worked on AWS cloud technologies like RDS, SES, S3 etc.., Web services (REST, SOAP) Experience in XML related technologies such as JAXB, SAX, DOMWOMEN CANDIDATES ARE ENCOURAGED TO APPLY", "Role": "Technical Architect,", "Industry Type": "Oil and Gas, Energy, Power, Infrastructure,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Hibernate", "J2ee", "React.Js", "fullstack"]}