{"Job Title": "Senior Software Developer - II - Python", "Company": "Josh Technology Group", "Experience": "4 - 7 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": " We are on the lookout for a technology expert who can lead the development of game changing technical solutions and assist in technical designs and architectures. You should be keen to serve as a role model and strive to mentor your team members.     Qualifications:      B.EB.Tech in CSITECE or M.C.A from a reputed college.    4-7 years of Software Developer experience.      Roles Responsibility:       Develop high-quality, maintainable, usable, and well-documented solutions to complex product functionality; ensures that all the modules are being implemented as per the best practices, extensible scalable design, and without any defects.    Identify the technical gaps in product requirements and lead a constructive discussion with all stakeholders to resolve the same.    Identify more optimal efficient scalable maintainable ways of implementing product modules discusses the same with product team to get them incorporated.    Troubleshoot applications and do performance analysis of the application.    Participate contribute in project level architecture design discussions, own project level design (post finalization of architecture technologies) and end to end implementation including testing performance deployments.    Work closely with other Developers, Leads Business Stakeholders to rapidly build, iterate, test and deploy new features and products and maintain a high-quality robust codebase.    Mentor team members, and help to build a high performance fast-growing team.    Lead and organize meetings that include all stakeholders at the project level, manage expectations clearly communicate overall project goals and success metrics.    Lead implementations with a complete sense of ownership and accountability.    Identify various bottlenecks in the project resolves the same as appropriate via automation, process changes, introducing best practices etc.    Effectively communicate one-on-one with on-shore off-shore product teams developers; gather and clarify requirements from technical folks product managers business teams.    Proactively assist and serve as a role model for the team members to follow the team software development process; consistently innovate the team processes to improve team productivity and quality.    Strong Analytical, Problem Solving Skills and participates in all activities with urgency, a results orientation, and a strong work ethic.    Must have expert level technical knowledge of Python-Django.    Strong experience with relational (PostgreSQL, MySQL) andor NoSQL databases.    Strong experience with unit testing and test-driven development.    Experience working with LinuxUnix Operating system comfortable with command line.    Knowledge of Angular or React would be an added advantage.    Experience with modern software engineering workflows and tools (e.g. Agile, JIRA, Git, CICD, Amazon Web Services, ELK, APM).    Experience in all areas of SDLC, including architecture and design, development, and testing.   Excellent understanding of feature estimation and ability to communicate issues and risks that may impact timelines, budget, or resources.   Experience with Agile development lifecycle,   Experienced in effectively leading remotehybrid teams.   Extremely passionate about code reviews, engineering best practices and mentoring coaching the developers to make them successful.   Ability to incorporate new technologies as required.   Excellent understanding of feature estimation and ability to communicate issues and risks that may impact timelines, budget, or resources.      How will you grow here:      Work in multiple projects teams spread across different domains and technologies.   Work interact directly with senior directors in an open and flat hierarchical structure.   You can own all aspects of leading software products and projects.   You get to work with top-notch engineers and leaders with decades of experience in building and delivering great software.   Work with CXOs Senior Directors of various emergent companies in US India.   Get involved with the newest products, latest technologies and different methodologies.   Opportunity to Mentor the Best and Get Mentored by the Best.   ", "Role": "Software Developer,", "Industry Type": "Other,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial", "PG": "MCA in Computers", "Doctorate": "None", "Key Skills": ["Automation", "Linux", "Postgresql", "MySQL", "HTML", "Unit testing", "JIRA", "Gaming", "SDLC", "Python"]}