{"Job Title": "Software Development Engineer", "Company": "Frontdoor", "Experience": "7 - 12 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "  Job Responsibilities     Develop a flexible and structured front end architecture designs     Create reusable components, web-based user interface, and front-end libraries for the above.     Own and drive design and implementation of major UI components, including ones that impact multiple platforms and products.     Create and automate unit level testing for your components.     Create and own any and all documentation for your components     Partner with the Product Managers, Software Dev Managers and other engineering teams to define product architecture, design and implementation     Accept and give meaningful feedback on UI designs     Participate in the requirement gathering, technical specification and design of other enterprise UI initiatives.     Debug production issues and create subsequent mitigation plans.     Preemptively find potential issues and bottlenecks and continuously improve the system     Help define and improve systems and processes followed by the team     Set standards by translating designs and wireframes to high quality, well documented code and groom junior team members to do the same     Help influence and shape the team's culture and mentor junior team members     When a problem is encountered, your first thought isn t just how can I fix it but how can I fix it AND make sure something like this never happens again .     Basic Qualifications     Bachelor's degree in Computer Science or similar     5+ years of experience in frontend development with React, JavaScript, CSS, HTML5, MobX, Redux etc     Code versioning tools, such as Git.     Experience working in an Agile or Continuous Integration/Delivery environment     Ability to understand design and deliver UI components independently     Strong written and verbal communication skills     Preferred Qualifications     Master s degree in Computer Science or similar     7+ years of professional software development experience.     Experience developing, designing, implementing, and using React, Angular or similar     Understand cross-browser and cross-platform compatibility issues and how to resolve them     Experience working with and creating complex flowcharts, UML/Sequence diagrams wireframes and other design tools.     Experience working in fast paced, high growth environments     Passion for great customer experience and usability     Experience working with cross functional teams beyond Engineering teams     Experience with full project life cycles from concept to productization.  ", "Role": "Software Developer,", "Industry Type": "Consumer Electronics, Appliances, Durables,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Computer vision", "Front end", "GIT", "Appliances", "UML", "Machine learning", "Javascript", "Agile", "Customer experience"]}