{"Job Title": "Software Developer ", "Company": "Smart Business & IT Solutions", "Experience": "1 - 3 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": "                         WHAT ARE WE LOOKING FOR                                                                   We are looking for an enthusiastic and motivated Fresher - Software Developers to be part of our fast-growing team and should be very clear with the programming fundamentals from the academics and be able to write logic in any programming language.                                                                                                                Candidates must be able to write clean code, develop a neat User Interface, adhere to best practices, be process oriented and above all, do a good job at documenting the work done.                                                                                                                                                                                                             KEY SKILLS                 Should be clear with all the OOPS concepts and be able to demonstrate proficiency in the same                     Should have good analytical ability                                     Familiar with any programming language IDE - Visual Studio, Eclipse, PyCharm etc.                                                     Candidates should be flexible to work across technology stacks.                                                                   Preference will be given to candidates with working knowledge of any of the following:                                                                                       ASP.NetC#MVC                                                                                                   PythonDJango                                                                                                                   front end frameworks like - Vue.js, angular or ReactJS                                                                                                                                            Requirements      EXPERIENCE REQUIRED FOR THIS ROLE                                                                                                                                                                          Hands-on with coding in any programming language         Familiarity with Git and JIRA                                                                                                                                                                                                     Usage of Source Control with branch per task methodology                                                                                                                                                                                                                  Should have hands-on development experience at least in the final year project in academics                                                                                                                                                                                                                                      KEY RESPONSIBILITIES                 Take on development of key modules in the application                      You will be responsible for your day-to-day development tasks across the Software Development Life Cycle assigned to you.                                      Code review on a regular basis and ensuring code quality and adherence to company coding standards.                                                      DESIRED PERSONALITY TRAITS                                                                          Should be flexible to work in any programming language                                                                                    Be able to stay focused towards project goals             Have a passion for creating great software and solving difficult problems; you live for it                     Responsible for and take ownership of assigned development tasks                                     Accept the challenge and rapid growth potential of a fast-paced environment                                                       Fluent and proactive communicator, both verbal and written                                                                       Possess a positive attitude towards work, responsibilities and others                                                                                       Use time effectively and bring a strong work ethic                                                                                                                                                                                                  Detailed oriented and self-directed            PREFERRED EDUCATIONAL BACKGROUND FOR THIS ROLE                                                                                                                                   Bachelor's or master s degree in Information TechnologyComputer Science        OR equivalent industry exposure           ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["SAN", "Front end", "Coding", "SOC", "Windows", "microsoft", "Information technology", "CRM", "Android", "Python"]}