{"Job Title": "Sr Software Development Engineer  ADC", "Company": "Pulse Secure LLC", "Experience": "6 - 11 years", "Salary": "Not Disclosed", "Location": "Bnagalore,Karnataka,India", "Job Description": "        The Team                Our engineering team is at the core of our products with the mission of providing Secure Access. Our solutions, suites and SaaS platform uniquely integrate cloud, mobile, application and network access to enable hybrid IT. We are continuously innovating challenging the way we, and the industry, think about Secure Access. Our engineers are working and build products to solve complex problems in the Zero Trust World.                 The ADC team at Ivanti produces an industry leading ADC solution for virtual and cloud environments. More than just a software load balancer, Pulse virtual Application Delivery Controller drives more transactions, even at peak load conditions, ensuring continuous uptime and realtime security monitoring of application traffic.                  We are currently expanding the ADC engineering team by recruiting an additional crossdisciplinary scrum team in Bengaluru. This new team will work alongside teams in the UK on the future development of our ADC product range.                  Your Impact               Empower users to seamlessly and securely connect from any place in the world that offers air, water and Internet!             Equip organizations with the right tools to configure access, manage and enforce compliance with a holistic view on network, users and usage.             Empower organizations to continue to breathe easy, now with an added sense of invincibility.             Work really hard so that you can focus on the things you want to!               Your Career               Use C (mandatory) / Python as your primary tool along with your knowledge of Linux, Networking and Security             Write scalable Linux system programs, understand how to do performance analysis and tuning             Bring onboard strong TCP/IP, networking or Web protocol experiences              Previous experience in the Application Delivery Controller or Load Balancing domain a distinct advantage.              Develop scalable, distributed, stateless containerized network functions             Not hesitate in trying your hands at some OS level programming             Always stand up to the challenges your software may present to the not so amused customer, be the light in the tunnel, not just at the end of it             Influence your peers, your stakeholders to design a top-notch solution for every problem space you put your hands on             Overall, be the user that eagerly looks forward to living the experience that you have created, day after day               Your Experience                B.E. / B.Tech / M.E. / M.Tech in Computer Science.               Strong programming knowledge and   6 years   of experience using C, C [Mandatory] / Python [Desired]             Hands on engineering in Networking or Security products, protocols.             Hands on system level programming in Linux             Programming experience with Perl and / or Javascript is a plus.             Good understanding of authentication protocols such as SAML, AD.             Programming experience using RestAPI             Good Understanding of micro-service-based architecture.             Good understanding of Kubernetes clustering and cloud technologies is a plus             Strong understanding of hypervisor and virtualization technologies like VMWare, KVM, Xen, Hyper-V             Good understanding of distributed system design concepts             In depth understanding of containerization (Docker, LXC) technologies             Excellent verbal and written communication and collaboration skills             Experience working in an Agile environment and working with a geographically distributed team             Proven ability to be productive and flexible in a fast-moving, geographic-diverse environment        ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial", "PG": "M.Tech in Electronics/Telecommunication", "Doctorate": "None", "Key Skills": ["VMware", "Linux", "Networking", "Cloud", "ITSM", "Javascript", "Programming", "Perl", "Virtualization", "Python"]}