{"Job Title": "Sr. PLSQL Software Developer", "Company": "Agreeya", "Experience": "5 - 8 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": "       Job purpose         As a Senior Engineer - Software Development, you will develop new product features/modules using best practices and provide maintenance to the existing systems. All our products are solutions for the airline, transport and travel industry using different technologies.          What you will do         Duties and responsibilities                   What do you need to know         Knowledge and qualification        Translate processes and enhancement specifications into programs        Develop and refine error-free code within agreed timescales using development techniques, tools, methods and languages with the aim of optimizing operational efficiency.       Evaluate changes and perform impact analysis       Work with functional staff to establish and clarify requirements        Investigate reported faults in operational code to determine changes and approaches to the code for promotion and replacement, conforming to established procedures.       Design and prepare unit testing plan strategies and write test scripts to validate all new software development and enhancements.       Take ownership of the test and implementation phases of projects       Prepares comprehensive documentation and ensures timely completion of assigned work       Participate in code review       Troubleshooting technical issues       Develop and enhance Packages, Procedures, Functions, Triggers, Views with strong expertise in Pl/SQL Programming         5-8 years experience in software development       Experience in understanding functional requirements       Proficiency in Software Development Life Cycle       Excellent debugging, analytical and problem-solving skills     Expertise in developing complex Stored Procedures, Functions, Packages     Ability to document requirements and specifications       3 years of hands on experience in Relational database concepts, relational logical modeling, best practices, and physical design.       Robust knowledge of performance tuning       Strong data analysis and design skills       Should have worked in complex Oracle platforms involving optimization     Strong problem solving and analytical skills   Ability to analyze information in complex way, with accuracy and attention to detail   Good questioning skills and able to explain technical information in a clear way   Good team-working and interpersonal skills   Degree in software engineering   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Performance tuning", "Data analysis", "Test scripts", "Debugging", "Stored procedures", "Unit testing", "Troubleshooting", "Oracle", "Operations", "Physical design"]}