{"Job Title": "Senior Software Developer (Amazon Web Services -AWS)", "Company": "Cyient Limited", "Experience": "4 - 8 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "  Job Description     We are looking for a highly skilled Full Stack Developer comfortable with both front-end back-end web development. The successful candidate   is responsible for designing, developing and troubleshooting high performance and high availability applications to meet the company s strategic objectives. Were looking for a professional who brings along fresh ideas from all areas, including large-scale system design, new age data architecture, cloud platforms, APIs, artificial intelligence, UI design etc.         Responsibilities       Developing front end website architecture    Designing user interactions on web pages    Developing back end website applications    Creating servers and databases for functionality    Ensuring responsiveness of applications though optimization for performance scalability    Seeing through a project from conception to finished product    Designing and developing APIs    Ensuring cross-platform optimization for mobile phones    Staying abreast of developments in web applications and programming languages    Collaborate with other team members stakeholders         Requirements       Highly flexibe to work across architecture - building both front end and backend    Proficiency with fundamental front end languages such as HTML, CSS and JavaScript    Proficiency with JavaScript frameworks like Angular JS, React and Amber    Proficiency with web server technologies like Node.js, J2EE, Apache, Nginx, ISS    Proficiency with server-side language of choice like: Express.js, Ruby on Rails, CakePHP    Proficiency with server side languages like Python, Ruby, Java, PHP and .Net    Proficiency with database technology like PostgreSQL, MySQL, Oracle and MongoDB    3+ years of relevant work experience    Strong organizational and project management skills    A sense of ownership pride in your performance its impact on the company s success    Critical thinker problem-solving skills    Preffered team player with great interpersonal communication skills        Skills Experience      Amazon Web Services (AWS), AngularJS, Node.js, Structured Query Language (SQL)   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["MySQL", "Javascript", "PHP", "J2Ee", "HTML", "Oracle", "Apache", "Troubleshooting", "SQL", "Python"]}