{"Job Title": "Software Developer", "Company": "CodeFire Technologies Pvt. Ltd.", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Noida", "Job Description": "Software Developer(PHP/MySQL) ,  Experience Required(2- 5 Years),  Total Opening ( 5 ) Job Description CodeFire Technologies is hiring experienced,  talented and energetic minds in PHP Kindly find the following details Candidate Designation:Software Developer (PHP/MySQL) Job Description: Good Knowledge of Core php and any framework like cakephp/Magento/yii/Laravel,  ajax, jquery etc Job Location: Noida Candidate Profile: Candidate should be B. Tech/ B. E./ MCA with good academic record having 2- 5 year experience . Good analytical/ logical skills. No. of Vacancies -  5 Only those candidates need to apply who want to work on challenging projects and are very serious for their growth and career. Candidate Profile: Candidate should be B. Tech/ B. E./ MCA with good academic record having 2- 5 year experience . Good analytical/ logical skills. Responsibilities 1. Write \"clean\",  well designed code 2. Produce detailed specifications 3. Troubleshoot,  test and maintain the core product software and databases to ensure strong optimization and functionality 4. Contribute in all phases of the development lifecycle 5. Follow industry best practices 6. Develop and deploy new features to facilitate related procedures and tools if necessary Requirements 1. Proven software development experience in PHP 2. Understanding of open source projects. 3. Demonstrable knowledge of web technologies including cakephp/Magento/yii/Laravel,  HTML,  CSS,  Javascript,  AJAX etc 4. Good knowledge of relational databases,  version control tools and of developing web services 5. Experience in common third- party APIs (Google,  Facebook,  Ebay etc) 6. Passion for best design and coding practices and a desire to develop new bold ideas Only those candidates need to apply who want to work on challenging projects and are very serious for their growth and career. Interested candidate can send their resume at hr@codefire.in along with current CTC,  expected CTC,  notice period required. Apply Now Web & Graphics Designer,  Experience Required (1- 2 Years),  Total Opening ( 1 ) Junior Software Developer (PHP/iPhone/Testing/Android ),  (Fresher: B.Tech/MCA) Total Opening (3) Fun at Work Interested to Join Us Send your resume at hr@codefire.in or POST YOUR RESUME Join CodeFire For exploring career options with us: CodeFire Technologies Pvt. Ltd. +91- 120- 4232295 hr@codefire.in H 218,  First Floor. Sector 63,  Noida,  India Project Inquiry Want to discuss your idea or project with us: CodeFire Technologies Pvt. Ltd. +1 (530) 377- 0678 (US) +91- 704.220.3446 (INDIA) info@codefire.in H 218,  First Floor. Sector 63,  Noida,  India Project Inquiry Join Us Copyright 2010- 2017 CodeFire Technologies Pvt Ltd. All rights reserved. Scroll To Top", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["iPhone", "development", "code", "software", "developing", "HTML", "mca", "graphics", "tools", "Android", "jQuery", "Coding", "web", "optimization", "MySQL", "design", "Javascript", "php", "CakePHP", "developer", "Open source", "Ajax"]}