{"Job Title": "Sr. / Jr. Software Developers", "Company": "Practice Guru.", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Jaipur", "Job Description": "Position:  Sr.  /  Jr.  Software Developers Job Location  Jaipur Job Description  Practice Guru team is looking for Software Engineers to be a part of a dynamic team working on building a scalable e- commerce platform using the latest web technologies.  Your work will matter:  your efforts will be readily seen by millions of users.  \n\nYou will be involved in all phases of development:  architecture design,  prototyping,  implementation testing,  analysis documentation,  deployment support.  Flexibility and collaboration,  coupled with strong object- oriented design software development skills are keys to success in this position.  \n\nEssential Duties Responsibilities:   Take the product/ feature idea from conceptualization phase to delivery with all the relevant high quality artifacts during the cycle.  Follow best practices in Software Engineering.   Strive for excellence.   Deliver high quality,  elegantly designed,  maintainable,  well- tested,  well documented,  code.  Be up- to- date with technology developments and be a valuable member.  Innovate.    Required Skills,  Education Experience  Strong OOPS and OOD Fundamentals.   Excellent Coding,  Problem Solving Skills,  algorithms and data structures.  Knowledge of My SQL database or any other RDBMS with good understanding of SQL language,  DOTNet Prior experience in web technologies is a plus  Ability to work on UNIX /  Linux platform 7  Should have a BE /  BTech /  ME /  MTech in Computer Engineering or related areas including MCA with 3- 8 years of experience in software development.  Good Communication Interpersonal Skills.    Experience with any of the following skills is a plus:  \n\nFull software life cycle experience including requirements,  design,  development,  testing maintenance.  UI Development Skills including knowledge of JavaScript (AJAX) ,  HTML,  CSS Web service development experience Photoshop Skills XML X Query.  \n\nAndroid based applications developer is also one key position we are looking for.  Salary /  Compensation  Best according to industry standards.   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["Unix", "Software Developer", "Linux", "XML", "Javascript", "Data structures", "HTML", "Photoshop", "Ajax", "Android"]}