{"Job Title": "Senior Software Developer", "Company": "Tower Research", "Experience": "5 - 8 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": "The Senior Software Developer will be responsible for: \n\nDesigning and implementing a high- frequency trading platform,  which includes collecting quotes and trades from and disseminating orders to exchanges around the world\nOptimizing this platform by using network and systems programming,  as well as other advanced techniques to minimize latency\nDeveloping systems that provide easy access to historical market data and trading simulations\nCreating tools to analyze data for patterns\nBuilding risk- management and performance- tracking tools\nShaping the future of the Core Engineering team through regular interviewing and infrequent campus recruiting tripsThe ideal candidate will have: \n\n5 years of experience in data structures,  algorithms,  and object- oriented programming in C \nA degree in computer science\nBrilliant problem- solving abilities\nThe ability to manage multiple tasks in a fast- paced environment\nStrong communication skills in English\nWorking knowledge of Linux\nKnowledge of any other development language,  including Java,  Python,  or Perl and shell scripts  (a plus) Financial experience is not required.\n\nBenefits Tower continues to enhance the in- house trading system and strategies that have positioned the firm as a leader in the thriving field of quantitative trading. While Tower offers challenges and rewards rivaling those of any Wall Street firm,  Towers cubicle- free workplace,  jeans- clad workforce,  and well- stocked kitchens reflect the premium the firm places on quality of life. Benefits include: \n\nCompetitive salary\nFive weeks of paid vacation per year\nLunch and dinner on a daily basis\nCab facility within Gurgaon\nHealth club allowancesTower Research Capital India Pvt. Ltd. is an equal opportunity employer.", "Role": "Software Developer,", "Industry Type": "Banking, Financial Services, Broking,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["risk management", "health club", "development", "java", "linux", "english", "tracking", "rewards"]}