{"Job Title": "Senior Software Development Engineer ", "Company": "AFour Technologies Pvt Ltd", "Experience": "5 - 7 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "    Technical Skills and Competencies        Strong proficiency in JavaScript, HTML5, including DOM manipulation and     the JavaScript object model is a must.        Thorough understanding of Angular 7 or above and its core principles is a     must.        Thorough understanding of Nodejs is a must.        Experience with data structure libraries (e.g. Immutable.js) is good to have.        Experience with common front-end development tools such as Babel, Web     pack, NPM or any such tool is a must.        Strong understanding of browser compatibility and web standards is good to     have.        Familiarity with server-side web technologies such as Nodejs is good to     have.        Familiarity with RESTful APIs is good to have.        Ability to understand business requirements and translate them into     technical requirements is a must.        Hands on skills with code versioning and configuration tools (such as Git,     Bitbucket) is a must.        Extensive and applicable experience as a hands-on architect and/or senior     level programmer is a must.        Experience working with architecture and design patterns on software     products is good to have.        Proven success in improving software architecture on desktop and web     applications is good to have.        Strong, functional competency in full-stack web development is good to     have.        Experience with Front-end performance optimization techniques is     good to have.        Strong skills in communication, critical thinking, decision making, problem     solving, and attention to detail is a must.        Responsibilities   :       Should be able to write code adhering to OOPS and SOLID principles .        Design Solutions and suggest technology choices to clients.        Own the implementation of the solution and deliver in designated     timelines.        Developing new user-facing features using the latest front-end     technologies        Building reusable components and front-end libraries for     future use.        Translating designs and wireframes into high-quality code        Optimizing components for maximum performance across a vast array of web     capable devices and browsers        Develop Components in Angular or Node and unit test the     same.        Design Solutions and suggest technology choices for     clients.        Own the implementation of the solution and deliver in designated     timelines.        Interface with customer for requirement gathering, analysis and     technology discussions.        Perform Code Reviews of the team members and mentor the team on     technology best practices.        Evaluate new technologies, frameworks and conduct POCs.        We promote a DevOps culture, so you will need to look beyond pure     programming and get involved with the deployment and operation of     the code we build.        Provide timely status updates and raise flags as needed.        Upskill and learn new technology as per the project demands.        Experience     5 7 Years.    ", "Role": "Fresher,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "Architecture, Interior Design,", "Employment Type": "Full Time, Permanent", "Role Category": "Other", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["software architecture", "Front end", "DOM", "GIT", "Web technologies", "Web development", "Javascript", "Programming", "Performance optimization", "Unit testing"]}