{"Job Title": "Software Development Manager", "Company": "IBM India Pvt. Limited", "Experience": "10 - 12 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Roles and ResponsibilitiesIntroductionSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do. Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide. At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.Your Role and ResponsibilitiesAre you ambitious in driving front end development for one of the largest next Generation Self driving network in the world? Do you love working with cutting edge technologies such as Python/Flask or Golang/Gin? Does distributed systems that process billions of transactions per day excite you? Do you love microservices, distributed systems, possess skills in networking? If answer is Yes, then we have a role for you.We are looking for ambitious Back-end developers for IBM Next Generation Self Driving Network (one of the largest in the industry).Responsibilities:Develop highly distributed massively scalable microservices based Back End for IBM Next Generation Self driving networkOwn development and operation of customer facing Rest API that will process billions of transactions in dayWork closely with architecture, and leadership team to ensure development is done as per the specifications and contribute to architectureAct as escalation point of contact for Back EndParticipate in weekly rotating on-call responsibilities, possibly providing 24/7 coverage when needed.Develop and maintain accurate documentation for internal procedures and servicesPractice and implement DevSecOps, Canary release, Blue/Green Deployment, A/B testing Required Technical and Professional Expertise10+ years of experience in One of the Programming Languages (Python/Golang prefer. Java or other languages is fine)5+ years of experience with Rest API development using one of the of framework (Flask/Django/Gin etc.)3+ years of experience with Event Driven software architecture and development experience3+ years of experience in Distributed Transaction Management in Microservices (Saga pattern)5+ years of experience developing distributed system using SQL (MySQL, PostgreSQL or Cockroach DB) and No SQL (Mongo DB, Cassandra etc.)2+ years of experience with Linux & Container Orchestration (Kubernetes)Understanding of basic network concepts including TCP/IP, DNS, HTTP, LDAP, DHCP, and Routing/SwitchingExcellent written and verbal communication skills Very strong troubleshooting skills3-5 years of people management experiencePreferred Technical and Professional ExpertiseExperience with Front End Development using JavaScript, React, Node.js etc.Experience with Jenkins, Spinnaker for CI/CD etc.Experience with NetDevOpsExperience with microservice orchestration tools (e.g. Kubernetes, Openshift, HashiCorp Nomad)", "Role": "IT/Networking-Manager,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Admin/Maintenance/Security/Datawarehousing", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": [" LDAP", " DNS", "Front End Development ", " PostgreSQL ", "Event Driven software architecture ", " HTTP", " Node.js", " React", " DHCP", "SQL ", "Software Development Manager", "MySQL", "JavaScript", "TCP/IP", "Rest API development "]}