{"Job Title": "Software Development Engineer in Test", "Company": "PRI India", "Experience": "2 - 6 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "   Job Description     Participate in requirements review/story elaborations and testing activities to deliver high quality products and incremental value with every iteration.     Document test plans and acceptance criteria using Rally or similar life cycle management tools.     Develop test scripts and perform automated and manual exploratory testing to ensure software meets business and security requirements and established best practices.     Leverage available tools and frameworks to produce durable tests and avoid application fragility.     Follow through to ensure defects are reported and escalated appropriately.     Bachelor's degree in Information Systems, Information Technology, Computer Science, Engineering or equivalent work experience.     Expertise knowledge using Selenium and any BDD framework (Cucumber, Jasmine or JBehave).     Intermediate Knowledge in REST API testing and knowledge of any API automation framework (Restassured, Spock or Karate).     Intermediate Knowledge of StormRunner or other performance testing tools.     Intermediate knowledge in core Java, Groovy, Node.js, and ReadyAPI.     Advanced experience writing user stories and acceptance criteria.     Strong communication and problem-solving skills.     Experience with software development methodologies, particularly with Agile/Scrum methodologies.  ", "Role": "Testing Engineer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - QA & Testing,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Health insurance", "Core Java", "Software development methodologies", "Test scripts", "Agile scrum", "Testing tools", "Performance testing", "ESIC", "Information technology"]}