{"Job Title": "Software Developer", "Company": "KGTiger Corporation", "Experience": "3 - 7 years", "Salary": "₹ 4,50,000 - 6,00,000 P.A. ", "Location": "Hyderabad/Secunderabad", "Job Description": " Software DeveloperJob Location: HyderabadCandidates with Healthcare/IRT/Clinical domain experience are preferred Job Description: Develops and maintains application components.  Working with Technical Lead, Team Lead and/or Software Development Manager gains an understanding of design patterns, principles, and standards to be followed in implementing assigned tasks. Understands and follows all coding standards.  Creates robust, well-documented code  Creates database objects as required.  Completes unit testing and peer review documentation as required.  Working with the development team integrates implemented code and database objects into the release application. Performs smoke testing for released application as required. Responsible for configuring client-specific systems using configuration tools.  Application Support : Efficiently and effectively diagnoses and resolves defects.  Identifies areas of the application impacted by the resolution and works with BSA and/or Software Test Engineer to define test cases required for the resolution. Completes all required change control documentation including updates to design and other technical documents as required. Deploys resolution to testing and production environment as required.Performs all work under-documented Standard Operating Procedures (SOPs), Working Instructions. Education: Bachelors Degree in Computer Science, Information Systems or related technical major.  The demonstrated experience will be considered instead of a Bachelors Degree.  Experience: 3-7 years experience professionally developing software.  Experience with some or all of the following technologies: Microsoft SQL Server 2005/2008, MySQL or other relational databases including stored procedures, views, and triggers Microsoft SQL Server Reporting Services or other reporting tools   Microsoft Visual Studio 2012, C#, ASP.NET  ASP, VBScript, IIS, HTML, JavaScript, AJAX, CSS, XML, XSLT  Web page design  Windows application design  Object Relational Mapping (OR/M), MVC, MEF, Unity Framework, and Dependency Injection (DI) is a plus Team Foundation Server, Visual Source Safe, Subversion or other source control product  Experience estimating development and support tasks.  Familiarity with GCP, 21 CFR Part 11 or experience in a regulated environment desirable.  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Software Development", "LINQ", "ASP.Net", "c#", ".Net", "SQL Server", "MVC"]}