{"Job Title": "Software Developer (PHP)", "Company": "Cleft Solutions", "Experience": "2 - 7 years", "Salary": "Not Disclosed", "Location": "Thane", "Job Description": "Software Developer (PHP)\n\nWORKING AT Cleft- Solutions\n\neople are our greatest asset and it is they who ensure our success. We have a cosmopolitan mix of professionals who are bright and talented and get along famously with each other. As Colleagues they are constantly in discussion with each other,  improvising processes,  updating and educating one another. They are perfectly at ease because they can be themselves even at their workplace which is why they are so highly motivated.\n\nOur business environment is dynamic and includes rapid technological advances. We provide an enabling and positive environment that motivates our people to scale heights,  reach achievement and superior levels of performance. It is our belief that continuous education of our employees is reflected in our business results and so we strive to provide the best training that keeps us competitive in our field and leverages our personnel to provide customer delight.\n\nWe value our employees and therefore we offer a positive working environment which helps them maintain a near perfect work- life balance and get the recognition they truly deserve.\n\nExperience: More than 2 Years.\n\nEducation: MCA/ BE/ BS/ MS degree in Computer Science,  Engineering or a related subject.\n\nFunctional Area: E- Commerce,  Internet Technologies.\n\nLocation: Thane Mumbai.\n\nWe are looking for an iOS Developer who possesses a passion to maintain high coding practices by maintaining good design documentation and participating in unit testing and peer code reviews.\n\nCandidate has to communicate with stakeholders to collect requirements,  describe software product features and technical designs. Strategic thinking and ability to make sound technical decisions is a must keeping abreast with the latest technologies and their application.\n\niPhone/  iPad developer with hands on experience in iOS and iPhone SDK.\n\nExpert knowledge of Objective- C,  Xcode 5,  C/ C++, UI Kit and Cocoa.\n\nWorking Knowledge of iOS 8,  Swift,  XCode 6.\n\nExperience: More than 2 Years.\n\nEducation: MCA/ BE/ BS/ MS degree in Computer Science,  Engineering or a related subject.\n\nFunctional Area: E- Commerce,  Internet Technologies.\n\nLocation: Thane,  Mumbai.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Internet technologies", "C++", "code", "technical", "software", "testing", "E-commerce", "HTML", "Unit testing", "it", "IOS", "xcode", "iphone", "Computer science", "ui", "Coding", "design", "PHP", "developer", "iPhone SDK"]}