{"Job Title": ".NET Developer/Sr Software Developer -Infinite Computing Systems -", "Company": "Infinite Computing Systems Pvt. Ltd.", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": " LOOKING FOR CANDIDATES WHO CAN JOIN IMMEDIATELY Job descriptionGreetings of the day!We are currently hiring Professional .NET Software Developer/Senior Software Developer. Please go through the below Company profile & the Job description.   JOB IDENTIFICATION Title: .NET Software Developer/Senior Software DeveloperDivision: TechnologyLocation: Mumbai(Andheri East )(Walkable from Andheri Station)Working Days: Mon-Fri Timings: 12.00 PM- 9.00 PMReports To: Lead Programmer ESSENTIAL DUTIES AND RESPONSIBILITIES:Write clean, well-engineered robust code Full software development life cycle responsibilities include:Requirement GatheringAnalyzing, Designing Solutions and Communication Programming and Testing Deployments and Production Support Conceptualize, Design, and Implement products & services as a member of a scrum teamDesigning and building solutions in .NET 4.0 or higher technologies (C#, .NET Framework, MVC, ASP.NET), WCF, Web API, SQL Server 2012 or higherDesigning and building responsive web applications using HTML5, CSS3, JavaScript & Bootstrap.Strong knowledge of design principles OOD, Design Patterns, N-tier architecture, TDDStrong experience using JavaScript frameworks like Angular 8 and jQuerySolid Understanding and Experience in Azure Cloud Framework.Proficient understanding of code versioning tools such as Git, SVN, etc.Unit testing preferably using MS Test. NUnit, Jasmine/KarmaDynamics 365 CRM knowledge will be an added advantage Desired Skills & Experience: Bachelors/ Masters Degree in Computer Science / Software or Computer Engineering / Information Technology Skills: .Net & MVCAngular js & Angular 8SQL Web API JQuey, Javascript and CSS (For client side)  Perks and Benefits Perks and Benefits fixed competitive salary Opportunity To Work With Global Clients Open and flexi-work culture Potential On-site opportunities Five days working Shuttle service Interested candidates please share resume along with Skills mentioned in Desire candidate profile on cshah@infinite-usa.com", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Sc in Computers, B.Tech/B.E. in Any Specialization, BCA in Any Specialization", "PG": "MS/M.Sc(Science) in Any Specialization, MCA in Any Specialization, M.Tech in Any Specialization", "Doctorate": "None", "Key Skills": ["C#", "Angularjs", "Software Development", "CSS", "jQuery", "Javascript", "SQL Server", "ASP.Net MVC", ".NET Framework", "Angular"]}