{"Job Title": "Software Development Engineer - Carried Forward", "Company": "Resource Access Management Solutions Pvt. Ltd.", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Noida", "Job Description": "  Job Description     ServiceNow Application Administrator and Developer role is based at Noida, India office, and is responsible for management, maintenance, and development of ServiceNow applications    supporting  RMS primary ITIL processes Incident, Problem, Change, CMDB, Asset, Service Catalog, Integrations, HR onboarding, and other service modules. Strong experience in scripting and API integration is must.     Roles and Responsibilities     Responsible for administrating ServiceNow Applicatio   Core configuration administration navigation, UI, ACL, manage lists and forms, create/modify incidents/change/problem workflows, business rules, service portal, and client scripts   Core application administration build business rules for events and notifications, perform upgrades, manage application security   Service administration create and manage reports, configure Service Level Agreements (SLA) within the tool, create customization and branding for the website   User administration user access, roles, groups, profiles   Data management manage data with tables and CMDB, manage data with import sets and update sets   Responsible to develop and enhance the ServiceNow instances that are dedicated to RMS   Develop web services using JavaScripts for integration with other applications (example:.HR onboarding, monitoring stack, etc.,)   Develop new features within RMS instances using XML, workflow, business rules, UI actions, UI policy, client scripts and other related technology   Work with infrastructure and other service owners to conduct proof of concept, design, and implement discovery, data certification, service automation, integration, and other related features   Work with the ServiceNow vendor to ensure RMS gets the maximum value for their products and services     Requirements     A qualified candidate should possess following technical/analytical, and collaborative skill set   Technical/analytical   Expert level knowledge of ServiceNow application and all of it s function modules   Experience with JavaScript XML, HTML and other script languages to develop applications   Experience with AngularJS, Apache, Glide and/or Jelly scripting and system/process automation (Orchestration)   Experience with service oriented architecture and web services integration (SOAP, WSDL, REST)   Experience of integration with other enterprise software systems   Experience developing custom applications within the ServiceNow platform from the ground up   Knowledge of ServiceNow technical architecture, especially Mid Server architecture for discovery functionality   Knowledge of LDAP, MS Active Directory and the integration with ServiceNow   Basic network and infrastructure knowledge   Knowledge of Performance Analytics is a plus.   Research ServiceNow Wiki and apply the knowledge to the day to day job   Collaborative   Ability to quickly come onboard and can support current ServiceNow implementation   Ability to write clearly and communicate information/ ideas   Possess excellent problemsolving skills. Ability to understand and interpret technical issues and communicate issues effectively to management and stakeholders, and help team members to trouble shoot and resolve issues   Ability to listen and appreciate different points of views, and take inputs from all stakeholders and come up with solutions, recommendations, and decisions that are at the best interest of RMS   5-10 years IT experience, with 5 years ServiceNow ITSM tool administration and developer experience   ServiceNow administration and ITIL certification  ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["LDAP", "XML", "Javascript", "Active directory", "Workflow", "HTML", "Apache", "Risk management", "Analytics", "Recruitment"]}