{"Job Title": "Software Developer ", "Company": "PROGNO FINANCIAL PLANNING SYSTEMS PVT LTD", "Experience": "3 - 9 years", "Salary": "Not Disclosed", "Location": "Kochi/Cochin", "Job Description": "  Preferably, 3+ years of overall Software Development experience using C#, ASP.NET MVC(456), HTML, CSS, JavaScript.  Expert in Object Oriented Design and Object Oriented Programming.  Expert level understanding of complete responsive web applications and up-to-date knowledge and experience with the latest trends.  Bachelor's degree in Computer Science, Statistics, Math, Engineering, or related disciplines   Candidates who can join immediately within 14 days only need to apply.         Skill Set Required:        Expertise in ASP.NET MVC Programming and Entity Framework   Expertise in writing complex Queries and store procedure using Microsoft SQL Server   Expertise in Web Application and Web API development.   Experience with Team Foundation Server (TFS) or SVN.   Excellent communication skills, flexibility, and a positive attitude. Experience working in rapid growth environment that requires flexibility and continuous innovation   Ability willingness to quickly learn new concepts and softwares is necessary.   Professional work ethic coupled with sound judgment. Candidate should be self-motivated, independent, detail oriented, responsible team-player and passionate about building high-quality systems with software implementation's best practices, and design patterns.   3 to 9 years     ", "Role": "Software Developer,", "Industry Type": "Education, Teaching, Training,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Object oriented design", "Quality systems", "Web application", "Javascript", "Entity framework", "HTML", "ASP.Net MVC", "Software implementation", "Object oriented programming"]}