{"Job Title": "Software Developer", "Company": "Cyber Infrastructure (P) Limited", "Experience": "1 - 3 years", "Salary": "Not Disclosed", "Location": "Indore", "Job Description": "Software Developer - #CIS- DN- 05 Job Title Software Developer Job Code CIS- DN- 05 Department Microsoft Technology/ Area ASP. NET Experience Required 1- 3 years Educational Qualification(s) BE/ ME/ B. Tech/ M. Tech/ MCA/ MCM/ BCA/ Msc. PGDCA/ or equivalent Overview of Job Project work undertaken will be development and unit testing of straightforward or low complexity components. The main responsibility is to follow low- level designs, supported by colleagues and team leaders. May assist in any other aspect of the project life- cycle under supervision. Will still be developing technical and team working skills Duties & Responsibilities \n\nMay assist in requirement gathering under supervision. \n\nTo be a part of developing team of high end DotNet applications & portals. Assist in the design, coding, and testing of technical solutions \n\nUnderstand standard systems development lifecycle processes and apply our methodology effectively on client engagements \n\nDevelops technical knowledge and awareness of those technical areas in which requested to code. \n\nPeer Code review on a regular basis. \n\nAccurately records own time and accurately reports progress on own work. \n\nComplies with all confidentiality and non- disclosure policies and/ or agreements and ensures security of information at all time \n\nLearning new web related technologies and providing support in implementation in various projects as and when needed \n\nResponsible for meeting deadlines and adherence to set coding standards \n\nCommunicating with clients as and when needed. \n\nPreparing required reports as and when required. \n\nLearn and share knowledge with teammates and juniors in advanced technologies. \n\nProvide guidance to juniors and support to other teammates in their work as and when required. Minimum Requirements Mandatory Skills : - \n\n- Programming using server- side web- technologies. \n\n- A self- driven person with strong development skills in ASP. NET using MVC/ MVP to perform software development activities. \n\n- Minimum 1 to 2 year of work experience required. \n\n- Should have experience in C#, Sql server2008/ 2012. \n\n- Knowledge of API integration, Angular / Knock Out JS is desirable. \n\nDesirable Skills : \n\n- Exposure to Agile development methodologies\n\n- Good understanding of source control systems \n\nWeb Technologies : \n\n- ASP. Net, SQL Server, MVC2/ 3\n\n- Object Oriented Programming Concepts \n\n- Strong knowledge on . NET Architecture Location Based at CIS Indore location but required to work on client site whenever required. Any query related to job \"Ensuring success of our clients and partners through highly optimized Technology solutions while enhancing the quality of life for our workforce and community. \"\n\nOur Core Values \n\nAccountability", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["Policies", "PGDCA", "code", "technical", "software", "developing", "microsoft", "Code review", "Coding", "web", "api", "MSC", "net", "programming", "architecture", "development", "level", "testing", "Unit testing", "SQL", "quality", "ASP.Net", "developer", "MVC", "agile", "support", "applications"]}