{"Job Title": "Software Developer opening at Digived", "Company": "DigiVed Business Solutions Pvt. Ltd.", "Experience": "1 - 6 years", "Salary": "Not Disclosed", "Location": "Thane", "Job Description": "Software Developer opening at Digived  Careers @ DigiVed Welcome to The Digital World  The Future is here. Its ever changing with the trend ever growing. We are driven by incredible advancements in technology new strategic thinking.  Experience what the IT Business is using technology strategy Concentrate on a Job Preference Contribute Your Best  Represent values innovation in every role you plan  Dream Big,  Do Even Bigger | Step in Digital Technology  Interested to know more Roles /  Responsibilities :    Understand current system very quickly. Continuously upgrade add new dimensions in existing system. Follow standard architecture in work. ASP.Net with 3 Tier architecture developments Development in VB.Net or C#  Strong in Stored Procedure. At least 1 year exp. in Web Service or WCF. Functional Technical Documentation. Testing skills would be an added advantage. Support to existing applications.     The Honourable Prime Minister Narendra Modi,  had announced on 8th Nov that all Rupee 500 1000 currency were stripped of their status. Demonetization so as to understand the impact on their finances,  and also to learn from past history and its impact on economy. How to convert black Money into white money,  seemed to be trending on the search engines. Queries began surging soon after Prime Minister Narendra Modi. This represents the percentage of visitors who convert to leads by taking action on your offer.This usually means they have filled out a form.", "Role": "Software Developer,", "Industry Type": "Retail, Wholesale,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Diploma in Mechanical, Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["c#", "Prime", "VB.NET", "Architecture", "technical", "Service", "it", "Business Executive", "Technical documentation", "web", "Strategic thinking", "Manager Technology", "ASP.Net", "Software", "developer"]}