{"Job Title": "OSTC Senior Software Developer", "Company": "OSTC", "Experience": "15 - 20 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": "   Job Description     The Senior Software Developer will aid in planning and implementing complex software projects and timelines, providing reliable solutions to a variety of problems, using sound problemsolving techniques and ensuring security is considered by design. You will perform technical root cause analysis and outline corrective action for given problems    Your Role & Responsibilities:     Developing and coding review software to meet stakeholder needs.   Monitoring the quality and performance of applications.   Ensuring documentary evidence is maintained on all work for future reference.   Design and update databases where required.   Maintain software products to ensure strong functionality and optimisation.   Recommend improvements to existing software programs as necessary.   Mentoring and passing on your knowledge of technologies and best practices.    Liaising with project stakeholders and advising them on solutions.   Performing technical root cause analysis and outline corrective action for given problems.   Taking full ownership of assigned tasks, ensuring effective reporting while working towards efficient, internal customer satisfaction.   Developing their own capabilities and expertise to provide a high-quality service to the business.   Staying abreast of business updates, current industry trends, new technology, and changes and issues relating to secure development activities.        Qualifications      You are:     An innovative and creative full-stack development engineer with project leadership experience. You are highly organised and proactive and able to work against tight deadlines. We are looking for a problem solver with excellent attention to detail and ability to communicate effectively with colleagues, participants and external stakeholders.    Required skills:     Experience in Agile (Scrum) development environments   A collaborative approach to problem-solving and task management   Experience in working on commercial (digital/web/cloud/mobile) projects through all stages of development, incorporating security by design   Effective and confident communicator (technical and non-technical stakeholders across multiple business units)   Strong analytical skills   Ability to work using own initiative as well as working with a small team   Ability to manage your own projects and portfolio   Comfortable and highly competent at multi-tasking     Technical skills:     A full-stack developer working with the Microsoft stack (C#, ASP.NET MVC, SQL Server, WebApi)   Source control (SVN, GIT)   PostgreSQL   JavaScript frameworks e.g. VueJS   Experience in Microservices Architecture development using .Net Core on Azure Kubernetes Service   Experience in Containerization/Kubernetes   Knowledge of Azure DevOps specifically azure pipelines or similar CI/CD processes, Terraform   Background in development based on security architecture including Active Directory, RBAC   Experience with popular front-end U.I component frameworks (e.g. Material Design, Bootstrap, DevExtreme)    Experiences in Azure services like Azure Service Bus, Key Vault, Monitor, Application Insight and Blob   Python data science libraries (e.g. Pandas, lime).    Working knowledge of Git source control    ", "Role": "Software Developer,", "Industry Type": "Advertising, PR, MR, Event Management,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Front end", "GIT", "Coding", "Postgresql", "Javascript", "Active directory", "microsoft", "Monitoring", "SQL", "Python"]}