{"Job Title": "Python ( Software ) Developer", "Company": "RENTOKIL INDIA PRIVATE LIMITED", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Goregaon West", "Job Description": "  GENERAL DUTIES RESPONSIBILITIES     Minimum 3+ yrs Work experience as a Python Developer and expert in frameworks like Django     Well versed with writing Python based RESTful APIs     Experience in troubleshooting, software development processes and ability to understand and implement client requirements.     Fix detected vulnerabilities to maintain a high-security standard.     Improve functionality of existing systems     Implement security and data protection solutions     Knowledge of Front-end technologies, such as JavaScript, HTML5, CSS3, and AJAX is must     Writing efficient, robust, testable and reusable code     Strong understanding of Data Structure and Algorithms     Very clear with the Python coding standards.     Good understanding of server side templating language (Django Templates)     Thoughtfully design forward thinking, scalable and performant data architectures     Knowledge of best practices for SQL and MySQL     Experience of working on Object Relational Mapper libraries such as Django ORM.     Expert understanding of versioning control tools Git, SVN, etc.     Collaborate with developers to create and maintain back-end architectures for highly-trafficked applications.     Work towards improving code quality, internal tools/processes and documentation     CORE COMPETENCIES, KNOWLEDGE, SKILLS ABILITIES     Good understanding of the software development life cycle     Strong analytical and problem finding abilities     Knowledge of JIRA software will be an added advantage     Ability to work in a fast-paced environment with minimal supervision     Sense of ownership and pride in your performance and its impact on the company's success     Critical thinker and problem-solving skills     Team player     Good time-management skills     Acts as an independent developer to work on development of python applications end to end, utilizing a thorough understanding of applicable technology, tools, and existing designs.     Educational / Other Requirements     Bachelor s Degree (or its equivalent) in a related field.  ", "Role": "Software Developer,", "Industry Type": "Strategy, Management Consulting Firms,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Python"]}