{"Job Title": "Software Developer", "Company": "redef9skiLLs", "Experience": "4 - 6 years", "Salary": "Not Disclosed", "Location": "Mohali", "Job Description": " We are looking for a PHP Developer for one of our reputed IT Company in   Mohali   who is a team of enthusiastic and committed IT Professionals. Their main objective has been to provide state-of-the-art products and services in the field of Information Technology using the latest cutting-edge technologies. As they are professional, they can engineer your products beyond your imaginations with their professional knowledge, attitude, experience and expertise.    Industry: IT-Software, Software Services    Functional Area: IT Software Application Programming , Maintenance    Role: Software Developer    Employment Type: Permanent Job, Full Time     Skills Required:       3+ years of working experience of PHP, MySQL, JQuery and Javascript.       Strong knowledge of OOPs.    1+ years of working experience in Laravel.    Working experience in other major PHP MVC frameworks.    Sound knowledge of GIT.    Exceptional skills of writing SQL queries.    Understanding of Linux/Ubuntu, Web servers, Cross Browser compatibility.    Save my name, email, and website in this browser for the next time I comment.   24/02/2020    React.js Developer Job Location Mohali Salary Upto 9 LPA Experience : 3- 6 Years We are looking for a React.js Developer for one of our reputed IT Company in Mohali who is a team of enthusiastic and committed IT Professionals. Their main objective has been to provide state-of-the-art products and services in the field [ ]    20/02/2020    iOS Developer Job Location Noida Salary Upto 6 LPA Experience : 1 4 Years We are looking for an iOS Developer who possesses a passion for pushing mobile technologies to the limits and will design and build complex mobile applications. experienced in Objective-C & Swift is a must. Responsibilities Design and build advanced[ ]  ", "Role": "Software Developer,", "Industry Type": "Strategy, Management Consulting Firms,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["jQuery", "Linux", "Application programming", "MySQL", "Consulting", "Javascript", "PHP", "MVC", "Information technology", "Software services"]}