{"Job Title": "Senior Software Developer", "Company": "GENOMATICS PRIVATE LIMITED", "Experience": "5 - 9 years", "Salary": "Not Disclosed", "Location": "Coimbatore", "Job Description": "Hiring Java/J2EE developers for Genomatics Pvt. Ltd, Coimbatore.We are currently looking for Software Developers with experience in developing J2EE Applications using Frameworks.Must have experience developing at least one Enterprise application end-to-end. Experience range can be between 1-6 years. Salary, compensation package will be as per industry standards and depending on experience, commitment and contribution.Candidate/s should be skillful enough to take the project through complete cycle using waterfall model.Should be able to pickup required latest technologies and be able to create functional, web based, database driven scalable applications using J2EE and open source technologies.Skills:1. J2EE programming using JSF or Struts, Hibernate or Toplink, XHTML, JavaScript, AJAX, CSS is a must2. Experience with Glassfish Application Server or its equivalent, and Tomcat, Apache Webserver is required3. Experience with MySQL v 5.x or an equivalent transactional open source or commercial database4. Experience with Servlets, JSP, JDBC is good to have5. Have to be Skilled in database design (ER diagrams), business analysis, requirements capturing(SRS) , UI design, UML etc.,6. Experience with designing end-to-end web applications using transactional databases, session handling, data security, data encryption, and audit trailing mostly using waterfall model is required7. Understanding of OOPs and design patterns at least MVC is a must8. IDE: NetBeans or Eclipse and Operating System: Any Linux flavor, Ubuntu or CentOS or Debian and Configuration Management System: CVS or Subversion is a must9.Knowledge of Hadoop Framework, Big data, AI based programming like Chatbots development will be an added advantage10. Experience of PHP or Perl or any other scripting languages is beneficial11. Good understanding of cross-platform and cross-browser issues12. Good communication skills and be a team player", "Role": "Software Developer,", "Industry Type": "Pharma, Biotech, Clinical Research,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["JOB 3: Software Developer (no. of positions :1)"]}