{"Job Title": "Lead Full Stack Software Developer", "Company": "Arient Solutions", "Experience": "5 - 9 years", "Salary": "Not Disclosed", "Location": "Coimbatore", "Job Description": " We are looking for highly skilled, motivated committed candidates, with at least 5 years of Industrial experience in Full-Stack Software Development.    Responsibilities and Duties:     Must be able to develop, review and deploy code in a production environment.   Break Requirements into Use-cases, Stories and/or Tasks   Lead a team of 2-4 developers   Make RD on new Web-Technologies and deliver PoCs, as when required   Manage report the daily progress of Tasks   Own and Develop a module/block of requirements.   Good Coordination with the team to deliver the projects on time.     Required Skills:      Help the team technically - perform code review, help team sort-out technical issues   Mentor groom young members of the team   Good Programming aptitude, preferably working knowledge in Python   Strong knowledge in OOPS, algorithms, Design Patterns and Unit testing   Web development with (HTML, JS, JQuery, Django, PHP and any Object-Oriented Programming languages like Java, Python)   Strong SQL querying skills to write complex queries   Good prompt communication   Knowledge in    Big Data Machine Learning are highly preferred.   JavaScript MVC framework like AngularJS is an advantage      Required Experience Details:    Web Technology: 3 - 4 years (Required)   Team Lead: 1 year (Preferred)   Overall work: 5 years (Required)    Education:    B.E./ M.E./M.Tech/M.C.A/M.Sc(CS/ Software Systems)     ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial", "PG": "MCA in Computers, M.Tech in Electronics/Telecommunication, MS/M.Sc(Science) in Chemistry", "Doctorate": "None", "Key Skills": ["IT services", "jQuery", "Django", "Web development", "Machine learning", "PHP", "HTML", "Unit testing", "SQL", "Python"]}