{"Job Title": "iOS Software Developer", "Company": "TagTaste Foods Pvt Ltd", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Noida", "Job Description": "  About the Profile      We are looking for seasoned iOS developers with 2-5 years of prior work experience of developing highly scalable iPhone / iPad / Mac applications. You would be joining our core engineering team that is responsible to design, develop maintain our entire iOS suite of products. The work is challenging and will require you to work with multiple stakeholders simultaneously. Those who have passion to create an awesome mobile user experiences with a razor sharp focus on the usability of your apps by the end consumers would love to be a part of this team.   An Average Day For You    Collaborate with Program Managers to freeze your project requirements;   Design the architecture Databases, security, UI/UX flow, consumer endpoints etc.;   Code, code code some more;   Testing bug fixes;   Collaborate with stakeholders Sales marketing, support, UI/UX designers to ensure timely delivery at highest quality;   Work with customer support from tech side;   Manage product in growth phase;   Our Requirements    Strong expertise in shippping iOS applications to a large number of users   Expertise in iOS (Apple) SDKs, Xcode, Objective C, Swift and frameworks like foundation, UI Kit, Core Data etc.   Experience in HTTPS, JSON, OAuth, SQL and RESTful APIs   Mobile Analytics/Reporting   Strong programming fundamentals Data structures algorithms   Strong understanding of database designs   Experience of debugging, performance measurement, and test-driven development   Obsession of creating the highest quality product on time   B.Tech./B.E./BS/MS/Phd in Computer Science Engineering or related field   We would love to see    A track record of successfully shipped software   Apps you ve shipped on the Appstore that you re proud to share   Experience with growth projects and environments   An open source profile (such as Github) with some cool projects    ", "Role": "Software Developer,", "Industry Type": "FMCG, Foods, Beverage,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Backend", "Debugging", "Data structures", "JSON", "Customer support", "Open source", "Internship", "SQL", "Android"]}