{"Job Title": "Senior Software Developer - DevOps", "Company": "GILBARCO VEEDER ROOT INDIA PRIVATE LIMITED", "Experience": "5 - 8 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": "Location: MumbaiPurpose of Position:The focused on reducing the cost of procuring and managing fuel for retail, fleet and transportation companiesthrough innovative, technology-based solutions. We are committed to deliver measurable value to our customersand to continually expand that value through improvements to our solutions and processes. These improvementsare enabled by our highly motivated team of industry and solution experts collaborating in an environment ofteamwork, empowerment and accountability.Key Responsibilities:Build, configure and support Amazon AWS based with infrastructure as code”. Follow DevOps best practices and technology used to deliver quality products on time Assist in the identification and implementation of new services Support security certificates, key management, and firewall configurations Develop scripts using configuration management frameworks: Ansible, Terraform Follow standard work to troubleshoot live production environments, minimize downtime, and respond to client reported issuesRelationships Interaction with Global teamEducation & Experience: The ideal candidate will have Graduation/ Degree: Qualification: BE/ B.Tech/ Computer science/ IT Graduate Experience of 5 – 8 years in DevopsBackground and Skills: The ideal candidate will have 3 years+ of experience in middleware layer 5 – 8 years application development and troubleshooting with understanding of application performance systemsusing Java EE, Database, Agile, Web Services. 4 years+ of experience with Java/J2EE, Spring, JSP/Servlets, JDBC, hibernate required 2 years or working experience with MySQL, Oracle databases required. Working experience in scripting languages (shell/ruby) required. Familiarity with installing and configuring Apache, Tomcat, Jboss desired Familiarity with SOA, Enterprise Architect, Jenkins, Nagios desired Familiarity with Linux and Windows systems on internal hosted and AWS environment desired WOMEN CANDIDATES ARE ENCOURAGED TO APPLY", "Role": "Technical Architect,", "Industry Type": "Oil and Gas, Energy, Power, Infrastructure,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["kubernetes", "Ansible", "terraform", "AWS Cloud", "Devops"]}