{"Job Title": "Software Developer || Australian MNC || Noida", "Company": "KSNR Immegration Services Private Limited", "Experience": "6 - 11 years", "Salary": "Not Disclosed", "Location": "Noida( Sector-49 Noida ), Delhi / NCR", "Job Description": "Hi,We are hiring for the position of Developers with experience of maximum 5+ Years in Front End - with experience in UI Development, Kendo UI, Javascript, Jquery, MVC, Kendo UI.Need an Immediate Joiner (Maximum 25/30 days Notice Period)KSNR Immegration Services Private Limitedksnr.co.inKSNR is exclusive service & support provider to our sister Group of companies in Australia and in the process of setting up state of Art support center in NCR with initial team of 120 highly skilled professional in this domain. Many of our group companies are decades old and in the business IT Consulting and related services with Basket full of many fortune 500 companies in Australia.Key Role and Responsibilities: -  Roles and Responsibilities Candidate must have of experience into C#, MVC, ASP.Net, SQL, WCF, and relevant Web Technologies related to .Net. Knowledge of Winform, Windows Services, Kendo UI framework.  Experience in Development.  Solution Designing & Architecture  Liaising with Clients.  Designing the documents,  Testing and Team Activity.  Hands on experience in .NET MVC ,LINQ, AJAX,XML,Web API, Entity Framework, Repository Pattern  Experience in designing and developing the services using WCF,Web API  Experience in designing databases and writiing the complex Queries and stored procedures,Triggers,Indexes etc using SQL Server Database.  Experience in CSS, JQuery,Jave Script, HTML5, Bootstrap  Demonstrated ability to incorporate new technologies and techniques.  Knowledge of Winform, WPF, Windows Services, Multithreading  Familiarization with UML diagrams and Use Cases is expected  Experience in working with Source Control System like TFS.  Knowledge of microservices architecture implementation, web api, web services is desirable.  Strong and effective inter-personal and communication skills (verbal and written).  Knowledge of agile/scrum development processes. If interested please share the CV at shashank.jain@ksnronline.co.in or call - 9958853402.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization, BCA in Any Specialization, B.Sc in Any Specialization", "Doctorate": "None", "Key Skills": ["Repository Pattern", "Javascript", ".Net", "Entity Framework", "MVC", "WPF", "Ajax"]}