{"Job Title": "Software Developer | Leading Financial Services Company", "Company": "Unnati", "Experience": "2 - 4 years", "Salary": "₹ 5,00,000 - 7,00,000 P.A. ", "Location": "Noida, New Delhi, Gurgaon/Gurugram", "Job Description": "Roles and Responsibilities To get transparent and quick status update, apply on :https://rb.gy/dpau0yIf you are looking to work for a successfully established company that believes in giving back to society, then look no further. Here is the job you are looking for.Our client is more than 2 decades old NBFC registered with the RBI. The company was set up with an aim to empower rural entrepreneurs, SMEs, and small institutions by micro-financing. The company has come a long way since its inception in 1992 and has evolved with time with the introduction of its App in the small loans sector. At present, the company has more than 5000 employees and has serviced millions of borrowers to accomplish their dreams. The group has diversified into the education segment and is running two schools. The schools are part of one of the largest private school chains in India. The schools have a flourishing family of 350 teachers and 6500 studentsThe leadership team at the helm of the company has demonstrable experience in financial services and has built the company by upholding the trust of its customers.As a Software Developer, you will design, develop and implement Enterprise wide Business Applications.What you will do:Participating in requirements analysisCollaborating with internal teams to produce software design and architecture.Writing clean, scalable code using .NET programming languages.Testing and deploying applications and systems.Revising, updating, refactoring and debugging code.Improving the existing software by Upgrading, configuring and debugging them.Developing documentation throughout the software development life cycle (SDLC) Requirements.Providing technical support for web, desktop or mobile applicationsDesired Candidate Profile What you need to have:Hands-on Experience of ASP.Net MVC, Jquery, Javascript, Ajax, LINQ, SQL.Knowledge of at least one of the .NET languages (e.g. C#, Visual Basic .NET) and HTML5/ CSS3Understanding of Agile methodologies.Excellent troubleshooting and communication skills.Familiar with WIN2k3 Server, LAN/ WAN", "Role": "Software Developer,", "Industry Type": "Banking, Financial Services, Broking,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization, BCA in Computers", "PG": "Post Graduation Not Required", "Doctorate": "Doctorate Not Required", "Key Skills": ["C#", "Asp .Net", "LinQ", "Agile Methodologies", "VB6", "Jquery", "SQL server", "SqL", "WIN2k3 server", "Javascript", "MVC", ".Net platform", "LAN/WAN environment."]}