{"Job Title": "Senior Software Engineer - Java Developer", "Company": "Walmart Labs", "Experience": "6 - 9 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "  The POS systems provide software solutions to enable front end register technology in Walmart stores. This includes the manned and self-checkout lanes, server infrastructure within each store as well as services running in Containerization on the cloud and makes it easier on customers wallet by spreading out holiday payments over a period. It also provides the users an option to query tlog data.     You will be a key member of the Point of Sale Application Development team for Design, build, test and deploy cutting edge solutions at scale. You will work within our agile software development process and have an important impact on the POS products that we built. You will be interacting with Walmart engineering teams across geographies to leverage expertise and contribute to the tech community. Also engage with Product Management and Business to drive the agenda, set your priorities and deliver awesome products. You need to be proactive, energetic and responsible for design and end-to-end delivery of modules while collaborating effectively with cross-functional teams.           Skillsets:     Extensive hands-on experience building microservices using Java, Sprint Boot and Kafka.   Strong and hands-on experience in React Native, React JS, Redux, HTML, modular CSS, Javascript, libraries, components and frameworks.   Experience or knowledge of these systems and frameworks: Kubernetes, Kafka, Elastic Search, Kibana   Deep knowledge of UI design principles, patterns and best practices   Familiarity working with REST APIs for deep integrations with platforms   Familiarity with native build tools and Experience with automated testing suites.   Solid understanding of software design and patterns like - MVC, Delegation, Singleton, Factory, Adapter   Expertise in memory management, multithreading, networking Security   Experience in Microsoft Azure cloud technologies   Sound knowledge of source code management - Git/ GitHub.   Help put tools, processes, and documentation in place to improve our code quality.   Ability to work in an Agile /SCRUM environment.   Ravenous about learning technology and problem solving.   Strong writing and communication skills.   Previous experience in Point of Sale (POS) Application Development a plus   Previous experience or knowledge on Electrode framework is a plus   Should understand principles of mobile development and should have experience in developing apps in Android OS is a plus   Exposure to Monitoring/Logging tools like Splunk, Dynatrace is a plus       Our Ideal Candidate:     You should have a deep interest and passion for technology.    You love writing and owning codes and enjoy working with people who will keep challenging you at every stage.    You have strong problem solving, analytic, decision-making, and excellent communication with interpersonal skills.    You are self-driven and motivated with the desire to work in a fast-paced, results-driven agile environment with varied responsibilities.    You are innovative, talented and committed individual with excellent communication, spirit of teamwork and Analytical abilities to drive excellence!  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Product management", "Software design", "Multithreading", "Front end", "Agile", "HTML", "Application development", "MVC", "Monitoring", "Android"]}