{"Job Title": "Software Developer- Nodejs , MongoDB", "Company": "Plus91 Technologies", "Experience": "0 - 2 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "This is an exciting opportunity for an experienced industry professional with strong core technical skills to join and add value to a dedicated and friendly team. We are looking for a Software Developer who is driven by the art of programming. As a core member of the Development team, the candidate will take the ownership of project(s) by working independently with little supervision. The ideal candidate is a highly resourceful and innovative developer with extensive experience in the layout, design and coding of websites and applications. You must also possess a strong knowledge of web application development and MySQL Server databases. You will be hands-on writing code, unit tests, and performing peer code reviews. You will work with a project manager, Senior Developers, and Software Testers and customer stakeholders to deliver high quality, scalable and maintainable software solutions.Key Responsibilities• You must be able to develop logical modules within pre-existing platforms• You can contribute independent modules to be used by other software developers• Prepare technical documentation and presentations for the team and customer stakeholder alike.• Build and release to the production stack on a weekly basis• Work with the team lead to ensure that patterns for scalability, maintainability and performance are developed.• Follow the process for software development, testing and deployment.• Ensure that assigned user stories (requirements) have sufficient detail to be implemented properly.• Ensure that you have sufficient understanding of user stories to provide reliable estimates.• Support and maintain existing and new applications and deliver end-to-end solutions for the client requirements.• Design and develop high-quality, scalable, robust and reusable code and components.• Deliver solutions that perform seamlessly across different web browsers and mobile platforms.• Able to maintains the codes repositories through version control (Github, Bitbucket)• You should have the ability to solve complex problems with simple solutions.Candidate ProfileRequired Qualifications:-• Qualification: B.E/B.Tech in Computer Science or Engineering, MCA• 0-4 years of professional experience in building Web Application • Good Spoken and Written English Skills• Sound knowledge of JavaScript, Node JS, Angular 2+,Electron JS• Knowledge of MongoDB and MySQL Knowledge of Socket.IO (Preferred) • Ability to learn new technologies and to work in start-up environment while taking up responsibilities.B.E, MCA", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "MCA in Computers", "Doctorate": "Doctorate Not Required", "Key Skills": [" Javascript", " MySQL", " Mongo DB", "Node JS", "Electron js", "MySQL Server ", " Angular 2+", "MongoDB ", " Socket.IO ", "web application development"]}