{"Job Title": "Full Stack Developer / Senior Software Engineer", "Company": "Checktronix India Pvt. Ltd.", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Chennai, dharmapuri", "Job Description": " Requirements   Must have Java expertise and strong coding ability  Experience developing in a Windows/Linux environment  Practical, hands-on experience with modern Agile development methodologies (Scrum, TDD)  Solid experience in core Java, J2EE, Performance tuning, server-side Java development and building web services.  Familiar with tools such as Git, TeamCity, JIRA  Demonstrated success in delivering results  Excellent verbal and written communication  Ability to handle multiple competing priorities in a fast-paced environment  Should have experience in deploying Java applications on Jboss/WebSphere/Tomcat.  Strong analytical, problem solving, and production diagnostic skills.  Proficiency building and executing unit and functional tests  Familiar with automated System Testing tools such as Selenium  Ability to do a code walk-through on sample code selected at random.  Highly motivated and passionate about new technology  Experience with international/global (multi-site, multi-time zone) teams preferred  Skills Required   Strong Working knowledge of industry standard development practices and concepts of core Java, J2EE , Hibernate, JavaScript, jQuery, Servlets/JSP, XML, XSLT, SOAP, REST, HTML5, CSS, JSON, Spring MVC, Spring Framework (Preferably 3.2 and above), JUNIT / SOAPUI / Web Service Test Tools, Mock frameworks ? Mockito/EasyMock/Powermock, Gradle/Maven.  Responsibilities:   Follow agile methodology, designs, develops, and implements web-based Java applications to support business requirements.  Resolves technical issues through debugging, research, and investigation.  Assists in preparing technical design specifications based on functional requirements and analysis documents.  Develops and maintains operational and system level documentation.  Adopt new technologies, tools, and methodologies to deliver mission critical, enterprise class systems.  Writing and performing unit testing  Work as part of a dynamic team throughout the software development life cycle(Agile)  Designs multi-tier Web Services application architecture including OOAD (Understanding of Object-Oriented Design: re-use and component-based development), SOA, Relational Databases, LDAP and security integration,  Contribute automated build deploy systems  Develops Use Cases, Sequence Diagrams and Class Diagrams using UML for designing Object Oriented Design for large applications  Be part of a global (multi-site, multi-time zone) team developing applications and providing services. ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Hibernate", "Core Java", "jQuery", "Linux", "SOA", "UML", "XML", "JSP", "Javascript", "Windows"]}