{"Job Title": "Senior Software Development Engineer in Test - Upgrade", "Company": "Hortonworks Inc.", "Experience": "2 - 4 years", "Salary": "Not Disclosed", "Location": "karnataka", "Job Description": " Job Description:         Cloudera offers a data platform that manages and secures the data lifecycle across all major public clouds and the private cloud. The Quality Engineering Team is looking for an exceptionally talented software engineer who can understand the data platform and integration of multiple servicescomponents end-to-end. This team is responsible to work with field and product teams to design customer simulations and ensure a high-quality upgrade experience for our customers.         Requirements      Contribute to engineering efforts for validating majorminor upgrades of the data platform.         Gather requirements from field and product team to replicate the customer environment and validate various upgrade paths.          Provide valuable feedback on the upgrade experience to product teams.         Ability to work across multiple teams to deliver tasks.         Understanding of a variety of big data technologies such as Hadoop, Hive, HBase, Spark, Ranger, Atlas, etc.         Good knowledge of test methodologies, creating test cases, and test plans.         Familiarity with the advanced automated testing framework, tools, and automated test suites, in Python (pytest), Golang, Shell, Java (TestNGJUnit).         Excellent debugging skills to find the root cause of the problem across multiple componentsservices.         Deploying and upgrading software for highly scaled cluster applications, involving thousands of servers, or enterprise applications involving large data centers.       Preferred Qualifications      BSMS in Computer Science or related field.        2-4 years of experience in test development andor automation tools development.        Good communication and collaboration skills.        Ability to work effectively both independently and as part of a team.         Working knowledge of public cloud platforms such as AWS, Azure.      ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "cloudera", "Enterprise applications", "Software Development Manager", "Debugging", "Open source", "Testing", "SQL", "Python", "HBase"]}