{"Job Title": "Software Development (Reporting Solutions)", "Company": "EVERSANA INDIA PRIVATE LIMITED", "Experience": "4 - 8 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad, Pune, Bangalore/Bengaluru, Mumbai (All Areas)", "Job Description": "Roles and Responsibilities Responsible for creating various reports requested by the Client and inter teams.Responsible for the design and creation of data structures to produce reports to make data actionable and facilitate decision making for clients Interacts with customers to understand business and data requirements, and iteratively designs report prototypes for customer feedback. Works with team to identify best means to display data e.g., dashboard, chart, report, tabular, filters, selection options and subsequently build. Utilize traditional and agile methodologies in the report development process Manage and/or coordinate 3rd party resources in the development of reporting and data warehouse solutions Develop an understanding of health care terminology to include clinical quality measures and metrics Desired Candidate Profile 4 to 8 years of designing, developing, and implementing reporting solutions Healthcare background or experience preferred Hand on experience and skills working with reporting suites such as , Tableau, Business Objects, Cognos, Logi, SIIS Experience working with multi-dimensional data sets/databases i.e. Oracle, DB2, SQL Server, Postgres Exposure to Data Warehouse platformsExcellent Analytical skills Excellent verbal, written, and organizational skills Ability to work on a team , as well as independently Ability to proactively research solutions and best practices Ability to debug and problem solve ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Power Bi", "Tableau", "Oracle", "SQL"]}