{"Job Title": "Software Development Engineer II", "Company": "Resource Access Management Solutions Pvt. Ltd.", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Noida", "Job Description": "   Job description     As a team member, you will have the opportunity to play a key role in designing, developing, and innovating together as you bring your considerable software engineering skills to our dynamically growing organization.     Required experience and skills     Genuine hands on Coding experience with 3 to 6 years of experience.   Proficiency in Scala or equivalent programming paradigm for spark-based application development i.e. Java 8, Python etc.   Understanding and clear concepts of functional and object-oriented programming.   Good exposure to work on Agile methodology of software development and exposure on Atlassian suite - Confluence, Jira etc.   Should have experience in designing small modules and full applications.   Sound working knowledge of microservices style of architecture and rest api?s.   Strong skills in Programming and version control processes (git/vcs)   Excellent communication skills, ability to understand the requirements and hand off efficiently to onshore, self-starter and operating independently     Desirable/Nice to Have experience and skills     Exposure to testing frameworks for scala/java like funsuite, Scala test, junit, Jupiter, Mockito etc.   Exposure to any cloud framework like AWS , Azure , GCP.   Familiarity with GIS and Spatial Data Computations and queries   Familiarity with relational and big data tech stack such as Postgres, sqlserver, hdfs, AWS services - S3, EC2, EMR etc. and Spark.   Familiarity with devops tools like git , Jenkins , Docker, Kubernetes etc.   Familiarity with notebook technologies such as Apache Zeppelin or Jupyter   Familiarity in performance measurement, bottleneck analysis, and resource usage monitoring   Concepts and Familiarity in multi-threading and memory management.   ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - eCommerce, Internet Technologies,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["GIS", "Coding", "Application development", "Apache", "Open source", "Risk management", "JIRA", "Monitoring", "Python", "Recruitment"]}