{"Job Title": "Dot Net Software Developer (Full Stack)", "Company": "RiverForest Connections Private Limited", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": "Roles and Responsibilities Role OverviewWe are looking for several talented and experienced C# .NET Software Developers to join our Development Team. Reporting to the Head of Development, the role will require you to have strong and proven skills in modern C# .NET web, API and Front-End development.About YouYou have a minimum of 5 years commercial full-stack .NET software development experienceYou have a minimum of 5 years hands-on experience with relational databasesYou have experience in RESTful service developmentYou have experience with a modern JS framework such as Angular / Vue / ReactYou have experience of working in a SCRUM team / agile frameworkYou have experience with application integrations via web services and APIsYou have excellent communication skillsYou are passionate about software development and pursue this interest outside of your working lifeNice to Have Working experience with .NET core You have experience with Docker and Linux You have experience of using Vue.Js You have knowledge/experience with AWSWe’re looking for people that will get stuck in and make a difference. We have a great collaborative, entrepreneurial team that are passionate about what they do. If you want to join a team that is changing people’s lives for the better then we’d love to hear from you.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization, BCA in Computers, B.Sc in Computers", "PG": "Post Graduation Not Required", "Doctorate": "Doctorate Not Required", "Key Skills": ["C#", "Web Technologies", "React", "Angular", "Rest", "Full Stack Developer", "Front End", "C#.Net", "Javascript", "Agile", ".Net", "Scrum", "MVC"]}