{"Job Title": "Senior Software Developer (Full Stack) | Education Loans Fintech", "Company": "Unnati", "Experience": "2 - 7 years", "Salary": "₹ 7,00,000 - 17,00,000 P.A. ", "Location": "Noida, Gurgaon/Gurugram, Delhi / NCR", "Job Description": "Roles and Responsibilities To get transparent and quick status update, apply on :https://rb.gy/lmvtclDo you wish to be a part of a disruptive team, passionate towards democratizing education for students across India? Then read more.Our client is an expert in education financing and counselling related to higher studies abroad. They help students to understand about scholarships in various colleges abroad, whether they are eligible and how to apply for such esteemed institutions. Their dedicated page enlists every scholarship available across the globe, apart from other facilities required by students like visa counselling, forex, accommodation, Peer contacts etc.They also offer the best resources for exams like IELTS, TOEFL and GRE apart from organising webinars and events to connect with industry experts, alumni and fellow students - that helps to prepare for these travels, loans and more. Partnered with the most prominent Banking and non-banking financiers, the team is led by FinTech-experienced IIT Kanpur alumni, passionate about offering sustainable financial offerings.As a Sr Software Developer (Full stack), you will be part of the product development team.What you will do:Improving customer experience, not only for borrowers, but also other partners on the platformEnsuring seamless integration with data/ service providers and lending partnersWhen not doing any of above, writing tests to prevent any regressionsDesired Candidate Profile What you need to have:Full-stack development experienceExperience with Ruby on RailsSelf-starter: Someone who can develop independentlyPassionate about problem solving, ability to see the big pictureRealizes the value of 80-20Regular participation on Codechef, Topcoder etc. (If yes, please cite your rank and pass on a link to your profile!)Prior experience at a bank / fin-tech / non-banking financial player in a technical roleRuby on Rails, Postgres, AWS, jQuery", "Role": "Software Developer,", "Industry Type": "Banking, Financial Services, Broking,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "Doctorate Not Required", "Key Skills": ["Code writing", "Software Development", "Ruby on Rails", "jQuery", "Platform integration", "Full stack", "Codechef", "product development", "Postgres", "Topcoder", "AWS", "Testing"]}