{"Job Title": "Software Developer", "Company": "Advanced Computer Software", "Experience": "1 - 4 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   Role: Software Engineer      We re Advanced    Join a business that embraces innovation, gives you the scope to seize every opportunity and will help get you where you want to go. Life at Advanced begins in an unprecedented environment with a role that matters, taking you on a fast-paced journey of discovery, however big that might be.   We are one of the UK s largest and fastest growing software companies. True partnership is the defining thing that makes us different from the competition. We pride ourselves on delivering focused software solutions for public sector, enterprise commercial and health & care organisations that simplify complex business challenges and deliver immediate value.    A proven full stack Developer with 4-6 plus years of strong technical experience in development of cloud-based solutions using AWS/.Net/Javascript tech stack. He/She required to work for a product in Healthcare Domain.    Responsibilities include     Work with development teams, product owners and product managers, subject matter experts/architects to implement software solutions     Provide Design solutions/ideas related to client-side and server-side architecture     Develop components as required to meet sprint / release goals     Build frameworks that can be adopted by applications     Work with all stakeholders like PE, Architect and Devops teams to ensure all tools are configured (CI/CD/Automation) and technical challenges/dependencies are addressed     Understand functional/business requirements through user stories and translate into technical requirements and implement accordingly.     Develop and manage well-functioning database/data as a service     Write effective APIs, Troubleshoot, debug and upgrade software     TDD , Test software to ensure responsiveness and efficiency     Create security and data protection settings     Write technical documentation as required     Key Skills     Implement Automated CI/CD processes using Jenkins, Harness tools     Develop frameworks with SaaS as mindset     Front end: HTML 5, CSS, Advanced JavaScript, Ajax, Angular JS, jQuery, Bootstrap,     Server side / Framework: .Net 4.x, C#, VB.net, Rest API, Webservices     Cloud: AWS, S3, API Gateway     Database: Sql Server 2012 and above     Tools: Git/GitHub, SonarQube,     Secondary Skills    Agile, Jira, Pair programming,   Good communication skills   Analytical and efficient Development skills   .NetCore , React Js ,MongoDB will be added advantage ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Automation", "Web services", "jQuery", "Front end", "TDD", "Javascript", "Agile", "JIRA", "Ajax", "Technical documentation"]}