{"Job Title": "Software Development Engineer IV - Seller Engagement", "Company": "Tophatter", "Experience": "2 - 6 years", "Salary": "Not Disclosed", "Location": "India", "Job Description": " Software Development Engineer IV - Seller Engagement    Remote, India /   Engineering & Product Engineering /   Full-time     We're looking for a highly motivated, strong, experienced lead software engineer to join and lead our small and growing Seller Engagement team in India.   The Seller Engagement team's mission is to build, shape and scale the Tophatter platform for our sellers all over the world to enable them to they can sell anything, and build and control their business with sustainable economics. The team works in tandem with other teams globally, who're focused on the buyer side of the business.     We are a fully remote team, distributed all over the country (Andhra Pradesh, Karnataka, Maharashtra, Tamil Nadu and Uttar Pradesh).  Required experience and skills    Bachelors degree in Computer Science and Engineering. Bonus: Masters degree.     9+ years of total full-time work experience, preferably shipping SaaS applications.     Startup experience strongly desired.     Played a pivotal role in scaling a company and led teams in an agile environment where iteration has led to perfection.     Proven track record of on time project deliveries with balanced calls on technical designs and tech debt.     Expert proficiency in:     1. Ruby, Ruby on Rails, Mysql, Linux, Git, AWS, CI/CD, NewRelic.     2. broad range of internet technologies and applications.     3. interacting, building, and improving the performance of systems end-to-end.     4. architecting/designing complex systems     Strong collaborator and thought partner to Product team.     Driven by outcomes more than output.     Have led projects with small, dynamic, and fast-paced teams (3-5 engineers), with great flexility and adaptability on large projects, delegating working effectively.     Viewed by the team as their evangelist, role model and bar raiser. Past teams and co-workers attest to your prowess & agility in building great products, and driving sound technical decision making.     Mentored engineers within and outside own team.     High on EQ, humility, curiosity and self drive.   Responsibilities    Your responsibilities include:     Leading completion and delivery of multiple concurrent projects with clear deliverable timelines and milestones     Providing key input and guidance in helping to solve our most difficult and challenging issues, and providing recommendations for preventing or mitigating the effects of the issues in the future     Identifying inconsistencies caused by lack of best practices and patterns, and proactively collaborate with the team to gather input to define and rollout new best practices     Mentoring other engineers on increasing their impact both within and outside of their team, including identifying opportunities for them to do so     Participate in shaping longer term technical and architectural goals in consideration of product/company strategy, organizational growth, scalability, security, and other factors  ", "Role": "Software Developer,", "Industry Type": "Internet, Ecommerce,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "SAN", "GIT", "Architecture", "Linux", "MySQL", "Venture capital", "Agile", "Silicon", "Merchandising"]}