{"Job Title": "Software Engineer, Full Stack Developer", "Company": "Cardinal Health", "Experience": "0 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru, Bangalore", "Job Description": "  What Software Engineering contributes to Cardinal Health      Software Engineering is responsible for designing, developing, implementing and supporting applications, systems and IT products required to achieve the company's business objectives.   Demonstrates knowledge of software development techniques and fluency in software languages and application programming interfaces.  Demonstrates general understanding of hardware/software platforms including but not limited to operating systems, databases, application servers, web servers and integration technologies.  Plans and executes system implementations that ensure success and minimize risk of system outages or other negative production impacts.  Demonstrates conceptual knowledge of architecture standards and database and operating systems.  Demonstrates problem solving ability that allows for effective and timely resolution of system issues including but not limited to production outages.  Analyzes production system operations using tools such as monitoring, capacity analysis and outage root cause analysis to identify and drive change that ensures continuous improvement in system stability and performance.  Demonstrates knowledge of software development, life cycle, modeling of business processes, application design patterns, business/functional documents. Estimates to high level business requirements and provide options analysis.  Be a hands-on individual contributor, who can design solutions, code, automate and review the deliverables of other team members.  Design and develop Backend APIs using restful services and front-end application  Participate in all phases of the software development lifecycle applying best practices and Agile software development methodologies.  Understand and meet business needs with respect to functionality, performance, scalability, reliability, and adherence to development principles and product goal  Collaboratively work with various cross-functional teams across the globe.  Teach and mentor fellow engineers, and work to foster an environment of development and inclusivity     Qualifications     Degree in Computer Science or a related field  6+ years as a software developer  Great communication skills and an ability to work and lead a team  Expert programming skills in Java and JavaScript and expertise in API and Web development.  Experience with Cloud native technology and processes, including CI/CD pipelines and supporting technologies like Cloud Foundry, Concourse, dockers and Kubernetes is preferred  Exposure to modern web technologies such as Angular/React, Java, Spring Boot, Node.js  Experience with Commerce tools, API products, Adobe Experience Manager and IBM WebSphere products is a big plus.  Exposure to eCommerce and healthcare domain is a plus       What is expected of you and others at this level     Applies comprehensive knowledge and a thorough understanding of concepts, principles, and technical capabilities to perform varied tasks and projects  May contribute to the development of policies and procedures  Works on complex projects of large scope  Develops technical solutions to a wide range of difficult problems. Solutions are innovative and consistent with organization objectives  Completes work independently receives general guidance on new projects  Work reviewed for purpose of meeting objectives  May act as a mentor to less experienced colleagues    Cardinal Health is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status.  ", "Role": "Software Developer,", "Industry Type": "Medical, Healthcare, Hospitals,", "Functional Area": "IT Software - eCommerce, Internet Technologies,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["Java", "CI/CD pipelines", "Fullstack Developer", "API"]}