{"Job Title": "Senior Developer, Custom Software Development", "Company": "Uniphore", "Experience": "4 - 9 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  As the Senior Developer for the custom development team, you will closely work with the global delivery heads and clients to understand their unique business requirements and translate them into technical requirements. You will then plan and deliver the requirements ensuring high quality and performance. The requirements can range from custom utilities for data processing to developing internal tools, technical interfaces, process automations and bespoke integrations between Uniphore products and client systems    You will oversee the daily activities of the junior developers and provide direction and guidance as needed. You will be required to learn new tools and technology as needed to meet the development requirements.    We are looking for a hands-on dynamic individual who can lead with example and has a strong technical development background with a demonstrated track record of managing engineering teams.       Your Responsibilities     Partner with stake holders locally and globally, collaborate with peers and technology management.    Own technical (solution) development and delivery    Understand unique business requirements from clients and internal stakeholders and translate them into technical requirements    Design the workflows and tech stack for the custom solutions/ integrations    Ensure projects/ requirements are delivered with high quality and efficiency    Work towards zero defect releases    Drive delivery and process excellence    Adopt best practices for software development, Dev-Ops, Agile adoption and security.    Write reusable code and libraries.    Help in implementing firms cloud strategy for the program.       Your Qualification     4 + years of appropriate technical experience    Expertise in Java, Javascript, Python, Postgres, MongoDB    Experience building SaaS products    Experience driving large customization and integration projects    Experience working in an agile environment    Experience and knowledge of writing testable and high-quality code    Experience with microservices and containerization    Certifications: ITIL v3 or higher    Knowledge of PCI DSS or ISO 27001 or GDPR compliance policies    Ability to quickly learn and apply new tools and applications    Solid written and verbal communication skills    Proactive and results-oriented, with strong prioritization skills    Detail oriented and diligent    Ability to handle multiple tasks and work toward long-term goals    Programming/ Scripting experience in    o PHP, Python, Java, JavaScript, Unix Shell    o Web services    o Microservices    o Containers (Docker)    o Database such as Postgres, SQL Server, MongoDB database    o Servers like Tomcat Apache, WebLogic    In-depth knowledge of agile methodologies    Experience developing automations using Python, Ansible, Java, Jenkins etc.    Experience with cloud services, SaaS models, and client-server systems.    Knowledge of software architecture and design methodologies    Adaptability willingness to work in a fast paced environment and continuously upskilling and learning new technologies    Hands-on Data Mining, Data Science, and analytical work experience    Experience working with AI/ML solutions    Domain expertise -    Contact center domain expertise exposure to commonly used CRM/ ERP and contact center management solution   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Unix", "ERP", "Automation", "Weblogic", "Javascript", "Agile", "PHP", "Analytics", "CRM", "Python"]}