{"Job Title": "Software Developer- Embedded/Linux Software", "Company": "Signify", "Experience": "5 - 8 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "   Job Description     We are     Cooper Lighting Solutions - Color Kinetics. We build forward-thinking lighting solutions that make people s lives safer, while making buildings, homes and cities smarter and more sustainable. We deliver an industry-leading portfolio of indoor and outdoor lighting, lighting controls and smart lighting systems.      Cooper Lighting Solutions - Color Kinetics is a business unit of Signify, the world leader in lighting. Together we have a shared purpose to unlock the extraordinary potential of light for brighter lives and a better world.      Working as an Embedded Linux Engineer at Signify is dynamic. You ll be working on latest technologies with Embedded Linux platform. We re greater together through peer learning in our globally diverse team, with different backgrounds and nationalities. We re looking for an Embedded Linux Engineer who ll be responsible for understanding the product requirements, design, development and test back-end software for Lighting Products.    You ll be part of the Signify Connected Systems and its responsibilities are building IOT based Smart Lighting products , so Problem Solving, Taking ownership, Accountability, Drive for results must be in your DNA.       What you ll do        Drive innovation in Controller Devices for Connected LED Lighting Systems.    Architect, design, implement, debug and solve problems in embedded Linux devices.    Design distributed architecture to be able to connect and scale the embedded Linux devices into a complex connected system.    Evaluate and provide recommendations on trends in industry on embedded Linux devices.    Active participation in Code Reviews, Code Quality Analysis, Security Risk Analysis, Build Management and Documentation.    Ability to work with multiple disciplines of system including hardware, firmware, optics, cloud and mobile devices.    Active participation in Agile Software Development Process.        What you ll need        Bachelor s/ Master s or PhD in Engineering, Computer Science or related technical discipline.    5 - 8 years of relevant work experience in software development.    Proficient programming skills in one or more of programming languages - C++, Python, SQL, Java or C#    Demonstrated expertise in three or more of the following : Customized Linux Distro - buildroot, yacto etc, Secure network infrastructure - TLS, SSL, SSH; Shell Scripting, Web Servers - Nginx, Apache, etc; Linux Kernel Fundamentals; Bootloaders - GRUB; Disk Management, File Systems, etc.    Demonstrated experience in software development tools. IDEs like Qt Creator, Visual Studio, Eclipse; Code quality tools like SonarQube, Coverity; Build tools like Make, GCC, Jenkins, Maven Ant; Source Control tools like Git, SVN, ClearCase.          What you ll get in return        Competitive salary depending on experience    Extensive set of tools to drive your career, such as a personalized learning platform, free training and coaching    Opportunity to buy Signify products with discount       ", "Role": "Software Developer,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - Embedded, EDA, VLSI, ASIC, Chip Design,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["C++", "Eclipse", "Linux kernel", "Shell scripting", "Agile", "Firmware", "Visual Studio", "Apache", "SQL", "Python"]}