{"Job Title": "Systems Engineer - Full Stack Software Developer", "Company": "T & A Solutions", "Experience": "3 - 7 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": " Experience Range : At least 2 years of relevant experience   Core Responsibilities:    Develop visually appealing front-end website/application architecture, including translating designer mock-ups and wireframes into front-end code.   Design user interactions   Develop functional databases, applications, and servers to support websites/applications on the back end.   Ensure cross-platform optimization for mobile.   Develop and design RESTful services and APIs.   Stay abreast of developments in web applications and programming languages.   Stay current and provide insight on cutting edge software approaches, architectures, and vendors.   Ensure that non-functional requirements such as security, performance, maintainability, scalability, usability, and reliability are being considered when architecting solutions.   Keep job knowledge up to date by studying new development tools, programming techniques, and computing equipment; participating in educational opportunities; reading professional publications; maintaining personal and professional networks; participating in professional  organizations.    Mandatory Technical skills:    Fluent in Angular (versions 8 and up), CSS (Foundation or Bootstrap), JavaScript and HTML, with an understanding of CSS preprocessors including Sass and LESS.   Strong knowledge of Linux, PHP and MySQL, with working understanding of MySQL and Node.js.   Experience working with Java.   Working experience as a full stack developer.   Experience working with server technologies such as Apache, ISS, Node.js, Nginx and J2EE.   Experience in API design and development.   Understanding of libraries including Angular and jQuery.   Experience with AJAX.   Strong knowledge of data structures, system design, and algorithms    Good to haves:    These are not mandatory requirements but will give additional weight to the resume.   Some hands-on experience with other technologies and frameworks like python, .NET/C#.   Some hands-on experience in using APIs from third party systems like Google Maps, Microsoft Power BI or SAP etc.   Some hands-on experience with Cassandra or MongoDB   Some hands-on experience with Windows servers   Some hands-on experience in developing applications for Windows, Linux and MacOS  ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["SAP", "jQuery", "Linux", "MySQL", "Javascript", "PHP", "J2Ee", "HTML", "Windows", "Ajax"]}