{"Job Title": "Software Developer - Java ", "Company": "Lenskart.com", "Experience": "4 - 7 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  Majo    r Responsibilities:      Translation of complex functional requirements into technical requirements, implementing and maintaining a coherent and progressive development strategy for our product line      Design, develop and maintain complex systems using best of the breed development practices and technology.      Responsible for the over-all software development life cycle.      Delivery of High Quality, Scalable and Extensible systems and applications on-time and on-budget.      Adoption and Evolution of the software engineering practices and tools within the organization      Keep in sync with the latest technology developments and open source offerings. Evaluate and adopt them for solving business problem of organization.      Collaborate with other technology and business teams within the organization to provide efficient robust solutions to the problems.      Drive and manage the bug triage process      Report on status of product delivery and quality to management, customer support and product teams.      Desired Skills      Strong programming, debugging, and problem-solving skills      Strong understanding of data structures and algorithms      Sound understanding of object-oriented programming and excellent software design skills.      Good experience of SOA/Microservices/Restful services and development of N-tier J2EE / Java   Springboot applications (API s)   .      Strong understanding of database design and SQL (mySql/mariaDB) development      Good to have knowledge of NoSQL technologies like   MongoDB   , Solr,   Redis   , Cassandra or any other NoSQL database      Knowledge of design patterns and good to have experience of large-scale applications      Should have experience in Apache   Kafka   , RabbitMQ or other Queueing systems.      Ideal Experience      4 to 7 years of industry experience.      Bachelors or Master s Degree in Computer Science/ IT      Drive discussions to create/improve product, process and technology      Provide end to end solution and design details      Lead development of formalized solution methodologies        Passion to work in startup like environment      Personal Characteristics      Passion and commitment      Strong and excellent software design intellect      High integrity      Self-starter   ", "Role": "Software Developer,", "Industry Type": "Internet, Ecommerce,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Software design", "SOA", "Database design", "MySQL", "Debugging", "Data structures", "Apache", "Open source", "Analytics", "SQL"]}