{"Job Title": "Software Developer III", "Company": "Grofers", "Experience": "5 - 9 years", "Salary": "₹ 25,00,000 - 40,00,000 P.A. ", "Location": "Gurgaon/Gurugram", "Job Description": "Work from home option available :About Grofers:Having launched in December 2013, Grofers is now the 5th largest organized groceryretailer in India with operations in 16 cities. Grofers became the largest e-grocer in thecountry with an annualized GMV run-rate of $700mn on the back of its flagship eventGrand Orange Bag Days in August 2019. The online grocer also runs the largest grocery membership program in the country called Smart Bachat Club and has over 1.2 million transacting users a month. Grofers is now foraying into the offline retail space through a partnership with neighbourhood kirana stores which would allow the e-grocer to further disrupt the category and open up a new source of growth with an Omni-channel strategyMarquee investors in the organization are Softbank Vision Fund, Tiger Global andSequoia Capital.About the Consumer TeamBeing in the consumer organization, we focus on consumer - generating demand, shopping experience and how to be profitable while delivering value to our customers. We build scalable systems which help us handle different amplitudes of demand during various sales and events. We have a modern tech stack and the teams work with an agile mindset and are strongly aligned with business outcomes. With each team, you get the autonomy and the tools to work on product features and experiments, take them to your users in a short time and use data to see the effect of your work. We are here to build a world-class tech organization with elite engineers and change-agents who would help us get there. We are looking for engineers who are skilled, passionate, driven and a wee bit crazy (yes, crazy works!) to join our G-Ship.Here's our primary Tech Stack - Micro Services, Kubernetes, Python, Flask, Golang, ElasticSearch etcObjective of the role:We are looking for seasoned engineers who are product thinkers, quality conscious, business cognizant and smart  not mere coders.In this role, you will be responsible to drive innovation in full-stack product development, while relentlessly improving performance, scalability, quality, and maintainability.Lead multiple teams and build creative technology solutions that positively impact millions of customer.Role & ResponsibilitiesWork with product managers in developing a strategy and road map that helps the teams to achieve their business goals.Work closely with senior engineers to develop the best technical design and approach for new product development.Drive technical roadmap of the team in collaboration with Engineering and Product.In still best practices for software development and documentation, assure designs meet requirements, and deliver high-quality work on tight schedules.Translate business requirements into technical solutions, recommend alternative technical and business approaches, and lead engineering efforts to meet aggressive timelines with optimal solutions.Operational Excellence - Monitoring & Operation of production services.Career management and development of direct reports.Works with teams to create OKRs.Research, design and build highly reliable, available and scalable platformsLead by example, mentor and guide team members on everything from structured problem solving to development of best practices.Platformize components as libraries, utilities and services and promote reuse.Conceptualize and develop prototypes quickly.Desired Skills & abilities:Experience - 5+ years in Backend/Full stack development.Knowledge of professional software engineering practices & best practices for the full software development life cycle, including coding standards, code reviews, design patterns, source control management, build processes, testing fundamentals.Expertise in any database, distributed  system, queueing system.Capable of industry research and R&D on emerging technologies.Software development experience in building web services, distributed systems, and highly scalable applications.Strong technical, analytical and quantitative skills with the ability to use data and metrics to back up assumptions, recommendations and drive decisions.Ability to work in a fast-paced environment where continuous innovation is desired.Able to define and articulate the ROI of an engineering project.Contributions in Open Source, GSOC projects are a plus.                                                                                                                                                   Tech expertise to own the best practices for project management in an agile development framework.Substantial experience in building complex and scalable solutions.                                                                                                                                                                       Excited? You will be, once you visit our Engineering Blog where you can deep dive into all the cool stuff that our engineers have been working on", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["java", "ElasticSearch", "Kubernets", "pyth", "Microservices", "Flask"]}