{"Job Title": "Software Developer", "Company": "Corpow Solutions", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Job Description We are seeking a highly skilled Senior ASP.NET/ VB.NET/ PHP/ MYSQL/ SQL SERVER developer with a strong background in building Scalable,  predictable,  high- quality and high- performance web applications on the Microsoft technology Stack. As a Developer,  you will be responsible for building and maintaining internal and external facing web applications. This person will work with a team of experienced analysts,  developers and business resources to build highly- performing enterprise systems that improve clinical outcomes and increase staff productivity and financial performance. Build new systems with .NET 4.0 /  ASP.NET /  VB.NET /  PHP /  MYSQL / SQL Server 2008 /  WCF Web Services /  WCF Data Services. Develop new functionality on our existing software products. Lead/ mentor developers and share knowledge through knowledge- sharing presentations. Participate in a small,  experienced,  energetic team on a rapid,  agile development schedule. All other responsibilities as assigned Skills /  Attributes Required Three  ( )  yearsrsquo experience with ASP.NET/ VB.NET. Two yearsrsquo experience on PHP and MY SQL Fresher can also apply At least one year exposure to Database architecting. Two  ( )  years working with SQL Server  (2005/ 2008 preferred) . Deep knowledge of the .NET 3.5/ 4.0 Framework,  including Visual Studio 2008,  VB.NET,  ASP.NET,  ASMX and WCF Web Services,  and ADO.NET. Strong knowledge of software implementation best practices. Strong experience designing and working with n- tier architectures  (UI,  Business Logic Layer,  Data Access Layer)  along with some experience with service- oriented architectures  (SOA) . Ability to design and optimize SQL Server 2008 stored procedures. Ability to adapt quickly to an existing,  complex environment. Ability to quickly learn new concepts and software is necessary. Candidate should be a self- motivated,  independent,  detail oriented,  responsible team- player and exhibit exceptional relationship management skills. Passionate about building high- quality systems with software implementation best practices. Knowledge in software design,  object- oriented design and implementation techniques and n- tier application design;   thorough understanding of design patterns and their application in software development. Practical experience designing and implementing .NET- centric,  service- oriented architecture  (SOA)  solutions and publicly- facing web services. Understanding of UML and the creation and maintenance of project work products including use cases,  data flow charts,  process flow diagrams,  software requirements document,  functional specifications document,  etc. Experience with database design,  architecture,  and implementation;   in particular,  such design,  architecture,  and implementation in support of n- tier .NET application architectures. Familiar progressive SDLC automation concepts such as continuous integration. Excellent interpersonal,  communication,  and organizational skills are absolutely required Education:  Bachelor's degree in Computer Science,  Software Engineering or a related area is preferred ,  MCA. Microsoft certifications are a plus. ", "Role": "Software Developer,", "Industry Type": "Media, Entertainment, Internet,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Any Postgraduate in Any Specialization, MCA in Computers", "Doctorate": "None", "Key Skills": ["software development", "automation", "soa", "uml", "design patterns", "php", "mca", "wcf", "sdlc", "sql"]}