{"Job Title": "Software Developer", "Company": "Spectrum Consultants India Pvt Ltd.", "Experience": "1 - 5 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "     JD :      We are searching for a highly motivated, creative engineer with experience in system software to join the GPU Software team. As someone who is hardworking and passionate about their work, you will design key aspects of our production GPU kernel drivers and embedded SW. You should demonstrate the ability to excel in an environment with complex software and hardware designs.      What youll be doing:        Define, design, develop and verify features for our GPUs; collaborating with hardware engineers and fellow software engineers.     You will follow the devices all the way through the development process to the customer desktops, notebooks, workstations, and gaming console products that are used throughout the world.     Heavily involved with the early modeling and simulation required to produce our world-class products.     Multiple opportunities to collaborate and communicate effectively with teams from all around the globe.      What we need to see:      BS or MS degree or equivalent experience in Computer Engineering, Computer Science, or related degree.     Strong C programming skills as well as having shown initiative in pursuing    independent coding projects.     Familiarity with computer system architecture, microprocessor, and microcontroller fundamentals (caches, buses, memory controllers, DMA, etc.).     Kernel experience with Linux, Android, Chrome, or Windows systems.     1- 5 years of meaningful software development experience.     Ways to stand out from the crowd:     Background and strength with complex system-level debugging is invaluable.     Deep understanding of memory management and virtualization concepts.     Familiarity with kernel level security concepts.     Experience with embedded system SW concepts, e.g.: RTOS and overlay programming models.       It is widely considered to be one of the technology world s most desirable employers.      We have some of the most forward-thinking and hardworking people on the planet working for us. If youre creative, passionate and self-motivated, we want to hear from you!     We are leading the way in groundbreaking developments in Artificial Intelligence,      High-Performance Computing and Visualization. The GPU, our invention, serves as the visual cortex of modern computers and is at the heart of our products and services.    ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["RTOS", "Computer science", "System architecture", "Linux", "Coding", "Debugging", "Windows", "Virtualization", "Gaming", "Android"]}