{"Job Title": "Software Developer ( ios)", "Company": "Taurus Hard Soft Solutions Pvt. Ltd.", "Experience": "2 - 4 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Company Description Taurus Hard Soft Solutions Pvt Ltd. is a Private Limited Company. \"Technology &   Service at your Reach\"- That is more than just a slogan at 'Taurus'.It's how we do business day after day. Our company is based on a philosophy that technology and service was invented to make life easier. We are a dedicated Hardware and Software Solutions Provider,  providing complete solutions to Research &   Development Organizations,  Defence,  Government,  Educational Institutions &   Corporate. Taurus can be broadly classified as an Independent Hardware Vendor (I &   Independent Software Vendor\n\nJob Description \n\nExperience\n\n- 2-  4 years\n\nSkills \n\n-  Expert in iPhone application development.\n\n-  Experience utilizing APIs for building native mobile applications\n\n-  Experience developing and implementing user interfaces for cross- platform mobile environments\n\n-  Hands on experience Objective c.\n\n-  Strong hold on Design Patterns.\n\n-  Strong analytical,  problem solving,  multitasking,  and time management skills with consistent attention to detail\n\n-  Ability to effectively learn and use new programming concepts,  tools,  and methodologies to support the needs of the business\n\n-  Ability to read,  interpret specifications,  and perform tasks with a high level of competency and autonomy\n\n-  Ability to effectively communicate technical issues and solutions\n\n-  Knowledge in agile development teams a plus\n\n-  Need Excellent coding Skill \n\nQualifications B TECH /  MCA \n\nAdditional Information IT IS AN URGENT REQUIREMENT . Those who are serving the notice period can apply .\n\nWill offer Other fringe benefits\n\nI'm interested", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["benefits", "objective c", "interfaces", "design patterns", "mca", "application development"]}