{"Job Title": "Software Developer", "Company": "Syncron International AB", "Experience": "2 - 4 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   Job Department   - Products   Job Description    Design, develop and deploy microservices with focus on high availability, low latency and scalability.   Developing across the full stack of Web technologies - Persistence, Services, Platform, Performances, and with a focus on great experiences.   Deliver maintainable, robust and testable code.   Designing and implementing software that is simple, intuitive and easy to use with a platform development mindset to solve real-world problems.   Collaborate with test engineers to define and write automated and manual tests to deliver a fully tested, high-quality services.   Work in an environment that supports your individual growth   Collaborate with both technical and business team members to understand requirements and develop solutions using an agile development process.   Drive a high standard of excellence for service scalability, and performance.    Required     2-4 years of development experience, 2 years of Java and web technology experience.   Very Strong experience in object-oriented design and analysis, design patterns and best practices   Deep understanding of Web technologies, Microservices and databases.   Experience with Maven/Gradle, Spring Boot, Hibernate/JPA, JAX-RS   Experience with RDBMS Databases Postgres, MySQL   Experience in using AWS cloud services such as EC2, S3, Lambda, ECS, API Gateway   Experience with RESTful web-services and event-driven architectures.   Experience with front-end web technologies frameworks like PWA, Micro-frontends, React.js, Vue.js, Angular   Experience building multi-tenant systems, techniques and approaches   Knowledge of debugging, profiling tools and techniques for JVM based applications.   Knowledge of writing infrastructure as code using Terraform    Ability to write automated unit, integration or functional tests that verify system expectations.           ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Order management", "Business process", "Object oriented design", "Maven", "Hibernate", "Front end", "RDBMS", "MySQL", "Debugging", "JPA"]}