{"Job Title": "Software Developer", "Company": "Cresc Datasoft Private Limited", "Experience": "2 - 7 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Software Developer Your supply chain back office Minimize risk,  improve forecasting and reduce costs to create a supply chain that works for you. Our BPO Supply Chain Management solutions can take you there. Read More Our deep insight,  knowledge experience in all aspects of global supply chain management will make you the winner. Read More File Maintenance Style /  Color /  Size master,  Customer Bill to,  Ship to,  DC,  Sales Terms file Read More Invoice Processing Sales Order /  Data Entry,  Pick Tick Creating /  Allocation Read More Accounting /  Bookkeeping Accounts Payable Accounts Receivable General Ledger Financial Statements Use your own infrastructure We will do the work write/ up We can use your existing system We can handle all your transactions remotely You can save substantially on employees and other associated expenses like insurance,  real estate,  etc Retailer Compliance Check Packing Instructions Tags/ Labels/ Markings requirements Any other compliance requirements Co- ordination with other entities Frt broker Factory Misc. suppliers (Labels,  tags,  trims,  supplies etc) Career Looking for exciting career opportunities We are hiring for below positions AR Collections Specialist Supply Chain Executive Software Developer Order Processing Associate Analyst Finance Accounts Analyst Supply Chain Management Customer Service Executive System Administrator Job Position: Software Developer /  Programmer We currently have an excellent opportunity for Software Developer /  Programmer to join our team. We are looking for talented people who will help in developing next breakthrough ideas. At a strategic level,  our development team will be instrumental in shaping the product direction and will be actively involved in defining key product features that impact the business. Job Description /  Responsibilities :-  Work closely with senior managers to design,  implement and deploy applications. Own the delivery of an integral piece of a system or application. Management and execution against project plans and delivery commitments. Create and execute appropriate quality plans,  project plans,  test strategies and processes for development activities in concert with business and project management efforts.", "Role": "Software Developer,", "Industry Type": "Oil and Gas, Energy, Power, Infrastructure,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["BPO", "Supply chain management", "jQuery", "MS Access", "Project management", "MySQL", "PHP", "HTML", "SQL", "Data entry"]}