{"Job Title": "Software Principal Engineer (Automation Lead Developer)", "Company": "Dell International Services IndiaPrivate Limited", "Experience": "10 - 14 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Software Principal Engineer (Automation Lead Developer)About Business Unit:Our Client Solutions Engineering team ensures that our customers have the software systems they need for a changing world. Working at the cutting edge, we design and deliver software systems modifications as well as enhancements of new products. We oversee product development at all stages: planning, designing, developing and testing of software and hardware products.This position is for Software Automation Lead Developer in Dell Client Product Group, Bangalore. The team tightly integrated with most of the development organizations, including platforms, OS engineering, systems management, cloud, and Telemetry. This position works very closely with its US, China, Taiwan counterparts: Engineering, Marketing, Quality, Product test, support, and core teams.Key Responsibilities: Automation Lead will be responsible work closely with Architect for driving end to end automation strategy for respective client software team.Demonstrate Strong technical hands-on skills in the following competency areas – Selenium, RestAPI, C#, Python/Java and PowerShell and Automation Frameworks; Intergration with CI/CD pipelinesGood knowledge about business and process know-how in line with Automation.Good knowledge at understanding and analyzing the trends in Automation industry (End to End Automation) Good knowledge latest technologies in Automation & Control industry such as IoT, Cyber Security, Cloud, etc.Ability to discuss complex technology and work with the team to implementMentoring skills – ability to build, groom, and lead a teamEssential Requirements: 10 - 14 years of related experience on implementing automation frameworks from the scratch using pytest, TestNg, Junit.Should have worked on developing test automation frameworks(either TDD or BDD)Must have experience working on API automation (REST + python preferred).Must have of experience working on automation development using any programming language preferably python.Must have experience working on UI automation using Ruby or Selenium(either Java/Python).Should have worked previously using tools like Git/Rally or any equivalent Agile tool.Desirable Requirements:Knowledge in network infrastructure, security, and application development.Knowledge of technology solutions and ability to learn, understand, and work quickly with new emerging technologies, methodologies, and solutions in the Cloud/IT technology space.BS or MS Engineering degree in Computer Science/IT/Electronics/Electrical Engineering", "Role": "Team Lead/Technical Lead,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - QA & Testing,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Sc in Electronics, Computers, B.Tech/B.E. in Electrical, Electronics/Telecommunication, Computers", "PG": "MS/M.Sc(Science) in Computers, Electronics, Electrical Engineering", "Doctorate": "None", "Key Skills": ["Java", "Bdd", "TDD", "Testng", "Pytest", "Ui Automation", "Automation Testing", "Selenium", "Rally", "Ruby"]}