{"Job Title": "Software Applications Developer - C#/.net/asp", "Company": "Career Infosystem", "Experience": "5 - 8 years", "Salary": "Not Disclosed", "Location": "Noida, Delhi / NCR", "Job Description": "SKILLS : - 5+ years of IT experience in analysis, design, development, implementation and testing of web and desktop based multi-tier applications in CRM, Social Analytics, E-learning, MiddleWare components and search engine domains. - Experienced in unit testing of complex web applications (back-end) and the concepts of Test Driven Development (TDD) - Experienced in all phases of software development life cycle (SDLC) - Feasibility study, Project Analysis, Requirements, Design, Development, Testing, Documentation, UAT, Deployment and support - Technical expertise in Microsoft Technologies such as .Net Framework (2.0/3.5/4.0/4.5), ASP.Net, C#, WCF, AJAX, ADO.NET,JQUERY,KNOCKOUT.JS, angular.js and MVC architecture - Hands on experience in developing robust highly scalable applications using ASP.NET using MVC Architecture. - Have expertise in technical design documentations using Object-oriented analysis (OOA), Design (OOD) and agile methodologies - Developed Data Access Layer (DAL), Business Logic layer (BLL) also in implementing Business Processes, Abstract factory as part of Service Oriented Architecture (SOA). - Knowledge in Design Patterns like Singleton, Abstract Factory, Dependency Injection - Expert in developing N-Tier application with Custom Control, User Control and Provided Rich Functionality. - Good experience on web using Java Script, jQuery, jSON, IIS, Master pages and CSS. - Hands on experience in developing and consuming XML Web Services using WSDL and SOAP. - Knowledge on Datawarehouse tools like SQL Server Integration Services, SQL Server Analysis Services - Experience with Model-View-Controller (MVC), Model-View-View-Model(MVVM) architecture - Created Entity classes, relationships between entity classes using LINQ (Language Integrated Query) to SQL to manage relational data as objects. - Experience in implementation of Migration projects . Eg: Migrating Application from MS-Access to websites with MVC with Asp.net, JQuery - Hands on experience in using Web Server - IIS - Consumed ADO.NET components like Data Adapter, Dataset to perform data operations. Extensively used ADO.NET to implement the data layer to communicate with different databases. - Created Stored Procedures to extract data for generating reports by using SQL Server 2005/2008 Reporting Services (SSRS), Triggers, Indexes and Views for performance tuning and retrieval of data and BI. - Had experience in build automation, publishing build using Visual Studio - Good Experience in managing SDLC using TFS - Experience in tools FxCop, StyleCOP, Code Analysis, NUNIT, powershell and CODED UI automation - Worked with various versions of Visual Studio 2005, 2008 and 2012.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required, Any Doctorate in Any Specialization", "Key Skills": ["FxCop", "C#", "NUnit", "LINQ", "MVVM", "ADO.Net", "WCF", "SQL Server", "ASP.Net MVC", "JQuery"]}