{"Job Title": "Software Developer", "Company": "Inlogic Technologies Pvt Ltd", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "The . NET Developer is a Key role within Inlogic,   the Technical Lead will ensure the technology- enabled solutions and components are designed considering the performance,   scalability,   usability,   extensibility,   adaptability,   feasibility.  He/  She should be able to develop PoC s and focus mostly on the development and support activities.  He will be working with the Technical lead in ensuring the application is developed as per the technical and functional requirement.  \n\nJob Description \n\n•Responsible for developing code for web and windows based applications.  \n\n•Deliver quality code that meets the business requirements  (on time) .  \n\n•Understand and follow standards,   guidelines,   and best practices adopted in the project.  \n\n•Flexibility to work on new technologies and cater to time difference needs.  Desired Skills and Experience \n\n•Comprehensive understanding in . NET 4. 0/  4. 5 Framework,   including Visual Studio 2013,   C#,   ASP. NET,   AJAX,   HTML5,   JQuery,   JavaScript,   WCF,   LINQ and Entity Framework.  \n\n•Exposure to relational database: SQL Server 2008.  \n\n•Knowledge of MVC,   CSS3 and Bootstrap Framework would be an added advantage.  \n\n•Ability to perform as a good team player with good communication and interpersonal skills.  \n\n•Must be proactive,   detail oriented and self- motivated. ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["IT services", "jQuery", "LINQ", "Windows mobile", "Javascript", "Windows", "WCF", "MVC", "Visual Studio", "CSS3"]}