{"Job Title": "Software Development Engineer", "Company": "Siemens Limited", "Experience": "1 - 4 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "   As a Software Development Engineer, you will developexciting solutions that change the way both Mentor and their clients work.Youll work in a collaborative, welcoming environment where new ideas drivetechnological transformation. We work in small, crossfunctional teams with biggoals, so you will need to be adaptive and adept at clear communication. Westrive to produce scalable solutions, and you will need to be familiar with howsoftware development best practices and high levels of automation help drivethem.     Job Description    Take part in design and development of industry leading andrapidly growing solutions for electrical distribution system wireharness.    Be part of the core team responsible for e ciently evolving large-scale enterprise product built on Java platform to run on the cloud and besold via SaaS business model.    Solve challenging design and technology problemswhile setting example in quality and application of object oriented designprinciples.    Develop, evolve andoperate high-quality software solutions that deliver the required productfeatures maximizing use of existing technologies from Siemens and beyond    Ensure optimal extend ability, extensibility,maintainability, security, performance and scalability    Ensure solutions support multiple public cloud providers,hybrid cloud and private cloud    Participate in continuous improvement of architecture,infrastructure, processes, skills and the organization.    Participate in product de nition, project planning andtracking including task investigation, work breakdown and estimation.     Job Qualifications    Bachelor or higher degree in Computer Science, SoftwareEngineering or other technical/scientific domain    4 years of professional experience as part of adevelopment team in software development with agile practices, quick iterationsand integration of regular feedback    Extensive hands on experience in developing software usinga modern programming language (Java, C , C#, JavaScript or other)    Strong object oriented programming skills, including butnot limited to SOLID principles modular design    Experience writing unit tests and applying automatedtesting approaches    Hands-on software troubleshooting experience    Strong problem-solving skills    Ability to work as part of a global distributed team withmixed cultures    Strong self-organization including ability to work independently,take ownership, Prioritize/multitask effectively and deliver valuable results    Fluency in written and spoken English, including theability to communicate complex ideas internally     Desirable / Great additions     Professional working experience with AWS, Azure or anothermajor cloud platform    Experience in automating and managing large-scale cloudsystems via infrastructure as code (IaC) and security as code (SaC)    Experience in cloud systems architecture, automation,orchestration, deployment,    Implementation, operation and optimization    Experience using Docker and Kubernetes    Experience with Test Driven Development (TDD)    Experience developing multi-tier, commercial off the shelfand/or CAD software    Familiarity with electrical and harness domains   ", "Role": "Software Developer,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Object oriented design", "Automation", "orchestration", "TDD", "Javascript", "Agile", "Project planning", "test driven development", "Embedded software"]}