{"Job Title": "Software Developer - PHP", "Company": "Power2sme", "Experience": "3 - 7 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": "Software Developer  -  PHP Career | Power2SME Your web browser is out of date. Refer as many friends/peers/partners as you want. Parichay Karaye Labh Paaye ! T C apply Your InviteReferrals Accounthas been Expired .Kindly Upgrade Now Work hard and have fun! Software Developer  -  PHP Product Technology | Gurugram Job Description    Candidate should have worked as an individual contributor in most ,  if not all ,  stages of a SDLC SDLC  -  requirement understanding ,  Translating requirements into modules ,  module design and designing.    Writing reviewing unit test ,  debugging and deploying with UAT.   Should have ability to use well known design patterns to plan implementations Or refactor existing solutions.   Will be evaluated for bias towards scalability ,  security ,  performance ,  and extensibility. This will this reflect as ability to design small modules ,  refactor classes methods.   Use CDI or robust MVC life cycle framework with deep understanding of the trade - offs In each each choice.   Should be conversant with basics of DB schema design principles and thumb rules.   A plus if he has worked with diverse data sources especially the NoSQL data storage engines.   Good technical communication and documentation (UML or similar) skillset is a must.   Should have very good knowledge of OOPS.   Hands on experience in either Laravel OR CRM.    Profile   Qualification  B.Tech/M.tech in computer science from Tier 1 college is preferred.   Experience   3 - 7 years in projects developed/maintained in LAMP stack with focus on server side development.   Strong interpersonal skills ,  positive attitude.   Excellent communication skills  -  Oral ,  written and presentation.   Self - motivated and able to work with minimal supervision.   Proven ability to influence cross - functional teams.   Insightful and collaborative.   A great advantage if he/she is working in a product based company as against a software development services company.   E - mail Id Select a doc file Respect for Individual No Internet Connection! Please check your internet connection and try again ", "Role": "Software Developer,", "Industry Type": "Other,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["Computer science", "CV", "UML", "Schema", "PHP", "Doc", "MVC", "Module", "SDLC", "CRM"]}