{"Job Title": "Software Developer - ASP.NET ", "Company": "Medical Billing Wholesalers", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "    Job Description   This position will interact with the operations team, human resources team, marketing team, and project staff to meet their needs on a variety of projects, including     Developing, maintaining, and making enhancements to a variety of software applications.     Supporting websites as well as applications related to the website, corporate intranet , mobile apps, and internal/external communication.     Collaborating with a variety of departments on various projects.     Researching new technologies and ways to improve our current software and processes      Preferred Skills      Working knowledge of ASP.NET Core or ASP.NET MVC, .Net Framework, C#, Windows applications frameworks, Bootstrap etc.     Proficiency with front-end web development technologies (Javascript/HTML5/CSS/ JavaScript,/ JQuery/ AJAX)     SQL Server database experience (or other databases) and knowledge of Stored Procedures         Candidate Profile        3+ years of experience     Knowledge of analytics, and cloud computing environment desired.     Ability and skills to contribute to the design aspect of projects     Ability to learn quickly and act independently     Eager to learn new applications and technologies     Strong work ethic, positive attitude, and a desire to work in a challenging position     Ability to work well with and provide excellent service to end -users     Graduate degree in technology along with requisite professional and technical certifications     ", "Role": "Software Developer,", "Industry Type": "Retail, Wholesale,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Cloud computing", "jQuery", "Front end", "Web development", "Javascript", "Windows", "Stored procedures", "Analytics", "SQL", "Ajax"]}