{"Job Title": "Staff Software Development Engineer  Full stack React", "Company": "Apptio INC", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Remote", "Job Description": "   The Role    As a Staff Software Development Engineer at Apptio, you will work closely with the Engineering team, Product Managers and Designers in helping our customers discover new savings opportunities in hybrid cloud environments. You will be designing and building microservices and modular user interfaces that can be shared by multiple applications. You will help design and engineer efficient and resilient software products that run at cloud-scale . You will participate in design, architecture and code reviews, foster collaboration, and guide the team through roadmap deliverables and other technical challenges. Above all, you will work as a technical leader to provide our customers with a great product while helping to grow a strong engineering team.    In a Typical Week You Will     Understand the on-going work and priorities within the team and help plan for the upcoming tasks within the sprint and beyond.   Partner with the product team to understand the problem space, the competitive landscape and constraints and help deliver engineering solutions that work both for the customer and Apptio.   Participate in design/code reviews, collaborate, and provide direction   Lead by example in writing high quality secure code, improve test coverage and ensure performance and observability.   Join daily standups to discuss project status, new projects, and blocking issues.   Help lead communities of practice, technical lunch learn sessions, and engineering book clubs to continue learning   Mentor junior team members     The Interview Process     You apply for an open position.   If your application is a good match for the role, you will have a chat with the recruiter to understand the position and the team. Afterwards, you will be asked to participate in an aptitude test and later, a technical phone-screen with a member of the team.   If all goes well, you will have a round of video interviews with members of the team.   We commit to making a decision and following up with an offer or an explanation within a week. We are happy to work through the process on a timeline that respects your schedule and current employment status.       REQUIREMENTS     Experience designing and implementing scalable, pragmatic solutions to complex problems   Proficient in JavaScript, React, Java   Hands-on experience with micro frontends architecture   Desire to operate and excel in a DevOps team   Competent with Git and CI/CD pipelines. Familiarity with GitHub Actions is a plus   Comfortable with fast moving software design and development methodologies   Experience with Kubernetes     Bonus Stuff:     Experience with Microservices Architecture, modern API designs and implementations   Experience with Piral micro frontend framework   Knowledge of Golang   Experience with PostgreSql, MySQL, Aurora DB   Experience with Timeseries DBs and NoSql DBs   Expertise with popular AWS, Azure and/or GCP services for compute, storage and databases etc.   Familiar navigating the nuances of 3rd party integrations with applications, APIs and SaaS/PaaS providers   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Software design", "github", "GIT", "NoSQL", "GCP", "Postgresql", "PAAS", "MySQL", "Machine learning", "Javascript"]}