{"Job Title": "Hiring 2 positions- PHP Developer & Software Tester-2+ yr' experience", "Company": "PICCOSOFT SOFTWARE LABS INDIA PVT LTD ", "Experience": "0 - 3 years", "Salary": "₹ 50,000 - 3,00,000 P.A. ", "Location": "Chennai( Choolaimedu, Kovilambakkam, Nungambakkam, West Mambalam, Egmore, Mylapore, Kotturpuram, Kodambakkam, Gerugambakkam, Pallavaram, Chintadripet, Kilpauk, Chepauk, Porur, Jafferkhanpet, Kelambakkam, Kovalam, ECR, Kandanchavadi, St Thomas Mount, Chromepet, Chitlapakkam, Injambakkam, Hastinapuram, Broadway ), Thiruvannamalai", "Job Description": "About Piccosoft : we are a middle-level IT company, we have branches in Chennai and Thiruvannamalai.Job Location: Piccosoft Software Labs India Pvt Ltd No.4, First Floor, Kamaraj Colony Chitlapakkam (Near Varadharaja Theater)The Applications for these job openings that come through this below link will be processed immediately as a first priority. http://www.piccosoft.work/Immediate Opening - PHP Developer - 2+ years Experience - Chennai Experience: 2+ yearsRequired skills: Should have minimum 2 Years of experience as a PHP Developer • Experience in Laravel /  CodeIgniter / WordPress / Core PHP .Responsible for the creation and implementation of a wide variety of Web-based products using PHP, JavaScript, MySQL and AJAX, JQuery, HTML.Immediate Opening - Software Testing - 1-2 years Experience - ChennaiExperience: 1-2  yearsRequired skills:  Should have a minimum of 1 Year of experience in Software Testing. Good in Software Testing content - Manual / Automation (Selenium).  Knowledge of the JIRA tool will be an added advantage Note: Immediate joiners are more preferableThe Applications for these job openings that come through this below link will be processed immediately as a first priority. http://www.piccosoft.work/Thanks and Regards,HRK.S.DeepaPiccosoft Software Labs India Pvt Ltdemail:hr@piccosoft.comweb: www.piccosoft.comMobile No: 9500107482 ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Mobile,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Diploma in Any Specialization, B.Tech/B.E. in Any Specialization, BCA in Any Specialization", "PG": "MCA in Any Specialization, M.Tech in Any Specialization", "Doctorate": "None", "Key Skills": ["Software Testing", "Defect Tracking", "JSON", "Manual Testing", "Laravel", "Codeigniter", "jQuery", "MySQL", "Wordpress", "Javascript", "PHP", "Automation Testing", "Selenium", "Core PHP", "UI Testing", "Ajax"]}