{"Job Title": "Software Developer Java", "Company": "Agreeya", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": "     Job purpose        As an Engineer - Software Development, you will build high-quality, innovative, and fully performing software that complies with coding standards and technical design. To do so, you will gather user requirements, define system functionality, and write code in various languages       What you will do        Duties and responsibilities        What do you need to know        Knowledge and qualification      Translate process and enhancement specifications into programs and develop or refine error-free code within agreed timescales using development techniques, tools, methods and languages with the aim of optimizing operational efficiency.   Evaluate changes and perform impact analysis   Work with functional staff to establish and clarify requirements   Investigate reported faults in operational code to determine changes and approaches to the code for promotion and replacement, conforming to established procedures.   Design and prepare unit testing plan strategies and write test scripts to validate all new software development and enhancements. Participate and be responsible for the test and implementation phases of projects     2-5 years experience in JAVA and J2EE technologies.   Experience in understanding functional requirements   Proficiency in Software Development Life Cycle   Excellent debugging and problem-solving skills   Excellent knowledge of relational database   Proficiency in software engineering tools   Ability to document requirements and specifications   Experience in JAVA and J2EE technologies.   2 years of hands on experience in Core Java, JSP, JS, HTML5, CSS, AngularJS, Bootstrap, jQuery, Struts, XML, SQL and Hibernate.   Good knowledge of IDE like Eclipse, Servers like WebLogic, JBOSS and oracle database.     \", ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Hibernate", "Core Java", "jQuery", "JBoss", "XML", "JSP", "Weblogic", "Struts", "J2Ee", "SQL"]}