{"Job Title": "Software Developer - Java", "Company": "Interface Infosoft Solutions", "Experience": "7 - 12 years", "Salary": "Not Disclosed", "Location": "Nagpur, Roorkee", "Job Description": "Mandatory Skills: We have been working with Interface for last 7 years for development and support of Aquent On Demand products. The development team is nice to work with and hard working. They have been able to solve complex issues. In the past,  they have been successful in delivering on time.\" Prashant Kadwe,  Director Software Development at Aquent Cloud Computing Cloud helps companies achieve cost benefits by providing high performance,  resource scalability and high availability. You only pay for the services you use: software,  platform or infrastructure. Cloud computing allows process and storage intensive tasks which were hitherto impossible. Challenges How can we migrate our business applications to the cloud What are the ways to integrate cloud applications with on- premise applications How do we reduce our cloud expenditure without affecting the performance How do we design a cloud application to scale up or scale down in real- time How can we ensure that our data and communications in the cloud are safe and protected How can we develop a cloud application that does not lock us to a specific cloud service provider What are the ways to meet governmental and internal regulatory compliances for cloud applications Our Services Migrate on- premise applications to cloud Design new SaaS applications Redesign or optimize existing cloud applications Public,  private and hybrid cloud deployments Monitoring and management of cloud applications Request For Proposal View Case Studies in Cloud Computing Mobility Solutions Mobility is the new frontier of computing. Mobile devices truly provide information at your fingertips anytime anywhere. They are revolutionizing how individuals work and interact with others. For businesses mobile applications offer tremendous opportunities for innovative products and new ways to connect with customers,  partners and employees. Given the wide spread use of mobile devices,  the potential for business and commerce is enormous. INTERFACE has expertise in developing a wide variety of innovative mobility solutions for its clients. Challenges How can we design effective mobile policy to monitor and manage company- owned and employee- owned mobile devices and apps on those devices How can we use smartphones for data collection,  collaboration and notification How do we manage the performance of our mobile apps on various mobile devices How can we monitor the customer usage pattern of our mobile apps How can we scale up or scale down mobile devices and mobile apps accessing the enterprise network What strategy should we adopt for testing an app for performance,  network access,  battery consumption,  privacy and security How do we port an existing app on a mobile device to another mobile device under a different OS Our Services Corporate mobility strategy Enterprise wide mobility deployment Mobile security Mobile analytics Mobile application development and testing Application porting across mobile operating systems and devices Monitoring and managing mobile devices and applications Request For Proposal View Case Studies in Mobility Big Data Analytics Big Data is characterized by exponential volume,  large variety and high velocity of data accumulation. More data,  when accurately analyzed,  leads to better decisions. INTERFACE provides customized services to collect,  store,  process and analyze your data. Our interactive tools help you visualize data graphically to help you make quick and smart decisions. Request For Proposal View Case Studies in Big Data Analytics Social Networking Social networking is revolutionizing the way individuals and communities interact and share their opinions and interests online. Social networking offers tremendous opportunities for businesses to interactively connect with its customers. Organizations are using social networks to advocate their products and services,  manage brand image and gather customer feedback. Social networking analytics provides valuable insights which can be used to improve products and services and to carry out effective promotional activities. INTERFACE has expertise in developing and implementing social networking strategy for its clients. Challenges How do we use different social media to reach out to our targeted consumers or users How can our enterprise applications be integrated with social networks to listen to our consumer,  employees and business partners Can we add social networking features on mobile app or existing enterprise application How do we monitor different social media to get actionable customer insights How can we connect with consumers,  customer or businesses on social networks without compromising on data security Our Services Designing corporate social media strategy Integrate with social networks Enable web and mobile apps for social networking functionality Social network analytics Custom social networking site Request For Proposal View Case Studies in Social Networking Healthcare Advances in medical research and information technology have created unprecedented opportunities for new and innovative products and services. These products and services are revolutionizing the Healthcare industry through new and better ways to treat patients,  aid doctors and nurses to perform better and help clinics and hospital to manage better. Since 2006 INTERFACE has built several innovative products for its clients. We have experience in compliance to various standards and with the rigorous and lengthy regulatory approval process. Our expertise Medical imaging Alarms and vitals management Remote Monitoring Integration with existing and new devices Regulatory compliance Technologies Web Technologies Mobile Devices Cloud Computing Device firmware Big Data Analytics Our services New Product development Custom software development Accelerate on- going product development QA and testing Product porting Big Data analytics for healthcare Request For Proposal View Case Studies in Healthcare Clients About Us INTERFACE is a software solutions provider. Our expertise includes Cloud Computing,  Mobility,  Big Data Analytics and Social Networking. We build software products and solutions for our clients in the Healthcare,  IT Software and Marketing industries. INTERFACE started its journey in 2006 with a team of engineers and researchers with an extensive experience in the IT industry. Over the years,  the company has served several organizations with product development to custom software solutions using cutting edge technologies. INTERFACE brings intellectual property (IP),  domain expertise,  thought leadership,  software frameworks and a unique software development paradigm to serve our customers unique business needs. Management Team Narendra Nandekar Chief Executive Officer Narendra is the founder and CEO of INTERFACE. He brings thought leadership with extensive technical and industry experience. Before founding INTERFACE,  Narendra worked with Capgemini,  IBM,  PWC,  American Express and JPMorgan Chase in the USA. He has played a major role in implementing several key projects in these organizations. He holds Bachelor of Engineering from VNIT,  Nagpur and Master of Technology from IIT,  Roorkee in Computer Science. Technologies With expertise in open standards and most major development languages and platforms,  INTERFACE has executed small to large software projects onsite and offsite. INTERFACE has expertise in diverse technologies and continues to test and use emerging technologies. Web Development J2EE,  ASP.Net,  ExtJS,  Flex,  jQuery,  JSF,  Spring,  SEAM,  Hibernate,  SOAP,  Web Services,  XML/ XSLT,  AJAX,  HTML5,  Silverlight Mobile Development Android,  BlackBerry,  iPhone,  iPad,  Java ME,  Windows Mobile,  PhoneGAP,  Sencha Application Development NET (Dot- NET),  C#(C- sharp),  C,  C++,  Visual C++ (VC++) and Java (J2EE). Big Data Analytics Hadoop,  HBase,  mongoDB,  DyanoDB Mahout,  R,  Tableau,  OBIEE Relational Databases Oracle,  MS SQL Server,  mySQL,  PostGRE SQL,  DB2 Web Server /  Application Server BEA WebLogic,  IBM WebSphere,  Apache/ Tomcat,  JBOSS,  IIS Source Control,  Build and Quality Assurance SVN,  Ant,  Maven,  Jenkins,  TestLink,  Bugzilla,  Appium,  Selenium,  JMeter Social Networking Platforms LinkedIn,  Facebook,  Twitter,  Social Graphs,  Wiki,  Tumblr,  Blogosphere,  Pinterest Software Product Engineering We transform innovative ideas into world class products. Our expertise in Cloud computing,  Mobility,  Big Data Analytics and Social media integrations allow us to quickly introduce compelling products to the market for our clients. Product engineering services Product Planning Architecture Design and Prototype Product Development Quality Assurance and Testing Feature enhancements and Release Management Product deployment and Integration Maintenance and Support Quality Assurance and Testing We offer testing services for Cloud,  Web and Mobile environments. We have developed our own tools for testing mobile applications. We also have experience in compliance specific testing and documentation required by the regulators. Our Offerings include We also provide following additional testing for mobile devices Battery Testing Wi- Fi and Carrier Testing Privacy and Security Testing Custom Software Development Many times pre- packaged software products do not meet your needs and you want to develop solutions customized for your specific situation. You need to add new functionality or features to the existing product. Or there is no product in the market that addresses your requirements. INTERFACE would work with you to analyze your needs,  develop an appropriate solution,  and implement and test it. Additionally we can integrate it with your existing enterprise system if needed. Our services Custom Software Development Software Re- engineering and Integration Software Porting/ Migration Support and Maintenance Software Optimization Case Studies Innovative products we built for our clients All Cloud Computing Mobility Big Data Analytics Social Networking Healthcare 1 Mobile Analytics Platform with Customer Segmentation,  Retention Analytics,  In- App Analytics 2 Marketing Project Management System 3 Malware Detection Agent for Android and iPhone 4 Mobile Analytics SDK for Android and iPhone 5 Credit Card Usage Pattern Detection System 6 Survey and Customer Insight Analytics Portal 7 Malware Pattern Detection and Analytics Portal 8 Conext Triggered Ad Delivery for Mobiles 9 Partner Accounting System for Retail Chain 10 Real Estate Data Collection and Data Warehouse System 11 IT and Network Security System 12 School Bus and Student Tracking System 13 Corporate Job Portal with integration to internal HR systems 14 Marketing Automation System 15 Media Management and Storage Portal 16 Location Based Real Estate Search App for Android,  iPhone,  Blackberry 17 3D Modelling of Real- time 2D Images captured from Cardiac Catheter 18 Mobile Based Medical Messaging System 19 Patient Alarm Management System for Mobiles 20 Data Capture and Live Streaming of OBGyn Data to Mobiles 21 Live Streaming of Medical Media for Physicians 22 Collaboration on Medical Live Streams and Archived Studies 23 Cardiac Event Monitoring System 24 Live Streaming of Medical Media for Mobiles 25 Mobile Based DICOM Query/ Retrieve Application 26 Configurable Statistics and Trend Analytics from Exhaustive Healthcare Data 27 Hemodialysis Remote Monitoring System Careers We are always looking for the best talent in the industry. INTERFACE offers a challenging and high- growth environment to motivated self- starters with a proven track record. You will be working with experienced industry professionals with outstanding achievements. Please email your resume indicating desired position to careers@interfaceinfosoft.com Our focus areas Medical Device Connectivity Solutions Healthcare IT Solutions Mobility Solutions Big Data,  BI and Analytics Solutions Mobile application and Security Solutions Cloud computing Services Custom software development Services Current Openings Software Developer -  Java (EXP 2 -  4 yrs) Software Developer -  Ext- JS (EXP 2 -  4 yrs ) Kindly fill- up all the details below Name * Email * Mobile No. * Attach cv *\n\n", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["Hibernate", "jQuery", "Db2", "XML", "JSP", "Project management", "MySQL", "Oracle", "Ajax", "Android"]}