{"Job Title": "Senior Software Development Engineer - Python-Toolkit Dev", "Company": "Delphix", "Experience": "4 - 7 years", "Salary": "Not Disclosed", "Location": "Noida", "Job Description": "   Job description                 Responsibilities      Be a hands-on developer, make regular code contributions to the development of the product.   Building complex systems with high quality, with repeatable success for on-time delivery    Contribute in sustaining (bug fixing) and testing as required    Work closely with end customers    Troubleshoot customer escalations and provide on-time quality resolutions.    Working independently with minimal guidance    Work cross functionally with other Engineering groups, Professional Services, Pre-Sales and Support    Create documentation and training material    Occasional travel may be required, generally two weeks a year or less (subject to local and international travel guidelines).     Requirements     Bachelor s Degree in Computer Science or related field, or equivalent combination of education and job experience.   Strong coding skills in Python, Shell-Scripting    Good understanding of databases    6+ years of experience in software development    Experience working with Unix    Strong debugging, problem-solving skills    Ability to work a flexible schedule to accommodate business needs    Excellent verbal and written communication skills with the ability to adjust to meet the needs of the audience    Detail-oriented, with the ability to work with time constraints and guide others to meet deadlines     Great, but not required    Experience working with enterprise software with complex dependencies   In-depth understanding of DB operations/DBA experience    Experience working directly with customers on requirements as well as debugging and customization    System Administration experience    Understanding of file systems and operating systems   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Unix", "Computer science", "ERP", "Coding", "Shell scripting", "Debugging", "Presales", "Oracle", "Python", "System administration"]}