{"Job Title": "Lead Software Development Engineer", "Company": "RGF Professional Recruitment", "Experience": "9 - 14 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": " Job description    Role :    Play a crucial part in helping drive Quality to help build and ship better products. Collaborate with our development teams to enhance our existing software development processes. Drive Quality Engineering methodologies and help build high quality software. Partner with developers to improve and automate test and release processes Help make Quality as an integral part of the development process    All About You :    Must have 9+ year of experience and should have hands on experience on the below listed skillset. Knowledge in Digital Native Architecture Experience in Integration testing needs especially on BI tools such as Tableau/Sisense etc. Experience testing across a variety of platforms: web and mobile user interface, APIs (REST and SOAP), and Mainframe and UNIX Hands on experience in Groovy scripting Knowledge on data warehouse. Solid experience with relational databases, including ability to write efficient SQL queries and Stored Procedures. Security Testing Tool like Fortify, Checkmarks etc. Exposure in building and using automation frameworks using technologies: Java, JUnit, JBehave,   Soap UI/Pro, REST, JSON and XML. Ability to create good acceptance and integration test automation scripts and integrate with Continuous integration (Jenkins/Bamboo) and code coverage tools (Sonar, Clover) to ensure 80% or higher code coverage. Knowledge in migrating from mainframe to Cloud/micro-services. Experience of working with other developers to ensure that systems are designed for reliability, performance and testability. ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Unix", "continuous integration", "Lead Software", "XML", "Integration testing", "Security testing", "JSON", "Stored procedures", "Recruitment", "I18n"]}