{"Job Title": "Senior Software Development Engineer in Test", "Company": "Sumo Logic", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Noida", "Job Description": "     Role and Responsibilities:      Design, develop, and maintain test cases for UI testing or/and backend testing.     Contribute actively towards scalable Automation strategy execution.     Participate in functional, system, and regression testing activities     Work closely with development teams to ensure exceptional test coverage     Estimate and perform risk analysis on large features during sprint planning meetings     Report project status defects report and verification, and issue escalation in a timely manner.        Requirements:      Bachelors/Masters in Computer Science or related fields     4 years experience in testing     Experience with Enterprise-grade SaaS products     Experience with Continuous Integration or Continuous Deployment a plus     Experience with object-oriented languages, for example in Java, Python, Scala, Ruby, or C#     Experience in working with Unix/Windows operating systems     Familiar with QE processes     Passion for testing with a break it mentality     Familiar with test tools such as TestRails, Jira, JMeter, Selenium, etc     Passion for cutting-edge technologies, complex problems, and breaking things.     Ability to understand the Sumo Logic backend architecture in-depth clarity and precision in verbal and written communication        Desirable:      Experience with testing large scale systems.     Experience in big data and/or 24x7 commercial service is desirable.     You should be happy working with Unix (Linux, OS X).     Agile software development experience (test-driven development, iterative and incremental development) is a plus.   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Unix", "Automation", "Linux", "Agile", "Windows", "Selenium", "Test cases", "JIRA", "Ruby", "Python"]}