{"Job Title": "Senior Software Development Engineer ", "Company": "Monotype Imaging", "Experience": "3 - 5 years", "Salary": "Not Disclosed", "Location": "Noida", "Job Description": "        What we re looking for:        3-5 years   of experience automating acceptance & integration tests for SPA, websites & REST APIs.   Experience with tools like Selenium, Protractor, Behat etc   Deep hands-on technical expertise in all QA practices and processes   Experience in building custom automation frameworks in Java, Javascript or PHP.   Experience and detailed understanding of testing E-commerce sites, WebAPIs, REST, UI and Visual Regression.   Exposure to the concepts around microservices and microsites.   Experience with GIT, bitbucket, Github and the Gitflow branching model.   Experience adhering to an Agile development environment and iterative sprint cycle.   Experience in Continuous Integration/Continuous Development environments, preferebally Jenkins   Experience creating test solutions and test frameworks in continuous integration and delivery environments.         You will have an opportunity to:        COLLABORATE   with global teams to build scalable web based applications.    PARTNER   closely with the engineering team to follow best practices and standards  .     PROVIDE   reliable solutions to a variety of problems using sound problem solving techniques.    WORK   with the broader team to build and maintain high performance, flexible and highly scalable web and mobile-based applications.    ACHIEVE   engineering excellence by implementing standard practices and standards.    PERFORMS   technical root causes analysis and outlines corrective action for given problems.  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Direct sales", "continuous integration", "Automation", "github", "GIT", "Javascript", "PHP", "E-commerce", "Selenium", "Python"]}