{"Job Title": "Senior Software Development Engineer - UI", "Company": "Planful", "Experience": "3 - 7 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "  Job description       About the role     We are seeking a Senior Software Development Engineer UI to take our vision for a market leading UI and turn it into reality.    Reporting directly to the Chief Architect, the role will own our UI stack; how we develop our UIs; how we ensure quality and how we evolve our vision over time.   Joining an engineering team of 100 , the UI Engineer/Sr UI Engineer will advocate for better UI development across the group.   By providing great tools processes, they will raise the standard of UI development from our backend engineers, as well as our existing UI engineers.   They will accelerate our product development velocity by introducing components, libraries patterns that suit our context and leverage our strengths, while working on a roadmap to reduce our weaknesses.   We have made a strategic decision on Angular as our UI framework. The successful candidate will be an expert in Angular and how to transition from other frameworks and libraries to Angular.   The role will work intimately with the Product Design and Product Management teams, as part of the cross functional effort to produce an amazing user experience in the Planful platform.       Key Responsibilities     Produce great UI controls that demonstrate UI development best practices as an example for other UI and backend devs to learn from   Take ownership of the UI stack, making strategic tactical decisions about library, component and tooling selection that best matches our short longterm objectives   Produce and socialize a long-term roadmap for transforming the Planful UI from its current fragmented collection of technologies to a highly productive development environment   Embody Planful s values and contribute to a culture of having fun together taking pride in building wonderful products         Required Skills Experience     Multiple significant examples of transitioning code bases from one UI framework/library to another   Expert-level Angular development knowledge, and multi-year experience in developing it for a complex web product with multiple UI and backend teams involved   A previous role defining the UI technical roadmap for a product development team   Strong communication, influence and cross-functional collaboration skills       Preferred Additional Experience     A significant example of transitioning a complex code base to Angular    B2B SaaS experience   Some finance domain knowledge         Key Behaviors     Work-proud - internally motivated to always produce quality   Pragmatic - able to adapt solutions to practical limitations without becoming demotivated   Persistent - has the vision and patience to make progress on goals that might take a while to achieve   Challenging - has the confidence to present alternative solutions or opinions   Customer-focused - has our customers front-of-mind and prioritizes how they will experience our product   Inquisitive - continuously seeking knowledge of the latest tools, technologies, standards and practices   Collaborative - actively seeks to share learnings and solve problems cooperatively   Results-oriented - will work as part of the team and share in the joy of achievement   Team player - puts team goals ahead of personal objectives  ", "Role": "Software Developer,", "Industry Type": "Banking, Financial Services, Broking,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Product management", "UI development", "Backend", "SAAS", "Software Development Manager", "Machine learning", "Financial planning", "Agile", "Product design", "Tool selection"]}