{"Job Title": "Embedded Software Development Engineering", "Company": "Colevit Technologies", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": "     Responsibilities    Manage communications between the customer and the development team (per project)    Estimate new project scope    Deliver estimates to management using proper templatesrates    Assess project milestonesdeadlines then ensure progress reflects those set goals. If there are any roadblocks, work to remove them by including other team members, leads, or management.    Monitor approved budgets and send threshold notifications at 75, 85, and 95%    Negotiate increases to budgets when needed    Provide status reports to management; including entering accomplishments into the tracking system on a monthly basis    Run project meetings both with customers and with internal project team    Attend Leads meetings with other PMs and management (every other week) as well as team stand up calls thrice weekly    Track project progress in Atlassian suite tools (JIRAKanban)    Participate (as needed) in new hire interviews or training    Assist Management in workload management for the development team to ensure each person is 100% billable on a daily basis     Qualifications    2 - 5+ years experience in a similar role    Ability to multi - task and keep well organized    Display confidence when speaking with customers and team members    Ability to work independently and make decisions without constant oversight    Experience in any project management tool like JiraTrello etc    Experience in managing both tech and non - tech people is a plus     BABSB.TechBCAB.Com. or Masters in any related field    Excellent written and verbal communication skills    Telephonic or Skype interview (in case not available in Delhi NCR)     This website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic...                                                                               ", "Role": "Project Manager-IT/Software,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Project Management", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Procurement", "Telecom", "Project management", "Healthcare", "embedded software development", "Management", "JIRA", "Analytics"]}