{"Job Title": "Software Development Engineer", "Company": "Hewlett Packard Enterprise", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad, telangana", "Job Description": "    The data platform runs of very large clusters of nodes and manages petabytes of data and running on thousands of nodes, and accessed by millions of users.   We are looking for engineers in our Hyderabad office to enhance the platform and provide functionality requested by our customers.   We will provide you an environment where your impact will be immediately felt and appreciated as you both learn and help address the needs of the world's most demanding and cutting edge customers.    You will be working alongside with talented and like-minded engineers in a startup like setting and have an opportunity to contribute across the entire backend stack. Specifically:   Develop scale out file system access and storage software functionality that runs on commodity hardware   Take ownership of ease of use, performance, availability, and robustness aspects of your design   Collaborate with frontend product teams to ensure that common and advanced product usages are available through the UI   Work closely with QA counterparts to provide high code coverage and to enable testing automation        SKILLS REQUIRED       5-10 years experience building system software   Strong programming C/C /Java skills in LINUX/UNIX environment   Good understanding of Multi-threaded and asynchronous programming concepts    Proven track record of developing a feature from requirements to delivery   Good debugging and problem solving skills   Expertise in File Systems, Networking or Distributed storage/compute systems is an added advantage   Communication skills and ability to work independently   Partnership first: We believe in the power of collaboration - building long term relationships with our customers, our partners and euch other   Extensive social benefits, flexible working hours, a competitive salary and shared values, make Hewlett Packard Enterprise one of the world s most attractive employers. At HPE our goal is to provide equal opportunities, work-life balance, and constantly evolving career opportunities.  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Unix", "Backend", "Automation testing", "Linux", "Networking", "Debugging", "Programming", "System software", "Analytics"]}