{"Job Title": "Senior Software Development Engineer in Test - Core", "Company": "Livestream", "Experience": "1 - 6 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "  Job Requirements:     Essential      Bachelor's or Master's degree in Computer Engineering or equivalent     4 years of software testing experience     Excellent testing acumen and positive attitude towards problem solving.     Experience creating / updating / reviewing / executing automated and Manual tests     Identify defects and own them through the resolution and verification cycle.     Strong programming experience & code debugging skills.     Proficient in writing clean, maintainable code in Java.     Hands on experience in Test Automation - Java, REST, API, JSON, TestNG, Selenium, MySQL     Experience in designing and developing automation frameworks using Java and TestNG      Preferred:      Knowledge of revision control software (ex. SVN, Git, etc.) SDLC & STLC is plus.     Experience with Agile Methodology and continuous integration (i.e. nightly built and release) is a plus.     Experience designing and implementing testing tools and systems is a plus     Working knowledge of virtualisation servers e.g. ESX servers, VM's etc. Understanding of Linux OS.     Behavioural Attributes:     Must have a passion for quality and a bias towards speed     Be a good evangelist for the benefits of test automation     Must be a motivated self-starter with a short learning curve     Must be able to learn new technical areas quickly     Ability to communicate effectively - Verbal & Written     Able to work well with global teams, including some time zone flexibility. Collaborate well with other teams within the organisation.       ", "Role": "Software Developer,", "Industry Type": "Media, Entertainment, Internet,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Software testing", "GIT", "Linux", "Testing tools", "MySQL", "Debugging", "JSON", "Agile methodology", "Selenium", "SDLC"]}