{"Job Title": "Software Development Engineer I/II - Frontend Architecture", "Company": "e-Hireo Global Pvt Ltd", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": "Roles and ResponsibilitiesExperience : 2 - 5 YrsLocation : GurgaonPosition : SDE-I/ SDE-II (Frontend)Responsibilities :- Implement new dashboards, app features and user interactions.- Innovate on making product verification workflows easier for consumers.- Produce front-end code and visual comps to create a polished and highly functional user interface with a focus on usability and simplicity of design.- Work with the Engineering team to design and build software applications to function across multiple platforms.- Solve any design or usability issues that arise and anticipate potential future problems so they can be resolved before they impact users.- Collaborate with the product team to understand and implement workflows.Required Skills :- 2+ years of engineering experience with a proven track record of building high-performance consumer web applications or services.- Good exposure to front end UI frameworks like ReactJS, AngularJS, VueJS or similar.- Thorough knowledge of HTML, CSS, and JavaScript including concepts like layout, specificity, cross-browser compatibility, and accessibility.\\- Good analytical and problem-solving skills.- Experience with browser APIs and optimizing front end performance.- Good understanding of SEO principles and ensuring that application will adhere to them.- Knowledge of React Native and building android/iOS apps and using it are a plus.- Knowledge of interacting with REST based APIs.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "BCA in Computers, B.Tech/B.E. in Any Specialization, B.Sc in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["REST API", "AngularJS", "Vue.js", "CSS", "Javascript", "HTML", "React.js", "Frontend Architecture"]}