{"Job Title": "Software Development Manager", "Company": "BankBazaar", "Experience": "8 - 12 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Working closely with a talented and highly skilled pool of Software development Engineers ,  you shall be responsible to drive the next level of features ,  while guiding and mentoring the team.     You will lead your team to build reliable and highly scalable solutions.     You not only optimize your own code but make sure engineers are able to optimize theirs.     You will manage your business goals ,  contribute to product strategy and help develop your team.     You will work with multiple stake holders from requirements gathering all the way to post production.     You will ensure the sanity of software architecture ,  operational excellence and quality ,  delivering results on time and tracking project milestones.     You will set up best practices for development and champion their adoption.     Create clear career paths for team members and help them grow with regular deep mentoring. Perform regular performance evaluation and share and seek feedback.     Operating with scale and speed amidst flux ,  there is just a LOT happening.    View more   View less          Requirement  Have deep understanding of technologies and architecture in a scalable and available set - up.     Superior project management skills to manage multi - engineer projects and experience of delivering high quality projects on time Strong object oriented design skills.     Proven analytical and quantitative skills ,  think strategically and execute methodically     Ability to manage multiple projects and project teams simultaneously     Ability to work in a fast paced environment where continuous innovation is desired     Excellent leadership skills to mentor the engineers under you.     Passion for building a strong Engineering culture.     A minimum of 8 years of relevant industry experience.     A Bachelors or Masters degree in engineering from a reputed institute.    View more   View less          Email To    Opportunity@bankbazaar.co", "Role": "Team Lead/Technical Lead,", "Industry Type": "Banking, Financial Services, Broking,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["Post production", "Object oriented design", "software architecture", "software development", "Email", "Tracking", "Operational excellence", "Analytical", "Project management", "Management", "Setup"]}