{"Job Title": "Software Senior Engineer- Automation Development", "Company": "Dell International Services IndiaPrivate Limited", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Software Senior Engineer (Automation Development)Dell Technologies has had a 37-year history and track record to deliver ground-breaking product, solutions and services to help customers on their modernization and digital transformation journey! We are making investment to bring modern hardware and software with cutting edge technologies to our customer, wherever they may be. If you want to join a massive transformational effort and feel excited by the opportunity to use technology to define new computing paradigms and business opportunities – this role may be just the right opportunity for you!Be a part of a team thats modernizing and transforming products with its cutting-edge software development kit, libraries and add-ons. Client Core engineering team designs and develops advanced libraries and add-ons for Dells software with the most advanced technologies, tools, software engineering methodologies and the collaboration of internal partners.Every Dell Technologies team member brings something unique to the table. Here’s what we are looking for with this role:As an automation test engineer, your key responsibilities will include:Design, Develop and execute automation test plan objectives prioritizing qualityWork with development team to strategize testing, plan release activities and deliverablesBuild and/or maintain test automation architecture, designs and implementationsBe a knowledge expert on automation infrastructure, test orchestration and executionChampion test execution in a CI Pipeline for 0-touch automationAnalyze automated test results, provide continuous status and defect reportingParticipate in code reviews and enforce code quality standardsEngage with the entire Engineering team to assist in development and testing objectivesEssential Requirements5+ years of hands-on software development experience in C# and/or pythonDemonstrable knowledge of Power Shell scriptingDemonstrable knowledge of testing on Windows operating systemsMust have strong communication skills and be project oriented and the ability to work with minimal day-to-day directionMust be highly motivated and willing to work in a team environment3-5+ years of Software Quality Assurance ExperienceBS or MS in Computer Science, Computer Engineering, Electrical Engineering or related disciplineDesirable RequirementsDemonstrable knowledge of testing on Linux operating systemsExperience with Kubernetes, DockerExperience with Virtual Machine environmentsExperience with Secure Software DevelopmentExperience working in AGILE (Scrum, Kanban)Experience with continuous integration development and release cyclesExperience with the Atlassian tool stack", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - QA & Testing,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Electrical, Computers, B.Sc in Computers", "PG": "MS/M.Sc(Science) in Computers, Electrical Engineering", "Doctorate": "None", "Key Skills": ["Automation Development", "Linux operating systems ", "Software Quality Assurance ", "Windows operating systems", "Power Shell scripting", "Scrum", " Kanban", " Docker", "Kubernetes"]}