{"Job Title": "Software Development Engineer", "Company": "GRUNDFOS", "Experience": "6 - 11 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "          Job Purpose    Develop and enhance the features in the Grundfos pumps and drives to ensure that we continue having the world best products by developing embedded software in close colaboration with the other developers using our common software platform. We work in an agile environment where flexibility is a natual thing as well as the ability to plan your own day,Also can take the responsibility of end to end product verification and play a key role in testing product SW for various applications whenever required      Key Responsibilities      Design and development of different embedded SW for product applications as a part of Product development team and ensure that it is working as expected   Unit test development and test of new software and products to the full value chain   Quality improvement on existing software, troubleshooting bug fixing and test   Build and share knowledge       Product/System Development     Support test set-up and maintenance.   Drive and develop re-usable test scripts   End-to-end System Testing   Field issues support    Test automation   Configuration management   Ensure test beds are operational in line with CI framework       What you need to apply     Work experience in coding and testing embedded work products in Embedded C   Have good understanding of software failures;   Embedded concepts at SW as well HW levels.   Structured, modularized development and testing at all levels for different embedded software components like -   RTOS knowledge (like Threadx), memory, etc.   Communication drivers and protocols e.g. RS232, RS485, I2C, SPI, Modbus, etc.   MCU architectures. Preferably - Renesas (Rx, V850, RL78).   Embedded environment - IAR    High/low level design and coding in C.   Emulators, OCD and other tools.   Hardware debugging and testing (Peripherals, schematic reading, oscilloscope, Multi-meter etc).   Test principles, test driven development, test automation and writing test cases.   Experience in using the protocol testing/analyzer tools for testing protocols (Wireshark, Modscan, Modbus Conformance Tool, Bacnet ).   Documentation.   User level understanding and knowledge with hands on work experience.   SW testing tools at unit level. Preferably CPPUnit.   Any continuous integration tool. Preferably Jenkins.   Any version control tool. Preferably GIT   Experience of 6 years of relevant work experience after formal degree of B.E/ B. Tech, M.E/M.Tech (Electronics Background       Competencies     Should be highly collaborative with colleagues around the world.   Working in agile teams and is self -organized   Individual contributor as well a good team player in a multi-culture environment.   Is able to understand technical problems and make them simple to implement   Challenge the team on assumptions and dependencies   Is able to focus on possibilities instead of seeing the limitations present   Achieving Personal Work Goals and Objectives    Strong attitude towards Quality and Process.   Open to share knowledge and contribute proactively.    Ability to Listen actively and understand requirements accurately, with good oral, written and presentation skills in English      ", "Role": "Software Developer,", "Industry Type": "Construction, Engineering, Cement, Metals,", "Functional Area": "IT Software - Embedded, EDA, VLSI, ASIC, Chip Design,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["RTOS", "Embedded C", "System testing", "Testing tools", "Coding", "Configuration management", "Debugging", "Agile", "Test cases", "Embedded software"]}