{"Job Title": "Senior Software Development Engineer / Bangalore", "Company": "Uberlife Consulting Private Limited ", "Experience": "4 - 9 years", "Salary": "₹ 15,00,000 - 25,00,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": " Responsibilities Knowledge of communication protocols, architecture, or platforms. Fluency in HTML, CSS, and JavaScript(ES6) React and modern UI libraries and frameworks Collaborate with QA on continuous integration and delivery (Cl/CD)   Knowledge of Flux architecture . Experience with test driven development and establishing unit test infrastructures. Experience with evaluating and integrating open source and in house developed toolsets. Good communication skills and the ability to generate and communicate meaningful development metrics. Expert in software quality and testing methodologies/ patterns. Comfortable working in a fast paced, highly collaborative, dynamic work environment . Experienced in interacting and coordinating activities amongst multiple teams. Knowledge of front-end build tools like Grunt, Gulp, or Webpack. Experience leading development of mobile applications that have been successfully delivered to customers and must have published at least one original Android and iOS app Comfortable working with newer technologies Strong knowledge of CS fundamentals including data structures, algorithms and complexity analysis Ability to translate concept designs into user interfaces on Mobile devices and other devices. Strong communication, analytical and problem solving skills Roles and Responsibilities Desired Candidate Profile Dynamic, fast pacedFlexible to adapt the environmentIntellectual curiosity", "Role": "Software Developer,", "Industry Type": "Internet, Ecommerce,", "Functional Area": "IT Software - eCommerce, Internet Technologies,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization, BCA in Any Specialization, Diploma in Computers", "PG": "MS/M.Sc(Science) in Computers, MCA in Computers, M.Tech in Computers", "Doctorate": "None", "Key Skills": ["CSS", "Software Development", "Algorithms", "Front End", "Open Source", "Data Structures", "Flux", "HTML", "Webpack", "Grunt"]}