{"Job Title": "Senior Software Development Engineer - Test - Mobile Testing", "Company": "Confidential", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad, Bangalore/Bengaluru", "Job Description": "Roles and ResponsibilitiesLooking for SDETs with mobile testing experience, we are open to both locations (Hyderabad and Bangalore). The interview process will being with a coding test and the candidate should be able to take the test within 2 days. Premier institute candidates will be more preferredResponsibilities and desired attributes : - Develop test automation for mobile applications on Windows and iOS and Android for end-to-end testing.Work closely with product management and engineering on planning and grooming of stories.- Define test plan and testcases based on product and technical requirements.- Must have a passion for quality and a bias towards speed.- Be a good evangelist for the benefits of test automation.- Must be a motivated self-starter with a short learning curve.- Must be able to learn new technical areas quickly.- Ability to communicate effectively Verbal & Written strong Desired Experience : years of experience in test and automation of mobile applications on Windows andor iOS Bachelor's degree in Computer Engineering or equivalent.- Must be proficient in writing clean, maintainable code in Java.- Must have developed test automation framework from scratch.- Experience with one or more database technologies (Postures, MySQL) a must.- Experience in Jenkins, Appium or UI Automation tools, scripting is required.- Prior working knowledge of networking server technologies and protocols (HTTP, Proxy Servers, Load Balancers) is plus.- Knowledge of revision control software (ex. Perforce, SVN, Git, etc.) and development life cycle is plus.Experience with the Agile- Methodology and continuous integration (i.e. nightly built and release) is a plus.- Nice to have experience in testing Web Services (REST preferred).- Well versed in testing highly scalable enterprise client-server software is a plus.- Experience designing and implementing testing tools and systems. ", "Role": "Testing Engineer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - QA & Testing,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["UI Automation ", "Java", "continuous integration", "Perforce", " SVN", "SDET", "PostgreSQL", "Appium", "Jenkins", "Mobile Testing", "Automation Testing", " Git", "Testing"]}