{"Job Title": "General Manager - Engineering - Software Development - Full Stack", "Company": "Catalyst", "Experience": "8 - 13 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "GM - Engineering (Software Development ) Client is looking for a General Manager-Software Development (GMSD) to lead a team of 40+ engineers (backend/frontend/QA/devops). The team's responsibility is to build and maintain the software applications and infrastructure that powers client's business. The GMSD will have overall responsibility and accountability for building and maintaining high quality, scalable, resilient and secure software at Medlife. Core competencies : - Exceptional leadership and management skills - Exceptional understanding of scalability and modularity- - Experience in architecting, developing and maintaining massively scalable systems - Experience in building consumer facing websites and / or apps- - Demonstrated ability to hire, build and manage high performance teams - Entrepreneurial mindset - Ability to iterate fast and deliver on-time results when requirements are evolving- - Hands on coder Required Tech Skills : - Backend - Java / JEE/ Spring /Node.js / Microservices- - Frontend - Html5/ JavaScript/ css3/ AJAX/ JSON / Angular / React- - Databases - SQL / NoSQL- - Cloud - Amazon Web Services- Required Candidate profileQualifications : - B.Tech in CS from a premier engineering institute - 8+ years experience in software development- - 4+ years experience managing software development teams", "Role": "Head/VP/GM-Technology(IT)/CTO,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Senior Management", "UG": "B.Tech/B.E. in Computers", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required, Any Doctorate in Any Specialization", "Key Skills": ["Java", "AngularJS", "Microservices Architecture", "Full Stack", "Engineering Manager", "Node.js", "Java / J2EE Architect", "Spring", "React.js", "AWS", "CTO", "SQL"]}