{"Job Title": "Sales Executives - IT – Software Development/Data and Cloud computing", "Company": "Agaues", "Experience": "3 - 5 years", "Salary": "₹ 4,00,000 - 7,00,000 P.A. ", "Location": "Hyderabad/Secunderabad, Bangalore/Bengaluru, Mumbai (All Areas)", "Job Description": " As an IT sales professional, you will usually work with commercial clients, finding the right technological needs and requirements to suit the business needs of the customers/clients.Experience of working in an IT sales environment will be desirable wherein you have particularly demonstrated evidence of exceeding sales targets and have built a successful customer relationship in previous roles Roles and Responsibilities  As an IT sales professional, you will need to:Speak to customers, either face to face or over the phone, carry out cold calling in order to create interest in the products and services, generate new business leads.Gain an understanding of customers' diverse and specific business needs. Market and promote a portfolio of products by writing and designing sales literature and attending industry events, conferences.Maintain awareness and abreast of the constantly changing technological landscape.Develop effective sales plans using sales methodology.Ensure quality of service by developing a thorough and detailed knowledge of technical specifications and other features of clients' systems and processes, and then documenting them.Provide technical advice to customers on all aspects of development work both before and after the sale.Advice on technological features and applicability in a variety of contexts such as accounting,      manufacturing or other business areas.Network with existing customers in order to maintain links and promote additional products and      upgrades, wherever applicableRespond to tender documents, proposals reports getting the business!Manage workload in order to organize and prioritize daily and weekly goals.Contribute to team or progress meetings to update and inform colleagues.Desired Candidate Profile  SkillsYou'll need to show evidence of the following:Good persuasive communication and presentation skillsa good level of technical understanding, with enthusiasm for business awareness, new technology, and its commercial uses Self-motivation and a  competitive, results-driven attitude along with professionalismResilience and the ability to work well under pressure.Time-management skills and the ability to prioritize your workload.Ability to pay attention to detail.Ability to work in a team. An up-to-date working knowledge of the industry and gather useful sources of information.Must have a high level of integrity and excellent customer service.Perks and Benefits  Remuneration will be best as per the Industry Standards. Candidates will be able to earn performance-related bonuses / OTE (on-target earnings) in the job.   Important Information: Candidates will need to provide a track record that they can complete a sales strategy from start to end, satisfy customers' needs, follow up with customers and support customers to meet their requirements.Location: Currently Work-from-Home and must have excellent telephone communication skills is essential.Skills Test: Note part of the recruitment, the best candidate will be selected, and this role will be a permanent contract. You must complete the skills test.", "Role": "Client Servicing Executive,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "Marketing, Advertising, MR, PR, Media Planning,", "Employment Type": "Full Time, Permanent", "Role Category": "Advertising", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization, MBA/PGDM in Any Specialization", "Doctorate": "None", "Key Skills": ["Technical Documentation", "Software Development", "Cloud Computing", "Technical Support", "Proposal Writing", "Business Development", "Reporting", "Corporate Sales", "Information Technology", "Information System"]}