{"Job Title": "Software Engineer II - iOS Development (Valiant Labs) | Nike", "Company": "ANSR GLOBAL CORPORATION PRIVATE LIMITED", "Experience": "3 - 5 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "About the role:Our team provides development support for Nike Valiant Labs which is our internal new business incubator. We explore new business ideas that can be brought to life using the latest technologies. By relentlessly pioneering new ways to connect with our consumers, we strive to embody and continuously redefine Nikes original mission: To bring inspiration and innovation to every athlete* in the world.Description:- We are looking for a Swift developer to join our development team. Youll be helping to develop and maintain the world’s best activity applications on Apple iPhone and Watch. We’re looking for someone with a passion for excellence and a love of sport. You will help us continue to innovate and serve our athletes by crafting an engaging and reliable experiences.- You will be working alongside other developers across various layers of the infrastructure, building new features, fixing bugs, and writing tests for your code. We’re looking for someone with a commitment to collaborative problem solving, sophisticated design, and creating quality products. Our ideal candidate will have a deep knowledge of Apple’s iOS SDK and the Swift language.- Combined with this technical knowledge, we’re looking for someone who can take direction and run with it, provide leadership to a group of other specialists, and complete feature development with quality, on schedule, and according to specification.Responsibilities:- Develop high quality features on iOS and watchOS- Ensure the performance, quality, and responsiveness of applications- Collaborate with team to define, design, and ship new features- Continuously seek opportunities to improve application performance and code stability- Help maintain code quality and organizationSkills:- Must demonstrate high proficiency in:- The Swift language- Object-oriented programming- Memory Management- Multi-threading- Databases and other system data stores- Integration with RESTful APIs- Code versioning tools, especially GitObjective-C language:- The iOS runtime, both pre and post-ARC- Xcode IDE and OS X development tool-chain- Computer science data structures and algorithms- Excellent analytical skills, and written and verbal communicationShould also have:- A good sense of UI design and consumer focus- Experience with automated testing and unit tests- Understanding of Apple’s design principles and interface guidelines- Familiarity with continuous integration- Experience publishing production apps to the Apple App Store", "Role": "Technical Architect,", "Industry Type": "Retail, Wholesale,", "Functional Area": "IT Software - Mobile,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Swift", "IOS"]}