{"Job Title": "Software Development Engineer –  Full Stack\n", "Company": "Vast Consulting", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "     Job   Description     The Software Development Engineer  Full Stack, partners with Product, Engineering and Design teams to   deliver new features and enhancements for new eCommerce platform. This   position focuses on providing eCommerce and related technology expertise to   design, develop, and support of on-line, customer facing, eCommerce business   solutions.      The successful candidate will have experience of a strong, hands-on   technologist. A person who is comfortable with multiple priorities in a   fast-paced environment is required. Work with other engineers, managers,   Product Management, QA, and Operations teams to develop innovative solutions   that meet market needs with respect to functionality, performance,   reliability, realistic implementation schedules, and adherence to development   goals and principles     Primary Responsibilities:      • Design and implement high performance scalable user experiences     • Estimate engineering effort, plan implementations, and roll out   applications with cross-functional impact     • Independently design, code, and test major features, as well as work   jointly with other team members to deliver complex changes.     • Own continuous improvement and fine tuning of front-end performance,   scalability and security     • Flexible approach to analyzing technical issues and clearly communicating   recommendations/solutions     • Proficient in agile development methodologies     • Expected to deliver consistently with little supervision     Basic Qualifications     • 5-10 years of professional experience     • Strong application development background and understanding of Web   Application technologies and techniques - JavaScript, NodeJs, JSON, HTML5,   CSS, SASS, React, Angular, REST, Micro services, Server-less applications,   GraphQl, NoSQL     • Experience with one or more general purpose programming languages   including but     not limited to: Java, C/C++, C#, Objective C, Python, JavaScript, or   Go.     • Interest and ability to learn other coding languages as needed.     • Ability to speak and write English fluently and idiomatically.     • Proven ability to define and implement effective software development   methodologies     • Bachelors Degree in Computer Science or Engineering, or a similar   technical degree     Preferred Qualifications     • Experience development of consumer React online experience.      • Experience building server-less solutions is highly-preferred       Qualification -BE/B.Tech/ME/M.Tech          Mobile   No:  9810844079     ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Sc in Computers, BCA in Computers, B.Tech/B.E. in Computers", "PG": "M.Tech in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["C#", "Java", "C++", "Reactjs", "Go", "js", "Node.JS", "J2EE", "React", "Nodejs", "Python"]}