{"Job Title": "Software Development Engineer – React.JS/Redux", "Company": "Vast Consulting", "Experience": "4 - 7 years", "Salary": "Not Disclosed", "Location": "Pune, India", "Job Description": "     Job   Description      The Software Development Engineer  Front-End, partners with Product,   Engineering and Design teams to deliver new features and enhancements for new   eCommerce platform. This position focuses on providing eCommerce and related   technology expertise to design, develop, and support of on-line,   customer-facing, eCommerce products.      The successful candidate will have experience of a strong, hands-on   technologist. A person who is comfortable with multiple priorities in a   fast-paced environment is required. Work with other engineers, managers,   Product Management, QA, and Operations teams to develop product features that   meet market needs with respect to functionality, performance, reliability,   realistic implementation schedules, and adherence to development goals and   principles      Primary Responsibilities:      • Design and implement high-performance scalable user experiences      • Estimate engineering effort, plan implementation and roll out product   features      • Independently design, code, and test major features, as well as work   jointly with other team members to deliver complex changes.      • Own continuous improvement and fine-tuning of front-end performance,   scalability and security      • Flexible approach to analyzing technical issues and clearly communicating   recommendations/solutions      • Proficient in agile development methodologies      • Expected to deliver consistently with little supervision  Basic Qualifications      • 3 - 7 years of professional experience      • Strong application development background and understanding of Web   Application technologies and techniques - React.js, Redux, NextJs, Graphql,   JavaScript, JSON, HTML5, CSS, SASS, REST, Microservices      • Proven ability to define and implement effective software development   methodologies      • Outstanding writing, presentation and communication skills   Preferred Qualifications      • Experience development of a consumer facing React.js online experience.        • Experience building server-less solutions is highly-preferred      Qualification BE/B.Tech/ME/M.Tech           Mobile   No. 9810844079    ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "M.Tech in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["CSS", "Redux", "Graphql", "SASS", "js", "JSON", "React", "Microservices", "REST", "Reactjs", "JavaScript", "HTML5", "NextJs"]}