{"Job Title": "Software Development Engineering in Testing", "Company": "PRI INDIA IT SERVICES PRIVATE LIMITED.      ", "Experience": "5 - 8 years", "Salary": "₹ 5,00,000 - 10,00,000 P.A. ", "Location": "Pune", "Job Description": "Dear ApplicantsGreetings from PRI Global.We are hiring for Testing profile for Product based company.Location: PuneRole: Contractual (Duration 2 Years)Experience: 5 to 8 YearsRoles and Responsibilities  Write test scenario & test cases/test scripts for Enterprise Application, within schedule and within estimated efforts.Should have good understanding of BDD/TDD practices, code review and analysis techniques, Test Pyramid, and open source agile testing frameworks for both web service and GUI applications.Prepare test strategy and test plans covering environment, schedule, test data set up, testing techniques, and key SLA metrics keeping end-user requirements and customer experience in mind.Provide estimate for the assigned task.Understand end-customer needs and associated value chain to drive processes and practices to ensure flawless customer experience.Partner with peers, stakeholders, and management to prepare for rapidly changing product roadmaps on emerging technologies to ensure highest quality standards.Perform peer review of automated test cases and mentor junior team members.Comply with organizations processes. Policies and protects organizations Intellectual property. Also, participate in organization level process improvement and knowledge sharing.Develop business and product knowledge over time and share such knowledge to mentor newer team members. This is not a management position; however, this position is expected to provide strong leadership to junior members of the staff.Remain current with new testing technologies. Must have soft skills as well as technical in order to Communicate, collaborate and work effectively in a global environment.Desired Candidate Profile  Hands on experience on working with Java, JUnit, JBehave, Spring, SQL Boot, RDBMS (Oracle and PostGRES), NoSQL (Cassandra)and Web-services (JSON and SOAP).Hands on experience of writing end to end Test scenario & Test cases for Enterprise applications.Web service testing experience (REST/SOAP) is required, including secure authentication mechanisms.Hands on experience of testing microservice application.Solid knowledge of one of the IDE (STS, Eclipse, Intellij) Rest Assured, Appium, Jbehave/Cucumber frameworks, Databases, APIs (REST/SOAP), SQL, UNIX/Linux, Continuous Delivery concepts and tools such as Jenkins/Bamboo, vulnerability tools such as Sonar, Checkmarx/Fortify, etc.Experience in defect tracking tools like ALM/JIRA and Test Management tools like ALM/JIRA, qTest, PractiTest, TestRail etc...Experience creating and implementing complex test strategies/acceptance criteria/test cases to cover all testing phases, with heavy emphasis on integration and end-to-end testing.Experience with cross browser and cross device testing strategies (i.e. In the Wild testing) and exposure to automation via device clouds (Perfecto, Device Anywhere, Testdroid, etc.).Experience in creating java-based automation frameworks. Exposure to Cloud concepts (i.e. Infrastructure-as-code, Platform-as-a-Service, etc.) desirable.Familiarity with cryptographic operations desirable.Knowledge of payments domain message flows, architecture, common design patterns, ISO message protocols, EMV standards, mobile payments, simulation/emulation tools highly desirable.Exposure to preparing and delivering executive-level presentations to business and technology audiences.Strong written and verbal English communications skills.Experience working in an Agile environment.Must have Skills: Java, Spring, Selenium,   Web Services, SQL/RDBMSRest Assured, BDD/TDD   practices, Jbehave/Cucumber frameworksJunit, Microservices,   Jenkins (CI/CD) Writing   end to end Test scenario & Test cases for Enterprise applicationsInterested candidates can share your profile on sandhya@priglobal.com with below details.Ready for Contractual role[Yes\\No]:Current CTC:Expected CTC:Notice Period:Thanks & Regards,Sandhya A.PRI Global Pune", "Role": "Testing engineer,", "Industry Type": "Banking, Financial Services, Broking,", "Functional Area": "Financial Services, Banking, Investments, Insurance,", "Employment Type": "Full Time, Temporary/Contractual", "Role Category": "Not mentioned", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Jbehave/Cucumber frameworks", "Java", "Software Development", "BDD/TDD practices", "JUnit", "SQL/RDBMS Rest Assured", "Selenium", "Spring", "Web Services", "Microservices", "Testing"]}