{"Job Title": "Software Development Engineer", "Company": "Amazon", "Experience": "1 - 5 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Central Retail Pricing is core team that generates prices for worldwide Amazon inventory,  you'll play a key role in the evolution of our machine learning based Pricing algorithms to solve the world's most complex technical challenges in pricing optimization,  large- scale computing,  distributed systems,  web applications,  algorithms and data mining -  to name a few. The Pricing systems are one of the first machine learning systems in Amazon,  responsible for determining and publishing prices automatically,  for the millions of items that Amazon sells worldwide ranging from Books to Consumer Electronics to Shoes. Each country presents a unique set of complexities in generating the price. Why is this exiting time for usWe are re- architecting our core services to scale up with Amazon s growth plans.We are updating our machine learning models to solve newer challenges presented by Amazon business expansions.We are looking for a sharp,  experienced software development engineer who will help design & develop the next generation systems,  services and tools for Pricing. The engineer will play a pivotal role in the expansion of pricing software,  with the mission to build and execute streamlined,  automated processes for computing,  validating and publishing prices,  as well as the internal workflows and interfaces that our business teams use to manage them. This is a rare opportunity to be part of a team that will be responsible for building successful,  sustainable and strategic solutions for Amazon from the ground up. If you are a talented,  detail- oriented engineer with a solid software development foundation and a commitment to deliver the best possible technology solutions for our customers,  then we want to hear from you!Opportunity:Are you seeking an environment where you can drive innovationDo you want to better understand how Amazon fosters customer trust globally with its pricing decisionsDoes the challenge of applying state- of- the- art computer science to define/ design/ build tools powered by large scale systems that solve real- world problems interest youDo you have a passion for taking complex business inputs and processes and designing best- in- class workflows and interfaces which deliver simple,  seamless user experiencesTo meet these challenges,  Amazon's Pricing team is looking for passionate and innovative software development engineers with a blend of technical,  analytical and design skills who will work with other software engineers,  project managers,  product managers across different countries and cross- functional teams to help build out the next generation pricing tools for Amazon.com worldwide.Required Candidate profileBachelor's or Master s Degree in Computer Science or related fieldEquivalent experience to a Bachelor's degree based on 3 years of work experience for every 1 year of education7 years professional experience in software developmentComputer Science fundamentals in object- oriented designComputer Science fundamentals in data structures", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Object oriented design", "Publishing", "Analytical", "Machine learning", "Data structures", "Technology solutions", "Data mining", "Distribution system", "Consumer electronics"]}