{"Job Title": "SMTS Software Development Eng", "Company": "Advanced Micro Devices, Inc", "Experience": "12 - 15 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  Developing great technology takes more than talent: it takes amazing people who understand collaboration, respect, and who will go the extra mile to achieve unthinkable results. It takes people who have the passion and desire to disrupt the status quo, push boundaries, deliver innovation, and change the world. If you have this type of passion, we invite you to take a look at the opportunities available to come join our team.    Bachelor s / Master degree in Electronic Engineering or Computer Science with 12 -15 years experience in Chrome. Android, or Linux system development     Proven skill on x86/ARM assembly and C/C++ language, demonstrable C/C++ programming skills     Solid experience with Kernel mode driver programming under Chrome/ Linux/Android OS (AOSP)/QNX     Experience with at least one of the technical area: graphics / mesa / audio / video / camera / IO / Power Management with HAL implementation is a plus     Experience with Chrome/ AOSP/Linux development, upstreaming experience is a plus     Strong analysis and problem solving skills, fast learner on new technical area     Proven interpersonal skill, technical leadership and teamwork required     Fluent in both written and spoken English     Experience of working with multi-site teams is a plus    KEY Responsibilities:    A major software engineer who architect, design and implement Chrome BSP, HALs for AMD platform solutions     Collaborate/interface with management and global teams, drive the development and test to deliver a complete sw product solution     Improve customer satisfaction and product quality by solving complex technical problems     Accountable for on time delivery and quality of deliverables     Actively drive team technical skill improvement and innovation     Regular communication via Audio/Video conference with global teams  ", "Role": "Software Developer,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - Embedded, EDA, VLSI, ASIC, Chip Design,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Graphics", "Computer science", "Product quality", "Power management", "X86", "QNX", "high performance computing", "Gaming", "Video conference", "Android"]}