{"Job Title": "Lead - Software Development", "Company": "Open Systems International, Inc.", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "\n Description\n In this position you will provide leadership, solve complex problems, and manage individual project priorities, deadlines and deliverables to support our organization. All of this is done using the latest technologies in a fast-paced, collaborative environment at our forward-looking company. Specific on-the-job training will be provided. As Lead - Software Development, you will have the following responsibilities:\n Work closely with the Software Development team and Product Managers on the development and enhancement of OSI's products.\n Actively contribute ideas for product improvements and solutions to technology challenges.\n Show a passion for continued learning, and staying abreast of new technology and trends.\n Deliver clean code supporting consistent user experience and product quality.\n Provide leadership and guidance to junior developers.\n Requirements\n Bachelor's degree in Computer Science, Computer Engineering, Software Engineering or related technical field. Master s degree in related field is a plus.\n 6+ years of progressive software development experience.\n Expert level web development hands-on skills, including HTML, CSS, Javascript/Typescript and Java development skills.\n Hands on experience in one or more of the following: C#, Python, Angular, Ajax, DevExtreme, Restlet.\n Experience with the following:\n Database: MSSQL, Oracle, and/or MongoDB\n IDE: Visual Studio, Eclipse, and/or NetBeans\n Analysis Tools: SonarQube, CUnit, FxCop, and/or Findbugs\n Code Review Tools: Phabricator and/or Github\n Source Version Control: Subversion and/or Git\n Continuous Integration: Jenkins or similar\n Windows and Linux platforms\n Experience with agile development principles, continuous integration, and writing automated unit tests.\n Excellent project management skills; self-directed and capable of working effectively in a deadline environment.\n Able to contribute ideas and solutions, and also honor and support the ideas of others.\n Excellent communication and writing skills, and the ability to facilitate meetings.\n Superior object oriented design and debugging skills.\n Strong initiative to find creative solutions to problems, and pride in well-crafted code.\n Experience working with distributed teams ensuring full participation, cooperation and productivity from all team members.", "Role": "Software Developer,", "Industry Type": "Automobile, Auto Anciliary, Auto Components,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Product quality", "Training", "Lead Software", "OSI", "Manager Technology", "Management", "Software solutions", "Energy management"]}