{"Job Title": "Lead - Software Development & Research Informatics", "Company": "Augusta Infotech", "Experience": "12 - 17 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  Education -   B.E/B.Tech in Computer Science    Job Purpose:     Lead the development of applications and solutions for client requirements and to support Research Informatics activities.     Key Responsibilities:     Lead the Software Development and Engineering team in the development of new software, web applications and informatics solutions.     Lead the continued support for existing applications and applications currently in development.     Oversee implementation and infrastructure initiatives, software updates.     Actively support the research informatics group in software planning and development.     Provide thought leadership in technology direction, best practices in development and coding enterprise-class solutions.     Responsible for overseeing training, hiring, performance of the software development team.     Participate in the Research Informatics senior leadership team representing the technology perspective as well as the overarching strategic objectives of the business.     Grow and lead a best-in-class development organization by supporting an open and highly collaborative work environment that fosters high engagement, performance and commitment among all members of the technology team.     Educational Qualification:     B. Tech /M. Tech/ MS in Computer Science / Engineering / Applications     Technical/functional Skills:     Experience with large scale software development and good understanding of different software architecting, design and development methodologies     Experience in multiple backend languages (Java, Python, C++) and popular frameworks (Django, Flask, Spring, JSF, GWT and java script frameworks including React, Angular, Node.js)     Experience with Databases (MySql, PostgresSQL, MongoDB), Webservers (Apache) and UI/UX Design elements     Experience with popular project management, code management tools, Integrated Development Environments     Good understanding of Continuous improvement/Continuous Development pipelines     Good Understanding of cloud services models (PaaS, SaaS, IaaS)     Experience:     12+ years of industry experience in software product development and project management     Behavioral Skills:     Excellent verbal and written communication skills with the ability to influence and negotiate     Solid commitment to customer service with good initiative and follow-through     Expert ability to assess problems and quickly formulate the correct solution     Team leadership experience with proven ability to communicate with key customer and internal stakeholders     Ability to set goals, manage individual / team performance, demonstrated ability to organize people and activities to achieve goals     Ability to work with cross-functional teams and strong collaboration skills  ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "C++", "Coding", "GWT", "Project management", "MySQL", "Customer service", "Apache", "JSF", "Python"]}