{"Job Title": "Software Development Team Lead", "Company": "2Soft Solutions", "Experience": "6 - 8 years", "Salary": "Not Disclosed", "Location": "Noida, Bangalore/Bengaluru", "Job Description": "   Software Development Team Lead for eCommerce development is primarily responsible for the design,  architecture,  and development of web site solutions,  including customizations,  data modelling,  screen changes,  security definition,  and work flow. The Team Lead will provide technical and team leadership through coaching and mentorship. The Lead must be able to create and communicate innovative solutions to business issues and processes leveraging their knowledge of eCommerce solutions. Moreover,  the Lead is responsible for assigning resources to specific application design and development tasks,  defect resolution,  and production application support. \n\n  Duties and Responsibilities-  \nGuide team development efforts towards successful project delivery. \nProvide technical leadership to teammates through coaching and mentorship. \nMaintain high standards of software quality within the team by establishing good practices and habits. \nIdentify and encourage areas for growth and improvement within the team. \nCollaborate with other software developers,  business analysts and software architects to plan,  design,  develop,  test,  and maintain web applications. \nAssist in the collection and documentation of userrsquos requirements,  development of user stories,  estimates and work plans. \nDesign,  develop,  and unit test applications in accordance with established standards. \nParticipate in peer- reviews of solution designs and related code. \nDevelop,  refine,  and tune integrations between applications. \nAnalyze and resolve technical and application problems. \nAdhere to high- quality development principles while delivering solutions on- time and on- budget. Provide third- level support to business users. \n\n  Desired Skills & Experience-  \n6 -  8 of technical experience in this specific discipline. \n4  years experience as JAVA/ J2EE Developer. \n2  years experience with eCommerce development. \nAbility to design and develop effective technical solutions using Java,  J2EE,  SQL,  SOAP,  WSDL,  and XML. \n3  years experience mentoring developers and guiding the team toward clear objectives. \nStrong decision making skills with an understanding of where projects fit into the overall business strategy. \nExcellent verbal and written communications skills. \nExperience developing integrations to external payment gateways,  product,  and order management systems. \n  ", "Role": "Team Lead/Technical Lead,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "MBA/PGDM in Any Specialization", "Doctorate": "None", "Key Skills": ["java", "software development", "wsdl", "xml", "application support", "documentation", "j2ee", "project delivery", "coaching", "strategy", "soap", "sql"]}