{"Job Title": "Software Development Manager", "Company": "getyourjob", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad, New Delhi, Chennai, Bangalore/Bengaluru", "Job Description": "  Working closely with scientists, product managers and business leaders to drive the next set of features, develop solutions and track influence of our systems on the overall advertising business.   Your work will include doing research on existing advertising products, analyzing data, feature gap analysis and prioritizing features in an incremental way.   You will also be responsible for ensuring sanity of architecture, operational excellence and quality, delivering results on time and working with other software teams in order for the feature to launch. You will be responsible for clarifying use cases, requirements and breakthroughs.   You will be responsible for mentoring and handling a highly skilled set of SDEs, and in providing them career growth opportunities.   Technical deep dive, architectural skills and bias for action are a requirement.   Having prior leadership experience handling people is a requirement and experience in the online industry is a great plus.    Basic Qualifications     A Bachelor s degree in Computer Science or a related field is a must, as is relevant work experience in software development.     5+ years of software management and a proven ability to translate customer needs into business and product requirements.     Proven analytical and quantitative skills ability to use hard data and metrics to back up assumptions and develop project business cases and deciding the right priority.     Proven ability to architect large-scale systems.     High attention to detail including precise and effective customer communications.     Ability to manage multiple, competing priorities simultaneously.     Ability to understand and discuss technical concepts, schedule tradeoffs and opportunistic new ideas with technical employees.     Should be able to think strategically and execute methodically and tactically.     Superior verbal and written communications skills.     Ability to work in a fast-paced environment where continuous innovation is desired.     Composed, poised and professional demeanor.     History of teamwork and willingness to roll up one s sleeves to get the job done.    Preferred Qualifications    Experience with service oriented architecture and object oriented design     Experience in the online marketing /advertising industry is desired     Experience in big data and distributed systems  ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Object oriented design", "Operational excellence", "SOA", "Architecture", "Online marketing", "Analytical", "Gap analysis", "big data", "Distribution system"]}