{"Job Title": "Software Development Manager", "Company": "Autodesk India Pvt Ltd", "Experience": "5 - 9 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "                Position Overview                   As a Software Development Manager, you will have the opportunity to build and mentor a team of strong engineers to up-level our data ingestion services that feed critical business data into our data lake. Ideally, you enjoy balancing speed of execution with quality while building a product that teams globally distributed can use with ease. You should be as enthusiastic about building and motivating a team as you are about the technical problems that you and your team will solve.           Responsibilities        Lead, grow, and motivate a diverse team of 4-6 engineers       Steer the architecture efforts for common data ingestion patterns and services for the Autodesk Data Platform        Own and improve developer tooling with an eye towards self-service, reliability, and developer efficiency        Maintain high quality, performance and availability of services managed       Collaborate with product managers and customers to roadmap and prioritize the work for your team of engineers        Establish high technical standards through processes and culture       Mentor and help engineers to plan and execute their career paths while also jumping into the code as needed        Meet with the rest of the engineering leadership to align engineering-wide priorities        Set and fulfill the engineering hiring plan for the team, including sourcing, screening, and interviewing        Build healthy inclusive teams promoting diversity       Foster engineering excellence and a collaborative culture       Keep team unified, motivated and connected to the goals of the organization       Continuously improve team processes and validate scope estimations       Participate in technical design discussions and communicate effectively across cross functional teams       Develop roadmaps and metrics for the team and broader organization            Minimum Qualifications        Bachelor s degree, Masters preferred in Computer Science /Information Systems/Engineering/related field       Solid professional experience designing, building, and maintaining data ingestion patterns and frameworks       Solid knowledge and experience with functional or object-oriented programming (i.e. Java, Python) and writing optimal and efficient SQL queries       Strong overall programming skills, able to write modular, maintainable code        Solid understanding of data structures and algorithms       Solid proficiency with AWS services       Problem solver with excellent written and interpersonal skills; ability to make sound, complex decisions in a fast-paced, technical environment.        5+ years experience building, managing and leading high performing engineering teams       Solid Experience working with stakeholders to align on goals and risks       Humble, collaborative, team player, willing to step up and support your colleagues       Effective communication, problem solving and interpersonal skills       Commit to grow deeper in the knowledge and understanding of how to improve our existing applications       Enthusiasm for cutting edge technologies, complex problems, and building things       Familiar with non-functional testing such as load, performance and resiliency testing       Good command of English (Speaking, Writing and Reading)       Working in an agile environment using test driven methodologies            Preferred Qualifications        Experience with Big Data especially on Product data       Good understanding of data architecture fundamentals       Experience in Elasticsearch/Kibana/Looker    ", "Role": "Team Lead/Technical Lead,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Interpersonal skills", "Functional testing", "Agile", "Data structures", "Autodesk", "big data", "Object oriented programming", "Python", "Data architecture"]}