{"Job Title": "Manager, Software Development", "Company": "ExecBoardinAsia", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  You will have experience with team management, capacity planning, and leading in an Agile environment. The right candidate will be skilled in SDLC, architecture, design and development of SaaS enterprise applications, contribute to the core technical strategy, drive product and functional requirements, value user experience, and will be a technology steward for the integrity of the system.   They use the latest technologies to help our customers understand, visualize, and take control of their IT costs. Building our application requires a deep understanding of our problem domain and a passion for technical challenges. they are scaling our operations in the Bengaluru area and seek you, as an Engineering Manager, to inspire, mentor, and develop a team that helps build the company products.   You will ensure that the company discovers, designs and delivers the right core capabilities predictably and enable your team, that develops the solution, to continuously improve. You will help in building and delivering simple, powerful, scalable services, innovative SaaS architectures, software quality, and developer productivity that results in high customer value delivery.   You will be involved in the daily activities of running your engineering team including: road mapping, planning sessions, requirement reviews, coding, design reviews, and technical discussions to determine technology direction. Additionally, you will work closely with other engineering teams across the company product suite, information security, product management, user experience, and other engineering leaders to define and architect innovative solutions.  ", "Role": "Technical Architect,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Product management", "Team management", "Coding", "Enterprise applications", "Information security", "Agile", "Manager Technology", "software quality", "SDLC", "Capacity planning"]}