{"Job Title": "Technical Lead, Custom Software Development", "Company": "Uniphore", "Experience": "9 - 11 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  Uniphore, the leader in AI technology, is looking for a Technical Lead (engineering) to help grow and nurture the custom development team.    The Custom Development team, part of the global delivery and services organization, works on developing custom requirements (new features, integrations and automations) to meet our customer s evolving business needs.    As the technical lead for the custom development team, you will closely work with the global delivery heads and clients to understand their unique business requirements and translate them into technical requirements.    You will then drive your team to deliver the requirements ensuring high quality and performance.    The requirements can range from custom utilities for data processing to developing internal tools, technical interfaces, process automations and bespoke integrations between Uniphore products and client systems. You will also be responsible to develop process improvements to achieve cost effectiveness.    You will lead the team and act as the technical SME.    You will oversee the daily activities of the engineers, provide direction and guidance as needed, own resource management, process coordination and competency development.    We are looking for a hands-on dynamic individual who can lead with example and has a strong technical development background with a demonstrated track record of managing engineering teams.       Your   Responsibilities      Own and drives custom development projects    Lead local team of developers, partner with stake holders locally and globally, collaborate with peers and technology management.    Own technical (solution) development and delivery    Understand unique business requirements from clients and internal stakeholders and translate them into technical requirements    Act as the technical SME - Design the architecture, workflows and tech stack for the custom solutions/ integrations    Ensure projects/ requirements are delivered with high quality and efficiency    Promote best practices for software development, Dev-Ops, Agile adoption.    Hands-on development: working alongside the team; Lead by example.    Write reusable code and libraries.    Team management - hiring, retention and promotion of high potential team members    Drive team maturity    9+ years of appropriate technical experience    Strong track record of leading team of developers and QA engineers    Technically hands-on experience with Java, Javascript, Python, Postgres, MongoDB    Experience building SaaS products    Experience driving large customization and integration projects    Experience implementing Agile Methodologies    Experience and knowledge of writing testable and high-quality code    Experience with microservices and containerization    Programming/ Scripting experience in    o PHP, Python, Java, JavaScript, Unix Shell    o Web services    o Microservices    o Containers (Docker)    o Database such as Postgres, SQL Server, MongoDB database    o Servers like Tomcat Apache, WebLogic    In-depth knowledge of agile methodologies    Experience developing automations using Python, Ansible, Java, Jenkins etc.    Hands-on Data Mining, Data Science, and analytical work experience    Experience with cloud services, SaaS models, and client-server systems.    Knowledge of software architecture and design methodologies    Strong architectural expertise in designing enterprise solutions that scale    Experience working with AI/ML solutions    Domain expertise -    Contact center domain expertise exposure to commonly used CRM/ ERP and contact center management solution   ", "Role": "Team Lead/Technical Lead,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Unix", "ERP", "Automation", "Weblogic", "Javascript", "Agile", "PHP", "Analytics", "CRM", "Python"]}