{"Job Title": "Lead Software Development Engineer - Test - Selenium/jmeter", "Company": "eHireo", "Experience": "5 - 7 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   Lead Software Development Engineer - Test - Selenium/JMeter/ LoadRunner/API Testing    Job Type :  Permanent    Interview Type :  F2F Weekdays    Job Location :  Bengaluru, Karnataka         Job Type :  Full time         Experience Required :  5+ Years     Job Description :  We are looking for an outstanding Software Development Engineer for Test Lead with proven skills who is responsible for developing and executing comprehensive suites of automated test plans and test cases, maintaining and adding to the existing automation framework, evaluating test cases for inclusion in regression, adding automation for newly integrated features, and developing of toolsets to augment QA and Development testing.    Job Responsibilities :    - Create, maintain, and execute test plans and test cases   - Estimate test efforts   - Analyze and communicate test results   - Defect tracking and reporting   - Lead and participate in day-to-day QA activities   - Enhance and extend the automation library and framework for regression testing   - Performance and scalability testing   - Write specialized testing tools for use in testing our software platform   - Build testing solutions in-line with feature development.   - Analyze and improve requirement specifications at review meetings.   - Establish any non-functional requirements such as performance and scalability and their method of validation   - Confirm testability of any development effort upfront with developers before code is written   - Work with the development team to troubleshoot and resolve issues.   - Drive the testing progress of new features forward.   - Research and recommend effective testing approaches.   - Effectively work well in a deadline-driven, team-oriented environment.   - Mentor and lead other team members.    Required Candidate profileSkills And Qualifications : - 5-7 years of experience - Significant proven experience in testing, - API Testing experience - Knowledge of automation testing tools such as JMeter, Selenium, LoadRunner and others - Solid experience of Java, Cucumber-JVM, JUnit, Selenium; - Knowledge of performance and scalability test approaches and automation - Passion for finding bottlenecks and thresholds in existing code through the use of automation tools - Excellent troubleshooting skills to root cause complex issues required - Demonstrated skill using code repositories - Passion for creating and executing test plans - Passion for continuing education and improving code quality - Demonstrated skill in using coding standards and being an active participant in code reviews - Strong time management skills with a history of meeting commitments - Excellent verbal and written communication skills - Analytical and logical thinking with natural curiosity; - Ability to adapt and learn and think dynamically on your feet; - Well versed in software engineering tools and best practices; - Effective communication skills with both business and technical audiences; - In-depth knowledge of end to end QA process' is a mandatory requirement for this role - Demonstrated problem-solving capabilities and the ability to effectively communicate and present thoughts eloquently.", "Role": "Team Lead/Technical Lead,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - QA & Testing,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required, Any Doctorate in Any Specialization", "Key Skills": ["Software Development", "JUnit", "Cucumber Testing", "SDET", "Automation Testing Tools", "Software Quality Assurance", "API Testing", "Automation Testing", "LoadRunner", "Selenium", "JMeter", "Testing"]}