{"Job Title": "Software Development Manager (iOS and Android)", "Company": "Cerence Inc.", "Experience": "4 - 7 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "    Principal Duties and Responsibilities      Evaluate/Support issues related to mobile application and OS/Carrier differences.   Participate for in-depth architecture and code reviews.   Own and understand system integration and the architecture of the other components in our system (e.g. server, 3rd party libraries, intermediate pieces).   Drive the team development and testing efforts towards successful project delivery.   Actively contribute to create and execute detailed project work plans and revise as appropriate to meet changing needs and requirements.   Work together with the business and product management teams, to elaborate functional and feature requirements with a focus on customer satisfaction.   Handle customer escalations and appropriately address concerns.   Contribute to increase quality, performance and productivity in software development cycle by introducing and applying new approaches, methods or processes.   Contribute to department process improvement initiatives.   Participate into the Evaluation Review of your team members.   Work in an Agile environment.        Qualifications      Number of Years of Work Experience: 10+ years software industry experience        Required Skills      Experience in delivering mobile applications on iOS and Android.   Expert understanding of at least two programming languages (at least 7+ years combined experience) with very strong in C/C++ and Object-oriented analysis and design approach.   5+ years of combined experience in mobile or embedded development (one of iOS or Android required)   Knowledge in networking domain, knowledge of protocols like TCP/IP stack.   Deep understanding of how to produce effective development environments for automation.   Experience working in an Agile delivery cycle and knowledge of JIRA   Strong understanding of client / server architectures.   Proven ability to quickly ramp up on new technologies and become a domain representative in internal and external stakeholder meetings.   Strong software/system troubleshooting and problem-solving capability.   Strong experience in managing software engineering teams through the entire development lifecycle.   Experience working with remote team members.   Excellent oral and written English communications skills, including ability to make technical presentations.   Self-motivated individual and ability to work with a minimal direct supervision and multiple projects in parallel.       Preferred Skills     Experience in porting/ optimizing or coding in commercial/ free network protocol stacks.   Experience in technology used to connect mobile device with infotainment or another consumer device.   Knowledge of Bluetooth and USB communication protocol.   Experience to open-source technologies and libraries, including SQLite.   ", "Role": "Software Developer,", "Industry Type": "Automobile, Auto Anciliary, Auto Components,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["C++", "Automation", "Bluetooth", "Networking", "Coding", "USB", "Agile", "Open source", "Principal", "Android"]}