{"Job Title": "SOFTWARE DEVELOPMENT TEAM LEAD", "Company": "NATHAN ARK SOFTWARE PVT. LTD.", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "  SOFTWARE DEVELOPMENT TEAM LEAD   3-6 Years   We are seeking talented, driven individuals to serve as team lead.    Project Management skills.     Previous experience leading development teams is a plus.     Application of agile development processes in a leadership capacity.     Full stack development experience in Microsoft Technologies.     Proven experience with Microsoft .NET technologies including, ASP.NET, MVC, Entity Framework.     Proven Skills with C#, SQL, JavaScript/DHTML, HTML-CSS, AJAX, jQuery, Web Services, TFS, Object Oriented Analysis & Design, etc.     Ability to manage large scale web/database application.     Should have working knowledge of using a latest development tools and techniques.     Must have good problem solving and analysis skills.     Team-player with strong communication & collaboration skills.     Previous experience with ecommerce website development is preferred.     Previous experience leading development teams is a plus.     Defining the project scope.     Conducting business research.     Define configuration specifications and business analysis requirements.     Defines project requirements by identifying project milestones, phases, and elements; forming project team; establishing project budget.     Define reporting and alerting requirements.     Translating requirements to the team.     Performing acceptance testing.     Own and develop relationship with partners, working with them to optimize and enhance our integration.     Help design, document and maintain system processes.     Report on common sources of technical issues or questions and make recommendations to product team.     Communicate key insights and findings to product team.     Constantly be on the lookout for ways to improve monitoring, discover issues and deliver better value to the customer.     Creating, analyzing, and validating detailed functional specifications.     Coding for high-risk/high-complexity areas or establishing patterns for other developers to follow.     Collaborating with Product Managers/Architects on establishing requirements and overall design.     Collaborating with management to develop overall project schedules while providing accurate development estimates and identification/mitigation of project risks.     Ensuring quality through code reviews and other tools such as peer programming with other team members.     Review and product documentation.     Consultation to other departments for the creation of training or other go-to-market materials.     Provide management with key feedback and assistance for personnel evaluations and development plans.     Research into new tools, techniques, and best practices + facilitating knowledge sharing within the team.  ", "Role": "Team Lead/Technical Lead,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["jQuery", "Business analysis", "Coding", "Javascript", "HTML", "microsoft", "Monitoring", "SQL", "Ajax", "DHTML"]}