{"Job Title": "Senior Software Development Engineer in Test - Python", "Company": "Aspire Manpower Services", "Experience": "12 - 15 years", "Salary": "Not Disclosed", "Location": "Noida", "Job Description": "Roles and ResponsibilitiesThe RoleAt Delphix, quality comes first, and our QA team is the guardian of that quality. The QA team partners closely with project teams to define and execute test plans early in the development process. QA engineers at Delphix are well-versed in writing test automation in Python - from automating routine tests to building a robust automation infrastructure for scale and reliability.ResponsibilitiesAnalyze features and workflows to identify high-risk areas and design a test strategy with detailed test plan and test casesDesign and implement test automation in Python, and plan the work required to achieve thisMonitor and maintain test automation, across multiple platforms and configurationsRun manual testing as requiredDesign and build tools for effective and efficient testing and results monitoringCommunicate results to multiple stakeholders as requiredContribute as part of the engineering team on incoming customer escalation resolutionQualifications5+ years’ experience in Quality Assurance and Test Automation.3+ years’ experience in object-oriented programming and scripting languagesMinimum undergraduate college/ university degree in computer scienceAbility to think clearly and articulate your vision to others of varying technical comprehensionAbility to work a flexible schedule, across geographies to accommodate business needsGreat, but not requiredExperience mentoring and helping to strengthen teamsExperience with other virtualization platforms such as VMware and KVMExperience in system administrationExperience working with SQL databases (preferably Oracle)Experience working with enterprise softwareExperience working directly with customers on requirements as well as debugging and customizationPrevious experience writing automation frameworks in PythonDeep understanding of file systems and operating systems.", "Role": "Testing Engineer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Sc in Computers, BCA in Computers, B.Tech/B.E. in Computers", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["Test Automation", "testing", "test strategy", "test cases", "software developer python", "Quality Assurance", "python tester"]}