{"Job Title": "Senior Software Development Engineer - Python Development", "Company": "Aspire Manpower Services", "Experience": "6 - 11 years", "Salary": "Not Disclosed", "Location": "Noida", "Job Description": "Roles and ResponsibilitiesSenior Software Development Engineer - Python Development (Product based)• Be a hands-on developer, make regular code contributions to the development of the product.• Actively contribute to new ideas and help others.• Building complex systems with high quality, with repeatable success for on-time delivery• Work closely with QA, Product Management, and Support• Solving complex problems; applying new perspectives to existing solutions• Troubleshoot customer escalations and provide on-time quality resolutions. • Working independently with minimal guidanceRequirements• Strong coding skills in Python, Shell-Scripting• Good understanding of databases (Oracle, Postgres, DB2, HANA preferred)• At least an undergraduate degree in computer scienceExperience working with Unix• Strong debugging, problem-solving skills• Ability to work a flexible schedule to accommodate business needs• Excellent verbal and written communication skills with the ability to adjust to meet the needs of the audience• Detail-oriented, with the ability to work with time constraints and guide others to meet deadlines• Understanding of Branching, Versioning, Source Control, Release Managementengineering gradutae from top tier colleges", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": [" python developer", " backend development", " HANA ", " Postgres", " DB2", "Oracle", " core python", "Python", " backend developer", "Release Management"]}