{"Job Title": "Lead Software Development Engineer - Test - Performance Testing", "Company": "Hunting cube", "Experience": "6 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Title : Lead/Principal SDET Responsibilities : - As a Lead SDET, you will work closely with developers to automate developed features and manual testing of the new features. You will be responsible for owning the complete architecture of automation framework and planning and designing automation for performance, API and UI for an application. - You would also lead setting up automation infra, which would need to you work on setting triggers in CI/CD pipeline and using Docker orchestration for on-demand resource allocation. - You will be building high-quality automation frameworks to cover end to end testing of your owned features.- You will get an opportunity to contribute at all levels of test pyramid. You will also help support team to replicate post production release issues. - Besides that, you will attract talent and guide SDETs to gain knowledge of new tools and remove blockers.  Required Candidate profileQualifications : - BE/B-Tech degree in Computer Science, Engineering or a related subject - Proficiency in at least one programming language (Preferably Java) - Knowledge of data structures and algorithms - Good object-oriented design and coding skills - Good proficiency in Database querying (SQL & Mongo) - Strong expertise in automation and manual testing of APIs,Mobile Apps, UI and database - Strong knowledge of QA methodology and tools . Experience in Jmeter tool - Strong expertise in setting automation frameworks - Knowledge of Docker, container orchestration, CI/CD pipeline is a plus. - Experienced in Agile or Scrum software development methodologies - Experience with performance and/or security testing ", "Role": "Team Lead/Technical Lead,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - QA & Testing,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["Performance Testing", "CI / CD Pipeline", "SDET", "OOAD", "Automation Testing", "LoadRunner", "Manual Testing", "JMeter", "Load Testing", "Testing"]}