{"Job Title": "SOFTWARE DEVELOPMENT ENGINEER IN TEST", "Company": "McAfee Software (India) Pvt. Ltd", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "         Role Overview:             End to End function testing of the products using Mobile devices, Routers, PCs, Linux, Mac, IOT devices   Review product requirements, solution design document and provide accurate feedback to ensure software is testable and supportable in production   Stay up to date with new testing tools and test strategies, apply them in day to day execution   Define detailed, comprehensive, and well-structured test plans and testcases   Write test automation code to efficiently validate product from functionality, performance and scalability and security perspectives   Actively measure code coverage of the automation and carry out improvements   Follow Agile development / test practices, risk-based testing to ensure efficient releases   Help in investigation of production issues, collaborate with development and product team to ensure timely resolution.   Enhance regression suite to ensure the problem do not reoccur   Optimize test processes & procedures to make them more efficient           About You:       4 years of solid experience in Quality assurance and software test automation role.   Programming experience in Go, Python and /or Java programming languages   2 years of experience in end to end testing for router, IOT & Mobile devices   Sound understanding of security and penetration testing and methods   Good understanding of Networking Concepts including IP Tables, routers, bridges.   Good understanding of protocols such as DNS, HTTP, SSL   Experience with test automation frameworks like Appium, Selenium, JMeter, Vagrant   Exposure to AWS Cloud, NoSQL DBs, SQLs   Well organized, structured approach for managing work, good at problem solving skills   Keen interest/experience in improving efficiency in software testing   Anything above that gets you an enthusiastic high-five and bonus points for having experience in the computer security industry        ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Manager Quality Assurance", "Linux", "Networking", "Testing tools", "DNS", "HTTP", "Selenium", "SSL", "Python", "Penetration testing"]}