{"Job Title": "SOFTWARE DEVELOPMENT ENGINEER", "Company": "McAfee Software (India) Pvt. Ltd", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   Role Overview:       McAfee is hiring for SDET Engineers who will will create automated tests, contribute in system testing , follow agile mode of development.      About the Role:      1. You will write code per product requirements and create new products.   2. You will create automated tests, contribute in system testing , follow agile mode of development.   3. You will Oversee and maintain high-quality code for the cloud console that provisions, reports and orchestrates security in cloud.   Fix bugs quickly whenever required.   4. Demonstrate your code is complete by finding creative ways to develop test automation.        About You :    6 years of experience in product testing and development, including experience of code review / bug analysis, development of test tools, designing test cases and contribution to effective test planning.   A proven track record of shipping high quality, scalable software   Should have debugging experience, and excellent problem solving skills.   Understanding of Windows internals is a strong plus.   Demonstrated ability to work effectively both within a team and cross-group to drive identification and resolution of issues to ship under tight deadlines along with being able to drive features into the product.   Knowledge hands-on Python /Perl scripting experience essential   Knowledge of bug tracking system like Bugzilla, JIRA etc.   Experienced with Monitoring quality metrics   Experienced with performance, load, stress testing   Excellent communication skills, including development of presentations   Understanding hands-on experience of configuration management tools such as Git   Understanding of Code Review process. ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["System testing", "Stress testing", "windows internals", "GIT", "Configuration management", "Diversity and Inclusion", "Debugging", "Agile", "Monitoring", "Python"]}