{"Job Title": "AGM- Software Development", "Company": "GILBARCO VEEDER ROOT INDIA PRIVATE LIMITED", "Experience": "15 - 21 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": "Location: Mumbai15% Travel RequiredPurpose of Position: The Development Manger will be responsible for :The AGM -Software Development leading and supports the R&D Agile (SCRUM) SW team(Reporting to the Director of Software Development) and manages the day to day activities of theProduct`s Development Engineers (on-site, remote, and offshore). The job involves the effectiveassignment, allocation, and deployment of SW resources against a robust product roadmap in arapidly evolving industry. The AGM -Software Development will act as a player coach  working onprojects and acting as an expert technical resource to the team.Key Responsibilities: Should have team handling experience Should have 5+ years of formal or informal leadership experience – we’d like to see that you caninspire and influence others, even if it was not in an official manager role Innovative and technology oriented Assign and delegate tasks and coordinate project assignments to on-site, remote, and offshoreengineers Work closely with the customers and the product management teams to ensure effectivedevelopment. Assess resource requirements and deploy existing resources against various priorities Participate as a team member and team lead in product development projects. Solve and provide technical guidance on engineering topics Train & Hire new employeesRelationships Reports to: Software Development ManagerEducation & Experience: The ideal candidate will haveTotal Experience in years: 16-18 yearsGraduation/ Degree: BE/ B.Tech/ IT GraduateBackground and Skills: The ideal candidate will have Experience in C++ (Modern C++) with cross platform / multithreaded environment. 8+ years of experience working on software development teams (Modern C++ / C++ 11 and/orabove) Advanced knowledge in Linux, Networking - TCP/IP – HTTP, Multi-threading environment,Communication protocols, serial. Ability to operate effectively and independently in a dynamic, fluid environment Background in System Architecture and/or Product Owner. Experienced with Web development – Javascript, HTML5, frameworks Experienced with .NET C#Domain (Preferred Industry) – IT domainWOMEN CANDIDATES ARE ENCOURAGED TO APPLY", "Role": "Project Manager-IT/Software,", "Industry Type": "Oil and Gas, Energy, Power, Infrastructure,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Project Management", "UG": "B.Sc in Any Specialization, BCA in Any Specialization, B.Tech/B.E. in Any Specialization", "Doctorate": "None", "Key Skills": ["C#", "Leadership", "Software Development", "C++", "Multithreading", "Web Technologies", "Html5", ".Net", "Team Leading", "Management", "Web Development"]}