{"Job Title": "Staff Software Engineer - Python Development/Architecture", "Company": "Delphix", "Experience": "3 - 7 years", "Salary": "Not Disclosed", "Location": "Noida, New Delhi", "Job Description": "   Job description     Responsibilities        Be a handson developer, make regular code contributions to the development of the product.   Able to handle design review and code review   Actively contribute to new ideas and help others.   Building complex systems with high quality, with repeatable success for on-time delivery   Work closely with QA, Product Management, and Support   Solving complex problems; applying new perspectives to existing solutions   Troubleshoot customer escalations and provide on-time quality resolutions.    Working independently with minimal guidance        Requirements     Strong coding and designing skills in Python, Shell-Scripting    Good understanding of databases (Oracle, Postgres, DB2, HANA preferred)   At least an undergraduate degree in computer scienceExperience working with Unix   Strong debugging, problem-solving skills   Ability to work a flexible schedule to accommodate business needs   Excellent verbal and written communication skills with the ability to adjust to meet the needs of the audience   Detail-oriented, with the ability to work with time constraints and guide others to meet deadlines   Understanding of Branching, Versioning, Source Control, Release Management   Experience : 10 years         Good to have    Experience working with enterprise software with complex dependencies   In-depth understanding of DB operations/DBA experience   Experience working directly with customers on requirements as well as debugging and customization   System Administration experience   Previous experience in an architect role   Understanding of file systems and operating systems     ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Unix", "SAP", "Db2", "Coding", "Shell scripting", "Debugging", "Oracle", "microsoft", "Python", "System administration"]}