{"Job Title": "Full Stack Developer -  Software Development Life Cycle", "Company": "Confidential", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "Roles and ResponsibilitiesImmediate Joiners or Less Than 30 days notice only.- 4 to 5+ years of full Software Development Life Cycle experience Strong hands-on experience with full stack development Designs, codes, tests, debug, and documents software, and enhance existing components to ensure that software meets business needs.- Deploy and maintain Applications/Systems Work with other software engineers for one or more Agile scrum teams assigned to work on the project Contribute to the design and architecture to enable secure, scalable, and maintainable software and should be able to clearly articulate the implications of design/architectural decisions.- Developing front end website architecture and designing user interactions on web pages. - Developing back end website applications and creating servers and databases for functionality. - Ensuring cross-platform optimization for mobile phones. - Ensuring responsiveness of applications and working alongside graphic designers for web design features. - Designing and developing APIs . - Develop reusable patterns and encourage innovation that will enhance team velocity Collaborate on the design with other team members and product owners, both inside and outside the scrum team Estimate engineering work effort for engineering team and effectively identify and prioritize the high impact tasks.- Conduct design and code reviews to ensure code developed meets coding best practices guidelines, unit testing, security, and scalability and maintainability guidelines Strong web web development with React JS and AngularJS Strong knowledge in Node JS and MongoDB - Strong knowledge in Kubernetes and Devops Deployment Proficient understanding of client-side scripting and JavaScript frameworks, including jQuery, React, Redux - Proficient understanding of code versioning tools Good understanding of asynchronous request handling, partial page updates, and AJAX Experience or familiarity with technologies such as WSDL, REST and/or SOAP web services, XML, JBoss, Adobe CQ5 DAM, HTML5, CSS3, Bootstrap, Hibernate, Spring. - Docker/Kubernetes Experience Familiarity with any one RDBMS database like SQL, MySql, PostgreSql Familiarity with any one NoSQL database like ElasticSearch Familiarity with server-side languages such as Python, Python3 (Flask), .Net (C#). - A drive to learn and master new technologies and techniques. - Reasonable communication skills Drive a quality mindset within the team Seeing through a project from conception to finished product.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "BCA in Computers, B.Tech/B.E. in Any Specialization, B.Sc in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["C#", " Spring", " Adobe CQ5 DAM", "Version Control System", " Bootstrap", "Full Stack", "Webservices", " Hibernate", "SDLC", "Scripting", "SQL", " CSS3", " HTML5", "RDBMS", "SOAP web services", "MySQL", " XML", " JBoss", "React.js", "AJAX"]}