{"Job Title": "Software Engineer - Enterprise Application Development", "Company": "Altair Consultancy services", "Experience": "2 - 7 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "            Job Summary:                      We are seeking strong software engineering candidates for the Enterprise Applications Development group. This group is responsible for developing and implementing business applications for Altair worldwide, including internal and external facing applications supporting Financials, Customer Support, Human Resources, Project Management, and other functions. The ideal candidate will be comfortable working with various web technologies for both server-side and front-end development. The very nature of this job makes this a highly visible position throughout the enterprise, while contributing significantly towards continuous enhancements of business processes.                      What You Will Do:                      Work in a highly dynamic team to deliver end-to-end solutions for business processes, using web technologies, databases and server platforms                     Design and develop high quality, scalable, robust and reusable code and components                     Deliver solutions that perform seamlessly across different web browsers and mobile platforms                     Work closely with architects and other developers on software architecture, design, dependencies, code maintainability and developing standards                     Support / maintain both existing and new applications, while directly communicating with stakeholders                     Configure, customize and manage the User-Interface and workflows                     Document requirements, create design, develop test code, and implement customizations                     Build and manage integrations between enterprise applications and 3rd party business applications                     Process large data sets amongst enterprise applications                     Create and maintain detailed technical and user facing documentation                     Work in concert with the Enterprise Application Development team on broad-based projects                     Provide technical expertise in using efficient technologies, methodologies and design guidelines                      What You Will Need:                      At least 2 years of experience in enterprise application software development                     Experience working with databases, HTML, CSS, JavaScript                     Development experience in Java, Perl, Python, or PHP                     Experience using JavaScript libraries like JQuery, ExtJS or AngularJS                     Experience in following the Agile development life-cycle                     Experience with third party or developing custom API using REST, SOAP, etc.                     Experience in implementing SaaS or COTS solutions to replace existing legacy applications                      Basics:                      Bachelor s degree in computer science, or equivalent                     Ability to work as a single contributor as well as team player                     Strong problem solving and analytical skills                     Good written and verbal communication skills                      Preferred:                      Experience working with JIRA in an Agile software development environment                     Strong background in various database systems is preferred                     A can succeed attitude and work ethic           ", "Role": "Software Developer,", "Industry Type": "Strategy, Management Consulting Firms,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["jQuery", "Simulation", "Project management", "Javascript", "PHP", "Application development", "Customer support", "HTML", "Perl", "Python"]}