{"Job Title": "Software Development Manager", "Company": "Fiddich Consulting", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "Are you a technical leader who wants to own critical,  highly scalable systems,  and spur innovation Can you attract and grow the engineering talent needed for those kinds of challenges Are you interested in the bits and bytes and also the business opportunities  \n\n  Identity Services team,  part of eCommerce Platform Services at Our client,  owns user authentication and authorization,  on the web and mobile platforms. We're at the intersection of can never go down and need to move at agile,  internet speed. We're at the hub of Our client's massive,  worldwide service- oriented architecture. We are looking for a Software Development Manager who is excited about leading a talented team to innovate,  tackle complex problems and operate a complex and mission critical system under extreme loads.  \n\n  The successful candidate is expected to be a hands- on technical manager who understands and sets a high bar for all parts of the software development and deployment lifecycle including: design,  development,  documentation,  testing and operations. You must possess strong verbal and written communication skills,  be self- driven and deliver high quality results in a fast paced environment. We're looking for people who are smart and can get things done.BASIC QUALIFICATIONS\n * 8 years of experience,  with at least 3 years managing development teams\n* Experience in organizing projects and delivering quality releases on schedule\n* Experience in building and leading development of complex software systems\n* Good judge of top software engineering talent,  and ability to grow their careers\n* Ability to work well with clients and juggle competing demands,  good communication skills\n PREFERRED QUALIFICATIONS\n * Experience with off- shore development\n* Experience with large scale distributed systems", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - eCommerce, Internet Technologies,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["Relationship Executive", "Offshore", "Hub", "SOA", "Technical", "Agile", "Distribution system", "WHO", "Complex"]}