{"Job Title": "Software Development Engineer - MEAN Stack & React.js - Tech Startup\n", "Company": "HyrEzy Talent Solutions", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": " We have some urgent openings with one of our client based out of Pune location. It is a permanent position.Current team size of 31 peoplePosition :  Software Development EngineerExp. :  2+ Year(s)Working days :  6 (Alternate Saturday will be off)Shift timing :  GeneralNote :  Work from home currentlySoftware Development EngineerJoin  a Learning development team involved in building products that  integrate teaching andn multiple modes of learning -  to enhance student  engagement, course discovery, blended learning, content management etc.  Discover an opportunity to work on several new models in the field of  emerging technology. WHAT WILL YOU DO? The SDE  experience is a unique at here. You get to rub shoulders with software  engineers and researchers leading technical abilities and solving  challenging engineering problems. You will be working closely on the company product. YOU MAY BE THE RIGHT FIT IF YOU HAVE :  1. High Interpersonal skills2. Analytical Thinking and Problem-Solving Capability3. In-depth knowledge of programming for diverse operating systems and platforms using development tools 4. Team Player5. Demonstrated experience delivering innovative products6. Excellent judgment and organizational skills.7. Demonstrated ability to write highly performance code and end-to-end troubleshooting skills. YOU MUST HAVE :  -  BSc/BA in computer science or relevant field-  3-5 Years of experience -  Good knowledge of Mean Stack, Java script design patterns, React JS and MySQL-  Excellent problem-solving skills.Please note that this is a full-time post based in Pune. ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "BCA in Computers, B.Sc in Computers, B.Tech/B.E. in Computers", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["Java", "Software Development", "Mean Stack", "Design Patterns", "MySQL", "Javascript", "Go", "Programming", "React.Js", "Operating Systems"]}