{"Job Title": "Embedded Software Development", "Company": "Squircle IT Consulting Services Pvt Ltd", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "kalol", "Job Description": "ROLE TITLE: Research Engineer Embedded Software Engineer LOCATION: Halol, Gujarat JOB PURPOSE: Embedded Software Development KEY RESPONSIBILITIES: 1) Develop and manage assigned modules within schedules /  milestones /  work break down structures2) Review deliverables with stakeholders3) Demonstrate robust design principles in execution4) Manage key performance indicators for self 5) Continuously upgrade skills and knowledge of selfREQUIREMENTS:1) ME /  MTech (3 years work experience) or BE /  BTech (with 5 years of work experience) in Electrical /  Electronics /  Instrumentation Engineering 2) Strong relevant experience in Embedded Software Development for Microcontroller /  DSP based system3) Domain expertise in Industrial Automation /  Electrical Devices /  Wireless Technologies preferred4) Prior work in Substation Monitoring /  Transformer Monitoring /  RTU development preferred. 5) Hands on experience in using Cross compilers, Logic Analyzers, Debuggers, Programmers and allied embedded software development tools 6) Demonstrated ability to interpret schematics7) Strong interpersonal, communication and presentation skills8) Great Team player and influence the team 9) Good understanding of the Engineering design Processes and Tools ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Embedded, EDA, VLSI, ASIC, Chip Design,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Wireless", "Substation", "RTU", "Interpersonal communication", "Tools", "Engineering Design", "embedded software development", "Presentation skills", "Monitoring", "Embedded Software Development", "Instrumentation engineering"]}