{"Job Title": "Software Development/Lead - Full-stack", "Company": "Arkadin ConferIndia.", "Experience": "6 - 11 years", "Salary": "Not Disclosed", "Location": "Noida", "Job Description": " Job Description      As a Full Stack .NET Developer you will be responsible for creation and implementation innovative web application  You will also ensure support in analysis and designing during all phases of software production, including suggesting the most effective solutions for its implementation.   Among your tasks you will also find working on new concepts and solutions in frames of Microsoft technology and designing complex solutions, whose have to be compatible with clients expectations and users geographical dispersion.   You will have chance for professional trainings and certifications ( Microsoft, Agile , Prince2, ITIL).    Key Responsibilities    As part of the Development team and as a specialized .NET Developer you will have the opportunity to take ownership and lead the drive in delivering these high-profile business solutions. You will be integrating these with existing systems and applications as well as building from inception. Working with a team of analysts, architects, project managers and testers you will be taking the solutions through their full development lifecycle.  Qualifications      Experience in creating software using back-end and front end technologies in Microsoft area: Net, C#, SQL, Azure (at least WebApp, FunctApp, SQL PaaS). Angular and TypeScript.    Preferable: .Net Core, Entity Framework, Git Flow, Azure DevOps, MicroServices Architecture, UnitTest, CI/CD, OAuth, Azure Bus.   Knowledge of an object programming and project patterns,    Creating software using version s control system,   Knowledge of Cloud Service Platform - Microsoft Azure and related stack   Experience with agile framework such as scrum    Experience in Salesforce integration  ", "Role": "Software Developer,", "Industry Type": "Advertising, PR, MR, Event Management,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Front end", "GIT", "Control system", "PAAS", "Agile", "Entity framework", "Scrum", "Business solutions", "SQL Azure", "Salesforce"]}