{"Job Title": "Software development / Product Trainer", "Company": "CareerXperts Consulting", "Experience": "8 - 10 years", "Salary": "Not Disclosed", "Location": "India", "Job Description": "Cloud Evangelists  -  Trainers  -  CareerXperts Consulting    As a Technical Trainer, you will work closely with our engineering team to understand and work with customers implementing large scale mission - critical applications in cloud, enterprise and mobile computing deliver customer delight.    5 plus years in Software development / Product Trainer       To be highly successful, you bring on table:     Strong speaking skills for both technical and non - technical audiences, both on - site and online.   Solid grasp of programming principles (object oriented and functional). At least medium level proficiency in one of: Java, C++,Scala, Python, R(you have atleast 8 years of relevant experience)     Delivered technical training classes in the past year or trained engineers in sufficiently complex software stack. Note, we are also considering exceptional individuals with strong consulting backgrounds.   Experience working within the Enterprise software market or Internet industries is highly desired.   Ability to travel as required.   Responsibilities   Here s what you will do:    Deliver classroom and on - line training to customers and partners.   Develop new hands - on lab - based courses and modules in coordination with the developer training team   Understand the segment, opportunities and fine tune your training modules.   Work closely with engineering, sales team and understand the challenges and coming up with solution.   Employ the best in class methods and practices and inculcate.  ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["Training", "Technical training", "C++", "Consulting", "SCALA", "Cloud", "Enterprise software", "Sales engineering", "Mobile computing", "Python"]}