{"Job Title": "Business Analyst (BA) - Software Development", "Company": "Teknorix Systems", "Experience": "7 - 12 years", "Salary": "Not Disclosed", "Location": "Panaji/Panjim, verna,goa", "Job Description": "  Job Overview   We are looking for an experienced Business/Systems Analyst to join our software development company. You will be responsible to understand business and client requirements, analyze and document the same to provide actionable insights to the engineering team.   You will be working closely with product owners and business stakeholders to convert business use cases into software requirements specification documents.   If you have the potential and want to be part of our dynamic team, send in your applications to us right away.    Responsibilities        Understand, Analyze and Document business requirements of customers, making recommendations for improvements   Oversee the implementation of software development projects from inception to completion   Interact with Project Managers, Technical Architect and the Engineering team to ensure that business requirements are fulfilled in the systems we build.   Maintain record and document feedback about overall performance and issues      Requirements    Bachelors or Masters degree in Computer Science, preferably BE (CS/IT) or MCA   Excellent written and verbal communication skills    Ability to translate complex ideas into simple language   Prefer knowledge of database design and implementation   Knowledge of all phases of the Software Development Life Cycle   7 years experience in a supervisory position related to information technology   Sharp problem-solving, analytical and innovation skills   Keen leadership and project management skills, ability to drive projects from inception to completion.   Proven experience of working as a Business/Systems Analyst in a software development company   Strong Attention to detail   Good project management abilities   ", "Role": "Business Analyst,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "System Design/Implementation/ERP/CRM", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization, MCA in Computers", "Doctorate": "None", "Key Skills": ["Computer science", "Technical Architect", "Analyst", "Project development", "Product engineering", "Database design", "Analytical", "Project management", "Software development life cycle", "Information technology"]}