{"Job Title": "Software Development Project Manager", "Company": "Next Gear Solutions", "Experience": "5 - 11 years", "Salary": "Not Disclosed", "Location": "Kolkata", "Job Description": "  The Software Development Project Manager is responsible for leading teams through the agile software development life cycle on a day to day basis. They independently ensure that projects are proceeding according to scope, schedule, budget, and quality standards.      Critical Job Duties:         Owns development projects from start to finish in an agile environment from project creation, goal setting, feature/change requests, through to development, QA, and release          Provides leadership for team members including engineers and quality technicians, coordinating tasks across the team          Attends and leads daily calls or meetings for the team          Tracks outstanding deliverables, milestones, change requests, and issue reports          Creates, manages, and communicates development and release schedules          Provides daily updates proactively to management team, including updates on project milestones, deliverables, dependencies, risks and issues          Works with other Project Managers and Product Managers or Owners to oversee and report on daily progress toward goals          Manages project scope and changes          Understands the interdependencies between technology, operations, and business needs        Candidate Profile and Qualifications          The successful candidate has proven task and team management skills, able to work cross-functionally to lead a project to successful completion on time and on budget.      Their strong communication and organization skills keep the team on track and keep stakeholders engaged in the process.      The candidate will take a creative approach to problem solving with the ability to focus on details while maintaining big picture goals.       Qualifications:       Experience in SDLC methodologies, particularly Agile/SCRUM        Extensive project management experience, leading projects successfully to completion on time and on budget and meeting customer expectations        Experience working with business stakeholders in a cross-functional capacity        Understanding of Office and Atlassian (JIRA, Confluence) software systems        Proven ability to drive projects forward, meeting goals and deliverables        Proven ability to work with global teams        Strong organizational, communication, and interpersonal skills        Self-motivated and decisive in resolving business problems, making decisions, and identifying priorities        Strong leadership and delegation skills        Proven ability to think creatively and analytically to solve problems        Able to build and maintain relationships across many teams    ", "Role": "Project Manager-IT/Software,", "Industry Type": "Banking, Financial Services, Broking,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Project Management", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Interpersonal skills", "Team management", "Claims", "Agile scrum", "Project management", "Software development life cycle", "Budgeting", "JIRA", "SDLC", "Technology operations"]}