{"Job Title": "Software Development Manager", "Company": "ExecBoardinAsia", "Experience": "11 - 15 years", "Salary": "Not Disclosed", "Location": "haryana", "Job Description": " In this role, you will lead a team in building tools to improve the global payroll process and payroll data management across all countries where the company pays employees. While their current systems involve machine learning, analytics, business process management, data management, reconciliation, and compliance, they are looking for a visionary leader to come in and understand the current business processes and objectives and develop the next round of ideas to solve problems that they do not yet know that they have.   You will work with other the company business and engineering teams in planning, designing, building, and supporting systems. Your primary responsibilities will include developing a team of engineers, managing the team s devops processes, defining and publishing the team s charter and vision, managing priorities across groups of customers, goal-setting, and roadmap management.   Your team will architect highly efficient systems, making a tradeoff between scalability, performance, and user functionality needs using expert knowledge in software development technologies. You will develop long term domain\\/technology strategies and significantly influence the process and engineering standards on the team. You will lead design reviews and offer feedback on design, integration, performance, and scalability. You will serve as an authority in the area of technical and domain expertise and mentor, develop, and train the engineers.   The ideal candidate for this role will be technically strong and able to dive deep, particularly with the company, and have prior experience managing customer-facing teams. They will also have experience in the HR\\/Payroll\\/Finance domains and will have excellent verbal and written communication appropriate to engage with all levels at the company. Lastly, they will be a great leader who takes pride in and genuinely enjoys hiring, developing, mentoring, motivating, and retaining the best engineers. ", "Role": "Technical Architect,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Payroll processing", "Payroll", "Publishing", "Data management", "Machine learning", "Reconciliation", "HR", "Business process management", "Management", "Analytics"]}