{"Job Title": "Senior Embedded Software Engineer for Device Driver Development", "Company": "ATRIA LOGIC PVT LTD", "Experience": "8 - 13 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Senior Embedded Software Engineer for Device Driver Development Job Code: AL_ESW_IND_01 Required skills: \n\n8+ years of experience with as an embedded software developer where you are comfortable with firmware and debugging experience who really understands the low- level, device driver layer. Someone who has a expert grasp on Linux and is able to work on multiple projects at once. He will be responsible for development of host software components for major operating systems. Duties will include implementing kernel mode device drivers, other low level operating system components and some application level development for Windows and Linux PCs. This job includes development of new device drivers for future products as well as support of existing device drivers for deployed products. The applicant should be familiar with working in a development environment using revision control, issue tracking, and automated testing. Design and develop device drivers, middleware and board support packages (BSP) in various embedded OS environments, including Linux / Windows and VxWorks. 5+ Linux kernel and Heavy Device Driver Experience Expert in embedded C programming Experience in related display drivers like HDMI, Display Port, HDCP, Ethernet, PCI Express, USB etc Experience in chip ARM Driver customization per customer needs Assist the Applications team with customer support as needed Produce documentation that may be used inside and outside the company.", "Role": "Software Developer,", "Industry Type": "IT-Hardware & Networking,", "Functional Area": "IT Software - Embedded, EDA, VLSI, ASIC, Chip Design,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Sc in Computers, B.Tech/B.E. in Computers, BCA in Computers", "PG": "M.Tech in Computers, MCA in Computers", "Doctorate": "None", "Key Skills": ["Senior", "USB", "Ethernet", "Debugging", "Device driver development", "Senior Embedded Software Engineer for Device Driver Development", "Windows", "Firmware", "Middleware", "Embedded software", "Linux kernelSenior Embedded Software Engineer for Device Driver Development"]}