{"Job Title": "Software Development Director - Messaging & Observability", "Company": "ExecBoardinAsia", "Experience": "9 - 14 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   Job Description    They are looking for Director of Software Development with expertise and passion in solving difficult problems in distributed systems, virtualized infrastructure, and highly available services. These are exciting times in our space they are growing fast, still at an early stage, and working on ambitious new initiatives.   This role is available in the OCI Developer Services organization as a Director of Product Development within the OCI Messaging & Observability services organization. In the observability space, we are addressing complex, large scale and connected event platforms that manifests as the following services Logging, Monitoring and Event Correlation services. In the messaging space, we are building out the next generation flexible messaging platforms streaming, queues, a generic pub/sub platform for delivering notifications, and Email service.   As a Director of Software Development, you will lead the software development team and development for one of the major services in the companys Cloud Infrastructure portfolio. You should be a distributed systems generalist, able to architect broad systems interactions, while being very hands-on, able to dive deep into any part of the stack and lower level system interactions. You should value simplicity and scale, work comfortably in a collaborative, agile environment, and be excited to learn.    Candidate will be responsible for providing leadership, direction and strategy   Establishing and development of organization to meet and execute on strategy.   Working with geographically distributed teams and contribute to the success of his\\/her and other related teams.   Delivering large scale project on-time with the high quality   Manage a team that designs, develops, troubleshoots and debugs software programs for databases, applications, tools, networks etc.   As a director of the software engineering division, you will apply your extensive knowledge of software architecture to manage software development tasks associated with developing, debugging or designing software applications, operating systems and databases according to provided design specifications. Build enhancements within an existing software architecture and envision future improvements to the architecture.   ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["software architecture", "Software design", "Operating systems", "Debugging", "Agile", "Director", "Management", "Application software", "Distribution system", "Monitoring"]}