{"Job Title": "Manager, Software Development", "Company": "ExecBoardinAsia", "Experience": "11 - 15 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "  Job Description   Come join the companys HR Service Management product development team. The product streamlines the interaction between employees and HR and drives HR Service Delivery transformation by   Enabling easy access to information and engaging content for a modern employee experience by providing solutions on Mobile platform  Providing effective and efficient means of managing and fulfilling employee requests using ML capabilities, thus boosting productivity and  Helping HR teams leverage insights using analytical capabilities to continually optimize and improve operations and service levels    Managing product development activities in a high pace environment.  Responsible for the overall systems development life cycle for product implementation as well as custom built web applications on the company platform.   Work closely with program management, product management and support\\/satellite teams for new features and upgrades.   Management and execution against project plans and delivery commitments.   Contribute and participate in reviews for architecture, design and code.  Exercise appropriate influence to ensure commitment to customers and deliverable quality products.   Manage the day-to-day activities of the development team within an Agile/Scrum environment.   Management of departmental resource, staffing, mentoring, and enhancing & maintaining a best-of-class platform development team.  ", "Role": "Product Manager,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Product management", "Service management", "Agile scrum", "Staffing", "Analytical", "Manager Program Management", "Architectural design", "Product implementation", "HR", "Management"]}