{"Job Title": "Senior Software Engineer - Frontend Development - Javascript/AngularJS", "Company": "TalPro", "Experience": "6 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Frontend Developer with Javascript, React, Redux, Sass, Angular, Node.js.The Desired candidate profile for the Senior Software Engineer - FrontEnd will be :1. Work on most complex web application.2. Integrate with more than 40 upstream services while still providing users super fast response times.3. Build a next gen UI using the latest technologies: React, Redux, Sass, ES2016. 4 Deep expertise with Javascript. 5. Provide comprehensive alerts and monitors on the upstream services to make sure we met 99.99% SLA.6. You've built side projects or professionally utilize the latest stacks and libraries such as Node.js, React, Angular, Rails, LESS, SASS, CoffeeScript, etc. 7. Strong understanding of HTTP, HTML, CSS, Web APIs and other core Web Technology concepts along with deep understanding of Web and Information Security concepts and concerns, such as CORS, CSP, CSRF, XSS, etc. 8. Participate in the full SDLC (Agile), including meetings, iterative development, estimations, and design sessions.9. Stay current with the newest online technologies, research new technologies and make recommendations on implementations. 10. Work with other developers to review stories and specifications and ensure that the teams are meeting the objectives of the business while maintaining technical and architectural standards. ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Sc in Any Specialization, B.Tech/B.E. in Any Specialization, BCA in Computers", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["AngularJS", "LESS/SASS", "CSS", "UI", "WebAPI", "Redux", "Javascript", "Node.js", "HTML", "React.js", "SDLC"]}