{"Job Title": "Software Engineer - Frontend Development - React.js/HTML5/CSS3", "Company": "Serving Skill", "Experience": "3 - 5 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Roles and ResponsibilitiesJob Description- We are looking for a ReactJS Frontend Developer responsible for the client side of our service. - Your primary focus will be to implement a complete user interface in the form of a responsive (desktop/mobile/tablet) web app, with a focus on performance. - Your main duties will include creating modules and components and coupling them together into a functional app. - You will work closely with the back-end team to decide REST contracts.Roles & Responsibilities- Delivering web front-end applications from scratch- Ensuring high performance on desktop & mobile.- Writing tested, idiomatic, and documented JavaScript, HTML and CSS- Coordinating the workflow between the graphic designer, the HTML coder, and yourself- Cooperating with the back-end developers in the process of building the RESTful API- Communicating with external web servicesEligibility:- 3+ years of industry experience- Must have 2+ years of experience in JavaScript. Must be a Professional, with excellent communication skills.- Expert in React Redux, Redux Saga, ES6 and Object Oriented Javascript. React native would be a plus. Working knowledge of HTML5 and CSS3.- Creating self-contained, reusable, and testable modules and components- Thorough understanding of the responsibilities of the platform, database, API, caching layer, proxies, and other web services used in the system- Validating user actions on the client side and providing responsive feedback- Experience with building the infrastructure for serving the front-end app and assets- Documenting the code inline using JSDoc or other conventions- Writing extensive unit tests using automated TDD tasks- Creating configuration, build, and test scripts for Continuous Integration environments- Ability to communicate complex technical concepts to both technical and non-technical audiences.- We expect an entrepreneurial mind-set, someone who is not afraid to take on new challenges every day and who considers the product as his own by taking complete ownership of it", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Sc in Any Specialization, BCA in Computers, B.Tech/B.E. in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["RESTful API", "UI", "Redux", "HTML5", "Javascript", "ES6", "Redux-Saga", "React Native", "React.js", "CSS3"]}