{"Job Title": "Software Development Engineer I  Backend", "Company": "Enquero", "Experience": "1 - 3 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "     Responsibilities       At Enquero, we believe in hiring people smarter than us, we also believe that if we are the smartest person in the room then we are in the wrong room. And the way to balance between the two philosophes is teamwork.         As an SDE1 in Enquero’s Products & IP BU, the ideal candidate is one who is conversant with and can work independently on at least one technology in their primary role and is passionate to learn and expand his/her knowledge in their secondary role         You are passionate for programming combined with your strong fundamentals where analysis of situation or data requires review of relevant factors. You will exercise independent judgement within defined policies and procedures to determine appropriate action as well as reconcile your judgement on designs with the overall objective of the product’s technical roadmap and business goals.         Your demonstrated ability to consistently achieve this while building the new features and diversifying your knowledge in the areas broader than your programs/assignments will define success in this role.                   Primary responsibilities for the role include:           Must have strong fundamentals of Backend, API development and Design with understanding of algorithms (implementation in any language is okay)     Execute and build solutions based on designs proposed by leads, participate in peer review and take feedback     Continuously evaluate and improve on programming techniques while having clear understanding, visibility and impact of the development on the overall product.     Understand the concepts of data management in OLTP and OLAP data stores and has extensively used one or the other databases.     Lead and own delivery or work items, highlight & articulate dependencies and effectively communicate blockers that needs to be resolved at higher levels.     Must be willing to learn new technologies, processes, business functions.       Qualifications            REQUIRED QUALIFICATIONS:       Education      No formal degree in any stream is required.     ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Maven", "Backend", "Version control", "GIT", "Data management", "MySQL", "OLAP", "Oracle", "JIRA", "OLTP"]}