{"Job Title": "Embedded Software Development - Rail Domain/Rolling Stock", "Company": "Le Human Resources Solutions Pvt Ltd", "Experience": "10 - 20 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Roles and Responsibilities About the role:    The  Software Engineer applies the principles of software engineering to the design,  development, maintenance, testing, and evaluation of software of embedded Train  Control and Management Systems.  He/She  performs software design assignments requiring initiative, resourcefulness and  design experience and provides advice and guidance to other engineers or  designers.  Essential:     Programming  knowledge in C or C++ for embedded systems in Rail Rolling Stock or Signalling  Domain. Exposure to MISRA 2011 standards will be an added advantage.  Excellent  knowledge of Model Based Development using typical Functional Block Diagram (FBD) based  tools used in the Rail Domain. Similar experience with MATLAB / Simulink or similar tools may also be considered.  Specialized  or cross-functional knowledge / relevant experience required by the  position/role  Familiar  with complete software development life-cycle (requirements management, design,  development and testing ) for embedded systems  Excellent  knowledge of control systems design, testing and troubleshooting in  rail domain  Has  performed complete lifecycle of product or application development in minimum  in two projects  Strong  knowledge of Software Configuration Management and other lifecycle management  tools like ALM, Issue / Bug tracking tools and test management.  Experience  of working with global teams     ", "Role": "Subject Matter Expert,", "Industry Type": "Other,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "System Design/Implementation/ERP/CRM", "UG": "B.Tech/B.E. in Electrical, Electronics/Telecommunication, Computers", "PG": "Post Graduation Not Required", "Doctorate": "Doctorate Not Required", "Key Skills": ["C", "Rail", "Rolling Stock", "Misra", "Simulink", "Embedded Systems", "MATLAB", "Embedded Software Development", "signalling"]}