{"Job Title": "Software Engineer (Mobile development – Android)", "Company": "Sapwood Ventures Pvt. Ltd. ", "Experience": "2 - 4 years", "Salary": "₹ 3,00,000 - 6,00,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": "A software company is looking for a software Engineer ANDRIOD (Mobile Development)Technologies: Java, Android, Kotlin, Retrofit Excellent Knowledge in Java, Android Strong knowledge with OOPs concepts. Good Knowledge of Android SDK's, Android Studio, Gradle, Kotlin, Retrofit. Hands on experience in the full life cycle of Android application development Experience with storage components (SQLite, files etc) Working experience with Fragments, Activity and other Android components Collaborate with cross-functional teams to analyze, design, and ship new features Local and push Notifications in Android. Good working knowledge on Version Control GIT Excellent communication skills (verbal and written skills in the English language) Locations related Google APIsGood to have: A portfolio of Android / iOS apps in the Play Store/app store is a plus Good to have experience in iOS technology - Objective-C and iOS SDK Good working knowledge in Cocoa Touch Experience in Payment gateway integration in mobile apps Experience with Binders and AIDL in Android. Developing or directing software system testing or validation procedures A strong sense of ownership Exceptional technical skills Ability to understand the problem and craft the right solution Strong software architecture skills Dedicated to completing projects of the highest standards, on time Passionate about the work they undertake Previous experience working with a team on a large, complex project Excellent communication skills (verbal and written skills in the English language) Should be a self-starter and capable of operating on minimal management oversight Experience in debugging softwareoles and Responsibilities Desired Candidate Profile - Software Engineer-Mobile DevelopmentPerks and Benefits For further Details pls contact and please send your updated Resume toKIRANSr.ConsultantSapwood ventures pvt.ltd7987870177kiranmayi.chakravarthi@sapwood.net", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Client/Server Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "Doctorate": "None", "Key Skills": ["JAVA", "Retrofit", "Mobile Development", "Software Engineering", "KOTLIN", "Android"]}