{"Job Title": "Software Development Engineer II Backend", "Company": "Arvind Internet (A division of Arvind Limited)", "Experience": "4 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Tech @ Omuni, Arvind Internet:• Our architecture is powered by 50+ microservices, all built on open-source stack• Our systems process 1+ billion inventory updates a month• We have best in class integration patterns for fault tolerance and resilience• We design systems for SaaS offerings, we build for cloud and different form factor• We have the coolest apps in fashion commerce by combining in-store and digital experiences• We work on some complex programs involving integrating with disparate external systemsAbout the role:You will be responsible for:• You will be building distributed, fault-tolerant, highly scalable distributed systems.• Rapidly prototype and incubate new features and solutions.• Develop solutions to scale the real-time processing of massive amounts of data.• Work closely with other development teams to build and prototype solutions cutting acrossmultiple verticals.• Maintain and improve code base on continuous basisIdeal Candidate profile: 4+ years of experience creating highly scalable, high performance distributedapplications Experience working in agile team/ processes. Apply best coding practices , code reviews, source control management, buildprocesses and unit testing Experience building complex software systems that have been successfullydelivered to customers. Experience with scalable, API based agent or service oriented software architecture Must be able to write high quality, fault-tolerant and optimized code in Java. Excellent understanding of Algorithms, wise usage of Data Structures, complexityanalysis Ability to collaborate; be able to communicate clearly and concisely Desire for continuous improvement, always be learning and seeking improvement. In-depth understanding of collections, Multithreading, JVM Memory model, Optimizations and fine tuning of JVM Excellent problem solving and troubleshooting skills especially in a distributed andmicroservice based environment. Experience in distributed systems components - databases, caches, distributed,debugging and tracing, deployment. Meet the team:Arvind Internet is a young, dynamic, fastpaced organization that:• Loves solving complex problems• Challenges status quo• Is Customer drive• Engineers productsOur average age is 29 years!Culture:We are an open, employee-friendly organization with a flat structure. The core of all our processes is #rethinkretailBenefits Perks • Arvind Pride Card: 30% discounts on all brands of Arvind Fashion Limited, like U.S. Polo Assn., GAP, Arrow, Flying Machine, Ed Hardy, etc.; 20%-30% discounts with Sephora, Unlimited• A comprehensive and contemporary TimeAway from Work • Working with the best minds totransform retail• Flexi-working scheduleRegular Celebrations and outings • Relocation benefits for an inter-city movement • An approachable & accessible leadership team• Birthday gift voucher •Insurance program for FamilyTo know us more, you can visit us on: www.omuni.com; follow our LinkedIn page:Arvind Internet - A Division of Arvind Limited Interview Process for SDE II:In order to help you prepare better, wed like to share with a directional sens of what to expect in the interview:Exploratory call by Recruiter: [ 5 mins ]Recruiter call: [ 20 mins ] Recruiter call to check if you are interested in exploring job opportunity with us If yes, the Recruiter shares with you the JD.Does data checks in terms of CTC and Notice periodRound 1: Technical Screening [ video- call ]Discussion with a potential peerInterviewer explains about the org and therole Understands your past work experience, major projects youve worked on, assess your understanding of Data Structures and Algo; answers any questions you may have If the profile is further shortlisted, the next round is scheduled by the Recruiter Recruiter briefs you about the org; about the Tech org; about the role Understands from you about your work ex, skills,  expectations about the role, etc. If your profile is shortlisted in the screening process, the 1st Technical Round is set up with the Technical panel.Round 2: Problem-solving [ in person / video-call ]Discussion with a potential peerInterviewer assess you for your understanding ofDB, design thinking. One would want to understand your approach to solving problems, coming up with multiple approaches, technical expertise, etc. If the profile is further shortlisted, the next round is scheduled by the Recruiter Round 3: Technical Screening [ in-person / video- call ]In this round the interviewer attempts to understand design thinking and Problem-solving skillsUpon clearing this round, an interaction with the CTO is scheduled Round 4: CTO Round [ in person / video- call ] This round is to get an overall understanding about your profile, your strengths and opportunities for grooming, cultural and team fitment Round 5: Head HR Round [ in person / video- call ] This round is to get an overall understanding about your profile, org and  cultural fitment Post this round, a discussion with the Head of HR is scheduled.The above steps are meant to be directional and may undergo some change based on the deep-dive ones profilerequires", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - eCommerce, Internet Technologies,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "Doctorate": "None", "Key Skills": ["Java", "LLD", "Data Structures", "Software Architecture", "Problem Solving", "Spring Boot", "Microservices", "Distribution System", "Design", "Multithreading", "NoSQL", "Coding", "MySQL", "API", "High Level Design"]}