{"Job Title": "Manager-Software-Development", "Company": "Advanced Micro Devices, Inc", "Experience": "10 - 15 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": " Developing great technology takes more than talent: it takes amazing people who understand collaboration, respect, and who will go the extra mile to achieve unthinkable results.    It takes people who have the passion and desire to disrupt the status quo, push boundaries, deliver innovation, and change the world. If you have this type of passion, we invite you to take a look at the opportunities available to come join our team.    Manger Compiler/Toolchain Development            Responsible for managing, leading and developing software engineering teams, planning software development projects, creation of documentation, and delivering software products for internal as well as external customers.                  This role also requires that the individual can interact and work with their counterparts globally to ensure effective delivery of the projects.                  The successful candidate will be responsible for providing and ensuring consistent project planning, technical development, cost and risk management, and design rigor throughout all projects.            Your responsibilities include, but not limited to:      Managing teams of varying roles, varying sizes and responsibilities              Responsible for delivering the products that the teams are responsible for                  Participate and play critical role in planning project deliverables               Work with other organizations, including test/QA/Release, in releasing the product to customers                      Performing individual goal planning and evaluation in accordance with AMD policies                Maintaining the health and morale of the team             Developing and growing the engineering skills of the team               Performance management of the software engineering team Interaction, coordination, and communications with counterparts across geographies.                   Driving critical issues and interface with cross functional teams           Providing periodic management/executive updates        Leading brainstorming sessions, reviewing and providing input into engineering projects requirements                    BS or MS degree in Electronics/Electrical/Computer Engineering, plus a minimum of 10 years of experience in hands-on software engineering, development, and architecture                           Minimum of 3 years of experience as manager and comfortable acting in a leadership role                        Experience working with and managing a strong Compiler / libraries / DeveloperTools system software development teams                         Proven leadership skills in a team environment and ability to provide direction in an ambiguous environment                       Proven track record of planning and delivering complex system software products                   Strong project management skills and experience with project management techniques such as scheduling, budgeting, and risk management.                            Demonstrated disciplined approach to problem solving and ability to make business decisions in a technical environment                      Thrives on challenges in a fast-paced, deadline driven environment                 Proactive communication and planning skills              Good knowledge and/or experience in compiler/performance Analysis tools domain      ", "Role": "Head/VP/GM-Quality,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Senior Management", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Graphics", "Performance management", "System software development", "Project planning", "Scheduling", "System software", "Budgeting", "Risk management", "Gaming", "Software project management"]}