{"Job Title": "Software Development Engineer in Test (SDET)", "Company": "Cohesity", "Experience": "3 - 7 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "     Cohesity is seeing rapid adoption in enterprises and the scale of deployments is increasing every quarter. Performance is one of the crucial components for providing a seamless user experience when running different workloads. It is the most highly visible and impactful area that has a potential for defining the future directions for Cohesity s hyperconverged appliance.     Ideal candidate is passionate about performance,  has an intuitive understanding of the limits of every layer in the hardware/software stack,  has the intellectual rigor to reason about the theoretical limits of our software architecture and own the areas with the highest impact.     Responsibilities:      Architect,  own and drive:       Infrastructure/Framework(s),  tools and test development efforts.     Continuous integration related process changes and improvements throughout engineering lifecycle.      Execute on the Automation Infrastructure & Tools roadmap and build/enhance test infrastructure,  tools that:      Facilitate running test harnesses reliably.     Simplify development of new test harnesses and test cases.     Reduce the time to analyze failures and catch regressions (both functional and non-functional).      Design,  implement,  enhance and maintain test harnesses,  libraries,  test cases corresponding to various product areas.     Understanding of Infrastructure management tools is a big plus     Work with the engineering team during the feature design and implementation phases to ensure that:      The feature has test hooks that can be leveraged to automate test cases.     The feature is debuggable.      Participate in code reviews.     Mentor team members.     Analyze failures and root cause issues,  file defects,  follow up with developers,  documentation and other teams on the resolution if product issues are found.     Collaborate with other test team members,  developers,  technical writers,  and customer solutions engineers to ensure the company delivers high quality products to our customers.      Requirements:      Prior experience of designing,  building    robust,  multithreaded test frameworks   and harnesses preferably in Python or Go.     Good knowledge of Linux and should be comfortable with shell.     Excellent troubleshooting abilities spanning multiple software and hardware components (such as switches,  storage systems,  kernels) is a plus.     Have a high bar for the quality of the product.     Creative,  independent,  self-motivated and willing to learn new technologies.     Possess good understanding of QA methodologies and processes.     Ability to take up a variety of roles in a startup environment.     Knowledge of ESXi,  HyperV is a plus.     Understanding of storage concepts is a plus.     Experience with distributed systems (databases,  storage,  map-reduce frameworks,  etc.) is a plus.          Qualification:      BS in Computer Science with 10 yr experience or MS in Computer Science with 8 yr experience     4 years experience with systems products (automation in the domain of storage,  networking,  virtualization,  etc.)   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Engineering", "DBA", "Engineer", "Technology", "Computer Science", "Database", "SQL"]}