{"Job Title": "Software Development Engineer  -  Frontend", "Company": "Esper", "Experience": "1 - 4 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "        The Role:        We are looking for a talented Front - End Engineer to join our team. As a core member of Front - End team you will influence how we build individual features and take ownership of end to end product quality that will help make our app/website reliable. You will engage with an experienced cross - disciplinary staff to build the products. You will work closely with the Cloud, Android, Design and Marketing team to drive the development from the concept stage to the launch stage.         Responsibilities:         Ensure effective Design, Development, Validation and Support activities in line with the product requirements and architectural requirements.    Ensure continual knowledge management.    Adherence to the organizational guidelines and processes.      We are looking for people who have      Thorough understanding of React.js and its core principles.    Experience with popular React.js workflows (such as Flux or Redux).    Strong proficiency in JavaScript, ES6 including DOM manipulation and the JavaScript object model.    Familiarity with newer specifications of EcmaScript, and up - to - date with the latest technologies.    Experience with data structure libraries,(e.g., Immutable.js ).    Good coding skills as per standards and knowledge on third - party libraries.    Familiarity with building Frontend Device Management is a plus.    Have knowledge of browser behavior, performance, compatibility and cross - browser issues.    Proficient understanding of code versioning tools, such as Git.    You take pride in working on advanced CSS, animations and responsiveness.    Experience in NodeJS is a bonus.    Experience with other JavaScript frameworks like VueJS, AngularJS, ElectronJS is a plus. Familiarity with Responsive Web Design, common Web UX patterns and anti - patterns.    Ability to differentiate good design from bad design.    Ability to write clean, maintainable code which others can work on.    You re someone who wants to join our team and take us to the next level. Someone who doesn t see front - end as just a job who cares about what they do.    You have ideas for how to improve and expand efforts and are proactive enough to see those ideas through to implementation.        ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - eCommerce, Internet Technologies,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Product quality", "DOM", "GIT", "Front end", "Architecture", "Coding", "Debugging", "Javascript", "Web designing", "Android"]}