{"Job Title": "Software Development Engineer III", "Company": "Glance IT Solution", "Experience": "5 - 7 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "    you be doing         You will own the front-end development for one or more of our products and collaborate with visual/interaction designers, other engineers, and product managers to launch new products, iterate on existing features, and build a world-class user experience.         You will implement cutting-edge technologies and will be writing state-of-the-art code to keep InMobi at the cutting edge of current technology.         Your specific expertise will be required to make the site delightful, secure, performant and accessible to all our members.         Meet with colleagues including product managers, designers and other engineers assigned to your project(s).          What do we expect from you           Experience between 5-7 years into frontend development.         Substantial experience in building large complex and performant web applications using Javascript, HTML and CSS across multiple browsers.         Experience in frameworks such as React, AngularJS etc and good understanding of the basics of these frameworks and their life cycles.(MUST HAVE)         Deeper understanding of Chrome Dev Tools. Should understand nuances of the timeline for perf monitoring.         Deeper knowledge of UI optimizations and performance.         Deeper understanding of network layer, HTTP, HTTPS, cookies, local storage.         Strong problem solving skills, Good understanding of data structures and algorithms and their space and time complexities.         Excellent communication skills, good visual design sense, in-depth experience in developing web-based applications.         Experience leading multi engineer projects and mentoring junior engineers.         Strong technical aptitude and a good knowledge of CSS fundamentals         Command an impressive portfolio of the latest UI technologies is a plus         Nice to have skills:         Tech Skills: Full stack experience NodeJS , GraphQL etc      ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Bengali", "Malayalam", "Front end", "Mobile phones", "Javascript", "Data structures", "HTML", "HTTP", "Monitoring", "Visual Design"]}