{"Job Title": "Software Engineer, Product Development", "Company": "Taragana", "Experience": "2 - 7 years", "Salary": "Not Disclosed", "Location": "Kolkata, Kolkata", "Job Description": " We develop b2c and b2b products and solutions.  Our bioinformatics solutions are used by major bioinformatics and biotechnology companies worldwide like Invitrogen,  Millipore,  Scripps Research Institute etc.  and major universities.  Our market leading web product is used by worldwide web community.  Our information portals are visited by several million people every month. \n\nWe develop leading edge world-class web 2. 0 products and services with technologies such as Java,  PHP,  Javascript,  JSON,  XML,  HTML etc.  We do not follow others,  we believe in leading the way. \n\nWe have a very open culture with a flat hierarchy.  We honor talent and dedication above everything else. \n\nWhat are we looking for?\n\nWe are looking for energetic and enthusiastic programmers for product development.  The essential qualities are honesty,  talent,  dedication and a burning desire to make a difference.  We demand innovative solutions from our developers. \n\nWe do not care if you are male or female.  We do not care if you are married or single.  We do not want your passport number nor do we want to know about your parents or their professions.  We want to know only about you and what you can do for us.  At the core we want problem solvers. \n\nStrong knowledge of Java and / or PHP along with strong foundation in algorithm and data structure is a plus. \n\n", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["java", "software development", "passport", "web", "xml", "product development", "bioinformatics", "php", "json", "html", "javascript", "research"]}