{"Job Title": "Software Engineer - Product Development", "Company": "Pennant Technologies Pvt Ltd", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "Software Products and Services\n\n Profile\n\nPosition\n\nDescription\n\nWe are looking for technology professional with demonstrated experience in the development,  enhancement or management of Software Products specifically developed for Lending Vertical. You will be part of our core software product development team that strives to add new functional features to our core Product suite that focuses the complete life cycle of lending vertical in BFSI Domain.\n\nResponsibilities\n\nKey responsibilities include development and management of our Product Suite built on Java/ J2EE environment. The role requires hands-  on experience in the complete software development life-  cycle preferably in Agile methodologies as the role requires active involvement in the entire product life cycle from planning to execution. In addition,  the role requires:\n\n Designing and developing high-  volume,  low-  latency applications for mission-  critical systems and delivering high-  availability and performance\n\n Contributing in all phases of the development lifecycle\n\n Development using J2EE standard MVC framework using Jsp,  spring web-  flows.\n\n Writing well designed,  testable,  efficient code\n\n To work on Change Requests that are requested by the clients,  product features or enhancements that are planned as part of product roadmap\n\n Troubleshooting performance,  scalability,  performance,  reliability,  security,  availability issues for integrated solutions and debugging Production Problems\n\nSkills\n\n Hands on experience in JAVA / J2EE Technologies Spring Framework,  Struts.\n\n Able to write complex queries.\n\n Good Designing Experience.\n\n Hands on experience in SOA.\n\n Hands on experience in Web Logic Application Server.\n\n Must have completed 2-  3 complete life cycle implementations in Lending Domain.\n\n Hands on experience in managing complex software components.\n\n Good understanding on Architectures.\n\n Sun Certified Java Professional is an added advantage\n\nQualifications\n\n Bachelors or Masters Degree in Computer Science,  Engineering or any related subject\n\n At least 2 plus years of experience in Product Development or Application Development\n\n Product Development Experience in BFSI Domain in Lending Vertical is mandatory\n\nContacts\n\nPennant Technologies", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["development", "SOA", "software", "JSP", "Debugging", "SEZ", "developing", "Troubleshooting", "Computer science", "spring", "java", "application", "web", "Agile", "j2ee", "Struts", "Application development", "Software Engineer Product Development", "mvc", "applications"]}