{"Job Title": "Senior Staff Software Engineer - Web Technology Development", "Company": "Talpro", "Experience": "10 - 15 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "Roles and ResponsibilitiesDescription :- Looking for Sr. Staff Software Engineer to join our growing R&D organization. The candidate should have extensive experience in Java web-based application development. Responsible to build highly scalable & robust enterprise applications and provide technical guidance to the team.- The suitable candidate should have a strong technical background with solution skills in Java/J2EE. We are looking for a dynamic, talented person who is ready for a challenge where teamwork, technical ability, and problem-solving skills are essential.Responsibilities : - Design and implement networking / EMS / NMS solutions with high optimization and performance- Assist to address problems by coordinating with different teams and stakeholders and provide Technical Solutions, Proof of Concepts.- Review the code and provide the recommendations on coding style and best practices.- Come up with proof of concepts for critical modules/new frameworks- Establish high, mid and micro level plans and estimates for project teams.- Work effectively with all stakeholders and engineers throughout the lifecycle of the product to deliver a competitive product on time with the right quality- Work with customers and third-parties to understand their requirements/feedback and build features that increase the lead Gigamon has in the market. Skills and Competencies : - 10+ yrs with Strong Web technology development experience along with architecture and design experience in Java/J2EE technologies- Strong proficiency in Core JAVA, J2EE, JMS, Webservices- Experience with Service Oriented Architecture concepts and products- Strong Proficiency in frameworks like Spring, Spring Boot, Web, Data access module or ORM framework such as Hibernate- Experience with designing and implementing RESTful Web Services and Micro-services design principle using Spring Boot or a similar framework.- Good understanding of RDBMS concepts, entity modeling, and SQL query.- Proficiency with scripting frameworks such as JavaScript, Python, Node.js, and JSON- Strong proficiency in one or more of the following Database technologies (Mongo DB, Elastic, Postgres, HBase, Open TSDB).- Strong proficiency in HTML5 and Knowledge in any of Web message frameworks like Rabbit MQ- Experience with Source/Version control systems like GIT and project tracking tool JIRA.- Exposure to build and release process and tool. (i.e. Maven, Docker, etc)- Good knowledge of Unit test frameworks like JUnit. Hands on experience of unit and integration tests to demonstrate the robustness of delivered work.- Experience with Continuous Integration and Continuous Deployment tools (DevOps) is a Plus- Experience in executing projects in a distributed development model- Excellent communication skills: written, verbal & presentation/facilitation- Strong analytical and problem-solving skills- Good knowledge about disruptive networking technologies like SDN / NFV is a big advantage- Working knowledge of vSphere API; vCenter and ESXi experience is a plus - Working knowledge of Open stack, Amazon EC2, and other cloud platforms and environments is a plus.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization, B.Sc in Any Specialization, BCA in Computers", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["Java", "DevOps", "Vmware Vsphere", "CI/CD", "J2EE", "OpenStack", "SDN", "vCenter Operations", "NFV", "ESXi"]}