{"Job Title": "Software Development Engineer in Test", "Company": "CrowdStrike", "Experience": "4 - 8 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "      About the Role   As part of building a product to defend against a variety of threats,  we need to build a system to test the product against those threats. There is a need to answer the question of do we detect thisand if so,  under what circumstances or configuration. This may also include understanding how well we do given a body of samples under a variety of configuration settings.   This is a (Senior) Software Development Engineer in Test (SDET) position in the engineering team. This role focusses on development of automation framework and scripts,  tools,  harnesses,  and specialized tests for the sensor and end- to- end testing of the product. SDETs may also participate actively in design and code reviews,  and collaborate with the cloud and UI teams to assure end- to- end system functionality. They may also work with customers and product management to understand use cases and end to end scenarios.     What You ll Need       Designing,  developing and supporting effective and reusable test automation framework,  scripts,  tools and test setup for the entire team to use for developing tests effectively; the goal is to minimize manual testing and enable the team to write automated tests to test the product     Identify and write specialized tests across platforms such as Windows,  Linux and MacOS to ensure the quality of the system as a whole focusing on end- to- end test/customer scenarios inclusive of API and UI automation.     Relevant Automation experience level 4 to 12 years.     Proven experience in test automation,  extensible test framework design and development,  test planning,  test case designing and test execution     Hands on experience on writing quality code in any scripting or programing language. Having knowledge on Python is a plus.     Should have exposure to any of the Web supported tools/framework such as Selenium,  Django,  or web2py     Hands on experience to any of the CI/CD tools and process such as Jenkins / Bamboo     Database integration via automation framework is good to have. Experience on Mongo database is a plus      Bonus Points       Knowledge of Ansible,  Jira,  TestRail,  is good to have.     Having a sound knowledge on Networking concepts is a plus     Knowledge of enterprise applications deployed to cloud environments such as AWS is a plus      ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Product management", "Manual testing", "Linux", "Networking", "Enterprise applications", "Machine learning", "Windows", "Selenium", "JIRA", "Python"]}