{"Job Title": "Software Development Engineering in Test-DataProtection", "Company": "Cohesity", "Experience": "6 - 11 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "  What we are looking for:      BE/BTech degree in Computer Science with 6 years of experience. Master s degree is an additional advantage.    At least 4 years out of the total experience with testing enterprise software related to Vmware, storage or backup.    3 years out of the total experience with designing and implementing automation for testing enterprise-grade products    Advanced programming and debugging skills in Golang or Python    You have worked on and understand:     Vmware virtualization - vSphere, ESXi, VMFS, SRM, VAIO, vSAN, vCloud director, VMC.    Filesystems and the storage subsystem    Test frameworks, CI/CD pipeline and Jenkins    Test suite management systems     You have a high bar for the quality of the product. Creative, independent, self-motivated and willing to learn new technology.    Possess good understanding of QA methodologies and processes.    Strong test planning ability with understanding of enterprise storage workflows.    Be a champion for the product and services built by the team.    Possess excellent communication and sharp analytical abilities      Responsibilities:      Lead the testing effort in virtualization, storage and cloud domain    Work with the rest of the engineering team during the feature design and implementation phases to develop robust test plans.    Automate test cases.    Execute these test plans by running both manual and automation test cases.    Collaborate with other testing members, developers, technical writers, and customer solutions engineers to ensure the company delivers high quality products to our customers.    Analyze failures and root cause issues, file defects, follow up with developers, documentation and other teams on the resolution.    Monitor and manage the continuous integration automation environment.   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "VMware", "Automation", "Data management", "Debugging", "Test cases", "Virtualization", "Distribution system", "Python", "SRM"]}