{"Job Title": "Software Developer - Web Development", "Company": "BUYERSGOHAPPY.COM", "Experience": "1 - 5 years", "Salary": "Not Disclosed", "Location": "Not specified", "Job Description": "BuyersGoHappy Marketing Private Limited is a performance based online marketing company.  We work with 350+ partner websites to provide performance based marketing solutions.   We provide performance based marketing solutions tailored in 14 categories including Households,  Travel,  Fashion,  Sports Fitness,  Home,  Living Furniture,  Personal Care,  Baby Kids etc.  Responsibilities: Improving and maintaining the design of existing website.  Working on new product features for both existing and new user.  Testing site functionality, identifying problems or bugs and fixing errors Working on technologies including HTML, PHP,  MySql and CSS.  Develop,  host and manage web resources.  Create pages that appeal to the tastes of the sites users.  Stay plugged into emerging technologies/ industry trends and apply them into operations and activities.  Knowledge about App development,  chrome/ mozilla plugins would be a plus.  Requirements:  Engineering graduates/ post graduates with a background in CS/ IT.   Must have skills are excelling HTML,  Java,  CSS,  PHP,  MySql with a creative disposition.  Should have an experience on working with the cloud solutions like Godaddy,  Wordpress etc.  A solid understanding of how web applications work including security,  session management,  and best development practices Adequate knowledge of relational database systems,  Object Oriented Programming and web application development  Ability to work and thrive in a fast-paced environment,  learn rapidly and master diverse web technologies and techniques.  Proven ability to design code and build perfect web sites.  You must have the willingness to succeed in an early stage startup environment. ", "Role": "Software Developer,", "Industry Type": "Media, Entertainment, Internet,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["CV", "Online marketing", "Web development", "MySQL", "Wordpress", "PHP", "Software", "HTML", "Object oriented programming", "Sports"]}