{"Job Title": "Senior Architect - Software Development", "Company": "Wish Workforce Augmentation Services", "Experience": "10 - 15 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": "Roles and ResponsibilitiesSenior Architect - Software DevelopmentLocation :Gurgaon, IndiaFull Time Key Responsibilities :- Take lead in the design and architecture of one or more product components. - Lead the development and execution of the architecture of current and new products in-line with the complete understanding of customer needs. - Leverage industry best practices and your own innovations to deliver the product/component - Author documents that transform into high-level engineering designs - Actively participate in mitigating high risk developments by working on multiple feasible solutions and delivering the most stable, secure and scalable product. - Understand and incorporate the proper certification and compliance requirements into the product designs. - Define and ensure proper verification strategies of product in consultation with team members. - Participate in strategic planning for and delivery of expansion of the support strategy of current and new products in-line with the Product Team's recommendations. - Understand and incorporate design, development, manufacturing and deployment timelines whilst defining the architecture/functioning of product.Requirement :- B.E / B.Tech / M.E / M.Tech / M.S/ PHD- Possess over 10 years of professional experience- Expert level J2EE/Java with Microservices background preferably in Spring Boot.- Experience architecting, developing and deploying new, high availability SaaS microservice architectures with RESTful APIs.- Expertise in independent testing of microservices and its integration with devops CI/CD pipeline, including Jenkins, static analysis tools, etc- Worked in designing, developing and deploying complex Software products from concept to release.- Can understand and convey customer's requirement in different geographies to the team- Possess great collaboration and leadership skills to work with teams and stakeholders cross-functionally", "Role": "Technical Architect,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "MS/M.Sc(Science) in Any Specialization, M.Tech in Any Specialization", "Doctorate": "Ph.D, Doctorate Not Required", "Key Skills": ["Technical Architect", "Jenkins", "RESTful API", "Java", "CI/CD Pipeline", "Microservices Architecture", "J2EE", "PhD"]}