{"Job Title": "Senior Engineer Software Development", "Company": "GRAVITAS", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": "  Responsibilities   Develop solutions according to business requirements   Participate in business analysis and requirements gathering.   Develop reporting/dashboard solutions for financial or otherwise operational analysis.   Assist team members on development strategies   Assist in building and maintaining libraries/frameworks to support complex applications.   Integrate disparate systems in line with business processes.    Skills Required:    3 years of Experience in Microsoft Dynamics CRM, must have experience with Dynamics modules ( sales, marketing etc).    Extensive knowledge of .NET C#, ASP.NET, T-SQL, PL/SQL   Good working knowledge of reporting solutions such as PowerBI and SSRS   Demonstrable proficiency of Microsoft SQL Server DBMS   Good knowledge of web frontend technology, Frameworks and standards (e.g. JavaScript, CSS3, HTML 5)   Experience working in a professional Agile/Scrum environment   Knowledge working closely with source control systems such as subversion, git or TFS.   Excellent communication skills and being able to work independently or in a full team.   Either SharePoint or dynamics CRM solutions development   Maintenance of existing code/plugins.   Attitude Teamwork Projecting confidence tempered with humility. Must be a team player willing both to steer the team towards success and to fully support the team when others are struggling.   Problem Sensitivity The ability to tell when something is wrong or is likely to go wrong. Recognizing there is a problem and informing the resources who can address the problem.   Analytical and Detail Oriented    Requirements    Excellent business communication, writing and interpersonal in English essential    Understanding of sales/marketing workflows and terminologies.   Mobile application development    French Language skills   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["GIT", "French", "Business analysis", "Subversion", "SSRS", "Javascript", "Microsoft Dynamics", "DBMS", "Release management", "CSS3"]}