{"Job Title": "Director, Software Development", "Company": "AppDirect", "Experience": "2 - 3 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "     What youll do and how youll make an impact:      Lead, support and mentor multiple teams made up of Engineering Managers and Full Stack Engineers.      You will partner and drive performance management culture for your teams (i.e. objectives setting, performance reviews and career development).     Attract, retain and grow leaders within the organization.     Work with managers to build, refine, and communicate technical and product roadmaps.     Coach engineering managers on how to build high performing teams with good engineering hygiene and operational excellence.     Growing talent with structured career development and mentorship. Ensuring personal development plans, goals and objectives are defined for individuals.     Support and unblock the team in their latest development of micro services in production while being an evangelist for quality, performance, and security compliance for your team and across the billing organization.     Understand the system end-to-end from front-end and backend to help the team make tradeoff decisions.     Partner with the Directors local and abroad cross functionally to execute on strategic initiatives across the office, billing engineering group, the engineering department, and leadership team.     Partner and execute with Product Manager, Designer, and other Engineering Managers and Tech Leads to collaborate and build one of the best billing services experiences anywhere. Clearly communicating any risks with impact and mitigation plans.     Act as a sounding board and motivator for individual creativity on technical challenges, process efficiencies and everything in between.      What you ll need/Assets:      You are a technical leader with a real passion for development and with a strong product sense with a data driven approach.     Can translate ambiguity into clarity for your teams and the organization.     You can appropriately work with your managers to set objectives and empower them to solve problems by setting the right dynamic that encourages creativity and engagement..     You have a history of demonstrated success by building products end to end from concept to production.     You have a clear focus on creating value, know the importance of commitment and have great communication skills which help keep those around you keep calm and collected. Deadlines inspire you.     You drive objectives to completion, on time and to plan, and you are a fast learner, capable of picking up new skills as you go.     10 years of solid software development experience, with 5 years of experience managing software development teams. 2 - 3 years of experience managing managers at a Director level.     Experience managing multiple product development teams, having a total group of 25 or more.     Degree in Computer Science or a related field     Strong understanding of the following concepts and methodologies:      Data Structure / Algorithms      Object Oriented Analysis and Design     Design Patterns     Agile Development methodology      Have had solid experience demonstrated in some of the following technologies:      Core Java Java Frameworks: Spring Framework / J2EE / Reactor     Javascript technologies and frameworks: Node.JS / React / Angular     MySQL / MongoDB / Cassandra / Redis / Elasticsearch     Container: Docker / Rkt     Orchestration: Kubernetes / Mesos / OpenShift     Messaging: RabbitMQ / Kafka     Data Streaming: Flink / Spark     API: REST / GraphQL     Testing: JUnit / Mockito / Selenium / Cypress    ", "Role": "Head/VP/GM-Technology(IT)/CTO,", "Industry Type": "Internet, Ecommerce,", "Functional Area": "IT Software - eCommerce, Internet Technologies,", "Employment Type": "Full Time, Permanent", "Role Category": "Senior Management", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Supply chain", "Computer science", "Core Java", "Front end", "Spring framework", "MySQL", "Billing", "J2Ee", "Scrum", "Selenium"]}