{"Job Title": "Software Development Engineer in Test - Python", "Company": "Delphix", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Noida, New Delhi", "Job Description": "  The Role    At Delphix, quality comes first, and our QA team is the guardian of that quality. The QA team partners closely with project teams to define and execute test plans early in the development process. QA engineers at Delphix are well-versed in writing test automation in Python from automating routine tests to building a robust automation infrastructure for scale and reliability.  Responsibilities    Analyze features and workflows to identify high-risk areas and design a test strategy with detailed test plan and test cases     Design and implement test automation in Python, and plan the work required to achieve this     Monitor and maintain test automation, across multiple platforms and configurations     Run manual testing as required     Design and build tools for effective and efficient testing and results monitoring     Communicate results to multiple stakeholders as required     Contribute as part of the engineering team on incoming customer escalation resolution   Qualifications    5+ years experience in Quality Assurance and Test Automation.     3+ years experience in object-oriented programming and scripting languages     Minimum undergraduate college/university degree in computer science     Ability to think clearly and articulate your vision to others of varying technical comprehension     Ability to work a flexible schedule, across geographies to accommodate business needs   Great, but not required    Experience mentoring and helping to strengthen teams     Experience with other virtualization platforms such as VMware and KVM     Experience in system administration     Experience working with SQL databases (preferably Oracle)     Experience working with enterprise software     Experience working directly with customers on requirements as well as debugging and customization     Previous experience writing automation frameworks in Python     Deep understanding of file systems and operating systems  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["VMware", "ERP", "Automation", "Manual testing", "Manager Quality Assurance", "Debugging", "Oracle", "SQL", "Python", "System administration"]}