{"Job Title": "Senior Manager, Software Development File Analytics", "Company": "Nutanix India Technologies Private Limited", "Experience": "10 - 12 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "      We are looking for a leader who is passionate about solving large enterprise business problems at scale in a fast-paced environment.   If you are interested in building architecturally elegant systems and are motivated by solving hard business process problems with technology then this could be the position for you.    Responsibilities:      Mentor and lead a team of very talented engineers to continue to build File Analytics product   Ability to earn the technical respect of the engineering team. The candidate must be able to understand the product at a detailed level and be able to contribute to design discussions and code reviews   Ability to drive innovation and change. As an engineering leader, we will look to you to help plan, evolve and deliver the product.   Partner with other teams in Nutanix to drive consensus on design decisions   Obsess over the customer and requirements     Qualifications and Experience:      10 years of experience in developing distributed systems (on-prem and Cloud)   3 years managing a team of 15 people   Understanding of any of the cloud technologies (AWS, GCP, Azure) is a plus   Experience/understanding of Big data concepts is a requirement.   Knowledge of Python, C/C is a must. Experience in Go/Java programming is an advantage.   Experience/understanding of scalable and distributed systems [Ex: knowledge of Zoopkeeper, Cassandra etc].    --    ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Business process", "cassandra", "GCP", "Cloud", "enterprise business", "big data", "Distribution system", "AWS", "Analytics", "Python"]}