{"Job Title": "Software Development Engineer II", "Company": "ExecBoardinAsia", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "karnataka", "Job Description": "  Job Description     Writing high quality code, designing\\/architecting systems of varying complexity involving billions of data records with different variety and scope, and creating high quality documentation supporting the design\\/coding tasks and participating in code reviews.   You are widely held as a role model in your division. You can distill complicated situations to their essence, and communicate plans and results intelligently and compellingly. You are expected to be an effective influencer beyond your individual technical contributions. This includes harmonizing discordant views, navigating complex challenges to best outcomes, and steering people across the company toward better solutions.   Participating in team meetings, stand-ups, and architecture\\/design discussions.   Your technical knowledge is both broad and deep. You are an established go-to person for tech advice. You have designed, built, deployed, and operated several high-impact solutions.   You provide technical leadership based on business input. You understand the needs of the business, and drive initiatives to improve the business. Your manager can fire-and-forget. You deliver on your commitments and proactively report changes in plan along with recommended solutions. You provide solutions to problems not just point out problems and conceive initiatives.   You stand out from your peers in the speed with which you solve problems and the comprehensive solutions you provide.   You have a broad and deep understanding of the company s technologies and business. You have played a leading role in the design, development, deployment of multiple systems or products.   Your experience is sought out by others, and you are held up as a role model in the company. You think in terms of optimal technical solutions for business problems. You distill the essence of conflicts, harmonize views, find the best way forward, and lead people to that outcome.   You actively mentor junior team members and better your peers. You work to make other people more productive.  ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Software Development Engineer II", "Coding", "Architectural design", "Design development", "Technical leadership", "Mentor", "Deployment", "UPS", "Architecting", "Quality documentation"]}