{"Job Title": "Software Development Engineer in Test", "Company": "GAINSIGHT INC.", "Experience": "2 - 6 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "  What You ll Do Here      Setup, maintain and automate validation of multiple product areas       Improve test coverage, identify bugs, and lower defect rates       Identify test cases and generate extensive test data       Write effective and thorough bug reports and verify bug fixes       Work closely with the QA for automating existing test cases.       Work with the Developers to integrate automated tests with the end-to-end build and test environment       Create and maintain libraries and object repositories for the Automation Framework       Review requirements, specifications, user documentation, help files, and other project documentation to assure the quality of the products and tests to be developed       Drive test analysis through test suite code coverage and data analysis tools      What We're Looking For      2 to 6 years of total experience in the industry with a thorough understanding of SDLC (Agile in particular)       2+ years of experience as an Automation tester        Good interpersonal, communication, and presentation skills. An analytical mind and an eye for detail       Good programming and logical skills       Strong experience in Java, Spring, Selenium, Cucumber, TestNG, Jenkins, Ant, Maven, etc.       Experience with storage technologies like MongoDB, RDBMS, etc.       Exposure in API Web Application testing, White box, and Grey box testing       Understanding of QA methodologies, life cycle, and process       Ability to work independently with minimal supervision in a fast-paced environment       Familiarity in Design Patterns, Performance or Security testing will be an added advantage       Experience in working on Salesforce or Salesforce applications and Unix/Linux environments will be good to have.       Why You ll Love It Here       Our Attitude:    We ve created a new industry from scratch, and we re on the fast track!       Our Leadership:    We offer the leading tech solution for driving Customer Success.       Our ROI:    Reduce customer churn, increase up-sell, and improve customer satisfaction.       Our Technology:    Deep Salesforce.com hooks, predictive analytics, and a beautiful user interface.       Our Impact:    We help our customers make millions of dollars more per year.       Our Clients:    Big companies like Box, Adobe, Marketo, and many others.       Our Team:    Tech all-stars from Facebook, Box, and others (and top consulting firms like BCG and McKinsey!).       Our Values:    They are unique - Golden Rule, Success for All, Childlike Joy, Shoshin, and Stay Thirsty, My Friends       Our Office:    If you showed up one day, you might find anything from karaoke performances to mini-golf championships.      Here are our 5 core values       Golden Rule:    We believe in trusting each other, and our community by exercising reliability.       Success for All:    We believe that success for our stakeholders comes with making a difference in each other s lives.        Child-like Joy:    We aspire to experience passion, optimism, and laughter in everything we do.   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Unix", "SAN", "Maven", "Automation", "Linux", "RDBMS", "Consulting", "Agile", "Selenium", "SDLC"]}