{"Job Title": "Software Development Engineer ( C2H )", "Company": "Waterleaf Consultants Pvt. Ltd. ", "Experience": "4 - 9 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad, Delhi / NCR", "Job Description": "An exciting opportunity exists for an expert Senior Software Development Engineer to join the newly established Ed-Tech venture leading its ambitious vision to develop personalized career-centric learning.Roles & ResponsibilitiesYou will take the lead to develop Cloud Native SaaS products on AWS, deploying Java Spring Boot Microservices,NoSQL datastores, and other managed services for Identity management, MQs, API gateway, Docker Container Cluster management, Security, Performance, High-Availability and many more. Your role extends to doing Full-Stack in doing SPA clients for Web/ Mobile using React and React Native.The ideal candidate will possess strong coding skills in Java, No-SQL & JavaScript, Cloud Native SaaS on AWS, strong in computer science knowledge for data-structures and algorithms, and a successful previous record of working in similar product engineering development environments. In addition, your skills in doing SPA clients for Web/ Mobile using React and React Native, would be a definitive advantage for you and the organizationKey ActivitiesDesign and develop Cloud Native SaaS products on AWSIntegration with ML engines and data pipelinesIntegration with 3 rd party Cloud SaaS products and/ or Cloud Headless APIsDeliver DWH and BI solutions for enabling data-driven content and learner experience decisionsWork with large, complex data sets whilst solving challenging business problems independently and across teamsCollaborate with internal business stakeholders to identify priorities for the developers and engineers from an AI perspective", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Temporary/Contractual", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Java", "AWS", "Microservices", "Software Development", "Algorithms", "Docker", "Data Structures", "Web Technologies", "Javascript", "Spring Boot", "React Native"]}