{"Job Title": "Senior Technical Lead, Software Product Development", "Company": "Finite HR Consulting Private Limited", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Interested candidates should be well equipped and be responsible for the following: \n\nDesign,  develop and deliver applications on JAVA/ J2EE and growing technologies. \nCollaborate with Architects and Product management team on design decisions. \nSuccessfully design medium to large- scale Enterprise solutions using Java technologiesGood knowledge of the design patterns like core design patterns,  J2EE design patterns and architectural design patterns along with knowledge of UML  \nLead technical discussion to provide technical guidance and create coding standards. \nGood with architecting and engineering systems independently,  would want the individual to be comfortable implementing a significant part of the framework. \nProvide technical knowledge and leadership on design and development best practices. \nProvide technical input on unit and integration tests for server-  and client- side applications,  build and deployment procedures and standards.8 years of experience in developing and testing software using Java J2EE based application programming.  \n Experience in managing team technically.  \n 4 years of experience in Object Oriented Analysis and Design.  \n3 years of experience in developing application using Spring (Spring Core,  Spring ORM and Spring Batch),  Hibernate.  \n2 years of experience in web technologies using Spring MVC,  jQuery. \nGood knowledge of design patterns \n Knowledge on SSL,  Web Application Security Frameworks.  \n Experience with J2EE performance and scalability.  \nHands on experience in ANSI SQL. \nGood working experience with Oracle 9 or higher. \nExperience in Test Driven Development \nHands on experience on Maven,  Jenkins,  Nexus etc.", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Technical product configuration", "c++", "C", "design", "MySQL", "JavaScript", "integration PHP", "HTML"]}