{"Job Title": "Software Engineer - Android Development", "Company": "Serving Skill", "Experience": "4 - 7 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "Roles and ResponsibilitiesJob Description: MUST HAVES:- Exp in Android, Android Studio, Firebase, Google Play services- Strong coding skills in Android, including Android Studio, Kotline, and Java SDK- Experience and knowledge of webviews and performance- Experience and knowledge of API design- Experience and knowledge of writing testable and high-quality code- Agile way or work. Non Hierarchical mindset. Autonomous way or working.- Extremely collaborative mindsetNICE TO HAVES:- Experienced in agile software development practices (automated testing, mob/pair programming, CI/CD etc.)- Comfortable in discussing product design and improvements- Experienced in Azure DevOps and/or other cloud environments- H&M India Service, Information technology (IT)asks and responsibility - What work tasks are to be performed? Most fun/important/challenging?- You will contribute to helping build creative interfaces and sophisticated components to improve the customer experience in one of products, ranging from our Loyalty program benefits and special features in the app for our customers, focusing on a range of sustainability initiatives to exclusive member features, or our login and sign-in process using JWT tokens, or enabling personalization and relevance across the site.What are the products?- The products in the area are Member Growth, Member Engagement, My Account, Service Offerings, Customer ID & Sign-On, Triggered Communication, Cross-Channel Experience, Customer Lifecycle Management, Community & Social Sharing. We are looking to replace consultants in all these products.Tech stack? Tools? System?Android, Android Studio, Firebase, Google Play servicesDescribe the team?Customer Engagement works with Loyalty programs, customer identification, and personalization.WoW/ Transformation context? In what stage of the transformation are you now, where will you be when the employee starts?We are already fully launched as an area.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Mobile,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization, BCA in Computers, B.Sc in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["Java", "Firebase", "Android Development", "API", "Android Studio", "Android", "Kotlin"]}