{"Job Title": "Staff Software Engineer- Full Stack Development", "Company": "Visa Inc.", "Experience": "2 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "    Job Description     As a Full Stack Engineer,  provide Platform-as-a-Service (PaaS) offerings,  that are easy to consume,  scalable,  secure,  and reliable using open source-based Cloud solutions for Big Data technologies      Work at the intersection of infrastructure and software engineering by designing and deploying data and pipeline management frameworks built on top of open-source components,  including Hadoop,  Hive,  Spark,  HBase,  Kafka streaming and other Open Source Big Data technologies.     Collaborate with various teams to build and maintain the most innovative,  reliable,  secure,  and cost-effective distributed solutions.      Facilitate knowledge transfer to the Engineering and Operations team during and after deployment.     Work with geographically distributed teams on technical challenges and process improvements.     Responsible for the design and implementation of agile-innovative data pipeline and workflow management solutions that take advantage of technology advances that allow cost reduction,  standardization,  and commoditization.     Drive the adoption of open standard toolsets to reduce complexity and support operational goals for increasing automation across the enterprise.     Champion the adoption of open infrastructure solutions that are fit for purpose while keeping technology relevant.       8yrs of experience in architecture design and development of large-scale data management platforms and data application with simple solutions   A Full Stack developer with must have hands on coding and designing skills on    Node.js/Javascript or Java/Python   React/Angular for front-end   MVC (model-view-controller) for end-to-end development   SQL/NoSQL technology. Familiar with Databases like Oracle,  DB2,  SQL Server,  etc.   Web Services (REST/ SOAP/gRPC)   Expertise in design and management of complex data structures and data processes   Expertise in efficiently leveraging the power of distributed big data systems,  including but not limited to Hadoop Hive,  Spark,  Kafka streaming,  and etc.   Deep knowledge and hands on experience on big data and cloud computing technologies.   Good to have experience -Apache NiFi and Apache Spark for processing large data sets   Strong service architecture and development experience with high performance and scalability   Technical background in data with deep understanding of issues in multiple areas such as data acquisition,  ingestion and processing,  data management,  distributed processing,  and high availability is required.   Strong on driving for results and self-motivated,  strong learning mindset,  with good understanding of related advanced/new technology. Keep up with the technology development in the related areas in the industry,  which could be leveraged to enhance current architectures and build durable new ones.   Bachelor's degree in Computer Science or related technical discipline required; advanced degree is a plus.   Strong leadership and team player.   Strong skills on mentoring/growing junior people   Payment industry experience is a plus.  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Engineering", "DBA", "Engineer", "Technology", "Computer Science", "Database", "SQL"]}