{"Job Title": "Software Development Engineer I/II - Backend", "Company": "Benchire", "Experience": "2 - 7 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": "Software Development Engineer I/II - Backend - Node.js/MongoDB/Express.jsJob Description - NodeJS Engineer, SDEI/SDEII Location: Gurgaon Experience: 2 to 8 Years Your role would involve: 1) Building the platform architecture using multiple technologies like NodeJS, ExpressJS, Ethereum Blockchain, Solidity 2) Assessing the security risks associated with the platform architecture and suggesting/implementing suitable changes for the same. 3) Scaling up the infrastructure to meet increasing demand. 4) Understanding the underlying blockchain architecture and how the APIs have been designed and exposed for consumption 5) Working on optimization algorithms to ensure faster settlement through the platform and minimize any technical/financial risk 6) Setting up processes for easy deployment and maintenance of network infrastructure Required Qualifications: 1) Should have built an end to end full stack product - as part of a startup, or an organization- but understanding of the product architecture and its nuances is necessary 2) Experience with building production systems for a startup or an Organization 3) Good command over NodeJs and its internals is expected. Knowledge about ethereum blockchain desirable 4) Should be comfortable with RESTful web services/ APIs using ExpressJS 5) Should be comfortable with server side technologies as well - Python, Node.js, Docker, Kubernetes, Git et al 6) Should have good command over cloud infrastructure AWS (preferred), MS Azure or Google Cloud 7) Should have keen attention for detail and should be obsessed with building a good product - Applicants are strongly encouraged to share their github/bitbucket or product URLs 8) Should be able to learn fast and understand new concepts quickly 9) Should be willing to work in an agile startup environment and take complete ownership of the assigned responsibility", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "BCA in Computers, B.Tech/B.E. in Any Specialization, B.Sc in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["NoSQL", "Solidity", "Github", "Socket.io", "Ethereum", "RESTful Webservices", "Node.js", "MongoDB", "Express.js", "AWS", "Cloud Infrastructure"]}