{"Job Title": "Senior Engineer / Technical Lead (C++ Visualization)", "Company": "Agiliad Technologies Pvt. Ltd.", "Experience": "8 - 13 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "  Profile:    Candidate must have experience in Microsoft Technology.    Essential Responsibilities include (but are not limited to):     Should be able to elicit requirements and document them, while being able to verify, analyze and validate the requirements gathered. S/he should be able to manage requirements across phases, manage changes to requirements and ensure stakeholder involvement through the entire life cycle of requirement.   Should be able to use heterogeneous technologies for a given requirement with a view of creating multiple architectural options.   Should be able to translate business requirements into a design for functionality / usability etc.   Should be able to design and implement reusable, scalable and readable build; while being able to identify areas of automation and explore feasibility of usage of tools and also pilot the same.   Should be able to define appropriate test metrics for the project, define test STOP criteria, analyze test results and identify appropriate actions.   Should be able to independently create proposals involving one solution area. S/he is well versed with the various solutions capabilities across domains and service lines.   Should have knowledge of project management principles and able to perform estimation, project planning, project tracking reporting and risk management.     Desired Skills Experience:     Candidate must have 8 to 15 years of experience in the relevant technical/ domain, with prior experience Architecture.   Must have experience in C++ Development.   Storage consolidation and capacity planning.   Must have experience in DirectX.   Good to have if worked on OpenGL.   Perform landscape assessments of customer environments and identify improvement opportunities.   Should be technology savvy, understanding of technology trends and next generation technology.   Should possess analytical skills and abstract thinking.   Should be able to work independently and as a part of a team.   Qualification required: B.E/B.Tech/MCA.  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "MCA in Computers", "Doctorate": "None", "Key Skills": ["C++", "Automation", "PDF", "Architecture", "Project management", "Opengl", "Project planning", "microsoft", "Risk management", "Capacity planning"]}