{"Job Title": "Software Development Engineer II - DevOps", "Company": "HyrEzy Talent Solutions", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Delhi / NCR", "Job Description": " Responsibilities : - Maintain and enhance the SLA of 99.99% for offered services and managed platforms. -  Design systems architecture for projects using Linux and Linux  application stacks (Linux, Docker, Python, Golang, Postgres, Redis etc) - Proficient in capacity planning Design, implement and enhance CI and CD platforms. - Understand and Automate and solutions for permanently fix to prevent outages / downtimes  -  Responsible for architecting deployments for High availability,  scalability and reliability Design and implement platforms for  monitoring, log processing, metrics collection and data visualization. -  Script and code automation tools (in shell/ perl/ ruby/ python etc) for  automation and efficient management of sites/products Infrastructure and  platform security. - Ansible configuration management. - Liaise with application development teams to drive operational best practices. Requirements :  - You take pride in calling yourself expert/master in most of the below technologies/skills  - Minimum 3 years of relevant experience in most of the following Linux: In depth Linux fundamentals, - Good understanding the various linux kernel subsystems (memory, storage, network etc), - Understanding of various distributions nuances (Ubuntu/ Fedora/ Centos etc), Package management etc- Fundamentals: DNS & Networking Fundamentals, TCP/UDP, IP Routing, HA & Load Balancing Concepts. - Very good knowledge of container technology (Docker). -  Good knowledge of nginx server. Cloud Infrastructure: OpenStack Edge  Cache - Redis Databases: Postgres Configuration management: Ansible  Tools/Utilities: Jenkins, Zabbix, GIT/SVN Scripting/Programming: - Extensive work done on two or more of these scripting/ programming languages - Bash/PERL/Ruby/Python.Others : Regular expressions, Excellent troubleshooting skills. Good To Have : - Some familiarity with IOT devices like raspberry pi Knowledge of message queue systems and MQTT protocol  - A deep knowledge of AWS Cloud services would be an added advantage - Have previously worked in a Startup Desired Skills and Experience: Linux, Docker, Ansible, Nginx, Bash, Ruby, Python . ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Sc in Any Specialization, BCA in Computers, B.Tech/B.E. in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["Jenkins", "Nginx", "Software Development", "GIT", "Docker", "Linux", "Bash", "AWS", "Devops", "Python", "Zabbix"]}