{"Job Title": "Software Development Engineer III - Frontend Applications - Tech Statu", "Company": "HyrEzy Talent Solutions", "Experience": "6 - 10 years", "Salary": "Not Disclosed", "Location": "Delhi / NCR", "Job Description": " Responsibilities:- Complete ownership (code & team) of one or more business-critical modules. Work with product and UX teams to design, build and extend consumer-facing products.- Translate complex functional and technical requirements into detailed architecture, design, and code.- Demonstrate a high degree of ownership, accountability and exhibit high energy on org level initiatives.- Demonstrate creativity and sound analytical skills in identifying effective approaches to develop solutions independently.- Deliver features with high quality, on-time as per project plans and delivery commitments.- Work with team members to manage the day-to-day development activities, participate in designs, design review, code review, and implementation.- Maintain current technical knowledge to support rapidly changing technology, always on a lookout for new technologies and work with the team in bringing in new technologies.- Must be able to work with a minimum of technical supervision and supplemental engineering support, while responding efficiently to multiple program priorities.- In addition, the role involves analyzing the latest technologies and development trends, establishing and implementing standard practices.- Mentor other engineers and foster team spirit.Requirements:- Only candidates who understand data structures, algorithms, design, and architecture while working for high volume mobile apps with millions of users.- Tier 1 B.E. or higher in Computer Science or equivalent. 6+ years of frontend development experience.- Experience designing highly interactive web applications for desktop and mobile with performance, scalability, accessibility, usability, design, and security in mind.- If you don't have all of these, that's ok, but be excited about learning the few you don't know.- Hands-on experience building web applications using any of the modern frameworks like ReactJS, Angular, etc.- Strong, object-oriented design and coding skills. Solid software development background including design patterns, data structures, test-driven development.- Excellent verbal and written communication skills.- Excellent command over Data Structures and Algorithms. Strong problem solving and analytical skills.- Strong UI design exposure and experience in making web apps work intuitively. Knowledge about delegates, protocols, notifications and application life cycle.- Experience of working in a product-based company. Prior experience of working in a startup. ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["Software Development", "Algorithms", "UX", "Front End", "Design Patterns", "Data Structures", "Frontend Development", "User Interface Designing", "web applications", "Angular"]}