{"Job Title": "Freshers Start UP YOUR Career with BPO SAL UP To 23K\n", "Company": "Job Shop    ", "Experience": "0 - 5 years", "Salary": "₹ 2,00,000 - 4,50,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": " Job descriptionGreetings From JobShop (Bangalore's No 1 Recruitment Firm for BPO'sWe are currently hiring for the following Positions - Please call us on 7406026000International Voice Process;Whitefield - 80 Positions - Salary upto 28k if you have more than 2 years of Intl Voice Exp - WFHMarathahalli - 100 Positions - Salary upto 27k if you have more than 2 years of Intl Voice Exp - WFHElectronic City - 100 Positions - Salary upto 26k if you have more than 2 years of Intl Voice Exp - WFHBellandur - 200 Positions - Salary upto 25k if you have more than 2 years of Intl Voice Exp - WFOEdutech Sales Process - Work from HomeSalary upto 30k with 1/2 years of sales experience and excellent CommunicationBanking Sales Process: Sal upto 17k with 30,000 plus incentives based on performance Work from Office, Fixed 9 to 6pm shift and fixed sunday offSemi Voice Process with Excellent communication, only those with International Voice Experience can apply - Salary upto 26k - Work from Home If the above criteria is matching then Please Dial the followingPlease call HR Call Job Shop - 7406026000 / Drop a Wats app message with a Voice recording of your self introduction and resume , If I didn't respond to your call.", "Role": "Associate/Senior Associate -(NonTechnical),", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Graduation Not Required", "Doctorate": "None", "Key Skills": ["BPO", "Customer Service", "International Call Center", "Hiring", "Calling", "Voice Process", "Outbound Calling", "Customer Support", "Sales Process", "Outbound Sales", "Technical Support", "Customer Care", "Domestic BPO", "International Voice", "Call Center", "International BPO", "International Voice Process"]}