{"Job Title": "Day Shift / domestic voice Process / Hindi Mandatory / Freshers", "Company": "Black and White Business Solutions Pvt Ltd  ", "Experience": "0 - 3 years", "Salary": "₹ 2,25,000 - 3,00,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": "DEAR Job Seeker Complete Training with be provided on Accounts field with Free Tally Software Course with will help you improve your career interest and also training on Job Ethics skills Customer support Voice / / Telecom / tally / ecommerce/Contact : HR Renu@ 9513599664/ 9513648699 Email resumes to : hr9664@blackwhite.in Shift : Day shiftSalary : 15.5 K to 21 k   Roles and Responsibility: Maintain accounts in Tally accounting software Resolve customer complaints via phone, email, mail, or social media.Use telephones to reach out to customers and verify account information.Cancel or upgrade accounts. Assisting with research, filing, data entry, and recording and maintaining accurate and complete financial records. Update Tally software/ERP used with the details on the daily basis Provides financial information to management by researching and analyzing accounting data; preparing reports.Prepares asset, liability, and capital account entries by compiling and analyzing account information.Finalization of Accounts and preparation of Financial Statement such as Income Statement & Balance sheetPrepares special financial reports by collecting, analyzing, and summarizing account information and trends.Maintains customer confidence and protects operations by keeping financial information confidential.Secures financial information by completing database backups. Summarizes current financial status by collecting information; preparing balance sheet, profit and loss statement, and other reports   Contact : HR Renu@ 9513599664/ 9513648699  Email resumes to : hr9664@blackwhite.in NOTE :1. All the rounds will be telephonic/Skype/video call.2. Proper Follow up is done with our Clients.3. Feedback will be given on a Real-time basis. 4. Immediate Joining   AND ALSO We have openings with other International clients where in we are looking for- -10+2/ UG/ Graduate Fresher's and Undergraduate with min 6 months experience. With Excellent Communication skills and Flexible with Shifts *********************Please refer your friends********************** ", "Role": "Fresher,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Other", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Tally", "B.com Fresher", "Accounts", "Bpo", "CSR", "Finance", "Accounts Executive", "US Process", "Customer Support", "BPO Job", "Taxation", "Call Center", "Voice", "International"]}