{"Job Title": "Hiring freshers For leading UK Banking services/sal upto 4lacs", "Company": "Job Shop    ", "Experience": "0 - 5 years", "Salary": "₹ 2,00,000 - 4,50,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": " Offers in International & Domestic BPOs Sal up to 4lacs PA (customer service & sales) opportunities under one roof in JOB SHOP, Bangalores Largest Recruitment Firm. We Dont charge any fees!!Spot offers! Make the best use of the opportunity. Your hunt is just a call away. Call JOBSHOP 9964080000Job Opportunity For International Banking Voice process @ manyata Uk Shift Sal 25kWe are currently hiring experience candidate for INTERNATIONA VOICE PROCESS @ Manyata Tech ParkJob Description,Fresher : Customer Support -Level-1Excellent Communication skillsImmediate JoiningExcellent Verbal / Written skillsCandidates flexible working in shiftsCustomer Support with Experience :-Customer focused, Catering to customers queries and providing apt resolutionsExperience in International BPO with a Voice ProcessAbility to work in UK kind of work environment with night shifts and Rotational offsKnowledge of Banking Industry will be an advantageQualification - Undergraduate/GraduateExcellent Communication skillsExperience - Minimum 6 months with International Voice Process (Added Advantage)Note- B.E/B.Tech, M.Tech, MCA,BSc( CS/IT) and MBA are not eligible for this profile.Should be able to join immediately or 15 days.Sal upto 25k+3k inc* 5 Day work* 2 day Rotational off* 1 way Cab* Uk Shift(max Log out 2:30)* work Location Manyata Tech parkKindly carry any gov. Id proof, resume & print out of the call letter. Please report to me after your arrival at the following address:For More Details Call JOBSHOP 9964080000*****************Huge openings with web chat and tech support/customer support with sal up to 3.8lac CTC PA + incLoc: manyatha tech park , Karle buildingUK/US SHIFT5DAYS WORKINGImmediate joiningShould have minimum of 6m expTo know more Call JOBSHOP 7406026000 ", "Role": "Associate/Senior Associate -(NonTechnical),", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Graduation Not Required", "Doctorate": "None", "Key Skills": ["Communication Skills", "Customer Service", "Customer Support", "US Shift", "Technical Support", "Calling", "UK Shift", "Web Chat", "International BPO", "International Voice Process"]}