{"Job Title": "Spot Offer For freshers in BPO Non Voice/ Voice Process Call Jobshop", "Company": "Job Shop    ", "Experience": "0 - 5 years", "Salary": "₹ 3,00,000 - 5,00,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": " SENIOR CUSTOMER SUPPORT / TECHNICAL SUPPORT / INTL. VOICE SAL UPTO 4.5L PA FOR MORE DETAILS CALLJOBSHOP 9964080000  Here's a wonderful opportunity to work from home with one of the leading International companies in Bangalore, and it's a telephonic interview. Opportunity For International Banking Voice process@ manyata Uk Shift Sal 28k We are currently hiring experience candidate for INTERNATIONAL VOICE PROCESS @ Manyata Tech ParkBannerghatta Road for Technical processMarathahalli LocationEco Space LocationJob Description Fresher : Customer Support -Level-1 Excellent Communication skills Immediate Joining Excellent Verbal / Written skills Candidates flexible working in shifts Customer Support with Experience :- Customer focused, Catering to customers queries and providing apt resolutions Experience in International BPO with a Voice Process Ability to work in UK kind of work environment with night shifts and Rotational offs Knowledge of Banking Industry will be an advantage Qualification -10th, Undergraduate/Graduate Excellent Communication skills Experience - Minimum 6 months with International Voice Process (Added Advantage) Sal upto 25k+3k inc * 5 Day work * 2 day Rotational off * 1 way Cab * Uk Shift(max Log out 2:30) * work Location Manyata Tech park Kindly carry any gov. Id proof, resume & print out of the call letter. Please report to me after your arrival at the following address: For More Details Contact: HR JOBSHOP 9964080000 ", "Role": "Technical/Process Trainer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Training", "UG": "Graduation Not Required", "Doctorate": "None", "Key Skills": ["BPO", "Email Support", "Customer Service", "Non Voice Process", "US Shift", "Calling", "Non Voice", "Voice Process", "MS Office", "UK Shift", "Communication Skills", "Customer Support", "Technical Support", "Computer", "Chat", "Customer Care", "International Process", "Night Shift", "Voice", "International Voice Process"]}