{"Job Title": "Technical Architect- Full Stack Software Development", "Company": "Exponentia Datalabs Pvt. Ltd", "Experience": "6 - 11 years", "Salary": "Not Disclosed", "Location": "Mumbai (All Areas)", "Job Description": ".Job Description: Technical Architect  Software Development (Full Stack)  Exp  6 to 12 years What you will do: • You'll brainstorm with Product Managers, Designers and Frontend Engineers to conceptualize and build new  product features. • You'll produce high-quality results by leading or contributing heavily to large cross-functional projects that have  a significant impact on the business. • You'll actively own features or systems and define their long-term health, while also improving the health of  surrounding systems. • You'll assist our skilled support team and operations team in triaging and resolving production issues. • You'll mentor other engineers and deeply review code. • You'll improve engineering standards, tooling, and processes • You'll create a solution, design and build products for features from scratch. Skills Required • You've been building web applications or SAAS Applications professionally for 2-4+ years. • You have experience with functional or imperative programming languages -- e.g. Python, Go, C, Node.Js,  Angular 8+. • Experience in public cloud providers Azure, AWS, GCP and able to design solutions around them. • You can lead technical architecture discussions and help drive technical decisions within your team. • You are a strong communicator. Explaining complex technical concepts to designers, support, and other  engineers is no problem for you. • Backend or Full-Stack experience. • Evidence of exposure to architectural patterns of a large, high-scale web application (e.g.,well-designed APIs,  high volume data pipelines, efficient algorithms). • Passion for creating a highly effective AI technology platform for our growing global clients • Experience with different architecture patterns like Serverless, Microservices, Event Sourcing, CQRS • Experience with distributed Queues like RabbitMq, Kafka, SQS. • Experience with Agile development • Be future-looking; we might be focused on immediate regulations, but need to build for the long term • Comfortable with tackling ambiguous problems and unblocking yourself • Focus on building high-quality products; every one of our flows affects the business bottom line • Data-driven in how you solve problems and validate you've solved them correctly • Have a strong desire to mentor the careers and development of other engineers • Possesses strong verbal and written communication skills. • You possess strong computer science fundamentals: data structures, algorithms, programming languages,  distributed systems, information retrieval and the ability to articulate trade offs. Criterion: • Qualifications & Experience : B.E/B.tech (Computer Science, Engineering or related field, or equivalent) • Bonus points for experience of building scalable product from scratch.", "Role": "Technical Architect,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "Doctorate": "None", "Key Skills": ["Software Development", "Architecture", "full stack", "Rabbitmq", "Algorithms", "C", "Artificial Intelligence", "Go", "Kafka", "Information Retrieval", "AWS", "Python"]}