{"Job Title": "Software Development Engineer - Android Development", "Company": "Perennial Systems", "Experience": "0 - 5 years", "Salary": "₹ 4,25,000 - 9,00,000 P.A. ", "Location": "Pune", "Job Description": " Perennial Systems is looking for a candidate with good Technical Skills for an urgent opening of Android Developer, Pune locatiion.Perennial  Systems is hiring for a geeky Programmer As a developer, you have a passion for development and a thirst to learn. You enjoy working in a fast-paced and dynamic environment. You are a quick learner who can step up and take ownership of work to get things done on time. You also enjoy and appreciate working and collaborating with others from various background as part of a team. Experience:  01-05 YearsMust have Skills: Java, KotlinWho you are: Expert in JAVA. Expert in Android application Development for phones, tablets and wearable Quick learner and are adaptable to new technologies Good visual design sense and creative drive Aware of continuous integration and continuous delivery. Find satisfaction in a job well done and want to solve hard problems independently. What Youll do: Your specific duties in this role will include:Be responsible for software development and support of application build from scratch. Assist in scoping and creation of proof of concepts during the proposal stage. Apply judgment to plan and execute tasks. Respond to technical queries / requests from team members and customers.Coach, guide and mentor junior members in the team. Participate in peer-reviews of solution designs and related code Our Selection Process: The selection process will comprise of: 1. Virtual round ( Logical Coding + Technical Round) 2. HR Round (Virtual) About Us :  Perennial Systems is a part of a $100 million group of companies working in highly specialized industries. Since 2006, Perennial has helped build around 237+ high quality products and solutions for start-ups as well as global giants across all domains from scratch. Today our development team of 150 plus is based in Pune, together with our Sales and Servicing teams in USA and Singapore.Apart from being into OPD (Outsourced Product Development) space, we also have our own in-house product (GST Hero) approved by Government of India. GST Hero is a Perennial's initiative to assist Businesses / Tax Consultants / Chartered Accountants in making them compliant with ease through the efficient use of technology. For more details visit our website(s) : www.perennialsys.comhttps://gsthero.com/", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Mobile,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "Doctorate": "None", "Key Skills": ["Java", "Android Application Development", "Software Development", "Scratch", "Coding", "Continuous Integration", "Continuous Delivery", "Programming", "Kotlin"]}