{"Job Title": "Technical Lead - Software Development", "Company": "Virtual Engineering Services (P) LTD", "Experience": "4 - 6 years", "Salary": "Not Disclosed", "Location": "Delhi / NCR( Okhla )", "Job Description": "  About VEST Inc.(www.vestusa.com)VEST, Inc. was founded in 1997 in Troy, Michigan, USA. We are a niche, leading worldwide commercial provider of innovative design-automation and sales-automation Desktop Solutions to the Fluid Power industry. Our products help engineers and hydraulic corporations do their jobs faster with end-to-end automation needed to execute 2D schematic and 3D manifold designs. VEST has developed a portfolio of software solutions to improve the schematic design, 3-D geometric configuration design, and the accurate Manufacturing of hydraulic power units and manifold assemblies. VEST has more recently extended these capabilities as cloud-based services for OEMs, retail salespeople, field service technicians, and engineers. The Opportunity:VEST seeks motivated Technical Lead for the Software development group the role expects the candidate will be leading one or more of the VEST products depending upon candidates' experience and skillset towards development, fine tuning and optimizing software applications. Leading the cross-functional team thats responsible for the full software development life cycle, from conception to deployment & maintenance. About the JobOwn the development and technical specifications (including architecture) of the product.Ensure scalability and testability of the product and its subsystems.Consider the legacy of the code you produce, limiting the use of short-term workarounds and able to create flexible software without over-engineering.To work on project ideas with stakeholders and peers.It required to help team members to evolve by actively participating in the code review process, design discussions, team planning.What you must have:The technical abilities showcasing a breadth and depth of technical knowledge and have passion in programming.Strong understanding of object-oriented programming, concurrency, and fundamentals of computer-science.Previous experience in developing windows-based desktop applications, and you are interested to excel in desktop application development.You are good either in one or more of the programing languages i.e., C++, Java, C# and Angular.You understand SQL concepts like stored procedures and queries. Experience of working on both front-end and back-end technologies will be a plus.Exceptional coding skills in an Object-Oriented programming language (C++ or Java).Proficiency in implementation of algorithms and use of advanced data structures to solve problems in computing and have Strong problem solving and analytical skills.Done your B. Tech in computer science and / or Mechanical Engineering with 5  7 Years of strong programing experience in an IT product firm. Our Work EnvironmentWe have a strong culture of valuing our employees and promoting an autonomous, transparent, and ethical work environment. We do not tolerate any form of discrimination.We at VEST always try to foster an environment that values and respects all individuals strength, perspectives, ideas and ability to meet the needs of our customers globally.Talented and supportive peers who value your contributions and drive your learning. Challenging opportunities: Learning happens outside the comfort zone and that is where our team likes to be always pushing the boundaries and growing personally and professionally.Our Flagship Products and product Capabilities.AutoRouter™ is the world’s first and only automated manifold design service.MDTools® is the world’s only 3D parametric software created exclusively for manifold design.HyDraw CAD® is the premier schematic design product with a self-contained 2D CAD engine.NetSkeme™ is the world’s first cloud-based, multi-domain schematic service using DWG file format.ManifoldEdge™ is a recently launched online 3-D collaboration platform supporting manifold design.", "Role": "Team Lead/Technical Lead,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Sc in Maths, B.Tech/B.E. in Computers", "PG": "MCA in Computers", "Doctorate": "None", "Key Skills": [".Net Core", "Software Development", "Object Oriented Programming", "angular", "Algorithms", "Software Engineering", "Typescript", "Data Structures", "Desktop Application Development", "Code Review", "SQL"]}