{"Job Title": "Looking For Korean, Kannada Language Expert. Team Lead and DM - Roles", "Company": "Conneqt Business Solutions", "Experience": "0 - 5 years", "Salary": "₹ 2,00,000 - 4,00,000 P.A. ", "Location": "Noida", "Job Description": "Dear Champions Greetings from Conneqt Business Solutions (Formerly known as Tata Business Support Services) in association between Tata Group and Quess Corp.We have 3 different requirements at Noida office. Roles and Responsibilities Requirement No: 1 We are looking for Korean Language specialist This is an Inbound voice processShould be fluent in English, Hindi & Korean languagesShould have 2 years Diploma in Korean Language or an equivalent Certification Salary ranges between 3 to 4 LPARequirement No: 2Looking for Team leaders and Deputy Manager.Team Leaders - 4 RequiredDeputy Managers - 1 RequiredPeople having experience in a BPO, can applyThis is an inbound processSalary : 5 LPA to 7LPARequirement No: 3Looking for Kannada languageFresher and Experience. Both can apply This is a voice processShould be fluent in English, Hindi & Kannada LanguagesSalary ranges between 2 to 2.4 LPAWill be Inbound and Outbound processDesired Candidate Profile Must be Graduate passedRotational shiftsPerks and Benefits Interested candidates can walk-in at below mentioned address on 17th & 18th MarchC-56 A, Plot no. 10/11, Sector 62, Dr. ITM Group, Opposite to Stellar IT Park Building.For any queries, kindly call 9914463025. RegardsHR Team", "Role": "Associate/Senior Associate -(NonTechnical),", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Assistant Manager", "BPO", "Customer Service", "Telesales", "Team Manager", "Korean", "Inside Sales", "Team Leader", "Inbound", "Outbound", "Team Lead", "Customer Support", "Kannada", "Lead Generation", "Telecalling", "TL", "Deputy Manager", "Customer Care", "Cold Calling", "Team Leading", "Call Center", "Voice", "Telemarketing"]}