{"Job Title": "Hiring For Customer Support Executive (Backend/ Non-Voice Process)", "Company": "Elcamino Software Pvt Ltd", "Experience": "0 - 1 years", "Salary": "₹ 2,25,000 - 2,50,000 P.A. ", "Location": "Gurgaon/Gurugram( Udyog Vihar )", "Job Description": "Urgently Looking for Male Candidates for the Customer Support Executives for Back end/Non-Voice Process in Gurugram (Udyog Vihar Phase-IV).Jobs & Responsibilities:-1. Candidates must be having their own desktop/laptop as per seeing this pandemic situation.2. Candidates are expected to have better understanding over English as well as in written with good grammatically without any errors.3. Selected candidates will be responsible to work in the US-based Website moderation process and must be willing to work on rotational shifts such as Morning, Afternoon & night on monthly basis.4. Must be having the basic knowledge of computer along with fair typing speed.5. Deserving candidates will get a chance to work in paid training session, highly-supported official environment, exploring new things & much more.Important Points to be Noted:-1. Work from Home may be provided after noticing your work performance.2. Only Male candidates will be considered with having age criteria between 20-30 years old.3. Interested candidates are requested to come in formal attire only as we are very stick over maintaining disciplines. Without having any formal attire you will be not allowed to enter into our office premises.4. It is mandatory to work in all shifts on monthly basis as per official rules & policies. Those are not comfortable to work as per our scheduled shifts then kindly excuse us.Salary & Remuneration:-Salary packages start from INR 2.30 to 2.60 LPA + other allowances such as PF, ESI, NFH & etc., incentives & best performer appreciating benefits will be also there.Kindly check the venue details below for Walk-in Interview:Elcamino Software Pvt Ltd.Plot no. 194, Udyog Vihar, Phase -4, GurugramPhone No: - 0124-4111735Contact Person: Mr. Amit Kumar/ Kapil SharmaYou can also drop your updated CV by emailing or Skype at ecs.hr3@ectusa.net", "Role": "Fresher,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Other", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Backend", "Customer Support", "Non Voice Process", "Non Voice"]}