{"Job Title": "Virtual Assistant For International Backend Operations - Urgent Hiring", "Company": "Acelerar Technologies Pvt Ltd", "Experience": "0 - 3 years", "Salary": "₹ 1,50,000 - 2,50,000 P.A. ", "Location": "Noida( Sector-63 Noida )", "Job Description": "This is a unique opportunity for a creative and charismatic individual to be part of the Team with Acelerar Technologies Pvt. Ltd.( Ranked amongst top 4 Virtual Assistant companies in India by Hubstaff and amongst the top 20 business service providers in India by Clutch)We strive to be the best in what we do and we have our own ways of doing things, a simple but smart business model, a strong sense of business ethics and some very smart people...and we need more smart folks to support our growth    What are we looking for?As a Virtual Assistant, you will be assisting International Clients primarily based out of US, Europe, and Australia   5 days a week work schedule and evening shift Supporting top executives and professionals from Fortune 1000, Fortune 500 clients, and small and medium-sized companies mainly in the US and Europe. Assisting them in their day-to-day administrative tasks such as scheduling appointments, organizing meetings, managing their calendar, managing their task list, email management, basic customer support, other admin tasks Updating online databases, working on Excel, Word, and creating documentation and power-point presentation. Acting as a personal assistant by helping in hotel &travel reservations, itinerary planning, ad-hoc purchases, social event coordination, booking personal appointments, processing monthly payments, other miscellaneous personal tasks which do not include any specialization Provide output reports based on keyword & product research, travel research, market research, rates and catalogues search, statistics assistance, legal procedure research, research data compilation, web research on any topic Client communication through email, phone, and IM on a daily basis  Required Candidate profile Candidate should possess excellent verbal and written communication skills Working knowledge of Excel, Word, Outlook, and PowerPoint Should be an avid internet surfer, excellent at data mining, data collection, data analysis and market/ internet research Great attention to detail, well organized and superior multi-tasking skills Time management, planning, and scheduling skills Ability to prioritize tasks and decision making Proactive and ability to work with minimum instructions  Experience of working as a Virtual Assistant in a BPO back-office operations setup will be given preference  Candidates willing to learn and grow with the organization Flair for customer/client service with a positive learning aptitude and ability to perform under pressure A hands-on professional with a go-getter attitude  Excellent team player with a client-centric and problem-solving approach Be comfortable and adaptable to an ever-changing, fast-paced, hands-on, entrepreneurial environment  And there's more...We will give you responsibility from day one. We enjoy a sensible and flexible working hours, a decent salary, and a happy, relaxed working environment.It's a great opportunity to be part of not just a fast-growing organization in an exciting market, but an organization that is amongst the best in the sectorRemuneration: Amongst the best in the industry, it will not be a constraint for a deserving candidate.   ", "Role": "Associate/Senior Associate -(NonTechnical),", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Back Office/Web/Transaction Processing", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization, Post Graduation Not Required", "Doctorate": "Any Doctorate in Any Specialization, Doctorate Not Required", "Key Skills": ["virtual assistant", "fresher", "international bpo", "backend operations", "bpo fresher", "international voice process", "voice support", "Client Servicing", "virtual office assistant", "back end executive", "blended process", "client servicing executive"]}