{"Job Title": "Urgent Hiring For Customer Support In MNC", "Company": "AWP ASSISTANCE (INDIA) PRIVATE LIMITED", "Experience": "0 - 1 years", "Salary": "₹ 1,75,000 - 2,00,000 P.A. ", "Location": "Gurgaon/Gurugram( Badshahpur )", "Job Description": "Urgent Hiring For Customer Support In MNCFreshers & Experience Both Can ApplyRoles and Responsibilities  To Manage Inbound and Outbound calling.To Resolve Customer queries over the call.To Register customer's request.To Take Feedback on call.To Manage the Escalations.Desired Candidate Profile Candidate should be fluent in Verbal as well as Written English.Speech of candidate should be clear and without MTI.Candidate should be Graduate in any field.Male candidate should be ready to work in Rotational ShiftsCandidate should be from Gurgaon or Near to Gurgaon location.No Candidates is considered outside of NCR regionIn Night shift Male candidates have to Manage their daily commute to office.Perks and Benefits Salary- 13.3k (In Hand) on the basis of interview + (Incentives)Shift - For Male: 7AM to 11PM (Rotational Shifts in between 7am to 11pm) For Female: 7Am to 7PM (Rotational Shifts in between 7am to 7pm)Working days - 6 daysWorking Hours- 9 HoursSelection- Based on telephonic round of interview. Office Location- Allianz Partners, Spaze Business Park, 6th Floor Tower-A, Sector-66, Gurgaon.Note-:Please apply if you are Graduate in any field.If you have proper Aadhar Card with full date of birth mentioned+ Pan Card.Ready to join immediately.Please apply only if you are in Gurgaon or in any part of Delhi/NCR.**Interested candidates can directly Call/WhatsApp 9991361100 ( HR Sahil )**Kindly share your resume at: extern.sahil.s@allianz.comContact Person: HR Sahil**********************************************************************************************Disclaimer: Beware of Fake/ Unauthorized Job Provider operating under the name of AWP ASSISTANCE (INDIA) PVT. LTD. / AWP SERVICES (INDIA) PVT. LTD. (hereinafter referred to as Company/AWP/ALLIANZ PARTNERS). The Company never asks for any payment for providing any job offer. Please check carefully before applying and providing documents to any unauthorized/ unknown organization/person. In case of any suspicion and/or fraudulent mail, you can contact to the company at 0124-4343800 and at ashish.rana@allianz.com.. PLEASE NOTE THAT IN ANY CIRCUMSTANCES THE COMPANY AND ITS/ EMPLOYEES SHALL NOWHERE HELD RESPONSIBLE FOR ANY FAKE JOB OFFER/APPOINTMENT ISSUED TO YOU ON BEHALF OF THE COMPANY.", "Role": "Associate/Senior Associate -(NonTechnical),", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Customer Service", "Solving Queries", "Calling", "Inbound Calls", "Telecommunication", "Voice Process", "Outbound Calling", "Customer Support", "Feedback", "Telecalling", "Customer Care", "Customer Handling", "International BPO"]}