{"Job Title": "Software Development Manager", "Company": "Ashoka University", "Experience": "4 - 6 years", "Salary": "Not Disclosed", "Location": "Sonipat/Sonepat", "Job Description": "  Job Description      We work on different application catering all stockholders of the University   You will be responsible for plan, directs, and coordinates all activities related to writing software programs.   You must be familiar with all the policies, procedures and technical issues related to software programming.    You must evaluates and ensures the completion of tasks and projects; analyzes software requirements; implements design plans, reviews unit tests; documents software development and user manuals   monitors status of developing software; writes, reviews and revises product requirements and specifications   participates in other areas of the software development process; and provides technical support to other university personnel.      Responsibilities     Plan, design and build efficient, scalable systems that are used by people across the university and outside.    Own what you build as you create, test and refine what?s under the hood of our pages and services    Work with the real time feedback from users (external and internal) to make the products better      Skills      Strong knowledge of software development process from development to deployment    Strong knowledge and handson experience with .Net framework    Have strong handson experience with SQL    Knowledge of latest JS libraries and frameworks    Should be able to work alone on a project or module    Good interpersonal, written and verbal communication skills.    Excellent troubleshooting skills     Eligibility      Bachelor/Master?s degree or equivalent in the field of computer science or business management    Minimum 4-6 years of professional experience    Ability to work with teammates and at the individual level.  ", "Role": "Software Developer,", "Industry Type": "Telcom, ISP,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Computer science", "IT Director", "Software development", "Software Development Manager", "Consulting", "Javascript", "Deployment", "Management", "Troubleshooting", "SQL"]}