{"Job Title": "International Voice Process - Sales Agent Required", "Company": "COMMERCE SERVICES PVT. LTD", "Experience": "0 - 3 years", "Salary": "₹ 90,000 - 3,00,000 P.A. ", "Location": "Chennai( Porur )", "Job Description": "International Voice Process –US-Sales Officers- FreshersExcellentCommunication Skills in English is mustNight Shift - 10.00 PM to 7.00 AMGender: Female and Male can applyLocation: ChennaiRemuneration:Salary is not constraint for the right CandidateFreshers CTC starts from 1,30,000Experience CTC starts from 1,50,000Monthly Incentives are from 8000-30000Weekly incentives are from 1000 – 8000The US- Sales Officers responsibilities include managing the company's sales on an international platform for US/UK/Canada Markets. He/she Interacts with the customer at a professional and friendly level in order to market the company’s products and services. He/she plays a vital role in maintaining the financial gains of the company, builds good rapport, confidence and trust in the Services offered to our customers.The following are Key Job Responsibilities:-Making the clients understand about the various products and services by explaining them in step by step process in simple English.Overlooking negative clients, turning them in positive prospects by giving them a wow experience in terms of customer service and converting them to loyal customers.Treating and greeting the clients very well and making them go through the purchasing methods and procedures.Submitting the reports, records, presentations and sales documents to the manager of the companyMeets Monthly/weekly/daily Sales Targets.", "Role": "Technical/Process Trainer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Training", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Communication Skills", "Customer Support", "Technical Support", "Customer Care", "Voice Process", "Night Shift", "International BPO"]}