{"Job Title": "Customer Support - Voice", "Company": "Concentrix Daksh Services India Private Limited.", "Experience": "0 years", "Salary": "₹ 2,00,000 P.A. ", "Location": "Kolkata( Salt Lake )", "Job Description": "Greetings ! We are hiring for customer Support - Voice at Concentrix Kolkata !Spot offers for immediate joiners !TOTAL Openings  :  20 Work Location: Kolkata  (Salt lake) Sector 5 Freshers Role Mode of Interview : Telephonic / Video call Interviews from: Monday to SaturdayTime: 10.00am to 6.00 pmSalary and Benefits :2 Lakhs per annum (Inclusive PF, gratuity ) & Other Benefits Qualification: Compulsory Graduation ( Any graduate-  Candidate should have Graduate certificate as proof of document)Interview Process:HR RoundCommunication Skills round (versant)Ops Round Client Round  Work Shifts/ Hours: 24/ 7 Rotational Day & Night shift.   6 days working  ( Rotational WEEK OFF)DOMAIN : Insurance process Essential Functions / Core Responsibilities  : Ensure service delivered to our customers meets contractual Key Performance Indicator (KPIs) a Mix of Both Inbound & Outbound call Handling role . Clarify customer requirements; probe for understanding, use decision-support tools and resources to appropriately provide resolution to the customer Listen attentively to customer needs and concerns; demonstrate empathy while maximizing opportunity to build rapport with the customer Greet customers in a courteous, friendly, and professional manner using agreed upon procedures Maintain basic knowledge of client products and/or services  Prepare complete and accurate work including appropriately notating accounts as required Participate in activities designed to improve customer satisfaction and business performance Offer additional products and/or services Track, document and retrieve information in call tracking databaseCandidate Profile : Any Graduate  - Fresher’s can also apply (0-2 years) Courteous with strong customer service orientation Strong computer navigation skills and PC Knowledge Ability to effectively communicate, both written and verbally Skilled in multi-tasking; including the ability to be flexible and adapt to changes quickly Should Have PAN CARD & all the Educational Documents for verification  Ability to work as a team member, as well as independently    Demonstrate patience in all customer contact situations; including maintaining a pleasant and professional tone and manner Should be open to work in rotational shifts as per business need .Disclaimer   Neither Concentrix Technologies (India) Private Limited nor any authorized 3rd party who assist with our recruitment process, ever ask candidates for 'recruitment', 'processing' or any other kind of fees in exchange for offer letters from Concentrix. Offer letters and other recruiting correspondence from Concentrix are printed on Concentrix letter head with authentic signatures of appropriate Concentrix authorities.The above statements are intended to describe the general nature and level of work being performed by people assigned to this job. They are not intended to be an exhaustive list of all responsibilities, duties, and skills required of personnel working within this job title.", "Role": "Associate/Senior Associate -(NonTechnical),", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["BPO", "Bfsi", "Insurance", "Customer Support", "fresher", "Banking", "Calling", "Customer Satisfaction", "Insurance Processing", "Night Shift", "Inbound", "Customer Service Orientation"]}