{"Job Title": "Senior Software Engineer Product Development", "Company": "Foray Software Pvt Ltd", "Experience": "2 - 4 years", "Salary": "₹ 1,25,000 - 5,00,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": "Roles and Responsibilities KEY RESPONSIBILITIES• Design and development of software platforms/products/data platform pipeline• Strong problem-solving capability. Analyse business issues and technical problems independently, andcome up with smart, logical solutions.• Participate in product releases through requirement reviews, development, deployment, setting upenvironments, documenting release notes and• technical details regarding functionality and configuration.Desired Profile• Graduate(BE/BTech/MCA) in Computer Science or equivalent from a premier institute with 2 4years hands-on software development experience• Strong hands-on experience in development using Java and Spring framework• Expertise in developing microservices using Spring Boot, Spring Data JPA and Spring Security.• Experience in working with Angular, HTML and CSS and JavaScript• Database programming knowledge using any flavours of SQL• Exposure across all the SDLC process, including testing and deployment• Experience in Azure Infrastructure and Azure DevOps (CI/CD) will be a strong plus• Good knowledge of Python or Scala will be a plus• Team player with an inclusive approach to decision making.• Experience with Agile methodologies like Scrum and Test Driven Development is a plus• Proven track record in keeping existing technical skills and developing new ones, so that you canmake strong contributions to architecturediscussions around systems and applications in the cloud (Azure, AWS or GCP)", "Role": "SSE,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "Senior software engineer,", "Employment Type": "Full Time, Permanent", "Role Category": "Not mentioned", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["JAVA", "SPRING", "HTML"]}