{"Job Title": "Allianz Partners- Hiring For Customer Care, Gurgaon", "Company": "AWP ASSISTANCE (INDIA) PRIVATE LIMITED", "Experience": "0 - 2 years", "Salary": "₹ 50,000 - 2,50,000 P.A. ", "Location": "Gurgaon/Gurugram", "Job Description": " Key Responsibilities: To handle all Inbound/Outbound calls in a prompt and courteous manner in line with company standards.Work with team spirit to achieve a common goal i.e. customer satisfaction.Determined and focused to achieve all the targets set up by the operations team for the benefit of the customer and then the organization.Should willingly take up any project assigned by the call center manager or management team. Desired Candidate Profile-  Fresher or Experience all would be eligible for this profile.Decent to good communication skills required without MTI. Language required- Hindi/EnglishIf interested you can apply with your resume on-  extern.priyanka.sharma@allianz.com Beware of Fake/ Unauthorized Job Provider operating under the name of AWP ASSISTANCE (INDIA) PVT. LTD. / AWP SERVICES (INDIA) PVT. LTD.’ (hereinafter referred to as Company/AWP/ALLIANZ PARTNERS). The Company never asks for any payment for providing any job offer. Please check carefully before applying and providing documents to any unauthorized/ unknown organization/person. In case of any suspicion and/or fraudulent mail, you can contact to the company at 0124-4343800 and at ashish.rana@allianz.com.. PLEASE NOTE THAT IN ANY CIRCUMSTANCES THE COMPANY AND ITS/ EMPLOYEES SHALL NOWHERE HELD RESPONSIBLE FOR ANY FAKE JOB OFFER/APPOINTMENT ISSUED TO YOU ON BEHALF OF THE COMPANY.”Regards,Priyanka Sharma-HRAllianz Partners", "Role": "Telecalling/Telemarketing Executive,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Graduation Not Required", "Doctorate": "None", "Key Skills": ["Inbound Process", "Customer Service", "Solving Queries", "Inbound Calls", "Calling", "Voice Process", "Query Resolution", "Outbound Calling", "Communication Skills", "tele caller", "customer relation", "Customer Support", "Telecalling", "Customer Care", "Domestic BPO", "Call Center", "telugu", "Customer Handling"]}