{"Job Title": "Technical Lead  Software Development (JAVA)", "Company": "Landis+Gyr", "Experience": "7 - 9 years", "Salary": "Not Disclosed", "Location": "Noida", "Job Description": "               Areas of Responsibility / Tasks:              This role should have extensive experience in Java methodologies. Technically mentoring the team, coordinating the domain related activity. The role includes design, development, engineering and post release support of technical solutions.             To handle operational problems, solving problems, identifying scopes of improvements and prevention of it. To establish methodologies, standards and procedures for requirements analysis, project plan preparation, procedure development and execution, documentation of results and reporting. Work With The Network Operations Center And Sqa Teams To Replicate Field Issues.             Document, Train And Support Operations And Software Quality Assurance Teams.             Perform Code Reviews. Install And Configure Application Server (Jboss, Apache Tomcat, Weblogic, Etc), Development Environments, Other System Elements Expeditiously             Read And Understand Both Requirements (Use Cases) And Architecture Documents (UML). Accurately Estimate Work Effort And Complete Assignments On Schedule             Database Design and Maintainence. To plan, manage and deliver projects ontime with the agreed quality and cost. Accurately estimate work effort and complete assignments on schedule.            Desired Skills/Competencies         6 - 8 years of experience in development and deployment of Service-oriented, Web-based Enterprise Software product/solutions           Hands-on in the implementation of multi-layer architectures using technologies such as:              Business Applications (Java/J2EE, multi-threading, JPA, JDBC, ActiveMQ) and API technologies (Web Services SOAP and REST, JMS, XML/XSD)           Database (Oracle, SQL)           Experiece in writing unit tests using Junit or any other similar framework        Experience in build tools such as Maven, Ant        Experience in deployment and troubleshooting Application Servers, such as, Weblogic, WebSphere, Jboss.          Expereince with GIT or similar source control tools as well as Eclipse IDE         Experience using Defect management, Source Code Managenent, REQUIREMENT Management tools (Rational/TFS/Other...)               Experience using Agile/Scrum software development methodologies using tools such as Jira, Confluence.                 Good to have:      Web rich UI (Javascript, Action Script, Adobe Flex, Angular JS)            Behavioral Competencies            Strong analytical skills, attention to detail and excellent problem solving/troubleshooting skills                  Excellent verbal and written communications skills              Highly driven, positive attitude, team player, self learning, self motivating and flexibility       Strong customer focus    Flair for creativity and innovation        Relevant tertiary qualification - B.E (CS, IT, ECE), B.Tech, M.E, M.Tech, MCA    ", "Role": "Team Lead/Technical Lead,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["JMS", "UML", "JBoss", "Database design", "XML", "Weblogic", "JDBC", "JPA", "Software quality assurance"]}