{"Job Title": "Customer Service Executive (Airline Process)", "Company": "MAJOREL INDIA PRIVATE LIMITED", "Experience": "0 - 5 years", "Salary": "₹ 1,75,000 - 2,75,000 P.A. ", "Location": "Navi Mumbai", "Job Description": " Majorel India Private Limited ( Former Name:  Bertelsmann Marketing Services India Private Limited )    Hiring for Premium Airline Process  (Voice profile) Profile : Customer service process Experience: Graduate Freshers &  HSC + 6 months minimum Experience (Work from Office or Work from Home & Job location is Navi Mumbai Vashi)Eligibility Criteria.* It is work from office you have to travel till office for a month for training period.* No Cab facilities in day time only in Night drop will be available.* After training period it will be work from home if lockdown continuous or will be work from Office.* You should be comfortable with rotational shifts & rotational week off as it is 6 days working.   Skills: travel process, aviation, travel agency, travel desk, customer care,   Hiring for Travel Process   Handle Inbound/ Outbound calls for 6 Months. Pure Customer Service profile - No Sales/ No Target  Verify customers details as per data protection act before sharing information Assist customers to resolve their issues satisfactorily Update customers profile in client database Provide resolution in the very first contact General information delivery Escalate problems if need be through the devised channels Abide by compliance and quality guidelines set by the company Always be courteous towards customers Reporting to the team leader for day-to-day functioning    Full Time Work Role.    Eligibility  * Minimum Graduate Qualification With good English & Hindi Communication skills * Preferable From Aviation Background * Graduate freshers Also Welcome and HSC only if have On paper 6 month experience minimum experience* HSC Fresher are not eligible for this opening   (Salary Maximum upto 13k In Hand) .  If Interested WhatsApp Your Details on Mentioned Number Details: (Note please share details on WhatsApp first with CV)   Contact Person : Aniket Chauhan Number : 7021135710  Name :    Experience :   Last Salary :   Highest Qualification :   Location:    Position Applied For :   ", "Role": "Telecalling/Telemarketing Executive,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Any Graduate in Any Specialization, Graduation Not Required", "PG": "Any Postgraduate in Any Specialization, Post Graduation Not Required", "Doctorate": "Any Doctorate in Any Specialization, Doctorate Not Required", "Key Skills": ["Airline Process", "travel process", "ticketing process", "iata", "inbound", "customer service", "customer care", "Voice Process", "airline", "Amadeus"]}