{"Job Title": "SR. Manager  Software Development", "Company": "ExecBoardinAsia", "Experience": "11 - 15 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "  Development Manager for eCommerce is part of growing eCommerce transformation team at the company. This team is focused on enabling best in class customer experience for their customers online and truly drive towards an Omnichannel experience.   eCommerce Development Manager will be responsible for partnering closely with Product Teams to understand the initiatives and lead the development teas to deliver best in class solutions to meet the initiative outcomes. This person will also be responsible for working closely with multiple other teams such as QA, API, Security etc. to make sure that Product Owners gets a complete development services experience. They will work closely on developing the team and growing them into a world class eCommerce team.   This is a senior role in the organization which along with a team of other architects will help design the future state of technology at the company.    PRIMARY DUTIES AND RESPONSIBILITIESinclude the following. Other duties may be assigned.     Lead the eCommerce development team   Participate in the refinement of their long term and shortterm eCommerce roadmap.   Collaborate with solution architects to design solutions across platforms.   Establish design and development standards to speed time to market and continuously improve quality.   Mentor and develop development talent.   Lead an agile development process which may include leading daily standups, sprint planning sessions, and business requirement meetings.   Provide thought leadership to business stakeholders about emerging trends in digital technology as aligned to strategy.   Prepare lifecycle for different projects inclusive of research, development, design, evaluation, testing along with delivery to product management.   Plan, define and review projects for proper implementation and migration to service mode   Evaluate performance of team members, provide feedbacks and prepare appraisals.   Learn and display as how products would add value to respective business.   Supervise resource allocation to assure attainment of apt business and personnel development goals.   Collaborate with application management on defining project objectives, resource planning, allocation and support for projects.   Consult Director on serious concerns and issues relating to application resource utilization.   Provide means of escalation of issues between departments and project team.   Involve in strategic plans to accomplish technical as well as business with leadership chain, team and with customers.   Manage cost and quality improvement activities by implementing new effective processes.   Manage and execute software development projects from beginning to finish   Evaluate projects, develop and update schedules plus supervise project status.   Collaborate effectively with all team members as well as hold regular team meetings.     ", "Role": "Project Manager-IT/Software,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - eCommerce, Internet Technologies,", "Employment Type": "Full Time, Permanent", "Role Category": "Project Management", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Product management", "Supervisor", "Project development", "Quality improvement", "Resource utilization", "Application management", "Resource allocation", "E-commerce", "Management", "ecommerce development"]}