{"Job Title": "Linux Kernel Engineer", "Company": "Brainstorm Technologies", "Experience": "4 - 9 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  Kernel Engineer with development experience in software design,  debug,  and verification of drivers and kernel code. You will use your nb\u0006pdeep understanding of kernel development,  scheduling,  locking and performance; to contribute to and interoperate within in a highly scalable multi- protocol network attached file system.  Development and maintenance of drivers and Linux kernel code.This position will interface with Hardware engineers,  Software Engineers,  Manufacturing engineers and the Field Service Engineers. Some of these will be located at remote sites. Collaboration and interaction with other groups and remote teams is essential for development.The successful Software Engineer must demonstrate good problem solving and analytical skills.Good verbal and written communication skills are also essential in daily functioningWork with the Linux community. Requirements4 years or more experience in software development.Previous experience in building commercial customer productsLinux Kervnel development experience Device driver implementation in 2.6.xExperience with performance optimization for low latency application sClient/ Server implementations C,  C Experience in building highly scalable systemsDemonstrated ability of strong software designs and debug skillsSelf Starter with the ability to remain flexible and learn new technologies quicklyClose interaction with development management (both local and remote) Must have excellent troubleshooting/ debugging skills,  using a variety of tools such as gdb,  gprofAbility to interact and collaborate with other senior engineers in different geographiesExcellent teamwork; written and verbal communication skills.", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["Analytical skills", "server", "development", "c", "Field service", "analytical", "Linux kernel", "Debugging", "Tools", "Performance optimization", "Scheduling", "Troubleshooting", "Software design", "application", "optimization", "service", "linux", "Software", "hardware"]}