{"Job Title": "Microsoft Dynamics 365 Developer", "Company": "Version 1", "Experience": "4 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "    Job Description    As a Microsoft Dynamics 365 Consultant in Version 1, this is a role where youll be able to deliver quality engagements using your expertise as a developer, advisor, by leading workshops, and troubleshooting to ensure we are providing value. On a daily basis you will be using your abilities to combine your technical skills, creativity and customer focus to deliver great solutions to our customers and ensure they get the best out of our technologies and solutions.    Work with business endusers to elicit requirements assist in developing design specifications to maximise the benefit of MS Dynamics.   Lead the technical delivery of the solution ensuring the designs meet architecture and customer requirements that fully exploit the capabilities of MS Dynamics   Deal with other stakeholders/ end users in the software development lifecycle PMs, Business Analysts, testing etc.   Manage and mentor the team through the project delivery    Qualifications     Good knowledge of the MS Dynamics platform and core technologies   Experience of working with SharePoint Online   Knowledge of MS Power Platform   Proven record of delivering applications from technical designs or specifications   Experience with development frameworks (SCRUM/Agile)   Clear knowledge of Microsoft stack such as MS SQL Server, .NET, JavaScript, ASP.NET, MVC   Client facing experience and ability to talk to senior stakeholders including gathering requirements   SSRS   ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["MS SQL", "Talent acquisition", "SSRS", "Consulting", "Javascript", "Agile", "Scrum", "Oracle", "microsoft", "Troubleshooting"]}