{"Job Title": "Windows Engineer", "Company": "Caliban Solutions", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "As a growing organization, we have various opportunities all the time for fresh graduates as well as experienced professionals. If you do see a connect with what we are pursuing at Caliban, then do get in touch with us. Irrespective of your profile, we could figure out a good fit for you either with us or with one of our prestigious clients.Development - Browser / MMS / SMS / Multimedia / Camera / Bluetooth / Navigation/SyncML/PC-Studio/WIFI applications / Active sync / Email apps Strong in C, any platform - Linux / Brew / Anroid/WinCE Good programming skills in BREW, OEM Interface development Experience of using ARM Compilers, debugging tools (Trace 32 ) for embedded systems Should be a team player with good communications skills and willingness to learn Experience in using Configuration management tools : Rational Clearcase, CVS, Perforce Experience in preparing the SRS, HLD, and DLD, Unit Test case documents.BSP and Drivers development , File System, Memory Control/Connectivity/Multimedia Framework on WinCE/Linux/RTOS platforms.Very good C,C++ Good programming skills in BREW, OEM Interface development Experience of using ARM Compilers, debugging tools (Trace 32 ) for embedded systems Should be a team player with good communications skills and willingness to learn Experience in using Configuration management tools : Rational Clearcase, CVS, Perforce Experience in preparing the SRS, HLD, and DLD, Unit Test case documents.Integration of 3rd Party Solutions , Porting of Applications from One Platform to other. Development of Debug Scripts using Perl etc.Very Good Debugging skills ,experience of using any general debugging tools like RVIEC, Trace 32 etc. for embedded systems. Log Analysis. Good Programming C,C++ Skills. Should be a team player with good communications skills and willingness to learn Experience in using Configuration management tools : Rational Clear case, CVS, Perforce. Experience in preparing the Test report documents!--BSP and Drivers development , File System, Memory control/Connectivity/Multimedia Framework on WinCE/Linux/RTOS platforms.Very good C,C++ Good programming skills in BREW, OEM Interface development Experience of using ARM Compilers, debugging tools (Trace 32 ) for embedde dsystems Should be a team player with good communications skills and willingness to learn Experience in using Configuration management tools : Rational Clearcase, CVS, Perforce Experience in preparing the SRS, HLD, and DLD, Unit Test case documents.Design and Development of Automobile features for ECUs. Development ,porting and testing of Automobile Applications from one Platform to other. Development of Debug Scripts using Perl etc. Very Good Debugging skills , experience of using any general debugging tools like RVIEC, Trace 32 etc. for Automobile and Avionics systems. Good Programming C,C++ Skills. Good experience on CAN , KW2000, 1553B protocols. Should be a team player with good communications skills and willingness to learn Experience in using Configuration management tools : Rational Clear case, CVS, Perforce. Experience in preparing the SRS, HLD, and DLD, Unit Test case documents.Experience in Porting, Integration and testing of stacks such as Modbus, Profibus, Industrial Ethernet, Interbus, and Controller Area Network. Design, development and testing of software for controlling distance, position, velocity and electronic gearing of industrial control and information systems, motion controllers, motion applications PLC programming HMI/UI application on different platforms such as Windows, Mac and Embedded Linux. Commissioning Testing of Industrial controllers. Experience in using Configuration management tools : Rational Clearcase, CVS, Perforce Very good analytical skills  Good skills in C, C++, Data-Structures, OS-Internals, CPU/Microprocessor design", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["RTOS", "CVS", "C++", "Bluetooth", "Configuration management", "Ethernet", "SMS", "Data structures", "Perl", "Windows"]}