{"Job Title": "Java Developer", "Company": "Version 1", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "     Job Description     Job Objectives    The successful candidate will be responsible for the development of cutting edge Distributed Systems and API s. You will be working with a range of technical experts as well as with knowledge leaders from the business, giving you exposure to an industry sector embracing innovation and evolution.   The role will be based at our Edinburgh office with travel twice a month to London for a day.   You will be responsible for:     Owning the design and delivery of your code from cradle to grave.   Peer reviewing your team mate s code   Being a key player in this client s Digital Transformation both implementing changes to existing APIs and developing new ones to integrate with the latest digital stack.   Developing new and bespoke features as well as working on large scale integrations    Working in an Agile Scrum environment where you will be challenged and motivated    Calling out risks if you spot them in a particular approach or design.    Qualifications     Experience with Java or other high-level Object Orientated Programming languages. The Project is very modular in nature so the more experience with Object Orientated Programming the quicker they will pick up the solution.   Knowledge of IO for both reading and writing data from files and possibly databases for managing test data and recording of test results.   Any knowledge of what Selenium is/does. Experience of using Selenium in any programming language. Selenium IDE experience is not as beneficial but still useful and would mean they would have good knowledge on the tool.   Knowledge of the basic structure of a webpage and what Xpaths are as they will need to interact with them during the creation of tests.    Plus    Knowledge of Cucumber/Gherkin.   Knowledge of Maven.   Experience with Fusion EBS or HCM    ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Maven", "ERP", "Agile scrum", "Spring framework", "Talent acquisition", "Programming", "Selenium IDE", "digital transformation", "Distribution system"]}