{"Job Title": "Dot Net Developer", "Company": "Cesta Solutions", "Experience": "1 - 4 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": " Job Description    We are looking for a highly skilled .NET Developer with a strong background in building scalable, predictable, high-quality and high-performance solutions for the Microsoft technology.     As a Developer, you will be responsible for building and maintaining internal and external facing web and windows applications.    This person will work with a team of experienced analysts, architects, developers and business resources to build high-performance enterprise-level integration solutions.     Candidate must have excellent analytical skills as well as a solid object-oriented programming experience.   Interact closely with Integration analyst/ architects to understand software requirements and design solutions   Assist Integration Architects with providing estimates for Integration Solutions.   Provide development support and assistance for customer escalations and issues, including off-hours   Multi-task many projects effectively   Responsible for quality and accountability of deliverables   Prioritize and schedule assignments to meet team deadlines and goals   Develop new functionality on our existing software products.   Share knowledge through knowledge-sharing presentations.   Participate in a small, experienced, energetic team on a rapid development schedule.   Design, develop and maintain software on .NET platform.   Should be comfortable with direct communication with all levels of technical and business resources.   Must be able to interact well with multiple priorities in an extremely dynamic environment, initiating necessary tasks and ensuring complete follow up   All other responsibilities as assigned    Skills Requirements    Bachelor?s degree or higher in CS, CIS, or related field   Solid Object Oriented Programming skills   Good understanding of all Software Development Life Cycle Phases   4+ years experience in application development   3+ years of development experience using Microsoft technologies   3+ years using: C#, ASP.NET, ADO.NET and SQL Server    Solid knowledge of .NET framework 4.5 or higher, C# , MVC, WCF Web Services, Windows Workflow, Visual Studio 2015 and higher, REST, SOA, object serialization for XML/JSON   Develop using HTML5/CSS/JavaScript frameworks such as AngularJS and TypeScript   Experience working with TFS   Solid knowledge of SQL Server 2014 and higher with the development of stored procedures, service broker, and triggers   Performance tuning, code profiling, code review, hands-on experience using Best Patterns and Practices    Good understanding and  experience on Enterprise Integration Patterns, B2B, EAI and EII integrations   Microsoft Certification preferred    Experience working with Powershell/install packages   Knowledge of Student Information Systems, CRM Systems, and Learning Management Systems is a plus   Must be flexible to travel 25% - 50% to customer sites.  ", "Role": "Administration Services/Medical Facilities,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "Medical, Healthcare, R&D, Pharmaceuticals, Biotechnology,", "Employment Type": "Full Time, Permanent", "Role Category": "Medical Professional", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["CRO", "Biostatistics", "Statistical analysis", "Pharma", "Analytical", "Protocol development", "Clinical trials", "Clinical research", "SAS Programming"]}