{"Job Title": "Junior Test Automation Engineer", "Company": "Version 1", "Experience": "1 - 4 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   Job Description     In this brand-new role, you will have the opportunity to be part of a newly formed Cloud and Digital Centre of Excellence focused on designing and implementing solutions which incorporate best of breed technologies, frameworks, and best practices. This provides a unique opportunity for people who are passionate about technology and have a deep commitment to code quality and best practices to build something special and make a real difference to our business and to our customer s business. You will get to work with some of the brightest people in our organisation who are industry thought leaders and build cutting-edge solutions. It is a position with excellent career prospects, suitable to someone looking to make the next step up in their career and that is seeking to work with new technologies and drive our ambitious development team members to new heights. This is a techie s dream role!   Successful candidates will have demonstrated experience of testing within iterative / incremental software delivery, including good knowledge of automated testing and ideally exposure to Agile Scrum. They will have communicated a deep interest in improving both own and teams ability to produce high-quality, valuable software and have demonstrated their ongoing commitment to personal learning and development in this discipline. We provide complete lifecycle solutions to our customers, helping them to achieve their business objectives by identifying requirements, designing and developing solutions and providing on-going support and strategic advice.    Key Duties Responsibilities     Requirements analysis and validation.   Defining and executing test automation scripts.   Provide QA support to the development scrum teams to automate tests to guide development.   Develop best of breed solutions.   Work in an Agile environment where you will be challenged and motivated.   Introducing/suggesting new processes and techniques.   Demonstrate a strong commitment to Excellence      Qualifications     Essential:     Good Test Analyst skills such as defect tracking, troubleshooting issues etc.   Experience of working in fast paced environments to strict deadlines.   Knowledge / familiarity with UI automated testing tools such as Selenium / Cypress / Jasmine / other   Knowledge / experience of defining test strategy / test approach.   You will have worked in an Agile environment and be comfortable with fast-paced Sprint Cycles.   Ability and desire to quickly pick up new technologies, languages and tools   Excellent communication skills   Passionate about code quality and best practices an absolute must   Must show evidence of your passion for technology and continuous learning   Good team player       Preferred:     BDD tools such as Cucumber   API Testing via Postman / SoapUI / Rest-Assured      ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["IT services", "Test strategy", "Testing tools", "Agile", "Scrum", "Selenium", "Customer service", "Oracle", "microsoft", "Troubleshooting"]}