{"Job Title": "Principal Engineer", "Company": "CropIn Technology Solutions Pvt. Ltd.", "Experience": "9 - 14 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  Job Summary   Principal Software Engineers develop, document, and test software to ensure that the software meets the needs of end-users and achieves business goals. Principal Software Engineers provide technical guidance to development teams and oversee the technical aspects of all projects   Principal Accountabilities   Designing, coding, and debugging software.  Improving the performance of existing software.  Providing training to other engineers.  Maintaining and upgrading existing software.  Recommending new technologies that can help increase productivity.  Supervising and overseeing the technical aspects of projects.  Investigating software-related complaints and making necessary adjustments to ensure optimal software performance.  Regularly attending team meetings to discuss projects, brainstorm ideas, and put forward solutions to any issues   Primary Relationships   The position reports Head of Engineering  This position works closely with Product and Engineering team.   Best fit profile   Candidates who have 9+ Year of experience in development  Expert level in Java, Spring (Boot, Security, REST, JPA, Integration),AWS, Servlets, Hibernate.  Good knowledge of JavaScript, SQL, Maven/Gradle, HTML, Spring Batch.  Nice to have: Spring Cloud, Micro services..  Experience in AWS  Plan, direct and implement advancements and improvements in Product development and combined  remedy designs and implementation methods  Experience in Data Structure  Solve problems of various degrees of complexity  Ability to work in Full stack development  Provide technical guidance in software design and development activities  Hands on experience and ability to do the development  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Maven", "Hibernate", "Software design", "Coding", "Bfsi", "Debugging", "Javascript", "HTML", "SQL", "Remedy"]}