{"Job Title": "Staff Engineer, Data Engineering", "Company": "Exponential", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  Job Title Staff Engineer     Data EngineeringVDX.tv?s engineers develop the next-generation products powering a scalable ad tech platform which enablesadvertisers across the globe to reach out to their consumers and deliver effective, engaging advertising.     We are looking forengineers who are driven to solve challenges of large-scale system design, artificial intelligence, information retrieval,massive data pipelines, UI design, richmedia frameworks, data insights, optimization and targeting strategies.    The mission of the Data Engineering team is to empower the customers and business stakeholders to derive audience,contextual, psychographic, targeting and optimization insights across the digital platforms.   This is done by collecting andprocessing data from multiple sources across our ad tech platform and producing advanced insights and optimizationrecommendations.     Responsibilities     ? The position requires one to work on complex technical projects with peers in an innovative and fast-pacedenvironment.    ? Play an individual contributor role with high accountability, positive impact in small teams and work well both as anindividual and as part of the team.    ? Work on algorithms and systems that power the contextual segment engine using text mining, information retrievaland machine learning.    ? Work on massive semi-structured text, time series and graph datasets.    ? Mentor peers, share information, knowledge and help build a great team.Required Skills    ? Excellent problem solving skills with a strong foundation in Computer Science including core data structures,algorithms and analysis of running time and memory requirements..    ? Develop scalable and reliable software for internet scale and real-time data processing.    ? Be able to develop hypothesis and test with experimentation.    ? Be able to A/B test and deploy the algorithmic changes and improve the outcomes.    ? Relevant domain experience in building data mining products (data mining, information retrieval, natural languageprocessing, advanced statistics, and/or machine learning) with a strong systems orientation    ? Be able to create prototypes, examples to demonstrate the concepts.    ? Experience with developing and delivering production systems using any of Java, Scala, Python.Desired Skills    ? Knowledge of internals Lucene/SOLR or other information retrieval systems.    ? Experience with Hadoop, Pig, or other MapReduce paradigms    ? Experience with Data streaming paradigms.    ? Experience with SQL, python notebooks.QualificationsBTech / MTech from reputed engineering college such as IIT, BITS, DCE, REC?s with 3-8 years of hands on experience.  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - eCommerce, Internet Technologies,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Artificial Intelligence", "Machine learning", "SCALA", "Data structures", "System design", "Natural language processing", "Data mining", "SQL", "Python"]}