{"Job Title": "Senior QA Engineer", "Company": "Mundrisoft Solutions", "Experience": "11 - 12 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "     We are looking for   Senior QA Engineers   who can work with our awesome team. Our clients are top fortune 100 international technology companies.    Key Requirement:     Has excellent communication skills to handle any issue, requirement discussion, daily stand up call with Client.   Able to manage deadlines or unexpected changes in expectations or requirements.   Experience in creating test cases, test scenarios, requirement documents and other documents which are required from time to time for projects and to manage QA Operations.   Should have minimum 6 years of Experience in STLC, SDLC.   Should able to drive manual testing, API testing, Integration testing, Automation, Gathering requirement for existing products. Should have experience on End to End Functional Testing.   Good Experience in Automation Scripting (Preferred language: Java, Java Script, Python).   Should have minimum 1 year experience in testing SQL Queries.   Should have experience of using/configuring Jira, Zendesk , Git Hub, Quality Centre , TFS, Mantis.   Minimum 1.5 year Experience in Selenium, Appium, Protractor with any Framework. Should have ability to learn any new framework with specified time frame.   Should be Selfmotivated and Self Driven   Should understand deliveries and can adapt to the changing requirements.     Job Profile and Responsibilities:     Proactive and timely communication with client and management.   Work collaboratively with testers, developers and stakeholders.   Effective follow up for Defects, Backlog Task etc till closure.   Manage deadlines or unexpected changes in expectations or requirements.   Create Understanding documents, Detailed or High level Test case scenario documents, Minutes of Meetings and other documents to support or QA Operations.   Create and Execute Test plan to ensure Software product design specification as per Standards.   Constant involvement needed with dev team to improve product quality     Opportunity to:     Work for fortune 100 international clients   Work on latest technologies and product development   Work on mobile, tablet and desktop web applications   Amazing growth path. Learn, grow and help others grow   Be part of our awesome team      ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - QA & Testing,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Automation", "Manual testing", "Functional testing", "Integration testing", "Product design", "Selenium", "JIRA", "SDLC", "Analytics", "Python"]}