{"Job Title": "QA Engineer", "Company": "Mundrisoft Solutions", "Experience": "7 - 12 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "     We are looking for   QA Engineers   who can work with our awesome team. Requirement is for both Manual and Automation test engineers. Our clients are top fortune 100 international technology companies.    Required    key skills:     Experience in creating test cases, test scenarios, requirement documents.   Experience on End to End Functional Testing.   Experience in manual Testing, API Testing using Postman, Integration testing, Automation, requirement gathering for existing products/projects.   Experience in Automation Scripting (preferred language: Java, JavaScript, Python)   Minimum 6 months experience in testing SQL Queries.   Experience using tools like Jira, Zendesk ,GitHub, Quality Centre, TFS, Mantis.   Ability to manage deadlines or unexpected changes in expectations or requirements   Minimum 1 yearexperience in Selenium, Appium, Protractor or in any other framework   Experience in script creation.     Responsibilities:     Proactive and timely communication with team   Effective follow up for Defects, Backlog Task etc till closure.   Manage deadlines or unexpected changes in expectations or requirements.   Create Detailed or High levelTest case scenario documents   Constant involvement needed with dev team to improve product quality   Learn new frameworks   Good communication skills     Opportunity to     Work with our awesome team   Work for fortune international technology companies like Microsoft   Work on latest technologies      ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Automation", "Manual testing", "Functional testing", "Integration testing", "Javascript", "Selenium", "microsoft", "JIRA", "Analytics", "Python"]}