{"Job Title": "DevOps Engineer", "Company": "Cloudskope", "Experience": "2 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": " We are seeking a DevOps Engineer for a permanent/direct hire opportunity in Bangalore, India. In this Agile environment, you will work between the SQA and Dev teams to design and develop high performance solutions for critical applications. The responsibilities of this role are as follows:    Design, deploy and maintain DevOps platforms, systems and infrastructure.   Build, deployment, monitoring, and troubleshooting of cloud-native infrastructure and technology components using Kubernetes, Docker and Big Data technologies.   Work across all development teams to encourage best practices for continuous delivery and configuration management and to identify missing tools and automation.   Develop, implement, and optimize the software build and deployment pipelines.   Developmentof solutions for the automation of system provisioning and deployment.   Implement monitoring platforms across infrastructure, applicationsandnetworks.   Improve and build on kernel performance, database and storage optimizations.   Manage Linux clusters and containers using tools such as Ansible, Chef, Puppet.   Troubleshoot and resolve live production issues by analyzing logs from different sources, follow up with developers, platform engineer and other teams on the resolution.   Perform software installations and upgrades for the DevOps services platform and associated systems during industry-standard maintenance windows   Direct involvement with 24/7/365 production environment.    Qualifications     Bachelor's in Computer Science, Telecommunications or equivalent work experience.   Three years of hands-on experience in DevOps engineering.   Three years of hands-on experience with automation/configuration management tools (Puppet, Salt, Chef, Ansible, etc.)   Three years of hands-on experience in multi-server platforms and Linux operating system   Three years of hands-on experience with container technologies and management platforms (Kubernetes, Docker, Elastic Container Service)   Experience delivering mission-critical services in a SaaS/SaaP or PaaS     Functional Knowledge and Skills Required     Ability to knowledge share and work cross-functionally, in an Agile environment   Ability to translate standards to software requirements   Experience with RedHat OpenShift and Kubernetes   Hands-on development capability; Three years of Kotlin / Java / JVM languages  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Sc in Chemistry", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Computer science", "Redhat", "Automation", "SQA", "Linux", "Configuration management", "Agile", "Windows", "Troubleshooting", "Monitoring"]}