{"Job Title": "Senior Data Engineer", "Company": "CropIn Technology Solutions Pvt. Ltd.", "Experience": "1 - 4 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  Job Description:    This position is hosted by the Earth Observation & AI Science (EO & AI) team, and the position will involve working and collaborating with Technical and Business teams to bring innovation and solutions for sustainable Agriculture. The AI Infrastructure is the core lifeline and one among the 3 pillars that helps us in delivering value to our customers by making the data analysis ready.The candidate will be responsible for the infrastructure team, mentoring other data/ML engineers and working with the technical team comprising AI Data & ML Engineers/Scientists, researchers, subject matter experts (SME), Professors in the field of Data Science, Machine Learning and AI.    The Senior Data Engineer will also be working on open research problems and innovation that might result in publications. He/She must be self driven and passionate about solving problems in technology. The key responsibilities will be in understanding the existing data ingestion pipelines for Geospatial data on Amazon Web Services (AWS), working with the AWS team in tweaking these architectures for adopting the best practices from the Geospatial industry, and building new ingestion pipeline architecture, and monitoring ML algorithms and their life cycles.    Some of the responsibilities will involve setting up and configuring AWS IAM roles, automating workflows using Apache AirFlow or AWS Step Functions, optimizing, performance tuning and security. Integration of DevOps into development and production pipelines using Git, GitLab, GitLab pipelines, Docker, Docker Swarm and Kubernetes. These architectures will be deployed and validated initially at a small scale, and the candidate will work over a period of time to make these processes scalable and automated. Cross pollination of ideas and experience from other industries will be welcome! Essential EducationMaster s or PhD degree in Computer Science, Computer Engineering, Remote Sensing, Geoinformatics or related technical field, or equivalent practical experience.    Basic Qualifications and Skills:     AWS Cloud framework, Managing EC2, S3, workflow through Step Functions, Experience with ML Model building and version controlling using MLFlow and bring to production using Dockers     Work closely with scientists and understand the inner workings of complex machine learning algorithms.     Have expertise in Python, Linux and version control using Gitlab/Github,     Aptitude for Research and Publications and launch long-term research initiatives to publish at top-tier conferences.     Preferred Qualifications and Skills:     Experience with machine learning, deep learning, data mining, and statistical analysis tools.   Experience in taking projects from a Technology Readiness Level (TRL) of 1 to 4   Knowledge of best practices for the full ML development life cycle, including coding standards, code reviews, source/model control management, build processes, testing, and operations.   Experience with working on Google Earth Engine, ArcGIS/QGIS, Geopandas, Rasterio, Shapely, GDAL  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Data analysis", "Linux", "Coding", "Machine learning", "Data mining", "Monitoring", "Remote sensing", "Python", "Arcgis"]}