{"Job Title": "Optimize Overseas LLC - Oil & Gas Data Analyst", "Company": "Optimize Overseas LLC ", "Experience": "0 - 3 years", "Salary": "₹ 3,00,000 - 3,25,000 P.A. ", "Location": "Kolkata, Bangalore/Bengaluru, Delhi / NCR", "Job Description": "Type of Position: Work From HomeFresher/New Graduate, Full-Time Independent Contractor, 40 hours/week Work Hours: 8:30 pm - 5.30 am IST Monday-Friday (One hour break included)Position Description: The Oil & Gas Data Analyst will be responsible for detailed data entry required by various affiliates of Optimize Overseas, all of whom are oil & gas companies.  Accurate and timely entry of data appearing in PDF documents into spreadsheets is needed.  The Data Analyst may also be required to assist in the encoded data standardization & maintenance, as well as the review of data entry performed by other Data Analysts, to ensure high data quality.  These processes will require strong oral and written communication in English. The Data Analyst will further be expected to keep data encoding errors to a specified minimum, which will require very careful attention to detail.  Over time, the Data Analysts responsibilities will transform and increase, giving way to more advanced data analytical work and less focus on routine data entry.Desired Skills:Very Strong Attention to Detail, Evidenced By Previous Work / Successes (Required)Ability to Perform Repetitive Tasks With a High Degree of Accuracy (Required)Strong Command of English Language, Both Verbal and Written (Required)Ability to Follow Written or Verbal Direction, With Minimal Oversight (Required)Previous Experience in a Data Entry Role (A Plus, Not Required)Moderate understanding of Google Apps (A Plus, Not Required)Proposed Compensation: 26,000 INR / month Email your resume to ayan@optimizeoverseas.com", "Role": "Fresher,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Other", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Excel", "Spreadsheets", "Data Analysis", "Google Spreadsheets", "Data Quality", "Word", "Mac OS X", "Windows 8", "XP", "Internet", "Powerpoint"]}