{"Job Title": "Software Development Engineer", "Company": "Rocket media Technologies Pvt. Ltd.", "Experience": "0 - 2 years", "Salary": "₹ 1,75,000 - 3,00,000 P.A. ", "Location": "Gurgaon/Gurugram( Udyog Vihar )", "Job Description": "POSITION OVERVIEWYou are a software developer with a product mindset. You are passionate about solving hard problems while often face exciting, even daunting, challenges. You love innovating, are a self-learner with a hunger for knowledge. You are brimming with ideas and not shy about sharing and trying them out. You are driven by a passion to build awesome products that make a real difference.WHO ARE YOU?You will join the core product team to develop technology that is changing how restaurants run their business. As part of a small team, you'll be involved in the entire product life cycle from conception to prototyping to development to launch. We believe in Agile, short release cycles and quick iterations.YOU WILL OWNSpecialise in building elegant and responsive front end & back end user interfaces.Work with the design team to help design the user experience.Translating designs and wireframes into high-quality code.Optimising components for maximum performance across a vast array of web-capable devices and browsers.YOU HAVEDegree in computer science or equivalent from a recognized university.0-2 years of front-end & back end development experience.Excellent problem-solving and communication skillsDeep expertise in JavaScript, nodejs & React Native .WHAT'S IN FOR YOU1) Open office culture with a small lean team. 2) WFH till March 2021 3) Flexible working hours 4) Flexible leave policy 5) Team outings 6) Health Insurance 7) Paw Friendly", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers, B.Sc in Computers", "Doctorate": "None", "Key Skills": ["Javascript", "HTML", "CSS", "Software Development", "React.Js", "Product Life Cycle"]}