{"Job Title": "Hiring For International Voice Process / Sal upto 3LPA", "Company": "Black and White Business Solutions Pvt Ltd  ", "Experience": "0 - 5 years", "Salary": "₹ 2,75,000 - 4,50,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": " Dear Candidate, Greeting from Black and White business Solutions.I found your  Resume is suitable for the below opening with our esteemed client.Client Name:   Accenture, Concentrix,, Tech-Mahindra,HGS,24/7,OmegaJob Description:Openings for Top 10 BPO MNC's!! Walk -in with Resume Walk-out with an Offer, One day Interview Process,....... Just 2 Rounds of Interview, Easy Conversions.. Designation:- Technical Support Engineer (Voice ) Roles and Responsibilities \tWillingness \tand ability to work in shifts (24 x 7). Excellent \tverbal and written communication. Good \tKnowledge on Operating Systems, Hardware, Networking and MS \tApplications Multitasking \tand coordination skills. Team \tPlayer. Well \tversed with technology (understanding of networks, monitoring, \tDBMS, Windows) Excellent \tjudgment skills to be able to properly evaluate situations \tand immediately provide effective solutions  Skills Excellent \tverbal and written communication skills Strong administrative skills: organized, efficient and versatile Strong customer service approach to dealing with people at all levels internal and external Rotational Shifts Graduates freshers with excellent communication skills. 0-2years exp. Graduates with minimum 6 months experience in BPO Voice Immediate joiners. Work location:  BangaloreAbout Black and White Business Solutions Pvt Ltd  Incorporated  in 2006, we are the leader and innovator of the staffing industry and  today, have evolved as a premier provider of manpower for some of the  fortune 500 companies for their junior/middle & executive talent  management staffing needs. We work with our clients hand in hand to  overcome the challenges they face in attracting / interviewing and  retaining Junior / Middle & Top Management professionals.   Please forward the mail to all suitable candidates who might be interested to apply for the job You can alternatively reach out to me: Contact number: Akila @  9513161621 / 9741433322email id: hr1621@blackwhite.inRegards,PoojaBlack and White business Solutions Pvt Ltd", "Role": "Associate/Senior Associate -(NonTechnical),", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["E-commerce", "US Healthcare", "customer support associate", "BPO", "Email Support", "Customer Service", "MNC", "CSR", "International Call Center", "Jobs in bangalore", "Non Voice", "Communication Skills", "TSR", "Technical Support", "Chat", "Customer Care", "Domestic BPO", "Fresher"]}