{"Job Title": "Team Lead - Software Development - Java", "Company": "Career Infosystem", "Experience": "8 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   Lead Software Developer - Java-   Description:   INR :   Looking forward to have a candidate with minimum of 8 years of experience and hands on development experience in Web Services (RESTFUl, SOAP), core java, data base concept, spring, hibernate and UNIX/LINUX command understanding. Microservices, cloud computing are a plus-   JOB DESCRIPTION :   Architecture and high level design experience. Leading a self-contained team of 3 - 5 developers. Develops, codes, tests and debugs new moderately complex software solutions or enhancements to existing software in a maintenance capacity. Has good understanding of business application.   Works with technical staff to understand problems with software and resolve them. Resolves customer complaints with software and responds to suggestions for improvements and enhancements.   May assist in development of software technical documentation. Designs and codes moderately complex applications using routine and/or advanced technology. May create optimization programs to resolve problems. May design and build prototype applications.-   EDUCATION : Bachelor's degree or equivalent   REQUIRED SKILL :   Must be fully proficient with Java programming language and various Java EE technologies. Thorough knowledge and hands on experience with Spring, Hibernate and web services is a must.   - Demonstrated knowledge of Object Oriented Analysis and Design Experience in JSON, XML/Web Services technologies   - Understanding of relational databases (Oracle, SQL) Demonstrated knowledge of Linux operating systems   - Strong communication skills   - Experience with build tools Ant/Maven/Gradle   - Experience with Apache Camel Experience in JMS/MOM, JBoss, JMX, Drools a plus  PREFERRED SKILLS : Agile experience is a plus Understanding of TDD practices and experience with   JUnit/Unit Testing. Microservices and Cloud computing.   Skills ( Mandatory /Optional) Core Java (M)   - Spring (M)   - Hibernate (M)   - Webservices (M)   - Restful / SOAP (M)   - Database concept (M)   - Junit (M)   - Exposure on Microservices ", "Role": "Team Lead/Technical Lead,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required, Any Doctorate in Any Specialization", "Key Skills": ["Unix", "Java", "Hibernate", "Software Development", "Linux", "RDBMS", "XML", "OOAD", "Microservices Architecture", "JSON", "Webservices", "Spring"]}