{"Job Title": "Analyst Programmer - Software Development Life Cycle", "Company": "Serving Skill", "Experience": "2 - 4 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": " Join the team that is improving the way the world creates, protects, and advances innovation.Department : Life Science TechnologyLocation : Bangalore, IndiaTerms : Full-time EmployeeMain Purpose of Role :-  As an analyst programmer, this role will be tasked with the development  and maintenance of the client-facing web application. Key  responsibilities include understanding technical requirements and  architectural choices contributed by the architecture and design teams;  working as part of a team in delivering on the goals of the project and  ultimately contributing code to the solution as required. - The  ideal candidate will be passionate about software development and  technology, have demonstrable technical and problem-solving skills. The  candidate should show a clear understanding of development trends and a  broad understanding of software development paradigms. They will have  excellent organization skills, good knowledge of the full software  development life cycle including Agile/Lean development processes.Knowledge, Skills, and Abilities Required :- Overall IT industry experience of 2 to 4 yrs- Solid development experience in a commercial IT environment- Passionate about code and software architecture- Strong web-focussed development skills- Effective communicator at all levels, excellent interpersonal skills, strong business focus- Highly self-motivated, confident to work on projects alone as well as in a team- An enthusiastic approach to extending knowledge and learning new skills- Strong commitment to quality of work and good attention to detailExpert in the following :- Angular- Typescript (1+ years of experience)Basic Knowledge of :- Agile/Scrum Software development methodologies- Working with continuous integration environments- Configuration Management tools: Redmine/Bugzilla, Jenkins/Hudson, Maven experience- Version Control: SVN, Git, MercurialNice to have:- Server-side programming using typescriptNotice Period : Maximum 30 days ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "BCA in Computers, B.Sc in Computers, B.Tech/B.E. in Computers", "PG": "M.Tech in Computers, MCA in Computers, MS/M.Sc(Science) in Computers", "Doctorate": "None", "Key Skills": ["Jenkins", "Maven", "GIT", "Software Development Methodologies", "Continuous Integration", "Hudson", "Redmine", "Agile", "SVN", "Version Control"]}