{"Job Title": "Software Development Manager - Startup", "Company": "Benchire", "Experience": "6 - 11 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Benchire is looking for a Software Development Manager, to help manage a Backend/Frontend team for a US based company Must haves: * You have many years of web, mobile, or devops experience * You are a systems thinker and process minded * You have managed teams successfully before * You love to motivate people, keep them focused, and remove their obstacles * You are not afraid to get your hands dirty and enjoy working alongside the team Day-to-day responsibilities: * Hands On Coding / Code Reivews / Architecture: 70% * Project Management: 30% Code * Write Code * Help Architect new Features / Projects. * Review Code and Approachof fellow team members Project planning * Help coordinate projects from design to resource planning * Help shepherd them through deployment * After the daily stand ups, be sure that everyone has what they need for their given project * If needed, add people to a project and halt another * Bigger projects require retrospectives and write-ups Lead firefighting * When the inevitable happens help the engineers debug and fix the problem as fast as possible * Coordinate retrospective meetings to document what happened and how we can prevent this in the future Aid in product planning * Understand the roadmap and help plan a way to execute it Skills: Python, Javascript, Django, MySQL, Redis, Celery, AWS/EC2/ELB/S3/DynamoDB, ElasticSearch", "Role": "IT/Networking-Manager,", "Industry Type": "Internet, Ecommerce,", "Functional Area": "IT Software - DBA, Datawarehousing,", "Employment Type": "Full Time, Permanent", "Role Category": "Admin/Maintenance/Security/Datawarehousing", "UG": "B.Tech/B.E. in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["S3", "Architecture", "Redis", "DynamoDB", "ElasticSearch", "Celery", "EC2", "Django", "MySQL", "Javascript", "ELB", "AWS", "Python"]}