{"Job Title": "Software Development Engineering, Professional", "Company": "Fiserv India Pvt Ltd", "Experience": "1 - 5 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Our software engineers at Fiserv bring an open and creative mindset to a global team developing mobile applications,  user interfaces and much more to deliver industry- leading financial services technologies to our clients. Our talented technology team members solve challenging problems quickly and with quality. We're seeking individuals who can create frameworks,  leverage developer tools,  and mentor and guide other members of the team. Collaboration is key and whether you are an expert in a legacy software system or are fluent in a variety of coding languages you're sure to find an opportunity as a software engineer that will challenge you to perform exceptionally and deliver excellence for our clients.\n\n Full- time \n\n Entry,  Mid,  Senior \n\n Yes (occasional),  Minimal (if any) \n\nGlassdoor: 64% \n\nSuccess Profile\n\nSuccess Profile Every candidate has their strengths,  and at Fiserv,  we want to match you to a career that allows you to put your best foot forward. Do you have the competencies outlined below If so,  you might be an excellent candidate for Software Engineer career at Fiserv.\n\nCritical Thinker\n\n10\n\nTechnologically Savvy\n\n9\n\nAnalytical\n\n8\n\nCollaborative\n\n8\n\nDeadline Oriented\n\n9\n\nProblem Solver\n\n8\n\n10\n\nGoal- oriented\n\nCommunicator\n\nTeam Player\n\nStrategic\n\nCreative\n\nResults- driven\n\nProductive\n\nInventive\n\nPrevious \n\nOur associates may work purely as product developers working on multi- tenant platforms,  maturing them over time by adding new features,  getting rid of technical debt,  and advancing technologies. This is the area where the most creativity and innovation takes place. \n\nEric Drudge,  VP Technical Product Development \n\nOur developers are encouraged to be extremely creative. They re thinking about design and user interface and decide how to create experiences that delight the customer when they log on. \n\nWade F,  CIO,  E- Payments \n\nWe re looking for the most innovative people - -  those who work with technology all the time,  especially as a hobby. We want engineers that have built their own servers,  used a raspberry pi kit,  or have played LAN games. Because of our size and industry dominance,  we have every opportunity that a developer would want. We are working with the newest versions of cutting edge technologies. Fiserv has so many opportunities. You can t lose. \n\nWill Casey,  Manager,  Application Support Engineering \n\nOur associates may work purely as product developers working on multi- tenant platforms,  maturing them over time by adding new features,  getting rid of technical debt,  and advancing technologies. This is the area where the most creativity and innovation takes place. \n\nEric Drudge,  VP Technical Product Development \n\nOur developers are encouraged to be extremely creative. They re thinking about design and user interface and decide how to create experiences that delight the customer when they log on. \n\nWade F,  CIO,  E- Payments \n\nNext \n\nTrending\n\nFiserv Industry Awards & Recognition\n\nLearn about the exciting kudos we receive for providing our customers with industry leading solutions,  our associates with an outstanding culture,  and the marketplace with a brand to envy.\n\nLearn More \n\nProduct Lifecycle\n\nFiserv is a FORTUNE 500 company with a start- up feel. Learn about the benefits building products in a culture that values an entrepreneurial spirit and supports you with real resources.\n\nWatch Video \n\nBenefits & Well- Being\n\nHealth /  Medical /  Vision\n\nStandard for all associates\n\nOnsite Gym/ Fitness Center\n\nWhen Fiserv performs well,  so does your financial health\n\nHealth and Wellness\n\nPrograms that help promote a positive work environment\n\nFlex Time /  Working Arrangements\n\nWork from home full/ part time,  virtual opportunities & more\n\nTuition Reimbursement\n\nTo encourage associate professional development\n\nRecharge & Refuel\n\nA time off policy that encourages you to maximize well- being\n\nResponsibilities\n\nRequisition ID R- 10105376 \n\nDate posted 02/ 07/ 2019 \n\nCity Bengaluru \n\nCountry India \n\nThe associate should have experience in\n\nDevelopment experience in .NET (4.5/ 4.0/ 3.5/ 2.0) framework,  VisualStudio(2005/ 2008/ 2010/ 2102),  C# 5.0/ 4.0/ 3.0 and SQL Server 2008/  R2 and SQL Server 2012\n\nGood knowledge of implementing and consuming WCF and/ or Web services\n\nGood knowledge of scripting knowledge frameworks JQuery, Javasscript\n\nknowledge of unit testing and tools like Nunit /  TFS etc\n\nProven experience of web designing with CSS, HTML\n\nGood knowledge of object oriented design principles and patterns,  hands- on experience with multi- tier/ layer distributed applications\n\nGood knowledge of Session State Management,  Caching,  Http handlers and Modules,  Page life cycle,  Error handling etc.\n\nReview code developed by team members and provide constructive feedback\n\nTroubleshooting & problem solving skills\n\nExposure to Agile Kanban process is added advantage\n\n", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["server", "code", "technical", "software", "developing", "HTML", "Troubleshooting", "tools", "sql", "scripting", "Coding", "web", "design", "Agile", "c#", "Application support", "development", "interfaces", "testing", "mobile", "HTTP", "jQuery", "application", "Flex", "LAN", ".net", "developer", "WCF", "support"]}