{"Job Title": "Sutherland is Hiring For International Customer Support Chat I Chennai", "Company": "Sutherland Private Limited", "Experience": "0 - 2 years", "Salary": "₹ 1,00,000 - 2,00,000 P.A. ", "Location": "Chennai", "Job Description": "Greetings!!!We are hiring for Front line Agents, also known as an Customer Service Executive, A CSR will act as a liaison, provide product/services information and resolve any emerging problems that our customer accounts might face with accuracy and efficiency.  Responds to Chats, voice calls and assigned tickets from users; Assign work orders / incidents to appropriate support teams and follow up until closure.Identify and assess customers' needs to achieve satisfactionBuild sustainable relationships and trust with customer accounts through open and interactive communicationAsk customers targeted questions to quickly understand the root of the problemTalk clients through a series of actions, either via phone, email or chat, until they've solved the issueProperly escalate unresolved issues to appropriate internal teamsRefer to internal database or external resources to provide accurate tech solutionsEnsure all issues are properly logged.Job nature requires Working From Office right from Day1.Free transportation provided by the Company. US / Night Shift with two days rotational off.Interested candidates can book their interview slot by mailing the updated resume to karthick.k@sutherlandglobal.comThanks much,Karthick KumarLead Talent AcquisitionSUTHERLAND, ChennaiRequired Candidate profileAny fresher graduate can apply. Tenured from BPO or Other industry experience can also be considered if you have stable career path with excellent industry knowledge and are from a Direct sales, institutional or corporate sales background or similar lines.Must be naturally a helper, enjoy assisting people with product issues and are able to explain in details simply, we'd like to enroll you for interviews.Ultimately, you will be a person our customers trust. They will rely on you to provide timely and accurate solutions to their problems.Notice Period of 1 week or fewer days required.Should be Interested for rotational Night shifts. Should have good convincing power as you will be regularly in contact with clients and/or customers. Soft Skills:-Excellent communication and conversation skills (Verbal and Written)Good documentation skillsShould have a great customer handling skillsAble to handle unforeseen situationsHigh level of acceptanceCan drive Sutherland's value and moralsPlease write to karthick.k@sutherlandglobal.com in case of any doubts.Perks and Benefits Net Pay will be discussed at the time of interview", "Role": "Associate/Senior Associate -(NonTechnical),", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Temporary/Contractual", "Role Category": "Voice", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["BPO", "Customer Service", "cold calling", "US voice", "Inbound Calls", "Online Lead Generation", "International Ticketing", "Outbound Sales", "Telecalling", "Domestic BPO", "Air Ticketing", "Call Center", "Telemarketing", "International Voice Process"]}