{"Job Title": "Software Development Engineer II", "Company": "Flipkart Internet Private Limited", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Job Description:Software Development Engineer IIAbout the roleAt Flipkart, SDE-2 are engineers who create features based on product requirements. You’re expected to design and code in multiple tech components related to your functional area. You’re required to learn the best practices and design principles and patterns to make the code-base maintainable and extensible. You must also develop a deep understanding of non-functional requirements, such as reliability and availability, scale, horizontal scalability, etc. over time and make tech stack decisions accordingly. We are looking for engineers who are well rounded - quality conscious, product thinkers, business cognizant and smart – not mere coders. Engineers get to significantly amplify their impact with the scale that Flipkart operates at.What you’ll do:Design components by translating product requirements, break down project into tasks and provide accurate estimatesIndependently come up with different solutions, extensibile Low level design. Write modular, extensible, readable and performant codeChoose the right Data Structures, tools and tech stacks and be able to do High Level Designing with guidance. Build, develop, mentor and coach junior team members Collaborate with teams by contributing to the shared vision and working closely with cross-functional stakeholders.What you’ll need:B.Tech or M.Tech or equivalent with at least 3-year of experienceBuild abstractions and contracts with separation of concerns for a larger scope. Extensive programming experience in any one programming language like Java, Ruby, Clojure, Scala,C or C++, SQL etcStrong object-oriented programming skills. Experience with multi-threading and concurrency programmingAbility to work with complex business flows and dealing with huge amounts of data. Prior work experience in an agile environment or continuous integration and continuous delivery (CI or CD) Experience of building robust and scalable web-application is good to have.Open Positions :1Skills Required :Problem solving, Algorithm", "Role": "Software Developer,", "Industry Type": "Internet, Ecommerce,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "M.Tech in Any Specialization", "Doctorate": "None", "Key Skills": ["Java", "continuous integration", "C++", " Ruby", "C", " Clojure", " SQL ", "object-oriented programming ", "concurrency programming", " Scala"]}