{"Job Title": "Hindi Translation - ECommerce - Kolkata", "Company": "Netscribes (India) Private Limited.", "Experience": "0 - 2 years", "Salary": "Not Disclosed", "Location": "Kolkata", "Job Description": "Dear Applicants,Business Description:Netscribes   is a market intelligence and content marketing firm, with delivery   centers in Mumbai, Kolkata and Gurgaon. Our clients are spread across   US, Europe, Asia Pacific and India. We are funded by a US based private   equity fund. More details are available at www.netscribes.com. In 2014,   Netscribes incubated a new business for providing content creation and   process support services for clients in the eCommerce domain.Role description: Language ExpertDesignation: AssociateLocation: KolkataEducation: Graduate*BOTH FRESHERS & EXPERIENCED WITH FIRM GRIP IN HINDI & ENGLISH CAN APPLY**This is an onsite requirement and it will be Work From Home module as of now. People who are in Kolkata & can join immediately are only eligible to apply.*Job Responsibilities:- Read given material and research industry-specific terminology- Convert text and audio recordings from one language to one or more others- Ensure translated content conveys original meaning and tone- Cross-reference specialized dictionaries and translation tools to check quality of translation- Proofread translated texts for grammar, spelling and punctuation accuracyRequired Candidates' Skill Sets:1. Strong communication skills in English2. Must know Hindi (Read/Write/Speak) [ Additional certification in linguistics is a plus  ]3. Excellent proofreading skills with the ability to identify grammar, spelling and  punctuation errors4. Ability to clearly explain linguistic challenges and cultural questions and concepts in English 5. Good working knowledge of MS Office Suite, adept with spreadsheet and logical operators(AND, OR etc)6.Knowledge on e-commerce related jargons7.Commitment to meet deadlines and multitask in a fast paced environmentSalary : 10,800/- (associate), 13,300/- (sr. associate)Interested candidates can forward their resume/CV with current salary(if any) to:monika.barnwal@netscribes.comContact - 8240101432", "Role": "Associate/Senior Associate -(NonTechnical),", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Back Office/Web/Transaction Processing", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["English", "Translation", "Hindi to English", "Hindi Language Expert", "E-commerce", "Hindi Translation", "Hindi", "English to Hindi", "Grammar", "Strong Communication Skills"]}