{"Job Title": "Healthcare/Pharma Recruiter", "Company": "Commutech Associates", "Experience": "0 - 3 years", "Salary": "Not Disclosed", "Location": "Mohali", "Job Description": "  Shift Timings US EST ( 9 AM - 6 PM), India ( 6:00 PM to 3:00 AM )     Job description     HonorVet is looking for a   Healthcare   Recruiters for US Staffing   who is looking for a good challenge to come and join our dynamic team based out of   Mohali     Being part of the Talent Acquisition Team, you would be expected to:      Identify potential candidates based on job requisitions provided by VMS Portals, Tier 1 Client Hiring Managers using Job Boards, Employee Referrals, Placement Ads, Networking, Cold Calling, and External Placement Agencies.   Conduct the initial screening to determine suitability and interest of Candidates and provide the Candidates with information on the position and our company.   Manage and coordinate interviews between Candidates and Hiring Managers   Extends verbal offers of employment to Candidates in consultation with the Hiring Managers and within the guidelines of Company s Compensation policy.   Ensure all proper paperwork and documentation is completed for all Candidates throughout the sourcing process.   Manage and coordinate all communication with Candidates throughout the Recruitment, Selection and Hiring Cycle.   Develop and maintain strong relationships with all stakeholders including Hiring Managers.   Gathering requirements for consultants from Tier - 1 Vendors of clients, Job portals and other networking techniques   Updating and maintaining the database for future requirements, generate daily reports and update them    Qualifications    0 - 4 years of experience in full lifecycle recruiting ( Freshers also welcome)   An expert level of knowledge in all full lifecycle recruiting components including, but not limited to, sourcing, qualifying, networking, assessing, job analysis, relationship management, and due diligence.   Knowledge and past use of a server - based applicant tracking system, preferably Job Diva preferred.   Excellent project management, writing, and oral communication skills are required.   Demonstrated ability to recruit for a broad/deep range of positions.   Demonstrated ability to function/recruit on a national, multi - location level.   Ability to handle sensitive and confidential information appropriately.   Must be Internet savvy and experienced in mining online databases.   Good knowledge of Microsoft Office Suite of applications and the use of email.   Must be consistent in preparing & submitting daily/weekly reports to senior management   Must be able to achieve monthly and annual recruiting targets set by the company     Educational Qualifications    B.Sc Anthropology, Bio - Chemistry, Biology, Botany, Chemistry, Zoology   B.U.M.S Unani Medicine,   Skills Required to recruit for    Well defined Career Path   Technologies such as Artificial Intelligence based recruiting Platform, ATS, Internal Databases, Cloud based Operations ", "Role": "Recruitment Executive,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "HR, Recruitment, Administration, IR,", "Employment Type": "Full Time, Permanent", "Role Category": "HR/ Recruitment / IR", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Cold calling", "Relationship management", "Mining", "Networking", "Talent acquisition", "Pharma", "Project management", "Healthcare", "VMS", "Recruitment"]}