{"Job Title": "Software Development Engineer (Back end)", "Company": "Tesco Bengaluru", "Experience": "1 - 3 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": " The Role    The Software Development Engineering team are responsible for the full software development lifecycle.    They work with Product Managers to help shape the backlog and future direction of the products we build. They implement and test features to a very high quality and support the product or service in testing and live environments.   Our Engineers have industry-leading technical abilities demonstrating breadth and depth of knowledge of engineering best-practices: design design patterns re-usability usability testability version control documentation build deployment and operations.    They are expected to design each piece of the application or system and plan how the pieces will work together producing high quality maintainable and resilient code.   They demonstrate an ability to analyse problems and solve them at their root cause recommending software upgrades for existing applications and systems ensuring that the software continues to function normally through regular use maintenance and testing.   Our Software Development Engineers can pursue 2 distinct career paths as an individual contributor or alternatively a management route.   This role is a part of the Career Framework and the internal job title is Software Development Engineer     Essential Duties and Responsibilities   Whilst specific responsibilities will be dependent upon the changing needs of the Tesco business the following provides an overview of the role s key responsibilities and measures:     Address problems at their route cause and solve problems for the long-term balancing complexity against business value.    Build and deploy solutions to customers for problems of significant scope and complexity.    Contribute to the evolution of our software engineering practices recommending changes in development maintenance and system standards.    Impart knowledge to users customers and other team members.    Build solid working relationships with relevant personnel across Tesco.    Consistently seek out new languages and tools that will help to improve working practices across multiple teams.    Perform code reviews suggesting best practice improvements.    Educate review and help other engineers to grow their capability    Design and build new tools that make the organization more efficient impacting the way the entire organisation operates.    This role will best suit an individual who enjoys working as part of a team is well organised pragmatic and a lateral thinker with an inquisitive mind who is motivated to make change for the better and most importantly puts our customers first.    Key Skills and Experience     We are looking for people who have a passion for Technology.    You will likely have made open source contributions and have a Github account.   You will demonstrate experience of different platforms and technologies.    We expect to see some or all of the following:    Consistently leads delivery of valuable features   Continually looking for process improvements   Proposes new ways of doing things   Suggests novel ways to fulfil requirements   Helps elaborate requirements where necessary Programming   In depth knowledge of IDE language and toolset in Javascript technology.   Strong native JavaScript skills in the server including OO JavaScript NodeJS ES6 Babel   Exposure to GraphQL/ Apollo is advantageous   Exposure to a variety of JavaScript frameworks and libraries: flow JSlint Sinon Mocha   Experience of using Node.js to create high traffic websites using Express.js Sails Koa or similar   Excellent understanding of language framework and a good working knowledge of the abstraction layer underneath   Can profile and optimise code   Can write Secure code by default   Understands advanced HTTP features (Caching appropriate use of verbs)   Experience in full development life cycle; design coding test build QA deployment and maintenance   Exposure to the DevOps model   Experience in Lean and Agile environments and understanding of principles behind methodologies such as: BDD ATDD and TDD   Solid enterprise / commercial development experience   Demonstrable ability to self-manage be proactive take ownership build relationships and drive solutions through from inception to production   Can identify and apply appropriate design patterns to problems.   Comfortable developing large features   Understands Idempotence   Understands boy scout principle. Leaves code in a better state then when arrived   Good understanding of cohesion SOLID and how to apply   Writes clean maintainable code   Understands importance of domain model and can coherently model a problem domain within a given context   Anticipates medium term (3-6 month) vectors of change and designs and abstracts accordingly   Understands appreciates simplicity the value of removing code    Understands design patterns    Understands how to design for performance at all levels   Comfortable evaluating new tools   Can produce POCs to establish usefulness of new tools   Understands when new tools may not be appropriate   Introduces new tools and methodologies when appropriate to simplify or increase efficiency of development   A strong team player with the ability to influence and lead stakeholders when necessary   Leads group discussions on design of particular areas   Comfortable presenting information   Gains buy in from team and drives design   Mentors and develops those around them   Understands domain well enough to work with PM to drive value   Shares knowledge with wider community  ", "Role": "Software Developer,", "Industry Type": "Education, Teaching, Training,", "Functional Area": "IT Software - eCommerce, Internet Technologies,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Business services", "Career development", "github", "Version control", "orchestration", "Coding", "TDD", "Agile", "HTTP", "Open source"]}