{"Job Title": "Voice Process - Accounts Receivable (AR) Callers", "Company": "Access Healthcare.", "Experience": "0 - 4 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "  Job Description     Training will be provided by the company for freshers who are selected for the position     Perform pre-call analysis and check status by calling the payer or using IVR or web portal services     Maintain adequate documentation on the client software to send necessary documentation to insurance companies and maintain a clear audit trail for future reference     Record after-call actions and perform post call analysis for the claim follow-up     Assess and resolve enquiries, requests and complaints through calling to ensure that customer enquiries are resolved at first point of contact     Provide accurate product/ service information to customer, research available documentation including authorization, nursing notes, medical documentation on client's systems, interpret explanation of benefits received etc prior to making the call     Perform analysis of accounts receivable data and understand the reasons for underpayment, days in A/R, top denial reasons, use appropriate codes to be used in documentation of the reasons for denials / underpayments    Job Requirements    To be considered for this position, applicants need to meet the following qualification criteria:     0-4 Years experience in accounts receivable follow-up/denial management for US healthcare customers     Fluent verbal communication abilities (Business English)     Call center expertise is an advantage but not mandatory     Willingness to work continuously in night shifts     Basic working knowledge of computers.     For experienced candidates, knowledge of Denials management, A/R fundamentals, healthcare terminology and ICD/CPT codes will be considered a plus, along with prior experience of working in a medical billing company and use of medical billing software. Access Healthcare will provide training on the client's medical billing software.  ", "Role": "Associate/Senior Associate -(NonTechnical),", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Voice process", "Service management", "Nursing", "Medical billing", "IVR", "Product service", "Healthcare", "Management", "US healthcare", "Accounts receivable"]}