{"Job Title": "Software Development Engineer III", "Company": "Flipkart Internet Private Limited", "Experience": "6 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Roles and ResponsibilitiesAbout the roleFlipkart has defined the eCommerce industry in India and will continue its leadership with its core value of putting “Customer first”. Flipkart is made of people who love being themselves and their independence of thoughts pave way for disruptive innovation in technology, business and operations fronts. You will own a functional area - from product conception to its delivery to customers. You are expected to design and code independently in multiple tech components related to your functional area. You must also develop a deep understanding of non-functional requirements, such as reliability and availability, scale, horizontal scalability, etc., over time and make tech stack decisions accordingly. You are expected to actively mentor junior engineers. You own the codebase quality.We are looking for seasoned engineers who are quality conscious, product thinkers, business cognizant and smart - not mere coders. Engineers get to significantly amplify the impact of their work or creations with the scale that Flipkart operates at. The same scale also demands the engineers to produce super-efficient solutions.What you’ll doOwn a functional area from product conception to deliveryGiven a fuzzy product requirement, work with other stakeholders, product to understand & refine the requirements and change them to tech requirementsPrepare high-level designs under the guidance and document themLow-level design and code independently in multiple tech components related to functional areaChoose the right tech stack for a given situation under guidance from senior team membersOptimise any existing microservicesTake non-functional requirement (Reliability & Availability, Scale, horizontal scalability) into considerations while taking any decisionBuild, develop, mentor and coach junior team membersOwning the quality of code, UT coverage, documentation etcCollaborate with teams by contributing to the shared vision and working closely with cross functional stakeholders.What you’ll needB.Tech or M.Tech equivalent with at least 6-years experienceDeep expertise in at least one programming language & tech stack.Strong object-oriented design skills, ability to apply design patterns, and an uncanny ability to design intuitive module and class-level interfacesExperience in building data-driven web application design and development is a plusGood understanding of multiple tech solutions and ability to pick the correct one for the given situationPrior work experience in an agile environment or continuous integration and continuous delivery (CI or CD)Ability and experience in designing high-level software designs of the scalable system, taking NFR (non-functional requirement) in considerationSkills Required : Programming, Design", "Role": "Software Developer,", "Industry Type": "Retail, Wholesale,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "M.Tech in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["Software Development", "Scalability", "Design Patterns", "Web Application Design", "Web Technologies", "Continuous Integration", "Continuous Delivery", "Business Operations", "Design Skills", "Microservices"]}