{"Job Title": "C++ Developer - Software Development Engineer 1&2", "Company": "HEAL India Private Limited ", "Experience": "2 - 6 years", "Salary": "₹ 6,00,000 - 16,00,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": " Key Deliverables: Participate in development, enhancement, and maintenance of backed engines that uses the following technologies: C++ based high performance engines development.Strong emphasis on data structures and algorithm design Sound programming experience using multi-threading concepts, inter-process communication concepts and thread-safe programming. Knowledge in interfacing with any one database such as MySQL, Oracle & MSSQL. Experience in network card sniffing and network protocols is a plus. Experience in cross platform frameworks and experience in developing in at least two of the following operating systems (1) Windows (2) Linux (3) AIX (4) Solaris Experience in POCO is a Plus Should be willing to participate in all phases of software development life cycle such as design, coding, reviewing, debugging, unit testing, release, and configuration management. Should be self-motivated, willing to work with small teams and coordinate with other product teams. Should be able to independently carry-on tasks with limited supervision.  Requirement: Minimum of 2 years in core software development Product development experience is must.Experience in product development life cycle and product process oriented agile development environment like Scrum is preferred. Proficient in C++, exposure to Poco is plus.Excellent understanding of OS fundamentals, multithreading, algorithms, and data structures. Should have worked on one of the following (Linux, AIX, Solaris, HP-UX, Windows). Working knowledge of Windows and Unix is a plus. Knowledge of networking protocols especially TCP/IP protocol is a plus. Strong debugging skills is highly desirable. Knowledge of debuggers, memory leak detectors, code profilers is a plus. ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "M.Tech in Computers, MS/M.Sc(Science) in Computers", "Doctorate": "Doctorate Not Required", "Key Skills": ["Unix", "Networking Protocols", "Software Development", "C++", "Algorithms", "Multithreading", "Linux", "Data Structures", "Database", "Socket Programming", "POCO"]}