{"Job Title": "Customer Service Executive (Voice Process)", "Company": "Alacrity E-Commerce Solutions Pvt. Ltd.", "Experience": "0 - 5 years", "Salary": "Not Disclosed", "Location": "Nagpur", "Job Description": "Post : Customer Service Executive (Voice Process) Qualification -  No preference Experience -  0 to 7 Years in International Call Center (Voice Process) (Freshers can also apply with good communication) Job Type -  Permanent Job Status -  Full Time Responsible for acting as a liaison between customers and companies. Assists with complaints,  orders,  errors,  account questions,  billing,  cancellations,  and other queries. Key Responsibilities : Resolve customer complaints via phone,  email,  mail,  or social media. Use telephones to reach out to customers and verify account information. Greet customers warmly and ascertain problem or reason for calling. Assist with placement of orders,  refunds,  or exchanges. Advise on company information. Take payment information and other pertinent information such as addresses and phone numbers. Place or cancel orders. Answer questions about warranties or terms of sale. Suggest solutions when a product malfunctions. Handle product recalls. Attempt to persuade customer to reconsider cancellation. Inform customer of deals and promotions. Sell products and services. Utilize computer technology to handle high call volumes. Work with customer service manager to ensure proper customer service is being delivered. Close out or open call records. Compile reports on overall customer satisfaction. Read from scripts. Handle changes in policies or renewals. Key Competencies Verbal and written communication skills,  Listening Skills,  Problem Analysis,  Problem solving Customer service orientation Organizational skills,  Attention to detail Initiative,  Judgment,  Team work. Additional Responsibilities Provide on- the- job training for new employees. \n\nQualification -  No preference \n\nExperience -  0 to 7 Years in International Call Center (Voice Process) (Freshers can also apply with good communication) \n\nJob Type -  Permanent \n\nJob Status -  Full Time \n\nResponsible for acting as a liaison between customers and companies. Assists with complaints,  orders,  errors,  account questions,  billing,  cancellations,  and other queries. \n\nResolve customer complaints via phone,  email,  mail,  or social media. \n\nUse telephones to reach out to customers and verify account information. \n\nGreet customers warmly and ascertain problem or reason for calling. \n\nAssist with placement of orders,  refunds,  or exchanges. \n\nAdvise on company information. \n\nTake payment information and other pertinent information such as addresses and phone numbers. \n\nPlace or cancel orders. \n\nAnswer questions about warranties or terms of sale. \n\nSuggest solutions when a product malfunctions. \n\nHandle product recalls. \n\nAttempt to persuade customer to reconsider cancellation. \n\nInform customer of deals and promotions. \n\nSell products and services. \n\nUtilize computer technology to handle high call volumes. \n\nWork with customer service manager to ensure proper customer service is being delivered. \n\nClose out or open call records. \n\nCompile reports on overall customer satisfaction. \n\nRead from scripts. \n\nHandle changes in policies or renewals. \n\nVerbal and written communication skills,  Listening Skills, ", "Role": "Associate/Senior Associate -(NonTechnical),", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["BPO", "Voice process", "Customer service orientation", "Customer satisfaction", "Social media", "Billing", "Manager Technology", "Customer service", "Customer complaints", "Customer Service Executive"]}