{"Job Title": "Dot Net & Angular 8 Full Stack Developer", "Company": "Version 1", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": " Job Description    You will be working in a Scrum Team of cross-functional skills in tight collaboration practising Agile.    You will be contributing to real decisions about technology to create maintainable solutions for our customer and participating in a highly collaborative group of software engineering professional s. Learning, developing your skills and becoming a rounded Developer in the process.    You will develop software to meet our client's user needs using C#/.Net on the Microsoft Azure Cloud, follow best practice guidelines and help to improve those guidelines.    In addition to C# you will contribute to the Angular development within the project. You will be creating best in class documentation with our client users in mind.     Qualifications     Essential criteria:      Current .Net and C# development experience    Experience developing REST based APIs secured using OIDC    Experience writing unit tests and integration tests Nunit an advantage    Experience in Azure DevOps CI/CD    Experience with modern version of Angular (ideally 8+)    Strong css layout skills Bootstrap 4, modern css layout techniques    Strong TpeScript / JavaScript front-end back-end development experience    Strong Angular unit test skills protractor, karma etc.    Interest in working in Cloud based technologies    Experience with any parts of the Azure stack of services an advantage    Ability to work with and be customer-facing    Confidence to work as part of a Scrum Team    Desire to learn new skills      Preferred criteria:      Work placement or working experience in Software development    Experience developing RESTful services    Experience with Azure ADB2C or AD token based authentication    Customer-facing experience in a professional environment    Experience with Angular 8+    Cloud application or Cloud solutions development experience    Experience of working in a Scrum Team and an Agile environment    Experience in UI    Microsoft Azure Cloud experience   ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["NUnit", "Backend", "Front end", "Talent acquisition", "Cloud", "Javascript", "Agile", "microsoft azure", "Scrum", "Unit testing"]}