{"Job Title": "UI Developer", "Company": "Exela Technologies", "Experience": "3 - 7 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "We are looking for a Front-End Web Developer who is motivated to combine the art of design with the art of programming. Responsibilities will include translation of the UI/UX design wireframes to actual code that will produce visual elements of the application. You will work with the UI/UX designer and bridge the gap between graphical design and technical implementation, taking an active role on both sides and defining how the application looks as well as how it works.Roles and Responsibilities  Support and maintain deployed applications. Innovate by refining, evolving and creating new features to improve the usability and functionality of our front-end applications  Write the programming code, either from scratch or by adapting existing website software and graphics packages to meet business requirements. Follow industry best practices for software development.  Technical documentation relating to design and code.  Communicate status of projects and issues with project manager.  Incorporate a strong portfolio of UI/UX best practices. Hands-on experience with different JavaScript frameworks (Angular 2+, JQuery etc.) Actively contribute to software development that creates a great user brand experience.Solid understanding of web standards and technologies (HTML, XHTML, CSS, XML, JavaScript, AJAX). High proficiency using HTML5 and CSS3 for website design.  Demonstrated experience with cross-browser and cross-platform issues (IE, etc.) Applying creative skills Excellent communication skillsQualification (Education/Skill and Experience for the job; Hands on knowledge of designing and development using HTML5, XHTML, HTML, CSS3, CSS, Responsive Design, Web 2.0 concepts, JQuery UI, JQuery Mobile, JQuery, Ajax & JavaScript, XML, XSLT Should be capable of writing new functions for JavaScript & JQuery An understanding of the fundamentals in Development UI for Mobile First Applications usi", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["UI Development"]}