{"Job Title": "Full Stack Developer", "Company": "OneGreenDiary Software Pvt Ltd", "Experience": "1 - 2 years", "Salary": "₹ 1,75,000 - 5,00,000 P.A. ", "Location": "Pune", "Job Description": "Node Full Stack Developer: Roles and Responsibilities You must have had experience with Node api development to apply for this positionShould have design, build and deploy applications/products Urgent requirements for Full-Stack Node Developer who have strong hold in Front-End Web fundamentals like HTML, JavaScript, and CSS like Sass or LESS, JavaScript frameworks like AngularJS, React, or Ember etc. You will also be require to collaborate across mutli-disciplinary teams such as architecture, business analysis, quality assurance, project management, infrastructure operations and system users.The candidates should be able to create requirements, build use cases, define interfaces and then translate them into technical implementations.Projects will range from prototype application development to customized integration, including portal interfaces, remote access tools, hosted services, reporting, and back-end processes.Being led as a lean start up, the team is engaged in conceptualization, development, successful delivery and adoption support for our customers.As a Full Stack Developer, you will be responsible for the end to end phases of the software development lifecycle including technical research, requirements analysis, high level and technical design, improving user experience, shaping the face of our new products, building internal tools, implementation of enhancements to the product, unit testing, debugging, and maintenance.Should be hands-on working experience with MySQL, and a good working knowledge of SQL.", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "MCA in Computers, CS in Any Specialization, MS/M.Sc(Science) in Computers", "Doctorate": "None", "Key Skills": ["Angularjs", "CSS", "Front End", "Use Cases", "Web Technologies", "MySQL", "HTML", "Node.Js", "Grunt", "Javascript Frameworks"]}