{"Job Title": "LEAD SOFTWARE DEVELOPMENT ENGINEER", "Company": "McAfee Software (India) Pvt. Ltd", "Experience": "4 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "           You will report to the Sr. Engineering Manager in India. The Engineer will work on building solutions that protects millions of customer devices. You will mentor other developers, perform code reviews and take up all the development work of key modules.         Lead research and development of nextgeneration applications supporting millions of users across security, privacy, identity, transactions and data.   Analyze requirements and lead the design, architecture, and implementation of highly scalable and flexible web applications using modern latest and greatest technologies.   Work with Architects to create end-to-end cloud solution, ensuring high scalability, availability, performance and cost optimization.   Discover opportunities to create standardized solutions across partners, improve processes, inculcate best engineering practices.   Conduct FMEA, create defenses against potential failures, instill monitoring and alerting mechanisms.   Assess technical feasibility of by building rapid POCs, find technological solutions for gaps, and create strategic IP.   Experiment with new technologies, promote adoption, implement a long-term technology vision for the team.   Troubleshoot customer issues and work with appropriate developers, product teams on issue resolution on end-to-end basis.         About You:    7 years of solid experience in designing and development of native Cloud based software solutions, with a deep focus on usability, performance and integration with downstream REST Web services.   Solid coding skills using .NET core, Python and Go programming languages with the ability to guide teams through massive refactoring exercise and improve coding standards across large code bases.   You have expert-level experience in high-caliber web scale and real-time response systems.   You have experience designing and scaling solutions with Amazon Web Services (AWS).   You have experience working with NoSQL DBs and knowledge to choose an appropriate one for a use case.   Exposure to Micro-services Architecture for cloud components and its pros and cons is a bonus.   Excellent Mentoring skills Be the technical mentor to the engineering team.   Build partnerships with, both oral and written, all parties, including Dev and QA teams, Program/Product managers, Technical Publications and other Project Partners.        ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["NoSQL", "Web services", "Lead Software", "Coding", "Diversity and Inclusion", "Cloud", "Issue resolution", "Monitoring", "Downstream", "Python"]}