{"Job Title": "Senior Apex Developer", "Company": "Version 1", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": " Job Description    Working as part of a team of managed services consultants, the primary role will be the technical support of Apex applications that integrate with Oracle e-Business Suite applications across a wide range of clients.    Daily tasks include:     Provide day-to-day support and quality assurance   Provide hands-on technical development support for Apex Applications   Gather and document business requirements on IT incidents and change work.   Document and manage technical specifications and software packages   Assist in defining and optimizing simple yet effective business processes and drive change within the organization through negotiation and consensus-building   Help ensure that ERP initiatives follow the proper planning, scheduling and management processes   Manage on-time changes delivery and business expectations and ensure internal customer satisfaction   Provide hands on analysis, design, testing, implementation and post implementation support utilizing prescribed software design lifecycle techniques and system documentation techniques (AIMSOUM)   Complete development tasks based on requirements submitted by business partners and best practices     Qualifications     Deep Experience in front end application design and development using Oracle Application Express    Experience on Applications integrating Oracle Apex with Oracle E-Business Suite, including interfaces on EBS with data coming from Oracle Apex.    Knowledge of Oracle E-Business Suite R11i12 ideal with technical knowledge of core Oracle EBS Modules including Financials, Projects and HR modules.    Knowledge of Data Warehousing architecture and design.    Knowledge of Oracle development tools, some e-Business application functionality, system administration, database structure.    Technical requirements: APEX, SQL, PLSQL, Unix Script, XML Publisher Java core skills    Must have good experience translating business requirements and design into technical solutions    ITIL process Knowledge    Ability to research, learn, troubleshoot and support complex system customisations    Willingness to operate and progress in areas that are outside of previous experience    Ability to multi-task and prioritise across concurrent workload may be required.    Excellent written and verbal communication   ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Unix", "IT services", "ERP", "Software design", "Front end", "XML", "Customer service", "microsoft", "Technical support", "System administration"]}