{"Job Title": "Frontend Developer (with React)", "Company": "Version 1", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": " Job Description   We are looking for a talented Front End / UI Developer to join our Development team who is highly motivated in combining the art of design within the art of programming. In joining our team of consultants, you will play a key part in the continual research, design and development of our clients core products. We are looking for someone who is motivated by emerging technologies and has a passion to drive technology transformation. The successful candidate should be hands on, able to contribute individually and should have experience with in a fast pace dynamic environment.    Responsibilities     Experience working closely with key stakeholders across the engineering team, including Architects, Product Owners and UX designers understanding and demonstrating how written requirements translate into a technical solution     Develop interfaces for web and mobile applications Develop high quality, efficient, reusable code and libraries for future use     Follow the agile development methodologies and practices     Exchange information and ideas with the team, evolve and model the new user-facing features     Constantly improve the products, through feedback and input on the product pipeline and roadmap    Qualifications    Requirements     3+ Years Front End Development experience     Experience working in an Agile development environment     Excellent communication skills both written and verbal     Strong JavaScript, HTML5 & CSS skills.     Experience building user interfaces with   React      Experience with CSS pre-processing tools such as Sass     Experience unit testing (with Jest is a bonus)     Experience with git source code control, code review tools, etc.    Additional Information   Version 1 Talent Acquisition Team ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["CSS", "GIT", "Front end", "Web technologies", "Talent acquisition", "html5", "Agile development", "Javascript", "Unit testing", "Mobile applications"]}