{"Job Title": "AEM Developer", "Company": "innoraft", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Kolkata, Ahmedabad, Jaipur, Bangalore/Bengaluru", "Job Description": "  Responsibilities:     Design and code from specifications, analyzes, evaluates, tests, debugs, documents, and implements complex web application using Adobe AEM.     Create and integrate content-driven applications on Adobe AEM core platform and search engines.     Asset Management (DAM) implementation, object model design (Java APIs), implementation, and unit testing.     Server setup, AEM installation, and deployment.      Experience with migrating large content from a CMS into Adobe AEM.      Translates business requirements into technical details relevant to Adobe AEM.     Resolve user-identified functional and technical issues relating to Adobe AEM.     Responsible for overall development and code quality. Service in release deployment support.     Prepare UML domain and sequence diagrams.     Partner with the data services team on web service API.     Work with testers to provide an overview of the solution and help them with data management.     Required:     3+ experience of Adobe AEM.     Must be AEM Certified.     Must have good experience in Adobe AEM 6.2. (Adobe CQ5 (AEM) version 5.3 or above)     HTL and how to use HTL Use-API to access Java classes inside components     Deployment of code in AEM     Doing builds with Maven and knowledge of how to configure Maven and its plugins     Java development especially focusing on OSGi components and services (including annotations) for JCR specific use cases (eventing, scheduling, servlets)     Good understanding of AEM specific APIs (JCR APIs, etc)     How CRX works (nodes, structure, permissions, how to store items) and how to access values configured in the component dialogs in HTL/JSP     How Sling works rendering the pages/paths based on node configuration along with RESTful Web service application with Sling     Dialog configuration using Granite components     AEM core architecture understanding (author, publisher, dispatcher)     Knowledge of replication     Using main AEM consoles like authoring environment, CRX DE, Package Manager, Users Administration Area, Assets Area, OSGi consoles      Ability to write clean, modular, reusable code (using design patterns) and experience with unit-test driven approach to development     Advanced knowledge of responsive (and/or adaptive) techniques and frameworks     Good to have:     Knowledge of Migration from other Applications to AEM or how Migration works with AEM     Integration of Bootstrap with AEM, Knowledge of Jquery, HTML, CSS, and AJAX     Experience working in a DevOps environment for AEM     Knowledge of AEM 6.5 and how to upgrade the application to the latest version  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Maven", "jQuery", "UML", "JSP", "CMS", "HTML", "Unit testing", "Open source", "Adobe", "Ajax"]}