{"Job Title": "Sr. Quality Engineer", "Company": "ELLIE MAE INDIA PRIVATE LIMITED", "Experience": "6 - 10 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "Roles and ResponsibilitiesThe Senior QA Engineer interfaces with the product team, working to understand the products key functionality and technical requirements, providing quality controls in accordance with industry and company best-practices. The Senior QA Engineer works closely with Developers, QA and other project team members to analyze test results, locate problems, identify root causes and develop solutions. Documents clear and detailed defect reports including steps to reproduce actual and expected results.Primary Duties and Responsibilities Executes, updates and maintains existing test frameworks, solutions and test scriptsProduces clear and meaningful automated reports to provide test results for each executionCollaborates with other team members to continuously refactor and improve test scripts, test plans and automation framework for reusability and speed.Train and mentor the manual test team to execute and update automated regression suitesDocuments clear and detailed defect reports including steps to reproduce actual and expected resultsIs proactive in following up with Developers, DevOps, etc. on open defectsDevelop/Enhance complex data driven Automation framework to support product and API testingFamiliar with using source control software, bug reporting software and Virtual MachinesDevelop/Enhance complex data driven Automation framework to support both UI and API testing.Collaborates with Automation team from each of the product, successfully rollout updated version of the Automation framework.Qualifications, Experience & Skills Computer Science Degree or equivalent6 to 10 year of experience in Quality Engineering3+ years’ uninterrupted experience developing Automation Framework in Java with Selenium WebDriver, TestNG/JUnit for web based applications and API/WebServices.1+ year of experience testing with application using AngularJS, knowledge of Protractor, SOAP, REST web services testing.Demonstrated knowledge of the Software Development Lifecycle (SDLC) and Agile development process.Ability to effectively communicate relevant project information with coworkers, peers, and management through written and verbal communication;Ability to communicate and effectively collaborate with internal departments and other outside parties in a professional manner.Experience with Amazon WebServices, Azure, or any Cloud platform is desirable.", "Role": "Testing Engineer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - QA & Testing,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Sc in Computers, BCA in Computers, B.Tech/B.E. in Computers", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["QA", "Selenium Webdriver", "Web Services Testing", "Testng", "API Testing", "Automation Framework", "Protractor", "Manual Testing", "Test Scripts", "Bug Reporting"]}