{"Job Title": "Senior Full Stack Developer", "Company": "CELEGENCE", "Experience": "10 - 12 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   Roles & Responsibilities      Develop applications using React/Node.js/MySQL with web sockets/AJAX   Help advise on the technology stack (end to end)   Work within a fast paced Agile/Scrum methodology   Use SOAP and REST to implement API integrations with other SaaS platforms   Experience in enterprise architecture, designing concepts, exposure to different design patterns for UI, Persistence and development of solution   Experience with Document Management Solutions like Box with good understanding of its APIs    Education & Experience    6+ years of experience in Node.js, MySQL and AWS, 4+ years in React.js   js with Express, MySQL and MongoDB, Passport   Microservice Architecture understanding and hands-on implementation   Hands-on development experience building 3rd party applications using Box.com e.g. Content Management APIs, Custom APIs, User and Groups security and collaboration, Search, etc.   Strong proficiency in JavaScript, including DOM manipulation and the JavaScript object model   Experience with popular React.js workflows (such as Flux or Redux)   Familiarity with RESTful APIs   Knowledge of modern authorization mechanisms   Familiarity with modern front-end build pipelines and tools   Experience with common front-end development tools such as Babel, Webpack, NPM, etc.   Ability to understand business requirements and translate them into technical requirements   Working knowledge of containerization   Basic knowledge on Kubernetes   Knowledge on any NOSQL database Skills   Database Schema Design and development   Hands on skills with Database Stored Procedures, Views, Database Security    Skills and Competencies    Possess strong verbal and written communications skills   Ability to influence others & problem resolving skills  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Content management", "Front end", "DOM", "Enterprise architecture", "MySQL", "Consulting", "Schema", "Javascript", "Stored procedures", "Ajax"]}