{"Job Title": "Azure . NET Integrations Developer", "Company": "Version 1", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": " Job Description   Version 1 are one of Europe s fastest growing IT Solution Providers who partner with some of the leading technology platforms to deliver market leading and tailored solutions to our customers. We have an opportunity for a driven, talented and passionate .Net Developer, with strong experience of Microsoft s Azure Platform, to join our London based customer who are going through a large scale digital transformation and streamlining of their applications. As part of the Development team you will have the opportunity to take ownership and lead the drive in delivering these high-profile business solutions. You will be responsible for using an API centric approach to build a platform to service a customer base of both internal and external customers. Working within a SCRUM team of analysts, developers and testers you will be taking the solutions through their full development lifecycle and will be working closely with the business. If you are a passionate Developer who likes to partner with various business units to deliver exciting, business enhancing solutions then this role is for you.    Responsibilities      Designing and developing lightweight, distributed components using modern leading-edge technologies     Bringing your experience as a full-stack developer to produce these businesses enhancing applications and software     Promoting and contributing to a continuous improvement model through continuous integration and delivery pipelines     Participating in SCRUM practices and ceremonies to ensure early value is being delivered to users    Qualifications   The key skills and experience you will bring to this role include:    Strong experience of the Microsoft Azure platform, particularly PaaS components     Strong .NET Development experience     Experienced in JavaScript, JQuery, HTML, CSS     Knowledge/understanding of serverless computing     Exposure to an Agile Development Methodology would be beneficial     Other desirable skills include:     Apigee development experience     Experience of both relational and NoSQL databases     Experience with Powershell     Continuous Integration experience, Atlassian Suite knowledge (Jira in particular)     Testing approaches such as TDD and BDD, the Spock testing framework preferable     Git     Dev Ops (Jenkins, VSTS)     Angular  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["IT services", "jQuery", "Talent acquisition", "Javascript", "HTML", "Scrum", "Customer service", "Oracle", "JIRA", "Business solutions"]}