{"Job Title": "Software Development Engineer In Test (SDET) : Cloud", "Company": "Cohesity", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   Responsibilities:       Own product areas and lead the test effort focussed in storage, data path, file system Cloud components.      Work with the engineering team during the feature design and implementation phases to develop:     The test methodology (designing the test approach) to test the feature end-to-end.     Test plans.       Collaborate with other testing members, developers, technical writers, and customer solutions engineers to ensure the company delivers high quality products to our customers.     Execute multiple iterations of the test plan by running manual and automated test cases.     Analyze failures and root cause issues, file defects, follow up with developers, documentation and other teams on the resolution.     Automate test cases.     Monitor and manage the continuous integration environment.      Requirements:      Have a high bar for quality of the product.     Creative, independent, self-motivated and willing to learn new technology.     Possess good understanding of QA methodologies and processes.     Strong test planning ability with understanding of enterprise storage workflows.     Ability to take up variety of roles in a startup environment.     Excellent troubleshooting abilities spanning multiple software and hardware components (such as switches, storage systems, kernels).     Good knowledge of storage stack, file system internals and testing tools like fio, fsct, vdbench, dd, specFs etc.     Strong knowledge of one or more storage protocols like NFS, iSCSI, CIFS, SMB, S3.     Prior experience of testing storage filers using NFS/SMB/CIFS/S3 is big plus.     Experience with distributed systems (databases, storage, map-reduce frameworks, etc.).     Good understanding of storage performance characteristics.     Prior work experience in testing enterprise storage products is a must.     Prior experience of programming, preferably in Go, Python, bash.     Knowledge of ESXi, HyperV, KVM is a plus.        Qualification:        BE B.Tech in Computer Science with 5 yr experience or MS in Computer Science with 5 yr experience     2 years experience with testing Enterprise storage systems.    ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "KVM", "Data management", "ISCSI", "Testing tools", "Test planning", "Test cases", "Troubleshooting", "Distribution system", "Python"]}