{"Job Title": "Senior Developer Advocate", "Company": "Freshdesk", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "    Key Responsibilities:    Expand the community of Freshworks developers through online and offline engagement.   Advocate our platform and identify and activate new avenues where developers can apply them.   Mentor and coach Advocates on the team, leading by example.   Keep abreast of technology trends that will influence the developer community and demonstrate how the platform can keep up.   Aspire to continuously improve our developer experience by bringing back feedback for the engineering team to incorporate.   Setup and nurture the practices that will develop an engaged community around the Freshworks Developer Platform.    Basic Qualifications    Bachelor s Degree with an emphasis in technology   At least 2 years of professional full-stack development experience   At least 3 years of relevant Developer Advocacy experience   Excellent written and verbal communication skills   A track record of public speaking and/or public writing   Organizational talent to plan and execute successful developer events such as meetups, hackathons, and webinars    Preferred Qualifications    Curiosity towards technology, trends in computing and emerging frameworks   Innate problem-solving skills that bring to bear elegant, simple solutions to complex problems   Experience preparing and publishing technical blog posts or tutorials   Empathy for developers that emerges from personal experience and a connect for fellow coders   A track record of building interesting hacks and personal projects (ideally, visible publicly on platforms like github)  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Other,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["SAN", "github", "Publishing", "GIT", "Machine learning", "Customer support", "Natural language processing", "Customer engagement", "cisco", "CRM"]}