{"Job Title": "SOFTWARE DEVELOPMENT ENGINEER", "Company": "McAfee Software (India) Pvt. Ltd", "Experience": "6 - 11 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "    Role Overview:       McAfee is hiring for people with expertise in C++ development on Windows platform:    About the Role :       As a software engineer, you will be working on developing next-generation Windows security solutions.       Your contribution will be crucial to the success of our strategic mission to build industry-leading products that give the most consistent, reliable and effective security experience to our customers.      You ll collaborate with senior engineers, software architects, quality engineers, product managers and other stakeholders to design and build innovative solutions to modern endpoint security problems.      This role is an opportunity to join and influence a new major Programme to build innovative, integrated products that are based on next-generation technology and leading thinking in the security industry.      You will be working as part of a strong local software development team as well as with engineering teams across the globe.         About You :         6+Years of Development Experience.     You can work directly with the Win32 API and/or the native API.   You understand Windows architecture and internals.   You are experienced with Modern C++ (11/14/17) language features and Standard Library.   You have experience with Object-Oriented Programming    and   Generic Programming.   You use development tools like Visual Studio 2019 and WinDbg.   Additionally, you will have excellent communication skills, a strong business acumen, and the ability to work within a large, matrixed organization. The ability to listen, adapt and influence is essential. TheAn understanding of cybersecurity industry and experience in the engineering of cybersecurity products is highly desirable but not essential.    ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Win32", "C++", "endpoint security", "Architecture", "Diversity and Inclusion", "Windows", "Visual Studio", "WindBG", "Object oriented programming"]}