{"Job Title": "WordPress Developer", "Company": "QX LTD", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Noida, Mumbai, Ahmedabad, Vadodara", "Job Description": "    We are seeking a WordPress Developerwho will work with Sr. WordPress Developer and will be responsible to support the Development team with both back-end and front-end development, including creating WordPress themes and plugins.   This position requires a combination of programming skills (namely WordPress, PHP, HTML5, CSS3, and JavaScript) and aesthetics (understanding element arrangements on the screen, the color and font choices, and so on). The candidate should have a strong understanding of industry trends and content management software.   Experience with the responsive and adaptive design is strongly preferred. Also, an understanding of the entire web development process, including design, development, and deployment is preferred.     Responsibilities:      Setup, install and configure WordPress CMS & Plugins     Strong HTML Skills for PSD to HTML conversion     WordPress Customization including HTML to WordPress Conversion with all Functionality     Designing and implementing new features and functionality custom Plugin and Themes     Work with MySQL, FTP, SMTP, HTTPS Setup     Manage Linux/WindowsServer     Manage all technical aspects of the WordPress CMS     Develop Clean, fast and mobile friendly website     Experience with WordPress Multisite (Multi-Geography, Multi-Language)     Add Content from admin side as per requirement      Required Candidate Profile:      Minimum 3+Years experience as WordPress Developer      Expert level experience and understanding of      PSD to HTML to WordPress     Front-end technologies, including HTML5, CSS3, Core PHP, JavaScript, jQuery, Bootstrap     CSS changes and their effects to ensure consistent style across platforms and browsers     WordPress and CMS technologies.     Comfortable working with debugging tools like Firebug, Chrome inspector, etc.     Knowledge of how to interact with RESTful APIs and formats (JSON, XML).     Proficient understanding of code versioning tools such as GIT.     Strong understanding of PHP back-end development.     Strong knowledge of MySQL database.   ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["jQuery", "Linux", "XML", "MySQL", "Wordpress", "Web development", "Debugging", "Javascript", "PHP", "HTML"]}