{"Job Title": "Business Development Manager", "Company": "J K Computers", "Experience": "1 - 4 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": "  Improve an organization s market position and achieve financial growth.    Select strategic goals, build key customer relationships, identifies business opportunities, negotiates and closes business deals and maintains extensive knowledge of current market conditions.    Need to find potential new customers, by networking, cold calling, advertising or other means.    Set up meetings between client decision makers and company s products and services.    Forecast sales targets and ensure they are met.    Supervise new business plans and ensure effective implementation.    Administers new markets and identify requirement for prospective markets and develop new products and services.    Develop proposals and identify proposal requirement.    Analyze potential client requirement and develop new products and services for new and prospective customer.    Monitor competitor business and assist to increase revenue for processes.    Assemble all presentation materials and maintain all business development materials.    Analyze business requirements and develop long term and short term strategies    Delivering presentations of the company products at conferences, customer sites and exhibitions.    Involved in Commercial Negotiation and closing down sales.    Researching actively for potential clients.    Following up customers continuously and responding to customers enquiries.     MinimumSkillsrequired     Graduate/PG (MBA) with an experience of 1-4 yrs. in sales    Fresher can also apply    Positive thinker and committed with goals    Mature attitude with a capability to discuss business issues    Self-starter along with target driven    well versed with MS office, Outlook     Job Summary      Location    :   Mumbai       Department:   IT   ", "Role": "Sales Executive/Officer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "Sales, Retail, Business Development,", "Employment Type": "Full Time, Permanent", "Role Category": "Institutional Sales", "UG": "Any Graduate in Any Specialization", "PG": "MBA/PGDM in Marketing", "Doctorate": "None", "Key Skills": ["Cold calling", "Supervisor", "Sales", "Networking", "Finance", "Research", "MS Office", "Forecasting", "Advertising", "Monitoring"]}