{"Job Title": "SOFTWARE DEVELOPMENT ENGINEER", "Company": "McAfee Software (India) Pvt. Ltd", "Experience": "7 - 12 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "    Role Overview:       The responsibilities for this role involve design, development and testing of features of BPS (Business Platform Services), which is the base platform for MVISION ePO (ePolicy Orchestrator)    About the Role :     Define, design, implement and deliver on various features   Ability to research and stay up to date on various cutting edge technologies and be able to choose appropriate technologies by creating prototypes   Excellent communication skills, ability to make and influence decisions, and drive open discussions to a closure   Must excel in both individual and group settings   Analyze customer requirements, propose and design product features.   Own independent modules (Design, develop, test, integrate)   You will analyze impact of code changes in existing systems   Provides technical direction for Application subsystem, research, design, analysis, testing, process improvement, and troubleshooting.    Reviews code and guide SEs   You will help in setting new processes for new type of work   You will estimate the work and provide ETA   You will identify automation opportunities and automate manual tasks       About You :     7-12 years of relevant work experience in developing and delivering software using Agile models.   You should have expert knowledge in .NET 4.7, C#, ASP.NET   Deep knowledge in XML, LINQ, Multithreading, Asynchronous, Parallel Programming   Extensive Hands-on experience in ASP.NET MVC 3, Web API, WCF, and JavaScript   Experience using UI frameworks such as AngularJS is a plus   Sound knowledge of TSQL (SQL Server 201X)   Experince in AWS , Microsoft Azure etc. will be a plus   Knowledge of Agile Methodologies, such as SCRUM is required   Proven track record of delivering high quality, scalable software with a cohesive user experience   Should have strong architectural, design, programming, debugging experience, and excellent problem solving skills.   Have expertise in development processes such as unit testing, static analysis, secure coding, and continuous integration.   Demonstrated ability to work effectively both within a team and cross-group to drive identification and resolution of issues to ship under tight deadlines along with being able to drive features into the product   You should be experienced in conducting code reviews and help improve quality through early detection   Experience in analyzing requirements, able to understand impact on existing systems and come up with an all-encompassing solution, independently   Good written and verbal communications skills and must be a strong team player   Good understanding of coding best practices and standards   Able to document user stories/use cases, functional specification and design clearly    ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Automation", "Multithreading", "Coding", "XML", "Debugging", "Javascript", "Agile", "WCF", "Troubleshooting", "SQL"]}