{"Job Title": "SOFTWARE DEVELOPMENT ENGINEER", "Company": "McAfee Software (India) Pvt. Ltd", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   Role Overview:       McAfee is seeking talented individuals to join the McAfee Labs engineering team in Bangalore. The team is responsible for core software components incorporated into many of McAfee s products. The opportunity is to join this team developing Anti-Malware detection technologies in C++.      About the Role:       McAfee are looking for experienced individuals to join the McAfee FTE engineering team in Bangalore. The team oversees software components incorporated into many of McAfees products. The opportunity is to join this team developing Anti-Malware detection technologies in C++.    You will   work as a software developer as part of an agile team distributed across multiple geographies.       About You:    You have excellent C++ knowledge with recent C++ development experience.   You have experience of development across Windows desktop and server platforms.   You have experience in agile   development and design   patterns.   You have an in-depth knowledge of Windows Internals.   Knowledge/use of source control systems and defect tracking systems.   Experience of crash dump analysis.   Experience of kernel development.   Experience of agile development processes.   Experience using a unit test framework   Experience within a defined software development process.   Experience of multi-thread development.   Experience in the software security sector. ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["C++", "windows internals", "Defect tracking", "Diversity and Inclusion", "Agile development", "Team development", "Cloud", "Unit testing"]}