{"Job Title": "SOFTWARE DEVELOPMENT ENGINEER", "Company": "McAfee Software (India) Pvt. Ltd", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   Role Overview:       We are looking to hire Software Development Engineer for our Enterprise Endpoint Engineering Organization based out of McAfee India Center, Bangalore.     About Role      Experience developing/shipping high-quality, scalable software on Windows platforms Have programming, debugging experience,.     Knowledge of debugging using tools like windbg.     Expertise in C++, C, Win32 API ,Multithreading, IPC, System Programming,      Memory management and understanding of basic CS concepts is must.     Experience on writing Unit Tests.     Knowledge of Windows internals. Exposure to Kernel level will be an added plus Good Knowledge on installers like Install Shield Familiar with Test-driven Development concepts.     Experience both within a team and cross-group to promote identification and resolution of issues to ship along with being able to promote features into the product. Exposure to Scripting language like    Perl    / Python / Ruby would be desirable.      Must be with a passion for and commitment to software quality  .       About You     5+ years of experience   doing code review, defect analysis, writing test tools and identifying automation opportunities      Excellent experience driving quality projects like coding guidelines, best practices within the development teams.     Must be with a passion for and commitment to software quality.     Have architectural, design, programming, and debugging experience.     Experience delivering high-quality, scalable software with a cohesive user experience.     Have good knowledge of Continuous development methodology and experience delivering software using CD principles.     Expertise on Microsoft Windows operating systems.     Manage work to    critical   project timelines with minimal or no management  .   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Automation", "C++", "Multithreading", "Coding", "Architectural design", "Debugging", "Perl", "software quality", "Ruby", "Python"]}