{"Job Title": "NON Voice - Chat Support Associate / ECommerce / Sal upto 25k", "Company": "Black and White Business Solutions Pvt Ltd  ", "Experience": "0 - 4 years", "Salary": "₹ 2,00,000 - 3,25,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": " Dear Candidate's,Greeting from Black and White Business Solutions Pvt Ltd !! WE'RE Hiring Freshers !! Any Graduate OR Undergraduates OR drop outHiring For Non - Voice - Chat Support / Email SupportHiring Freshers for Domestic BPO / US Healthcare / Customer Support - Voice & Non-voice* DAY SHIFT / US SHIFT *EXCELLENT GROWTH AND LEARNING OPPORTUNITIES FOR CANDIDATES WHO TAKE  INITIATIVE. AMONGST THE FASTEST PROMOTIONS IN THE INDUSTRY FOR HIGH  PERFORMERS Interface with Customers via Inbound or Outbound calls over the  Internet for the purpose of passively assisting the customers.Contact : HR Lakshmi - 9035004325Email - hr4325@blackwhite.inRoles and Responsibilities Greet Customers in a courteous, friendly,  and professional manner using agreed upon procedures.Clarify Customer requirements; probe for and confirm understanding of requirements or problem.Support Customers across Telecommunication, Financial Services & Healthcare vertical.Conduct  needs-based selling by using non-scripted probing techniques to determine Customer needs and to offer the most appropriate product or  service to address their needs. Candidate ProfileAny Graduate  Fresher OR Under-Graduate / drop out.Excellent verbal and written communication skills.Flexible with 24/7 Environment.Salary up to 30K & attractive Incentives amount.To provide best in class Customer support to customers over Voice.Take end to end ownership of customer issues reported.Research, diagnose and identify solutions to resolve customer issues..Document  solutions in the form of knowledge base, notes and Articles and help  build a robust knowledge base which can be referred in the future.Desired Candidate Profile Fresher or Experienced. Prefer Minimum 6 months of experience in International Customer support Inbound / Outbound VoiceGraduate & under Grads freshers or experienced can applyExcellent in Verbal EnglishWilling to work in Night ShiftsKnowledge on PC, Excel & Good Typing. Venue : Black and White Business Solutions Pvt Ltd, #721, 2nd Floor, CMH Road Indiranagar Bangalore-560038 Land Mark: CMH Bus-stop or KFC Bus-stop. Contact : HR Lakshmi - 9035004325Email - hr4325@blackwhite.inRegards, Lakshmi", "Role": "Associate/Senior Associate -(NonTechnical),", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Non Voice Process", "Customer Service Associate", "Process Associate", "BPO", "CSR", "CSE", "Customer Support Associate", "Customer Care", "Associate", "Sr Associate", "CSO", "International", "International BPO"]}