{"Job Title": "Work From Home-customer Care Executive-day Shift - Salary Upto 4lac\n", "Company": "Job Shop    ", "Experience": "0 - 5 years", "Salary": "₹ 2,00,000 - 4,50,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": " Looking for Day shift ?5 Day's Working- BPO is hiring for CSR | Salary 25k |Call Job Shop - 7406026000Job descriptionWe are looking for prospects with a blend of excellent communication skills and technical background .An opportunity to work in a voice technical customer support process to troubleshoot hardware and basic software issues.The position may also require to carry out challenging roles & responsibilities based on business requirement.Skills Required:Excellent communication skillsLanguages required: English & HindiExcellent command over the languageWhat we Provide:- Laptop- Job in Top MNC- Fixed Day Shift ( 9:30am to 6:30pm-5 Day's Work- with Sunday Fixed Off & 1 weekly Rotational Off- General day shift- Telephonic Interview- Immediate Joining- Salary upto 25k Take home plus 5k incentivesSalary:up to Rs. 3.20 LPAQualification:Both Graduates and Undergraduates can applyExperience:6 months international bpo experience mandatoryCall Job Shop - 7406026000************ ************* ******************** ************HIRING FOR E-COMMERCE COMPANY FOR INTERNATIONAL VOICE SUPPORTFor voice positions one must have excellent communication skills, average computer skills, and the ability to solve the customer's queries quickly. For this they are also required to have good listening skills and having a eaccent will only help. Having a neutral accent is nothing but having a clear voice without any influences from the mother tongue that you may have.Almost all international BPO jobs for voice process will have night shifts. instanceThere is always a monitoring process wherein your calls will be monitored for determining your productivity.Handling customer queries and solving them effectively.Good career growth.Communication Skills should be Excellent to get hired in Leading BPOQualification Mandatory : 12th /Graduates (freshers and upto 2yrs are welcomed)Working days :5 days working 2 days rotational off and it is rotational shiftPERKS :Will receive upto 4k incentives +Client incentives2 Way CABS will be given for free of costwork location :MarathahalliJob Role BPO/Customer Support ExecutiveSub Roles Incoming, Outgoing, Domestic, International, Voice, SupportExperience required 1 - 5 yearsJob Type Full TimeJobs Skilled in MS Excel RequiredLanguages known Fluent EnglishAge Criteria :18 upto 31yrs (cut off)Should also carry all previous documents like relieving letter ,salary slips and offer letter Documents required Proof of Aadhaar Card,Driving License,Voter ID Card Education 12th CERTIFICATE ORIGINAL Mandatoryany one who matches the above criteria kindly Cal 7406026000******** ************ ******** *********** ********Inside Sales Specialist For Nobroker.com ( Work From Home)Job descriptionJOB SUMMARY:( Minimum 6 month experience in BPO Sector is mandatory)The employee will be responsible for providing assistance to our customers who are interested in availing rented properties. Hence the employee has to coordinate with buyers and Sellers. The agent needs to maintain utmost professionalism while interacting with both team . Should be able to convince the customers to afford the membership cardsRESPONSIBILITIES:Provide clarity on quotes and negotiate on the same.Follow up on open leads till confirmation is received from the customer.Coordinate with internal teams and vendors for closing the issue at the earliest.Meet call/email quality standards.Ensure details are shared with the customer with regards to quotes.REQUIRED KNOWLEDGE, SKILLS AND BENEFITS:Graduate MandatoryGood English (At least 50% verbal communication skills in Hindi, & Other regional Languages.Good at comprehending situations and coming up with acceptable solutions.Day shift,6 days working ,package up to 4 lakhs (Including variables) Free food(veg&Non veg supreme quality) yearly 4 times salary hike (for performers) 2 times designation.Call Job Shop - 7406026000*********** ************ ************", "Role": "Associate/Senior Associate -(NonTechnical),", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Graduation Not Required", "Doctorate": "None", "Key Skills": ["Communication Skills", "Customer Support", "CSR", "Sales", "Calling", "Voice Process", "International Voice", "Verbal Communication", "Voice Support", "International BPO"]}