{"Job Title": "Hiring For International Voice Process - All Interview With HR Ginu", "Company": "Job Shop    ", "Experience": "0 - 5 years", "Salary": "₹ 3,00,000 - 4,25,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": "Please call Ginu at 6360842673 and talk to our Carrier Negotiator for more details on the Job and other opportunities. If I do not respond to your calls, drop me a WhatsApp message with your name, number, resume and Voice note.AddressNo 92,  Mosque Road, Frazer TownPulikeshi Nagar,Bangalore - 560005Above - More supermarketMap Url - tinyurl.com/y4s25cw5 ( Copy and paste the link to the browser for location and walkin )Roles and Responsibilities      *   Responding to and resolving customer queries via call.     * Handling customer queries via call.     * Freshers and candidates with prior relevant (BPO) and non-relevant (other   domain) experience are eligible to apply     * Master graduate candidates must have a minimum of 1-year work experience   in the BPO sector     * Good command over written and verbal English is mandatory     *   Voice/Inbound  A CSA in this role deals with a number of incoming calls   pertaining to the clients business. The associate provides excellent   customer service and gives precise information to the customer ensuring   customer satisfaction.     * Take a high volume of inbound Customer calls with a friendly and positive   voice, gives precise and correct information about the query to the customer   and works towards meeting the daily targets.     * Resolve Customer problems in a timely manner     *Take Ownership & Deliver on Customer commitments     * Professional Focus - demonstrates a high level of personal and   professional integrity when dealing with Customers. Treats all customers with   empathy and respect and consideration.  * Ability to solve problems  look   for solutions aligned to Customers perspective and deliver on all   commitments     * Teamwork  consistently work together, trust in each other, engage in   constructive conversations for the good of the group Desired Candidate Profile      * Good spoken English and Writing   Skills.     * Computer literate e.g. Word, Internet Explorer     * Professional & Courteous in mannerisms     * Good comprehension skills     * Ability to liaise with customers at all levels     * Ability to handle and resolve complex customer calls Please call Ginu at 6360842673 and talk to our Carrier Negotiator for more details on the Job and other opportunities. If I do not respond to your calls, drop me a WhatsApp message with your name, number, resume and Voice note.AddressNo 92,  Mosque Road, Frazer TownPulikeshi Nagar,Bangalore - 560005Above - More supermarketMap Url - tinyurl.com/y4s25cw5 ( Copy and paste the link to the browser for location and walkin )", "Role": "Technical/Process Trainer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Training", "UG": "Graduation Not Required", "Doctorate": "None", "Key Skills": ["BPO", "Customer Service", "International Call Center", "Hiring", "Voice Process", "Inbound", "Customer Support", "Technical Support", "Customer Care", "Call Center", "Voice", "International Voice Process", "International BPO"]}