{"Job Title": "Senior Software Engineer - Java Development", "Company": "Talpro", "Experience": "3 - 5 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Title: Senior Software EngineerThis position reports into the Technical Leader Development Manager at Mobileum and would be responsible for development, support and maintenance of J2EE applications.Job Specification for Java developerThis is an opportunity for a Java developer to work on exciting projects and to implement and enhance the ICampaign product to facilitate the delivery of welcome message.Job Description:The ideal candidate should have experience in Java software development and delivering software solutions and provide L2 support.Responsibilities:- To work as part of a roaming solutions project delivery team, reporting to a Lead Developer architect on all technical issues.- To contribute and deliver specifically in the areas of software specification, design, coding, testing, defect resolution and documentation.- To participate in peer reviews of documentation and code, identifying risks and escalating issues to the senior developer and or development manger- To provide timely and useful information to the team leader and project manager to assist in detailed project planning.- The successful candidate needs to have good problem solving, analytical and design skills with a strong level of commitment.Mandatory Requirements:- Hand on experience of development and implementation of Core java applications.- Hands on experience on - Core Java, servlets, multi-threading JDBC.- Hands on experience on Oracle SQLPSQL, Couchbase database.- Hands on Basic UNIX linux system administration (ability to start and stop services on a UNIX server, read logs from a command line, etc.)- Experience with complex designs using abstractions, modules, design patterns and re-usable system architectures.- Excellent verbal and written communications skills, capable of working effectively with customers, team members and management placed at multiple geographical locations.- Positive attitude. We want people who see challenges and solutions, not problems- Demonstrated customer-facing roles and experience.Desirable skills:- Mobileum. Proprietary and Confidential.- General network protocols and principles, including web services, XMLRPC schemes and simple TCP socket protocols- GSM and LTE protocols- Database design and database performance tuning issues- Application server deployment and configuration (Tomcat or similar)- Apache modules and configuration- ANT, CVS, JUnit, Cruise control- Agile product management experienceEducational Qualification:- B.E. B.Tech., M.E.M. Tech. or B.Sc. M. Sc. in Computer Science Electronics Engineering MCA .Work Experience:- 3+ years- experience of Java development on the core java platform, with an emphasis on high performance. (Product development experience is must.) ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Sc in Computers, B.Tech/B.E. in Electronics/Telecommunication, Computers", "PG": "M.Tech in Computers, Electronics/Telecommunication, MS/M.Sc(Science) in Computers, MCA in Computers", "Doctorate": "Doctorate Not Required", "Key Skills": ["Unix", "Java", "Core Java", "Multithreading", "Design Patterns", "Database Design", "Webservices", "Performance Tuning", "Servlets"]}