{"Job Title": "UK/ Rotatioal Shift Voice Process Sal Upto 3.2 L", "Company": "Creative Hands HR Consultancy", "Experience": "0 - 5 years", "Salary": "₹ 2,00,000 - 4,00,000 P.A. ", "Location": "Hyderabad/Secunderabad, Chennai( Avadi, Nungambakkam, Alandur, Anna Nagar West, Ekkaduthangal, Perungudi, St Thomas Mount, Perungalathur, Anna Nagar, Taramani, West Tambaram, Old Perungalathur, Mount Road, Sholinganallur ), Bangalore/Bengaluru", "Job Description": "Please find the below job description for International Process   Work location - Chennai  Type of Program:    Customer Support & Technical Support ( Voice / Semi Voice )   Qualification  Any Degree or under graduate   Requirements  -Excellent communication skill in written & Verbal. -Fresher or Minimum 6 months Experience   Shift  Uk / US   Salary      For Freshers Upto 2 Lacs CTC + Incentives For Experienced Upto 3 Lacs CTC + Incentives   Rounds of Interview     HR, V&A and OPS Round Perks and Benefits   Incentives Upto 3000-10000 Per month PLEASE DO NOT SEARCH FOR OUR NUMBER FROM GOOGLE AND PLEASE DO NOT CALL US.PLEASE APPLY FOR THE JOB IN NAUKRI.COM AND WE WILL REVERT BACK TO YOU. If you are not able to apply in Naukri.com, please send resume to - CreativeHandsHr2@gmail.com and we will call you asap.PLEASE DO NOT SEARCH FOR OUR NUMBER FROM GOOGLE AND PLEASE DO NOT CALL US.", "Role": "Associate/Senior Associate -(NonTechnical),", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Graduation Not Required, Any Graduate in Any Specialization", "PG": "Post Graduation Not Required, Any Postgraduate in Any Specialization", "Doctorate": "Any Doctorate in Any Specialization, Doctorate Not Required", "Key Skills": ["bpo", "international bpo", "btech", "cts", "tcs", "wipro", "freshers", "back office", "hp", "serco", "sutherland", "engineering", "customer support", "banking", "hcl", "international process", "technical support", "voice process", "ibm", "us shift", "semi voice", "non voice", "uk shift"]}