{"Job Title": "Manager - Product Development", "Company": "Quadratyx", "Experience": "8 - 13 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "   We, at Quadratyx, are looking for candidates who have the skills and expertise to help us build, deliver and support large-scale productssolutions on Big Data and Machine Learning platforms.   An ideal candidate is expected to:     Draw upon hisher software development experience and have a passion to develop reliable and scalable Big Data Solutions.   Collaborate with various disciplines and cross functional teams within Quadratyx and its partners.   Ensure our products measure up to the highest compliance standards.   Have experience in mentoring and managing a team of Software Engineers, Database Engineers, and Data Scientists.   Participate actively as part of a team or independently in showcasing the solutions and closing the pre-sale cycles with customers.     Requisites Education:     Bachelor Degree or higher in Computer Science (or a relevant area) from a reputed institute    Certified professional in Project Management and Agile Methodologies is big plus    Certified in Big Data Eco System components is a big plus     Experience (Years):     Substantive experience in building innovative and complex software.    8 plus years of development experience and 4+ years of leadingmanaging software development teams.    Skills Desired Skills:     8 plus years of total work experience in building scaling high performance software products   Develop products and relevant demos using technologies such as Java, REST, Node.js, Cloud Technologies, Python, Containers, etc.   Prepare necessary technical software user manuals   Manage the product development life cycle in an agile environment   Experience in managing engineering teams and project delivery, preferably in a startup environment   Experience in building and running distributed systems for 24x7 online services at scale   Experience in at least one object oriented language (C++Java) and one dynamic scripting language (e.g. Ruby, Python, PHP)   Sound understanding of web technologies (e.g. Javascript, HTML5, CSS) and strong command over databases (MySQL, PostgreSQL, Redis). Knowledge of MVC frameworks like Rails, Django is desired.   Knowledge of architecture principles and methodologies in development of Big Data Solutions   Experience in Big data, Hadoop related projects is a big plus   Experience with tools used for tracking software development tasks through feature development, implementation, debugging, and delivery   Knowledge of Machine Learning and AI systems is a plus    Other Skills     Provable excellence in past record, problem solving and analytical thinking skills, a penchant to excel, a strong urge to learn, an inclusive attitude to respect diverse individuals and perspectives.   ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Project management", "Postgresql", "MySQL", "Debugging", "Agile", "PHP", "MVC", "Ruby", "Python"]}