{"Job Title": "Associate DevOps Engineer", "Company": "Morningstar", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": "  The Role:   As an Associate DevOps Engineer you would play a critical role in working along with the development team and helping the timely and smoother deployment/execution of Quant products in Cloud. In this role, you would be responsible for deployment/execution of Stats/Machine Learning model run and monitoring. You will have opportunities to utilize your CI/CD knowledge to interact and collaborate with diverse teams.     Responsibilities:   Implement, and maintain solutions to automate manual processes using Python   Provide ongoing support for the cloud deployed analytics/ML/AI solutions   Use operational tools and monitoring platforms to perform ongoing monitoring of system availability, performance, and capacity.   Responsible for Data lifecycle management and archival.   Write and execute build/deployment scripts/tasks   Set up and maintain software development tools spanning source control, continuous integration/delivery, code review, etc.     Requirements:   BS degree in engineering, computer science, statistics, mathematics or practical experience   Good knowledge of AWS; AWS Certification preferred   Good knowledge of build, release, and configuration management practices   Knowledge of source control tools (Git, CodeCommit) and infrastructure automation tools (Terraform, CloudFormation)   Knowledge of modeling language (Python) and with PowerShell, Bash scripting   Knowledge of CI/CD tools (e.g. Jenkins, Sonar, CodeBuild, CodePipeline, uDeploy, Control-M, Git)   Working knowledge of Linux and Windows   Intellectual curiosity for the world of quantitative research   Fluent in both oral and written English. ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["Computer science", "Linux", "Quantitative research", "Fixed income", "Configuration management", "Windows", "Operations", "Analytics", "Monitoring", "Python"]}