{"Job Title": "Senior Cloud Devops engineer", "Company": "Thales Group", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Noida", "Job Description": "  Responsibilities:      Support and Troubleshoot all applications to ensure our cloud services is optimized for performance and reliability.     Socialize designs with team and integrate suggestions and changes as appropriate.     Implement Automation and pipeline codes in a timely fashion and with high quality, consistent with standards for the group.        Review other Devops code as necessary.     Test and Deploy    software/applications   updates, new features and hotfixes using various CI/Cd tools    like(Helmcharts,Ansible,GitLab   pipelines, terraforms )across multiple cloud services (AWS GCP) consistency.     Provide documentation as appropriate including design documentation, comments in code and enduser documentation.     Consult with other technical team members and management on industry best practices.     Discuss and agree on the most innovative solutions applicable to our cloud services environment.     Maintain and enhance internal tools.     Provide input to improve scalability and reliability of infrastructure to our Automation Architects     Deploy and assist with maintenance of automation technologies.     Participate on the on-Call schedule Provide L2/L3 Support to our Services desk and RD teams.     Document all build and run procedures when implementing new automation technologies.      Required Skills and Experience:      5 years experience in deploying and supporting web based applications.     5 years must to have experience with orchestration and Automations tools    (Helmcharts , Ansible , Terraforms , Yaml , Python , Json)   and Cloud Services     Understanding of operational concepts like change management, on call rotations, escalations, uptime, etc.     Experience in managing production systems on a very large scale.     5+ years must to have extensive experience working with Kubernetes Orchestration.     Experience working with DB s: MSSQL, MySQL, Postgres, Mongo,Elastic Cloud, etc.     5+ years experience with cloud and server architecture and with REST APIs, micorservices development and deployment.     Experience with security-relevant protocols     Deep understanding of one of the major OS families (Linux or Windows)     Adhere to security best practices from design to implementation and operations     Extensive Experience with PaaS technologies (K8s, OpenShift, etc.)     Ability to work in an extremely geographically distributed company     Excellent communication skills across multiple mediums.   ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Automation", "Change management", "Linux", "Aerospace", "PAAS", "MySQL", "JSON", "Windows", "Python", "Identity management"]}