{"Job Title": "Principal Engineer", "Company": "Thales Group", "Experience": "6 - 11 years", "Salary": "Not Disclosed", "Location": "karnataka", "Job Description": "    In fast changing markets, customers worldwide rely on Thales. Thales is a business where brilliant people from all over the world come together to share ideas and inspire each other. In aerospace, transportation, defence, security and space, our architects design innovative solutions that make our tomorrows possible.        Thales is expanding its presence in India through the development a Group Engineering Competence Centre (ECC), reinforcing its position as a leader in all its markets. Launching in early 2019 in Bengaluru, the ECC will expand Thales footprint in its core business areas and cement its longstanding relationship with India.    This ECC, the first of its kind in India, will focus on hardware, software and systems engineering capabilities for both the civil and defence sectors. India, and in particular Bengaluru, was chosen as the location for the new ECC due to the existing ecosystem its proximity to the market, competence in research and development and abundance of skilled engineers. Both the needs of the local market and export markets will be catered for, meaning those who join Thales will have the opportunity of working on diverse projects with a high level of complexity, innovating in all the different markets we are present in. We re inventing the future, right here, right now. By combining the curiosity to explore, the intelligence to question and the vision to create, together we re transforming the world around us.              Low      level software developer    :    Qualification:    Masters /PhD    in ECE or CSE from reputed institute      Experience in    Embedded Systems Design and Development    Low    -    level software developer: trained to write driver, and hardware programming.      Skilled in Linux and Zephyr.    Required Skills:    -    Excellent programming skills in C/C    -    Design and Development of Embedded SW    -    Develop low level drivers and hardware programming      Working experience in Linux and Zephyr, Good understanding of OS Architecture    -    Expe    rience in OS porting onto new hardware.      Good understating of Kernel internals, Peripheral drivers, Driver optimization, Boot Loaders, HW    -    SW Interface    (HSI)      Handling of Embedded development platforms like Simulator, Emulator or FPGA    -    Debug test failures an    d analyze the root causes    -    Tools knowledge      Requirements Management and Configuration Management (DOORS, JAMA, JIRA, GIT...etc)      Understanding Assembly prog    ramming and Board de    -    bugging         Additional Qualities:    -       Ability to work with minimum direction    -    RT setup    -    Quick learner / Working on multiple new technologies      Fiercely independent and self    -    motivated    -    Self    -    starter    -    Ability to guide / mentor projects @ reputed    Research Institutes such as IISC / IIT    -    Exposure to latest tools / technologies      Compiling / Writing Quality Technical reports with target audience from CTO office      ", "Role": "Technical Lead/Project Lead,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "Engineering Design, R&D,", "Employment Type": "Full Time, Permanent", "Role Category": "Engineering Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Embedded development", "C++", "GIT", "Linux", "FPGA", "Aerospace", "Configuration management", "Hardware", "Research", "JIRA"]}