{"Job Title": "Talend Developer", "Company": "ELLIE MAE INDIA PRIVATE LIMITED", "Experience": "1 - 3 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "Job Responsibilities:-Contribute substantially in the implementation of middleware solutions using Talend and SQL Server 2012.  Ensure Talend code base is appropriately engineered to maintain current functionality and development adheres to performance optimization, interoperability standards and requirements, and compliance with IT governance policies. Contribute substantially in the Middleware and Integration development lifecycle from business requirements to development of logical design, translation to physical design, code development, testing and deployment.  Contribute to the technical design documents, Use Cases, test cases and User Manuals for various projects. Conducts bug fixing, code reviews, and unit, functional and integration testing.  Conduct database programming, performance tuning, relational model analysis and data migration.  Demonstrate experience in leveraging various Talend components to develop complex batch and real-time integrations.  Able to develop not just integration jobs but also routes.  Basic experience with writing Java code, beans etc.  Experience with rest/soap API’s for creating and consuming API’s  Contribute substantially in maintaining and monitoring the Middleware on production and non-prod servers.  Collaborate with the QA team to create and execute system test plans and user-acceptance testing.  Provide updates to management and business to keep them informed of any system issues.  Mentor junior developers on best practices for ETL development using Talend.  Ensure all metrics are collected and exceptions are accounted for during design and development of the SDLC life cycle Move forward towards the company’s goal of overall automation  Work and co-ordinate with various team across the business and help develop key metrics  Understand and interpret business needs and communicate in and easy to understand way and then produce technical documents for the same  Keep informed of the latest industry trends and new technologies and make necessary improvements  Experience with upgrade and migration processes.  Minimum degree required - Bachelors  Accepted fields of study; Computer Science, Information Systems or a related engineering disciplineBasic Qualification:-. At least 1+ year’s ETL development experience in Talend, MS SQL (SQL 2005/2008/2012), T-SQL, basic database design skills and application performance tuning. . At least 1+ year’s hands-on experience with aspects of the Middleware lifecycle including analysis, design, and implementation. . At least 1+ year’s hands-on experience in ETL and reports development. Strong web-based application integration experience using REST/SOAP . At least 1+ years of experience with writing java routines, beans etc. . Strong problem solving and troubleshooting skills • Effective verbal and written communication skills . Demonstrated ability to deliver working solutions on a tight schedule . Good working knowledge of Salesforce, Netsuite and Oracle Financials. . Basic working knowledge of Java, Unix, XML and understand various databases like Postgres, MySQL, NoSQL etc.", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - DBA, Datawarehousing,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["database design ", "Java", " MySQL", "NoSQL", "Oracle Financials", "ETL development", " NoSQL ", "application performance tuning", "SQL Server", "Postgres", "ETL"]}