{"Job Title": "VBA Developer", "Company": "Cogneesol", "Experience": "3 - 4 years", "Salary": "Not Disclosed", "Location": "Mohali", "Job Description": "  Job description      Technical and Soft Skill sets required:     - Work closely with other developers for understanding the functional technical requirements.    - Developing and configuring automation processes as per the requirement of clients.    - Design and develop models using VBA programming for Excel, and other Microsoft software    - Use Advanced Excel capabilities, including pivot tables, lookups, complex formulas and graphing to streamline business processes    - Development and maintenance of Excel Macros/VBA Scripts to efficiently automate daily tasks and reporting.    - Advanced Excel skills (i.e. complex formulas)    - Assist other staff with development activities    - Gather, interpret, and utilize complex data to develop regulatory reports    - Create extensive macros to decipher large amounts of data    - Work directly with the surveillance team to ensure the proper implementation of regulations    - Quality assurance of reports generated    - Analyze and assess data to build risk models to ensure that procedures are always up to date    - Take complete responsibility for solution delivery including analysis, design, development, testing, and user coordination.    - Keep up to date documentation for all new and updated user tools.    - Maintain technical documentation and ensure that knowledge is shared with other members of the team    - Able to debug/code difficult functions/macros using VBA    - Ability to programmatically manipulate worksheet and cell properties using VBA    - Must possess problem solving skills and be proactive in researching solutions    - Excellent oral and written communication skills    - Experience in developing macros and dashboards using VBA in Excel or Access    - Ability to manage multiple tasks and adapt to a changing, fast-paced environment    - Desire to improve processes, take initiative, and solve problems    - Ability to work independently and as a member of a team    - Ability to analyze and organize data    - Able to quickly learn complex concepts and seamlessly manage multiple priorities     Qualification requirements:     - Associate s or bachelor's degree in data science, business analytics, finance, economics, accounting, or a related field preferred  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Automation", "Excel", "Manager Quality Assurance", "data science", "VBA", "development testing", "Business analytics", "microsoft", "Macros", "Technical documentation"]}