{"Job Title": "Full-stack Developer", "Company": "Zymr Systems Pvt. Ltd.", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Pune, Ahmedabad", "Job Description": "   Experience in building web applications using ReactJS, preferably using REST API ,WebSockets for client-server communication.     Must have experience for HTML5, CSS3, Bootstrap, Custom Graphics using SVG     Must have experience using CSS pre-processor: either LESS or SASS     Strong knowledge of best practices and modern web design trends is necessary.     Some experience with modern web-based typography.     Excel at rapid prototyping and at writing good code.     Experience with testing/debugging in multiple browsers and platforms.     Expertise in using Javascript     Should have worked on REST and WebSockets     Should be able to write Unit testing using any one of the frameworks like Jasmine, Karma, Jest , Enzyme or any other similar framework.     Should have experience in either one of the Build scripts like Gulp or Grunt or Webpack     Low-Latency UI, Page optimization, and bundle build+caching     Component-based architecture     Working experience in PHP preferred experience in LAMP.     Experience in customization on any of open source projects like WordPress, Magento etc.     Must have experience in writing unit tests using frameworks like PHPUnit.     If not PHP, experience with Backends using NodeJS.     Must have knowledge of web services implementation.Must have good knowledge of Javascript libraries & frameworks( Typescript Preferred).     Should be well versed with middleware concepts in Enterprise application development     Good working knowledge on doctrine(ORM)     Good knowledge of OOPs concepts and MVC architecture.     Experience in implementing common third-party APIs (Google, Facebook, etc.) and user authentication and authorization between various systems.     Good understanding of MVC design patterns.     Candidate should have worked on multiple projects using Git for version control     Candidate should be aware of Git commands like clone, pull, merge, etc.     Candidate should have worked on at least one project using Agile methodology      DESIRED SKILLS:      Experience working on a Public cloud environment like Azure, AWS, Google, etc.     Experience working on AWS,EC2,S3,RDS     Experience with some NoSQL DBs like MongoDB     Experience with some CI/CD like Jenkins     Experience with WebPack or Gulp or Grunt     Good written as well as verbal communication in English, since the candidate will be communicating with Clients based out of U.S. regularly     Self-motivated, self-learning     Out-of-the-box thinking to come up with Innovative optimized solutions     Should be able to take ownership of own tasks     Responsible and Committed   ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Graphics", "Wordpress", "Debugging", "Javascript", "PHP", "Application development", "MVC", "Unit testing", "Open source", "Middleware"]}