{"Job Title": "Software Development Engineer - Python", "Company": "Varite", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Pune, Bangalore/Bengaluru", "Job Description": "       Job description               Job summary        We are looking for individuals who can own and drive tools development    initiatives end to end from the design of the tool, to the development and t   esting, to putting that to production.        You will be required to understand the    requirements come up with tools design, review the design with the    stakeholders, plan and execute the development and testing in a sprint model,    and work on every aspect of quality involved in creating a delightful product.        As part of this role you will own the tools development for Prism but that could be widely used across Nutanix.      Hence it should involve proper thought put in place to consider a wider use case while designing.      As part of this role, you will be expected to make swift progress with coding and show the ROI of using the developed tool.      You will be required to ensure quality in terms of functionality,scalability, high availability and usability of the tool/product you are developing.          Description          You will own the design and development of tools by working closely    with various stakeholders to ensure timely and high-quality delivery of    product.        We are looking for individuals who have a knack of finding    efficient solutions to existing problems        Analyze failures and determine root cause   , setting the expectations of the solution/behaviour based on the    requirements.        You will be driving design of the tool, development and testing    activities of the toolthrough a sprint model and will be involved in creating    highly scalable and reliable tools.        Candidates must have exposure to backend automation        Ability to write robust scripts to test the product. Framework development experience, a plus.        Exposure to UI development; a good plus to the role as the tools    development may involve developing UI.          Qualifications and Experience          Bachelor s or Master s degree in Computer Science or related stream is    required.        Ability to design tools and code in any language will be required with    preference to Python        Candidates with experience in development using REST apis will be preferred.        Extremely swift in coding and development execution        Working knowledge of any manageability product or distributed systems, a    plus.        Should be familiar with linux operating systems and basic commands to    troubleshoot        Candidates with experience in    virtualization    background will be    preferred.        Minimum of    2 years experience with    test automation or development        3 - 5    years    of overall Software development/automation experience.   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Computer science", "UI development", "Automation", "Backend", "Linux", "Coding", "Design review", "Virtualization", "Distribution system", "Python"]}