{"Job Title": "Full Stack Developer", "Company": "Scogo Networks Pvt. Ltd.", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "location with expertise in React.JS, who interested to work in a fast - moving startup culture with cutting edge technology stack. You will be architecting and developing the core application for a very unique use case.\n\nWho are we: Scogo Networks is an internet startup and is on a mission to disrupt $50 Billion service industry in India with its globally unique and unmatched business model. We are on a bandwagon to transform the entire service industry through our unprecedented business logic together with automation\n\nWhat we are looking for : Minimum 3 years of experience in PHP Laravel / Lumen and MySQL. design and development Good to have Node.JS experience Roles and Responsibilities : Develop core application for Frontend (ReactJS) and Backend (PHP Laravel) Collaborate with the rest of the engineering team to design and launch new features Evaluate and resolve product related issues Develop backend logic including database designing Working with Agile frameworks such as Scrum Design and implement scalable solutions in microservices architecture Soft / Other Skills Needed : Can - do attitude Problem Solving attitude Self - motivated and detail oriented with the ability to work independently and collaboratively Should possess excellent verbal written communication skills Responsible Reliable Team Player. Quick learner of new technologies / architecture. Willing to learn New Languages / Frameworks. Code review with teammates, identify areas for improvement and help mentor junior developers. Relocation support will be provided if you are willing to re - locate to Pune. Be an integral part of the core team with early starter preference Be at the cutting edge of the technology Competitive salary and health benefits Startup culture: Learn Fast, Break Fast, Grow Fast Company provided technical and soft skills training every quarter This position is open for full - time employees only for Pune Location. . Ltd. is a search for a React Native Developer in Pune location (Relocation support will be provided) having expertise in React.JS and interested to work in a fast - moving startup culture with cutting edge technology stack. You will be architecting and developing the core application for a very unique use case.\n\nWho are we: Scogo Networks is an internet startup and is on a mission to disrupt $25 Billion service industry in India with its globally unique and unmatched business model. We are on a bandwagon to transform the entire service industry through our unprecedented business logic together with automation.\n\nWhat we are looking for : 1 - 4 year of relevant experience in React Native Application Development Have published at least one original React Native App Comfortable with Redux / JS / CSS Familiarity with RESTful APIs to connect App to back - end services Comfortable working with Google Location Apis, Cloud Message API, Push notifications (FCM) Knowledge of the React ecosystem and the libraries / components available for common tasks. Good understanding of the full mobile development life cycle. Strong focus on app performance Strong knowledge of Mobile UI design principles, patterns, and best practices. Roles and Responsibilities : Translate designs and wireframes into working Mobile App (React Native) Plan and development of Mobile App from scratch. Understanding, Enhancing and bug fixing of existing applications. Continuously discover, evaluate, and implement new technologies to Ability to understand business requirements and translate them into technical requirements. Benefits : Relocation support will be provided if you are willing to relocate to Pune. Competitive salary and health benefits. Be an integral part of the core team with early starter preference. Be at the cutting edge of the technology. Startup culture: Learn Fast, Break Fast, Grow Fast. The company provided technical and soft skills training every quarter. This position is open for full - time employees only for for us but havent found a suitable role", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["Automation", "Backend", "MySQL", "Service industry", "Javascript", "Agile", "PHP", "Application development", "Scrum", "CSS3"]}