{"Job Title": "Web Developer Intern", "Company": "MajorBrains Technologies Pvt. Ltd.", "Experience": "2 - 7 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "   Responsibilities and Duties:   1. Develop new user-facing feature and build reusable code and libraries for future use.  2. Conduct user research to identify problems and needs.  3. Learn constantly to stay on top of the latest front-end technologies and practices  4. Ensure coding standards and performance budgets are observed throughout the life of a  project  5. Help to gather requirements, write functional specifications, and determine optimal  implementations.  6. Test website and applications to ensure adherence to design specifications prior to release    Skills And Abilities Required:   1. Expertise in WordPress development and customizations of templates and plugins.  2. Expertise in Core PHP, WebServices & APIs Knowledge  3. Expertise in modern front-end web technologies: HTML5, CSS3, and Bootstrap.  4. Exposure to and expertise in at least one JavaScript framework.  5. Knowledge of Joomla, Laravel, etc  6. Code versioning tools (such as Git, SVN).  7. Proficient understanding of client-side scripting such as JavaScript and jQuery.  8. Strong knowledge of CSS concepts and experience with preprocessors.  9. Proficient in modern back-end web technologies: NodeJS.  10. Exposure to Agile Development method and Deep knowledge of MySQL.  11. Develop new user-facing feature and build reusable code and libraries for future use.  12. Apt knowledge of digital marketing to make SEO friendly websites & web applications.  13. Responsive and Mobile Design.  14. Ability and willingness to learn new technologies and development methodology.  15. Must be able to work under deadlines and able to learn new things quickly.  16. Client Communication & Project Management Skills.  17. Excellent Communication skills and proactiveness.  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - QA & Testing,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "MBA/PGDM in Marketing", "Doctorate": "None", "Key Skills": ["Web services", "jQuery", "MySQL", "Wordpress", "Performance testing", "SEO", "Photoshop", "Troubleshooting", "Open source", "Joomla"]}