{"Job Title": "Lead Engineer - Customer Engineering", "Company": "NTT Global Networks ", "Experience": "8 - 13 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": "NTT Global Networks Careers -  Lead Engineer -  Customer Engineering Lead Engineer -  Customer Engineering Description \n\n1. PRE- REQUISITE: \n\nExcellent verbal and written communication skills \n\nAble to contribute to the work in a group as a team player \n\nExperience working on Projects \n\nCustomer service skills including the ability to work with customers in activating services \n\nDetailed understanding and working knowledge of routing protocols like BGP,  OSPF,  EIGRP,  RIP,  RIP v2. \n\nWorking knowledge of MPLS- VPNs (L3 and L2 VPNs),  IPSec and SSL VPNs ,  QOS, Wireless communication,  load balancing/ sharing techniques. \n\nWorking knowledge of Switching techniques: VLAN,  VTP,  various flavors of STP,  dot1x,  Ether- Channel \n\nGood understanding of OSI Layer 1 and 2 protocols \n\nConfiguration,  installation and troubleshooting of Cisco and Juniper routers,  Layer- 2 and Layer- 3 switches,  Dial up modems,  wireless devices \n\nExposure on Firewalls /  WAN accelerators are preferred \n\nThorough knowledge of provisioning circuits including working directly with circuit providers \n\nTime management and prioritization skills 2. RESPONSIBILITIES: Responsible for implementing complete end to end Network Solutions for the customers. Responsible for interacting with internal groups,  vendors and customers to coordinate the timely implementation of customer networks and data services. Responsible for the final installation of circuits and data services.\n\nDuties: Organizational,  Professional and Technical \n\nCoordinate with internal Virtela groups,  vendors/ suppliers,  and customers to implement customer orders in a thorough and timely manner. \n\nManage the overall process of implementing complex,  technical installations. \n\nResponsible for the final installation of circuits and data services to achieve high levels of customer satisfaction. \n\nAssist in developing processes and procedures for the final installation and turn- up of circuits and data services. \n\nLead design discussions/  streamlining service delivery plans / implementations for new customers for smooth installation/ migration activities. \n\nServe as an SME and escalation point for the Operations team for accounts which have inherent complexity in their designs \n\nParticipate on periodic Customer Review calls \n\nTrain and mentor members within the team \n\nShould have the willingness to work across time zones and diverse cultural framework \n\nWork with hardware/ circuit provider from different geographical regions for installing diverse circuits types (E1/ T1 , DS3 , Ethernet , xDSL) and participate in remote troubleshooting wherever required \n\nMaintain and Provide weekly work report to the Manager 3. TRAINING AND CERTIFICATION REQUIRED \n\nCCIE,  CCIP,  CCNP,  CCNA,  JNCIE,  JNCIA,  JNCIS is desirable.\n\n4. EXPERIENCE: \n\nMinimum 8 years\n\n5. EDUCATION: \n\nBE and /  or postgraduate qualifications\n\nYou have been redirected to a NTT Global Networks job page\n\n", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Electronics/Telecommunication", "PG": "M.Tech in Electronics/Telecommunication", "Doctorate": "None", "Key Skills": ["Wireless", "Ccie", "WAN", "Ethernet", "VLAN", "CCNA", "Troubleshooting", "cisco", "MPLS", "OSPF"]}