{"Job Title": "Senior Site Reliability Engineer", "Company": "Morningstar", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": "    The Role:                 Our       Research       experience       team is looking for a Site Reliability Engineer (SRE - DevOps). As a DevOps Engineer, you will be responsible for applying DevOps best practices at scale. As a DevOps Engineer, you will be working in conjunction with like-minded departments such as software engineering to deploy these new products and manage our infrastructure, associated processes and systems. The role requires engineer to be detail-oriented and a skilled problem solver to help us streamline our processes and automating them where applicable.            This position is based out of our Mumbai office.                  Responsibilities:                    Develop new and existing application deployment pipelines at scale.                  Enforce DevOps best practices at scale.            Ability to script pipelines using different deployment tools (Jenkins, AWS       CodePipeline     ).            Develop Infrastructure as Code (     IaC     ) at scale using Terraform, AWS CloudFormation.            Ability to work across multiple teams and projects using various AWS cloud application frameworks (e.g. ECS, ECR,       Fargate     , Lambda etc.) and Docker.            Provide best deployment solutions for both hybrid and cloud microservice applications.                  Provide best practices in source control using Git.            Improve existing deployment processes by introducing new/better automated solutions.           Introduce new cloud deployment solutions at scale           Provide best practice in monitoring new/existing solutions using       NewRelic     /AWS CloudWatch.            Use operational tools and monitoring platforms to gain in-depth knowledge & understanding       to configure       monitoring of system     /services       availability, performance and capacity.                 Proactively monitor events, investigate issues, analyze solutions, and drive problems through to resolution.           Enforce industry Continuous Delivery patterns and collaboratively work with other members to achieve successful continuous delivery solutions.                    Requirements:                      A bachelor's degree in computer science, mathematics or       other       related field           5+ years of DevOps experience.            2+ years of experience delivering       IaC       automated pipelines.           5+ years of experience in an Agile delivery environment.           5+ years of experience spanning at least two IT disciplines, including technical architecture, application development or operations.                  Knowledge of business process re-engineering principles and processes.            Strong understanding of application development methodologies.            Adept at evaluating problems accurately and displaying sound judgment.            4+ years working with a broad portfolio of AWS infrastructure tools (EBS, S3, EC2, Elastic IP, Route 53, VPC) and experience with cloud infrastructure management and automation technologies (Terraform/CloudFormation).            4 + years       in any of one       scripting (shell, python, ruby) skills for monitoring and automation.                 4 + years using Continuous integration tools such as Jenkins,       CodePipeline     , etc.            Experience maintaining an infrastructure and ensuring stability while adding new features.            Ability to clearly articulate design and implementation choices.            Ability to use a wide variety of open source technologies and tools.            Comfort with frequent, incremental code testing and deployment.       ", "Role": "Project Manager-IT/Software,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "Site Engineering, Project Management,", "Employment Type": "Full Time, Permanent", "Role Category": "Project Management", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Automation", "Infrastructure management", "Cloud", "Infrastructure", "Application development", "Research", "Open source", "Ruby", "AWS", "Python"]}