{"Job Title": "Principal Engineer - Software Development", "Company": "Microchip Technology Inc.", "Experience": "8 - 13 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   About the Job:          Microchip has an opening for a Principal Engineer Software Development position for the storage management software team based out of Bangalore, India. Reporting to the Software Development manager, the potential candidate will be part of storage management software development team.          Responsibilities:          As a storage management Principal Engineer, you will join a growing team of engineers developing storage management software for RAID/HBA Controller and other storage products. Reporting to the Manager of Software Development, your responsibilities will include, but are not limited to the following:            Involve in design, development, integration, debugging, and verification of the storage management software modules/features/issues          Work with other teams like driver, firmware and hardware groups to design and shape the RAID HBA product offering         Qualifications:            BSEE or BS Computer Science/Math, or equivalent         8 years of professional experience in C/C+ based storage software development.          Experience with full software lifecycle: specification, design, implementation, integration, debug, and maintenance        Experience with Agile scrum methodologies.        Familiar with a structured professional coding environment: participating in code reviews, following standard revision control, bug tracking, and release practices         Superior design and problem-solving skills         Excellent communication and documentation skills        Experience in working with Microchip storage products        Experience with systems programming under Windows, Linux, Free BSD, Solaris and VMware          Experience with storage products like RAID, HBA, RAID subsystem, enclosures, tiered storage     ", "Role": "Associate/Senior Associate -(Technical),", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Any Graduate in Any Specialization", "PG": "M.A in Journalism", "Doctorate": "None", "Key Skills": ["VMware", "C++", "Linux", "Solaris", "Coding", "Debugging", "Software Development Engineer", "Windows", "Firmware", "Principal"]}