{"Job Title": "Intern -Software Development", "Company": "E-Lock Technologies", "Experience": "0 - 1 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "  Qualifications   B.E., B.Tech, MCA, MSc. Computer Science        Additional Qualifications   Good knowledge of Java and JavaScript        Job Description     Designing and developing programs   Handling the debugging, unit testing, documentation and tech support   Ability to develop software in Java, C++ or other programming languages   Must have very strong logical & OOPS concepts   Must have hands-on experience C/C++/VC++, MFC, ATL, ActiveX, COM, Windows Programming   Excellent knowledge of relational databases and ORM technologies (JPA2, Hibernate)   Experience developing web applications using at least one popular web framework Spring   Experience with test-driven development   Good knowledge in Web API, SOAP and REST service know how and well versed in MVC architecture   Expertise in HTML, CSS3, Bootstrap. Strong proficiency in JavaScript, knowledge of Ajax, jQuery is good to have   Execute full software development life cycle (SDLC)   Write well-designed, testable code   Integrate software components into a fully functional software system   Develop software verification plans and quality assurance procedures   Document and maintain software functionality   Troubleshoot, debug and upgrade existing systems   Deploy programs and evaluate user feedback   Experience of working in an innovative organization   A certificate will be awarded at the end of internship period   Final placement if performance is satisfactory  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Embedded, EDA, VLSI, ASIC, Chip Design,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "MCA in Computers, MS/M.Sc(Science) in Any Specialization", "Doctorate": "None", "Key Skills": ["C++", "Hibernate", "jQuery", "Debugging", "Javascript", "HTML", "Windows", "MFC", "SDLC", "Ajax"]}