{"Job Title": "Medical Coder CPC Online Certification", "Company": "Yogam BPO", "Experience": "0 years", "Salary": "Not Disclosed", "Location": "Ambattur, Ambur, Thanjavur/Tanjore, Tiruchirapalli/Trichy, Thoothukkudi/Tuticorin, Vellore, Velachery Vadapalani, Villupuram Neyveli, Vellore Karur", "Job Description": "ETHICAL AND INTELLIGENT ONLINE TRAINING PROGRAM IN YOGAM IS THE KEY ANSWER FOR FRESHER'S TO AVOID DISCOMFORT AND EMBARRASSMENT WHILE ATTENDING COMPANY INTERVIEWS.LEARN FROM US. WE RESPECT YOU.REACH US BY CALL @ 9840040143 OR WHATS-APP @ 9789004777Required Candidate profileBe flexible to work in any location after training completion.Willing to relocate and work in Healthcare Industry.We can help you take the first step.Share this out--it's good.Whats-app 9789004777Perks and benefitsLEARN ABOUT JOB, EMPLOYMENT OUTLOOK, SALARY TRENDS", "Role": "Fresher,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Other", "UG": "MBBS in Medicine, B.Sc in Optometry, Food Technology, Home science, Bio-Chemistry, Biology, Microbiology, Botany, Nursing, Chemistry, Dairy Technology, Zoology, B.A in Any Specialization, B.Tech/B.E. in Any Specialization, BCA in Computers, BHMS in Any Specialization, Homeopathy, B.El.Ed in Any Specialization, B.P.Ed in Any Specialization, B.B.A / B.M.S in Management, Other Graduate, BFA in Any Specialization, LLB in Law, BHM in Hotel Management, B.Ed in Education, BDS in Dentistry, BAMS in Any Specialization, Ayurveda, B.U.M.S in Unani Medicine, Any Specialization, BVSC in Veterinary Science, Diploma in Any Specialization, B.Pharma in Pharmacy, B.Arch in Architecture, B.Com in Commerce, B.Des. in Any Specialization, Graduation Not Required, Any Graduate in Any Specialization", "PG": "CS in CS, M.Arch in Architecture, M.Pharma in Pharmacy, Post Graduation Not Required, CA in CA, LLM in Law, MS/M.Sc(Science) in Nursing, Zoology, Veterinary Science, Bio-Chemistry, Biotechnology, Microbiology, MCA in Computers, Other, MVSC in Veterinary Science, DM in Any Specialization, M.Tech in Any Specialization, Any Postgraduate in Any Specialization, M.Ed in Education, Integrated PG in Any Specialization, Medical-MS/MD in Any Specialization, M.A in Any Specialization, ICWA (CMA) in ICWA (CMA), MFA in Any Specialization, M.Ch in Any Specialization, PG Diploma in Any Specialization, M.Des. in Any Specialization, MBA/PGDM in Any Specialization, MDS in Dentistry, M.Com in Commerce", "Doctorate": "Any Doctorate in Any Specialization, Ph.D in Advertising/Mass Communication, Doctorate Not Required, M.Phil. in Advertising/Mass Communication", "Key Skills": ["fresher", "bsc nurse", "biomedical", "Revenue Cycle Management", "Ayurveda", "Bhms", "medical billing", "Genetics", "life sciences", "Bams", "physiotherapist", "bpt", "gnm", "microbiology", "Doctor Activities", "dentist", "Dietician", "ICD - 10", "medical coding", "HCPCS", "medical transcription", "biochemistry", "CPC", "pharmacy", "Yoga", "zoology"]}