{"Job Title": "Medical Coding CPC Online Certification", "Company": "Yogam BPO", "Experience": "0 years", "Salary": "Not Disclosed", "Location": "Tambaram, Tirupur/Tiruppur, Tiruvannamalai, Tirunelveli, Madipakkam Perambur, Madipakkam Tambaram, Arakkonam Tiruttani, Tenkasi Tiruchendur, Cuddalore Tiruvallur", "Job Description": "Medical Coding companies prefer to hire candidates who have completed proper quality training to sponsor for professional CPC certifications.Completing online CPC training program in YOGAM BPO will improve your employment prospect.Call-9840040143Required Candidate profileOnline Training Compulsory.Any Life Science / Medical Background / Pharma / Nursing / Paramedical preferred.Age limit up-to 28 years.For more details mail to hr@yogambpo.orgWhats-app: 9789004777Perks and benefitsLEARN ABOUT JOB, EMPLOYMENT OUTLOOK, SALARY TRENDS", "Role": "Fresher,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Other", "UG": "BHMS in Any Specialization, Homeopathy, B.U.M.S in Unani Medicine, Any Specialization, BCA in Computers, B.A in Any Specialization, BDS in Dentistry, B.Ed in Education, Other Graduate, BHM in Hotel Management, Diploma in Any Specialization, LLB in Law, B.Des. in Any Specialization, BAMS in Any Specialization, Ayurveda, B.B.A / B.M.S in Management, B.Tech/B.E. in Any Specialization, B.Arch in Architecture, Any Graduate in Any Specialization, Graduation Not Required, B.El.Ed in Any Specialization, B.Sc in Optometry, Food Technology, Home science, Bio-Chemistry, Biology, Microbiology, Botany, Nursing, Chemistry, Dairy Technology, Zoology, B.Pharma in Pharmacy, BFA in Any Specialization, B.P.Ed in Any Specialization, MBBS in Medicine, BVSC in Veterinary Science, B.Com in Commerce", "PG": "M.Ch in Any Specialization, M.A in Any Specialization, M.Tech in Any Specialization, Integrated PG in Any Specialization, M.Des. in Any Specialization, MDS in Dentistry, M.Ed in Education, LLM in Law, M.Com in Commerce, ICWA (CMA) in ICWA (CMA), Post Graduation Not Required, M.Pharma in Pharmacy, MS/M.Sc(Science) in Nursing, Zoology, Veterinary Science, Bio-Chemistry, Biotechnology, Microbiology, DM in Any Specialization, MVSC in Veterinary Science, M.Arch in Architecture, MBA/PGDM in Any Specialization, CS in CS, CA in CA, Medical-MS/MD in Any Specialization, MFA in Any Specialization, Other, PG Diploma in Any Specialization, Any Postgraduate in Any Specialization, MCA in Computers", "Doctorate": "Any Doctorate in Any Specialization, M.Phil. in Advertising/Mass Communication, Ph.D in Advertising/Mass Communication, Doctorate Not Required", "Key Skills": ["fresher", "bsc nurse", "biochemistry", "Revenue Cycle Management", "Yogam", "Tai Chi", "Biology", "Bbm", "Bsc", "Botany", "medical billing", "life sciences", "physiotherapist", "Bcom", "Pranic healing", "Bca", "bpt", "gnm", "microbiology", "biomedical", "dentist", "Dietician", "ICD - 10", "medical coding", "Chemistry", "HCPCS", "CPC", "pharmacy", "Yoga", "zoology"]}