{"Job Title": "Senior Software Development Engineer  - Video Algorithms", "Company": "Hotstar", "Experience": "3 - 7 years", "Salary": "Not Disclosed", "Location": "Mumbai, Gurgaon/Gurugram, Bangalore/Bengaluru", "Job Description": " Senior Software Development Engineer  - Video Algorithms    Bangalore/Mumbai/ Gurgaon   1. Engineering Video   Full time    About the Role    At Hotstar, we have over 300 million users and capture close to a billion click stream messages daily. The engineering team at Hotstar is at the centre of the action and is responsible for creating unmatched user experience. Our engineers solve real life complex problems and create compelling experiences for our customers.   The pace of our growth is incredible if you want to tackle hard and interesting problems at scale, and create an impact within an entrepreneurial environment, join us!  Your Key Responsibilities    Develop and maintain video and image encoding software that plug into the Hotstar media pipeline, designing for quality, robustness and scale.     Design and implement algorithms that can automate video quality control of incoming source content and encoded Hotstar streams.     Participate in work related to next - generation video technologies.   What to Bring    4+ years experience in multimedia software development, with excellent debugging and problem solving skills.     BE/B.Tech in Computer Science/Electrical Engineering or equivalent. MS or PhD a plus.     Expert in C++ or Java and object - oriented programming.     Solid understanding of video compression and processing, including codec standards such as H.264/AVC, HEVC and VP9.     Strong background in image and signal processing, both algorithm design and implementation (for example, image scaling, deinterlacing, frame rate conversion, artifact detection).     Experience in large - scale distributed systems and cloud - computing     Experience in software performance optimizations     Experience in open - source multimedia projects (such as ffmpeg, x264, avisynth, webm)     Experience in image and video quality assessment     Experience in media packaging formats such as HLS, DASH along with encryption  ", "Role": "Software Developer,", "Industry Type": "Internet, Ecommerce,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Cloud computing", "Image processing", "Debugging", "Packaging", "Signal processing", "Manager Quality Control", "Open source", "Distribution system", "Object oriented programming"]}