{"Job Title": "Customer Service Associate For a leading search engine!! HY", "Company": "WSNE Consulting Pvt Ltd  ", "Experience": "0 years", "Salary": "₹ 2,25,000 P.A. ", "Location": "Hyderabad/Secunderabad", "Job Description": "We have an opening for a leading MNC at Hyderabad Location for One of the biggest search engine like Google, Yahoo, Bing - Voice Process Work from Home till Further Notice*Profile - Customer Service - VoiceAny graduate fresher with excellent communication skills can applySalary - 2.20 Lacs CTC 15K (Approx) in hand + Night Allowances - 1500 to 2000 per monthShift - Rotational5 days working, Rotational OffNote - When it would be work from Office then you would be based at Client location and will get Cab or Cab Allowances - 2600 for 1 side and 5200 for both side + Free Meals.For getting your interview scheduled you can call or WhatsApp our HR Team on below nos.HR Ayushi - 9311844779HR Arushi - 9899025091HR SIMRAN - 9311776253HR Priyanka - 9953345935HR Gautam - 9319001798HR Shivani - 9311776254The candidate must have the below documents.10th Marksheet12th MarksheetGraduation MarksheetGraduation Degree or Provisional CertificateIf Postgraduate then P.G.  Marksheet along with Degree or Provisional Certificate.Aadhar card (Mandatory)Pan Card (Mandatory)Voter ID Card or Passport (Any one document, if not both then candidate have to apply for a paid passport online). ((Mandatory))P.S.: We don't charge anything from any candidate. ", "Role": "Associate/Senior Associate -(NonTechnical),", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Back Office/Web/Transaction Processing", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["bpo", "Customer Service", "fresher", "cca", "csr", "tsa", "cce", "tse", "customer care", "cco", "customer support", "csa", "tso", "tsr", "cse", "cso"]}