{"Job Title": "Analyst/Lead-Accounts Payable (Polish Language) (MNC IT Company)", "Company": "Vertex Corporate Services (I) Pvt Ltd ", "Experience": "0 - 5 years", "Salary": "Not Disclosed", "Location": "Pune, Delhi / NCR", "Job Description": "Position: Analyst/Lead-Accounts Payable (Polish Language) (Leading MNC IT Company)Role and Requirements:- Fresher to 10 yrs of experience- Fluency in Polish language is a must- Graduate with Finance degree / Post Graduate with at least 6+ years in operations preferable P2P domain. MBA will be an advantage.- UK Shift timings- Operational/hands-on experience in and managing PTP processes for Europe region specifically for Poland, including involvement with the following: purchase requisitions, purchase orders (PO), non-PO processing, approval workflow review, vendor maintenance, helpdesk management, invoice processing and validation, maintenance of error logs, timely and accurate payment processing/analyzing & implementing tools to avoid duplicate pro-actively and tax reporting- Experience in transitioning onshore work from initiation to stabilization, including steadying work in Europe and implementing best practices post migration with re-engineering benefits. - On the job/onsite experience in process mapping and assessing upstream and downstream risks. Proactively evaluates process flows for adequate controls and helps drive standardization.- Able to think from client perspective and design dashboards / management reporting to identify root causes of issues and monitor end results / overall compliance- Experience in managing Six Sigma and SOX compliance for shared service environment and preparing Dashboards for clients- Should be open to travel to client locations abroad for short / long term duration depending on the business requirements- Able to manage conflict situations effectively and work positively under pressure keeping end-result in mind- Excellent client facing skills to help resolve customer escalations in a timely manner. Able to partner with internal and external parties (e.g., clients, auditors and management) to drive resolution and continual progress.- Excellent communication & interpersonal skills written and oral.- Strong presentation & analytical skill- Excellent quantitative and reasoning skills- Ability to nurture and grow effective business relationships with key customers at all levels- Strong problem solving and conflict resolution skills- Ability to coach, mentor and motivate people- Must be very proficient in MS Power Point, MS Excel and MS Access.- Hands on experience in PowerBI, AI & robotics tools & implementation- Freshers who are fluent in Polish language but without experience in Accounts Payable or P2P can also applyLocation: Gurgaon/ Pune", "Role": "Accounts Executive/Accountant,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "Accounts, Finance, Tax, Company Secretary, Audit,", "Employment Type": "Full Time, Permanent", "Role Category": "Accounts", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Excel", "Polish", "Invoice Processing", "Accounting", "Finance", "Polish Language", "Payment Processing", "PTP", "Invoicing", "Accounts Payable", "P2P"]}