{"Job Title": "Linux Kernel Engineer", "Company": "Brainstorm Technologies", "Experience": "4 - 9 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "4 years or more experience in software development. Job Decription Kernel Engineer with development experience in software design,  debug,  and verification of drivers and kernel code. You will use your &nb;p;deep understanding of kernel development,  scheduling,  locking and performance; to contribute to and interoperate within in a highly scalable multi- protocol network attached file system. Development and maintenance of drivers and Linux kernel code. This position will interface with Hardware engineers,  Software Engineers,  Manufacturing engineers and the Field Service Engineers. Some of these will be located at remote sites. Collaboration and interaction with other groups and remote teams is essential for development. The successful Software Engineer must demonstrate good problem solving and analytical skills. Good verbal and written communication skills are also essential in daily functioning Work with the Linux community. Requirements 4 years or more experience in software development. Previous experience in building commercial customer products Linux Kervnel development experience Device driver implementation in 2.6.x Experience with performance optimization for low latency applications Experience in building highly scalable systems Demonstrated ability of strong software designs and debug skills Self Starter with the ability to remain flexible and learn new technologies quickly Close interaction with development management (both local and remote) Must have excellent troubleshooting/ debugging skills,  using a variety of tools such as gdb,  gprof Ability to interact and collaborate with other senior engineers in different geographies Excellent teamwork; written and verbal communication skills. Experience developing distributed/ clustered systems Experience developing NAS protocols File system I/ O Strong Networking skills Scheduling and multi threaded applications Prior experience with GPL and open source collaboration", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["C++", "Software design", "Linux", "Linux kernel", "Tools", "Writing", "Scheduling", "Software", "Open source", "Troubleshooting"]}