{"Job Title": "Senior Technology Developer(8years) and Technology Lead(10years)", "Company": "OnProcess Technology India Pvt. Ltd.", "Experience": "7 - 12 years", "Salary": "₹ 7,00,000 - 12,00,000 P.A. ", "Location": "Kolkata", "Job Description": "Roles and Responsibilities 1. Senior Technology Developer -Position1 Design, build, test, and deploy Cloud (preferably Azure or AWS) based software solutions that provide high availability, scaling and predictable support costs.Work independently and as part of project teams delivering mission critical applications.Build proof of concepts using new technology as part of maintaining and evolving a best-in-class technology architecture.Mentor junior members of the team though code reviews, design sessions and regular interactions2. Technology Lead- Position2 Design, build, test, and deploy Cloud (preferably Azure or AWS) based software solutions that provide high availability, scaling and predictable support costs.Work independently and as part of project teams delivering mission critical applications.Build proof of concepts using new technology as part of maintaining and evolving a best-in-class technology architecture.Mentor junior members of the team though code reviews, design sessions and regular interactionsDesired Candidate Profile  1. Senior Technology Developer(1 open position)8+ years as a professional software developerIn depth understanding Understanding of basic OOAD design principles and standard design pattern and their application in effective modular and performant code developmentStrong software development skills using Opensource Technology stack (Java/J2EE, Node.js etc.) and SQL/NoSQL databases (MS SQL Server, MongoDB or others) and Cloud environment (AWS or Azure)Practical experience building Adaptive-Responsive Web applications through implementation of Microservices framework (Spring Boot or others) with REST APIs and integrations over any flavors or enterprise messaging platforms (open source or proprietary Message Bus, MQ etc).Practical experience designing and developing rich omnichannel web application leveraging HTML5, JavaScript tools/libraries (JQuery, Angular, Bootstrap or ReactJS)Exposed to Agile methods of Delivery models (Scrum, Kanban etc) and familiarity with associated tools (like JIRA or IBM ALM) and processes/procedural standards.Well versed with TDD style of software development through a test first fail fast approach through automated unit testing, integration testing and performance testing.Thorough and conversant in using CI/CD (DevOps and/or DevSecOps) technologies and frameworks (like Kubernetes, Maven, Gradle etc.) especially in containerized (Docker, Kubernetes cluster etc.) Cloud (Azure/AWS) deployment environment.Have prior experience in Salesforce CRM and/or Service Cloud and its associated marketplace delivery components through APEX framework.Preferred Experience in Python and/or Node.js for server-side development.Any prior experience in BPM tools like jBPM, Mulesoft, Pega etc.Experience using any industry standard data integration tools like Knime, Pentaho, Informatica or others.Practical experience in any industry grade enterprise event or messaging platform. Practical experience in API level integration with external systems (e.g. SAP, SFDC, Oracle ERP, ServiceNow etc.).Experience working in an Agile environment. 2. Technology Lead(1 open position) Required Overall 10+ years of as a professional software development experience and 2+ years in leading small/midsize team of senior or junior developers.Mature understanding of OOAD design principles and standard design patterns and their application in effective and performant software module design and code developmentStrong software development skills using Opensource Technology stack (Java/J2EE, Node.js etc.) and SQL/NoSQL databases (MS SQL Server, MongoDB or others) and Cloud environment (AWS or Azure)Led team for at least 2 such web applications in recent past. Practical experience building Adaptive-Responsive Web applications through implementation of Microservices framework (Spring Boot or others) with REST APIs and integrations over any flavors of enterprise messaging platforms (open source and/or proprietary).Practical experience designing and developing rich omnichannel web applications leveraging HTML5, JavaScript tools/libraries (JQuery, Angular, Bootstrap or ReactJS)Exposed to Agile methods of Delivery models (Scrum, Kanban etc) and familiarity with associated tools (like JIRA or IBM ALM) and processes/procedural standards.Well versed with TDD style of software development through a test first fail fast approach through automated unit testing, integration testing and performance testing.Thorough and conversant in using CI/CD (DevOps and/or DevSecOps) technologies and frameworks (like Kubernetes, Maven, Gradle etc.) especially in containerized (Docker, Kubernetes cluster etc.) Cloud (Azure/AWS) deployment environment.Strong experience in Salesforce CRM and/or Service Cloud and its associated marketplace delivery components through APEX framework.Preferred Experience in Python and Node.js for server-side development.Prior experience in BPM tools like jBPM, Mulesoft, Pega etc.Experience using any industry standard data integration tools like Knime, Pentaho, Informatica or others.Practical experience in any industry grade enterprise event or messaging platform. Practical experience in API level integration with external systems (e.g. SAP, SFDC, Oracle ERP, ServiceNow et", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "Doctorate": "None", "Key Skills": ["Java", "Rest", "OOAD", "MySQL", "J2Ee"]}