{"Job Title": "Senior Security Engineer", "Company": "Freshdesk", "Experience": "5 - 8 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "      Responsibilities :   Examine the products in detail to discover vulnerabilities and collaborate with the other security engineers to practically demonstrate the exploitability and risk factors.   Be at the forefront of emerging vulnerabilities/threats which could affect Freshworks products through independent research and study. Engage with the developers in developing workarounds/mitigation plans and ensure they are implemented per policy.   Engage with the development teams to conduct secure design reviews/threat modeling exercises to enumerates threats and mitigation strategies.   Enable the developers with knowledge of threat modeling by conducting focused workshops.   Priorities critical defects and ensure these are identified and mitigated during the sprint.   Integration and automation of SAST in the DevOps pipeline.   Build secure coding principles and propagate them across the development community.   Be the togo person for developers in solving critical issues relating to secure product development.   Build and enhance secure coding/security assessments training contents for developers and the QA team.   Deliver training programs at various levels in the organizations.   Conduct workshops/security tech-talks to disseminate security knowledge and awareness.   Master or Bachelor of Engineering in Computer Science / Engineering, Masters in Computer Science, Bachelor of Science in Computer Science.    5 to 8 years of experience   in application security, desirable to have 2 years of software development experience.   Expert-level knowledge in multiple classes of vulnerabilities that includes cross-site scripting, SQL Injection, CSRF, cryptographic-related weakness, and code injection.   Good knowledge in SAML / OAuth / Open ID Connect.   Good knowledge of programming/scripting languages such as Java, Ruby, and Python.   Good knowledge relating to services/technology relating to the cloud.   Ability to automate security testing and improve productivity in security assessments.   Basic understanding and knowledge of web frameworks and architecture.   Ability to communicate and interpret security vulnerabilities to various audiences such as development and management teams.   Experience in conducting security assessments in cloud platforms (SaaS, PaaS, IaaS).   Published CVEs / research papers/articles pertaining to the security of the application layer and related protocols.   Experience in integrating and automating security in DevOps through implementing / building orchestration tools.   Good security development experience in Java / Ruby on Rails.  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Automation", "GIT", "Coding", "PAAS", "Security testing", "Application security", "SAML", "SQL", "Python"]}