{"Job Title": "SOFTWARE DEVELOPMENT ENGINEER", "Company": "McAfee Software (India) Pvt. Ltd", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "   Role Overview:       As a Software Development engineer, you will report to the Manager, Software Engineering. You will help develop next-generation security solutions for SAAS applications.       About the Role:       Exposure to developing Web-based applications with 5+ years of experience. Build solutions to secure data in SAAS applications.   Have understanding of AWS services and expertise in deploying, and debugging cloud-based applications using AWS.   Work with product manager to analyse the requirements, create standardized solutions across partners.   Work with Architect to create end-to-end cloud solution, ensuring high scalability, availability, performance and cost optimization.   Estimate, prioritizing and planning project deliveries.   Troubleshoot customer issues and work with appropriate development, product teams on issue resolution on end-to-end basis.   Passion to work with demanding customers Document, user stories/use cases, functional specification and design.         About You:       5+ years of solid experience in designing and development of native Cloud/API-based software solutions, with a deep focus on usability, performance and integration with downstream web services.   Objective Oriented skills with a nifty ability to create clean interfaces and operate at the right levels of abstraction.   Solid coding skills using   Java programming   language Exposure to designing and scaling solutions with Amazon Web Services (AWS).   Experience working with NoSQL and SQL DBs.   Exposure to Micro-services Architecture for cloud components and its pros and cons.   Experience to convert a problem statement to a design and Implementation.   Participate in weekly code reviews with Engineers.   Can understand impact of code changes- both programmable and logical changes.   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["NoSQL", "Web services", "Coding", "Diversity and Inclusion", "SAAS", "Debugging", "Cloud", "Issue resolution", "Downstream", "SQL"]}