{"Job Title": "Automation Engineer", "Company": "SenecaGlobal IT Services Pvt. Ltd", "Experience": "3 - 5 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "  Job Description     Design, develop and maintain functional, integration, regression and endtoend automated test help the team improve testing process, test coverage and test quality.   Partner with Software Development colleagues to enable their contribution to automation.   Participate as a Scrum team member and be an advocate for quality best practices Experience and Skills.   Extensive knowledge of ability to write/code test automation using JavaScript ES6 and WebdriverIO   Experience designing, automating & executing tests based on high level requirements and descriptions   Ability to analyze and code complex test automation modules utilizing test automation frameworks in CD/CI environment, define data structures, and specify test and automation tools.   Demonstrated ability in using Data Structures to handle large amounts of data.     Required Candidate profile     Implementation of hybrid UI Automation framework using JavaScript ES6, WebdriverIO, and CSS Selectors   CI/CD implementation using Jenkins.   Problem Solving - Ability to solve/develop complex automated tests for hybrid web application   Hands-on experience in Agile methodology   Excellent communication skills with experience working with US based clients   Good experience in jQuery, html5, Core Java, selenium   Knowledge and experience writing custom test automation scripts and frameworks in Java, JavaScript.   Excellent understanding in SDLC and STLC   Ability to create good acceptance and integration test automation scripts and integrate with Continuous integration (Jenkins)   Experience in IDE : Preferably Eclipse   Experience with Version Control : GIT   Knowledge of Frameworks : Keyword Driven, Data Driven and Hybrid.     Experience: 3-5 Years     Qualification:   BTech/BS/BE/MTech/MS/ME from a reputed engineering institute ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization, Any Graduate in Any Specialization", "PG": "M.Tech in Any Specialization", "Doctorate": "None", "Key Skills": ["automation framework", "Core Java", "jQuery", "Version control", "Eclipse", "Javascript", "Data structures", "Scrum", "Selenium", "SDLC"]}