{"Job Title": "Platform Engineer", "Company": "Exponential", "Experience": "4 - 10 years", "Salary": "Not Disclosed", "Location": "Remote", "Job Description": "  We are looking for engineers who are driven to solve challenges of large-scale system design, artificial intelligence, information retrieval, massive data pipelines, UI design, richmedia frameworks, data insights, optimization and targeting strategies. We are looking to hire Lead Engineer, Staff Engineer, Senior Staff Engineer and Principal Engineers across the board for our engineering team which consists of roles in Data platform, Bidder platform and Platform Apps teams.   Responsibilities      The position requires one to work on complex technical projects with peers in an innovative and fast-paced environment.     Play an individual contributor role with high accountability, positive impact in small teams and work well both as an individual and as part of the team.     Mentor peers, share information, knowledge and help build a great team.     Work as a full stack engineer, with bias to learning and adopting new technologies over time.      Required Skills      Excellent problem-solving skills with a strong foundation in Computer Science including core data structures, algorithms and analysis of running time and memory requirements.     Develop scalable and reliable software for internet scale.     Be able to create prototypes, examples to demonstrate the concepts.     Experience with designing and developing REST APIs, microservices.     Experience with developing and delivering production systems using Java.     Experience with multithreading and concepts of concurrency.     Experience with Kafka, Data streaming paradigms.     Experience with relational and NoSQL databases.      Desired Skills      Experience with Typescript, React, NodeJS.     Experience with Hadoop or other MapReduce paradigms.     Experience with Data warehouse, Data Lake systems.     Experience with python notebooks.      Qualifications      Bachelor’s/Master’s in Engineering with 4 - 10 years of hands on experience in Software development.   ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Computer science", "Multithreading", "NoSQL", "Artificial Intelligence", "Team Mentor", "Data structures", "System design", "Information retrieval", "Individual Contributor", "Python"]}