{"Job Title": "Chat App Developer", "Company": "ZIPGRID Community Ecosystem Platform", "Experience": "1 - 4 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": "Chat App Developer General Description Proficient in developing Chat Applications on XMPP servers.  Understand requirements around functionality and translate those requirements into elegant functional solutions.  Build prototypes at tech scoping stage of projects Optimising performance for the apps  Keep up to date on the latest industry trends in the mobile technologies  Explain technologies and solutions to technical and non- technical stakeholders Excellent testing/   QA skills Proven commercial software development experience desktop and mobile  Published examples of chat applications on the App store & the IOS market   Excellent knowledge in information architecture,   human computer interaction and usability design principles.   Ability to use analytic data and user testing to inform design decision   A passion for new consumer technology and the emerging media landscape  Ability to multi task and good time management skills  Ability to work on their own and as a part of the team  Excellent scoping and estimation skills  Excellent communication skills (verbal and written) to liaise with various departments locally and internationally.  Work Experience Requirement Minimum 1- 4 years work experience in the listed skillset. Graduation in Computer Science Engineering or Masters in Mathematics. Essential Skills Strong OO design and programming skills in Android & XMPP Knowledge of NoSQL & chat backend system. Experience on web service integration (REST,   JSON,   XML) Experience building web and native apps Attention to Detail  Good Interpersonal skills  Dedicated to ensure closure.  Apply For Job ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Interpersonal skills", "Web technologies", "Time management", "XML", "Service", "JSON", "Application", "xmpp", "Android"]}