{"Job Title": "Software Development Engineer - Ruby on Rails", "Company": "MyUpChar", "Experience": "2 - 6 years", "Salary": "Not Disclosed", "Location": "New Delhi", "Job Description": "Roles and ResponsibilitiesJob Title: Software Development EngineerJob Overview :Want to be a part of an innovative healthcare startup in India with an energetic team, long term vision and top global investors backing? We are looking for RoR developers who are passionate to design, build, and maintain efficient, reusable, and reliable Ruby codeMandatory skills :- Good Communication Skills- Rails 3.x, Rails 4.x, Rails 5.x- AGILE Methodology- jQuery, AJAX, MYSQL 5.x, Apache- Experience in Git, SVN and Deployment- Rails specific server administration- Should have good knowledge of latest trends and developments in Ruby and Rails communityRoles &Responsibilities :- Independently execute the project (requirements gathering, analysis, low level design, development, testing, deployment)- Provide technical feedback and cost analysis on project features- Coordinate with the stakeholders for the on-going process of technical discussions, status updates etc- Provide technical assistance and implementation for interfacing with 3rd party APIs- Evaluate and add open source components based on project needs- Mentor and assist other developers- Should have developed at least one complex application using these tech stacksNice to have skills :- NoSQL databases- Have worked on AWS Cloudsearch- Contribution to the community in the form of gems, plugins or technical articlespublications.Nice to have skills :- Experience with search engines like Elasticsearch, SOLR.- Have working knowledge of AWSDesired Candidate Profile :- Experience : 2yrs - 6yrs- Good Communication and Interpersonal skillQualifications:- UG : B.TechB.E. - Any Specialization, BCA - Computers, B.Sc - Any Specialization- PG : M.Tech - Any Specialization, MCA - Computers, MSM.Sc(Science) - Any Specialization", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization, BCA in Computers, B.Sc in Any Specialization", "PG": "MCA in Computers, MS/M.Sc(Science) in Any Specialization, M.Tech in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["Ruby on Rails", "jQuery", "Git", "MySQL", "CloudSearch", "Apache Server", "Agile", "SVN", "AWS", "AJAX", "Server Administration"]}