{"Job Title": "QA Automation Engineer", "Company": "Contus", "Experience": "6 - 11 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "   Are you an experienced QA Automation Engineer looking for a company the truly values your critical contributions to their software development. You have a strong foundation in building automation frameworks for the testing Web and Mobile applications. Contus we seek to empower a QA Automation professional to grow with our talented technical team. As a QA Automation Engineer, you will participate in the development of business solutions by analyzing requirements, creating test plans, test cases, automated test cases, and testing all aspects of the completed solution.      Required Skills:    Excellent written and verbal communication skills    Ability to write meaningful test cases, execute test cases and record results    Knowledge of testing methodologies and how to apply them (white box, equivalence class partitioning, pairwise, state transition, boundary value, decision table)    Experience with at least one Test Case Management tool (TestRail,EggPlant, TestLodge, etc)    Experience testing AWS cloud-based web Mobile(REST)    Solid knowledge and understanding of software development life cycle, software concepts, test methodologies and their application    Strong backend testing experience is critical    Proven Experience in test automation (Cucumber, Selenium)    Ability to adapt quickly to a complex environment and learn new concepts    Experience in Agile software development environment preferred    Understanding of Change and Release Management    Undergraduate degree in Information Technology, Computer Science, Engineering, or a related field required    6+ years of overall experience in Test/QA    REST API testing experience    NoSQL data store experience    Experience with Docker and Selenium    Experience with Atlassian suite: Jira, Confluence, etc    Experience with CI (Jenkins or Bamboo)    Experience with product solutions that include a hardware component    Experience with Cloud deployments: AWS,GCP      Key Responsibilities:    Provide input on User Story creation from the testing perspective    Create Test Plans, Test Scripts, Test Cases and Test Data    Record test results (open new tickets, close existing tickets)    Attend design meetings with Developers, Test Automation Engineers and Architects and provide perspective to improve testability    Triage issues reported in the field by attempting to recreate in local test environment    Install, configure and operate the product in test and production environments     ", "Role": "Quality Assurance/Quality Control Executive,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - QA & Testing,", "Employment Type": "Full Time, Permanent", "Role Category": "QA/Testing/Documentation", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Backend", "Test scripts", "Agile", "Selenium", "Test cases", "JIRA", "Information technology", "Release management", "White box"]}