{"Job Title": "Database Engineer", "Company": "CREDITSAFE TECHNOLOGY PVT LTD", "Experience": "5 - 10 years", "Salary": "₹ 3,00,000 - 8,00,000 P.A. ", "Location": "Hyderabad/Secunderabad", "Job Description": "Roles and Responsibilities 5+ years solid commercial experience of Oracle development under a 10g or 11g environment. • Advanced PL/SQL knowledge required. ETL skills  Pentaho would be beneficial Any wider DB experience would be desirable e.g. Redshift, AuroraDB, DynamoDB, MariaDB, MongoDB etc Cloud/AWS An interest in learning new technologiesExperience in tuning Oracle queries in large databases. • Good experience in loading and extracting large data sets. • Experience of working with an Oracle database under a bespoke web development environment. • Analytical and critical thinking skills; agile problem-solving abilities. • Detail oriented, self-motivated, able to work independently with little or no supervision, and is committed to the highest standards of quality for the entire release process. • Excellent written and verbal communication skills. • Attention to detail. • Ability to work in a fast paced / changing environment. • Ability to thrive in a deadline driven, stressful project environment.3+ years of software development experienceResponsibilties :Write code for new development requirements as well as provide bug fixing, support and maintenance of existing code. • Test your code to ensure it functions as per the business requirements, considering the impact of your code on other areas of the solution. • Provide expert advice on performance tuning within Oracle. • Perform large-scale imports and extracts of data. • Assist the business in the collection and documentation of user's requirements where needed, provide estimates and work plans • Create and maintain technical documentation. • Follow all company procedures/standards/processes. • Contribute to architectural design and development making technically sound development recommendations. • Provide support to other staff in the department and act as a mentor to less experienced staff, including through code reviews. • Work as a team player in an agile environment. • Build release scripts and plans to facilitate the deployment of your code to testing and production environments. • Take ownership of any issues that occur within your area to ensure an appropriate solution is found • Assess opportunities for application and process improvement and share with team members and/or affected partiesDesired Candidate Profile Perks and Benefits ", "Role": "Database Architect/Designer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - DBA, Datawarehousing,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "MCA in Computers", "Doctorate": "None", "Key Skills": ["PLSQL", "11G", "MongoDB", "Oracle Development", "PL", "AWS", "Oracle 10G"]}