{"Job Title": "Engineering Manager", "Company": "Freshdesk", "Experience": "10 - 12 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "  Overview:    Freshworks seeks an experienced Engineering Manager to lead a growing team of Engineers that builds and scales one of our many products. As a technical leader, you own the engineering vision and oversee the technical standards your team thrives on. As a manager of engineers, you coach and develop our promising, young talent and ensure their collective energy is applied effectively and efficiently to accomplish not only the organizational goals, but also their individual career goals. An accomplished record as an individual contributor and experience managing an engineering team is expected to fill these shoes.   Responsibilities:   Own the development practices and standards for your team   Own the technical architecture, drive engineering design and shoulder critical decisions   Understand, prioritize and deliver the feature roadmap while chipping away at the technical debt   Work effectively with a cross-functional team of product managers, designers, developers and QA   Own the communication of the team s progress and perception of the team itself   Collaborate with the Support team to keep track of and triage technical issues and track them through to resolution   Collaborate with Talent Acquisition to drive sourcing, screening, interviewing and recruitment of the right talent for your team   Continuously improve the productivity of your team by identifying investments in technology, process and continuous delivery   Own the morale of your team, unblock them at critical junctures, break ties in a timely manner   Own the careers of your team members, deliver regular and timely feedback, represent your team for annual reviews and reward your performers    Requirements:   Education: Bachelor's Degree in technical field OR equivalent work experience   A minimum of 10 years of relevant professional work experience   A minimum of 6 years of object-oriented software development experience as an individual contributor   Experience developing software in a commercial software product development environment   A polyglot in programming languages with the ability to learn new technologies as the need arises   Experience leading teams that built software products for scale   Clear and confident spoken and written communication ", "Role": "Product Manager,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["SAN", "GIT", "Talent acquisition", "Machine learning", "Customer support", "Engineering Design", "Customer engagement", "cisco", "CRM", "Recruitment"]}