{"Job Title": "Lead QA Engineer", "Company": "Droom Technology Pvt. Ltd.", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": " As Lead QA Engineer, you will be responsible for developing manual and automated testing strategies, executing of test plans, mentor other members of QA team, developing management dashboards for reporting software quality metrics and trending.    As an engineering resource at droom, you will work on new challenges on daily basis, you will focus on problem solving, and you will interact with our Silicon Valley based technology team on a regular basis. We will operate in world-class and very fast-paced engineering environment and you will be learning new things and making huge impact at the same time.    An ideal candidate will possess following:     Engineering/M.C.A in Computer Science or equivalent Experience in developing Android apps to work with low bandwidth networks.   3+ years of experience in testing, test methodologies and automation tools.        Must have experience of open source test automation tools.        Must 2+ years of hands-on experience in testing web applications, preferably implemented in PHP/Java.        Knowledge of Databases and Knowledge of Networking Concepts is preferable.   Knowledge of Linux Based User Command preferable.    Excellent verbal and written communication skills.    Experience with bug tracking systems like bugzilla, mantis, Jira, etc.        Full understanding in software development process and prior experience in Agile or Extreme programming Methodology.        Extremely good communications and interpersonal skills.    Result oriented and ready to take ownership.    Desire to make impact and high work ethics.  ", "Role": "Testing Engineer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - QA & Testing,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "MCA in Computers", "Doctorate": "None", "Key Skills": ["Computer science", "Linux", "Networking", "Agile", "PHP", "software quality", "Open source", "JIRA", "Bugzilla", "Android"]}