{"Job Title": "Senior Solutions Engineer - ASEAN", "Company": "Freshdesk", "Experience": "4 - 8 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "  As a Senior Solutions Engineer, your primary responsibilities include :      Work closely with our customers in ASEAN to identify and solve their most critical business problems.     Support the sales team by conducting discovery calls and product demonstrations for our active deals.     Conduct effective requirements gathering to clearly identify customer problems.     Build and deliver compelling demonstrations of the Freshworks products.     Articulate the value of Freshworks solutions to a variety of audiences.     Be a lifelong learner and develop your skills continuously.     Evangelize a refreshing user experience on the Freshworks platform.      Job Requirements      We re looking for entry level professionals with 4-8 years of professional experience. Any experience as a Pre-Sales/Solution Engineer or in any technical role is a plus.     Excellent soft skills and presentation skills are a must for this role. You will rely on the skills every single day!     You should be capable of working on a cross-functional team to solve business tech problems.     You must possess solid verbal, written, presentation and interpersonal communication skills.     You will work on multiple deals every month. Proven time management skills in a dynamic sales environment will come in really handy!     We re looking for highly driven individuals with an execution focus and a strong sense of urgency.     Preferred ITSM/CRM presales experience.     Knowledge of related applications, relational database and web technology (HTML, CSS, Javascript)   ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["SAN", "GIT", "Sales", "Social networking", "Javascript", "Presales", "HTML", "Customer engagement", "cisco", "CRM"]}