{"Job Title": "Senior Software Development Engineer", "Company": "Aveva", "Experience": "7 - 9 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "About Our OpportunityAre you ready to join the global leader in engineering and industrial software? You’ll be part of a team that drives digital transformation to over 16,000 customers across the globe and strives for excellence every day.There are 4,700 of our people in more than 40 countries who challenge themselves and each other to create and improve the transformative technology our customers need. With our help, industries across the world can make a positive difference to the lives of people everywhere.We take pride in our core values and the diversity of our people, valuing the unique experience and expertise that people from different backgrounds bring to our business. At AVEVA, we’re all about Limitless possibilities. Are you?Senior Software Development Engineer: Skills and experiences required:• 7-9 years of experience working in Microsoft Technology stack• Proficient experience with C#, Java Script and .Net • Experience and applicable knowledge in backend development in C#, relational databases, NoSQL, Web services and cloud infrastructure.• Experience and applicable knowledge with HTML 5, CSS3 and Angular 6+• Development from specs - Ability to find requirements and break them down into an actionable execution plan for the team and proactively identify problems.• Analytical ability – recognize the factors and circumstances involved in a problem and break down / simplify the problem using clearly defined criteria • Innovation and Creativity – to show a willingness to understand innovative ideas and to apply new insights to existing situations • Solution Design – Ability to define and describe an architecture of a system and understand the cause and effect of their coding• Work experience in agile environment • Collaborative communication skills (written and oral) - Ability to convert technical concepts into non-technical• Very good written and verbal communications in English• Quality and teamwork oriented", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["C#", "DIV", "Software Development", "Web Technologies", "Html5", "Javascript", ".Net", "HTML", "Angular", "Web Services"]}