{"Job Title": "Lead / Senior DevOps Engineer", "Company": "Sorice Solutions", "Experience": "3 - 7 years", "Salary": "Not Disclosed", "Location": "Kochi/Cochin", "Job Description": "   Responsibilities:     Serve as key leader and expert on DevOps practices     Implement and support Continuous Integration and Deployment Pipelines.     Build and support Automation for deployment of various components of the product and Non-Production ecosystem.     Schedule, implement, and automate security compliance patching and updates on Development, QA and production clusters.     Work with the Operations team to build production deployment processes & systems.     Ensure continuous availability of various tools supporting SCM & Release Management including Source Control, Continuous Integration, & Change Management.     Engage with cross-functional co-located teams in implementation of enterprise scalable features related to enabling higher developer productivity, environment monitoring and self-healing, and facilitate autonomous delivery teams.     Support troubleshoot and analyse code on all 3 layers of the stack related to infrastructure, middleware, and continuous integration and delivery frameworks.     Responsible for deploying code and other proactive maintenance activities to keep the services up and running     Production Release Implementation plan and Install Support     Developer Efficiency Tools (Focusing on Freeing up Development staff to focus on deliverables)     Integrating Code Quality tools and Code Analysis tools into IDE s     Implementing Automation to improve coding efficiency     Integrations with SCM Tools     Integrations between various Observability tools.     Automations that enhance Site Reliability Engineering practices.     Improve our foundational framework for CI/CD     Mentor junior members in the team     Work collaboratively across team boundaries to share common capabilities     Required Skills/Expertise:     3-7 years of relevant work experience in DevOps     Should have hands on and good understanding on DevOps tools and automation framework     Must have hands-on experience with DevOps techniques building continuous integration solutions using GitLab/Jenkins/TeamCity     Must have experience in Git, Maven, SonarQube.     Hands-on experience working with Docker containers.     Good understanding and hands-on experience working with Kubernetes is a must.     Good understanding in setup and maintenance of Network and security in Kubernetes clusters.     Hands on experience working on Google Cloud (Preferable), AWS or Azure.     Must be proficient in one or more scripting languages like Unix Shell.     Knowledge and experience with Linux OS     Should have working experience with Observability tools like ElasticSearch, kibana, Promethues, Graphana.     Hands on experience in at least one of the programming languages such as Python, Java, Golang etc.     Experience in at least one of the configuration management tools such as Ansible/Chef/Puppet     Should have some experience working with Relational and NOSQL Databases.  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Unix", "Maven", "Change management", "Linux", "Coding", "Configuration management", "SCM", "Middleware", "Release management", "Python"]}