{"Job Title": "Urgent Requirement For Medical Coders (ED Facility/Surgery/Ipdrg)", "Company": "Access Healthcare Services Pvt Ltd", "Experience": "1 - 5 years", "Salary": "Not Disclosed", "Location": "Mumbai, Pune, Chennai, Coimbatore", "Job Description": "Greetings from Access Healthcare!!Hope you are doing well...Access Healthcare provides business process outsourcing and applications services, and robotic process automation tools to healthcare providers, payers, and related service providers. We operate from 12 delivery centers in the US, India and the Philippines, and our 8,000+ staff is committed to bringing revenue cycle excellence to our customers by leveraging technology, emerging best practices, and global delivery. To learn more about Access Healthcare, visit accesshealthcare.comOpenings for below mentioned specialties, Coimbatore location1. Surgery Coding (Certification is mandatory) 2. ED Facility (Certification is mandatory) 3. IPDRG (Certification is mandatory) 4. Observation coding (Certification is mandatory) Chennai location1. Surgery Coding (Certification is mandatory) 2. ED Coding Facility (Certification is mandatory)3. E/M OP (Certification is mandatory) 4. IP DRG Coding (Certification is mandatory) 5. Denial Coding ( Certification is not mandatory)6. Observation coding (Certification is mandatory) Mumbai location1. Surgery Coding (Certification is mandatory) 2. ED Facility (Certification is mandatory)3. IP DRG Coding (Certification is mandatory) Pune location1. ED Facility (Certification is mandatory)Experience: 1 to 5 YearsShift: Day shiftCompensation: We offer highly competitive work environment with best in the business compensation package Note : Freshers is not Eliible Contact Person : Suhasini (HR)* Interested Candidates Please do call me or Text me on ( 9840064094 ) to Arrange Telephonic Interview.", "Role": "Clinical Research Associate/Scientist,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "Medical, Healthcare, R&D, Pharmaceuticals, Biotechnology,", "Employment Type": "Full Time, Permanent", "Role Category": "R&D", "UG": "B.Sc in Bio-Chemistry, Biology, Botany, B.Pharma in Pharmacy, Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Er Coding", "E/M", "Evaluation and Management", "SDS", "same day surgery", "denials", "facility coding", "emergency department", "Medical Coding", "outpatient coding", "Observation coding", "Surgery", "outpatient surgery", "IPDRG", "certified", "ED", "ambulatory surgery"]}