{"Job Title": "Device Management Engineer", "Company": "DataSpeaks Services Private Limited", "Experience": "7 - 12 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "     Specific responsibilities and expectations include but not limited to:   Must have a minimum of 7 years of technical experience with client configuration management technologies.  Expert knowledge of Microsoft System Center Configuration Manager 2012 R2 and above.  Real world experience in designing, deploying, maintaining, upgrading and remediating issues with SCCM infrastructure.  Expert knowledge creating operating system imaging task sequences using Microsoft Deployment Toolkit  (MDT) and SCCM.  Advanced experience in design and administration of Mobile Device Management platforms (e.g. MobileIron, InTune, AirWatch)  Expert knowledge of PowerShell scripting design and troubleshooting  Extensive knowledge of application packaging using Flexera AdminStudio, Wise, InstallShield and other  application capture technologies (App-V, AppVolumes)  Advanced knowledge of Active Directory and Group Policy management.  Define, design, build, standardize and improve device management solutions  Define advanced monitoring strategies and automated systematic remediations to improve system  availability and performance  Define and improve backup strategies for data recovery in the event of system outages  Create and maintain documentation including operations manuals, procedure, problem resolution and root  cause analysis documents.  Collaborates with architecture teams to execute POC initiatives to vet new technologies and solutions  Participate in proof of concept initiatives to vet new technologies and solutions  Participates in special projects and performs other duties as assigned.  Ability to work in Agile (Scrum) environment desired.    Primary Technology Expertise Requirements   Microsoft System Center Configuration Manager 2012 R2 and above  Microsoft Deployment Toolkit (MDT) and SCCM Task Sequence design, administration and troubleshooting  Active Directory and Group Policy management of endpoints  Mobile Device Management (MobileIron, InTune, AirWatch)  Microsoft Windows 7, 10, 2012 R2, 2016 and macOS  Application Packaging Tools (Flexera AdminStudio, Wise, InstallShield, app capturing such as App-V and  AppVolumes)  PowerShell scripting     ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Application packaging", "App-V", "Powershell", "Configuration management", "Active directory", "mobile device management", "Troubleshooting", "SCCM", "Monitoring", "Installshield"]}