{"Job Title": "Software Development Engineer -III Backend(Product Engineering)", "Company": "Exotel", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": " Product Engineering Team @ Tech @ Exotel The Product Engineering Team builds applications and products enabling customers to use our core services such as Voice and messaging, grammatically.    The team builds endpoints with Identity, Authentication, and Management layers for other developers/programs to consume our core services.    Examples include integration into other CRM services such as Zoho, Freshdesk, etc OR into customers own workflows. It also focuses on building the work-flows as UI elements that can be used by customers.    Software engineering within the Product Engineering team involves all aspects of software engineering: designing and architecting services and features, development, testing, instrumentation, deployment, stabilization, and operations.   You will be working on the core cloud telephony platform and products.     What we are looking for   We are looking for technically very strong candidates, with a strong understanding of computer systems.    We want people who love designing and building infrastructure components and large complex services.    We are looking for engineers driven by a passion to create applications systems that can redefine the contact center communication space.     What you will do   You will be a part of the Product Engineering team at Exotel.    Specifically, we are looking for engineers for building services and dashboard backends that help customers use Exotel in a variety of ways.    Responsibilities include end-to-end software engineering aspects: Designing and architecting and plan systems and services Development Testing Deployment Instrumentation, dashboarding and monitoring Debugging production issues and handling production incidents Project Stakeholder management Mentoring and technical evangelizing    Must haves 5+ years of experience with a Bachelor / Masters Degree in Computer Science or equivalent.    1+ years of end-to-end application services development experience in product engineering organizations.    Very strong in Computer Science fundamentals    Expertise with one of Java / Go / Scala / C++ / C / C#    Experience in web Services, REST APIs / SOAP / RPCs.    Experience building large scale distributed systems OR done core systems programming    Knowledge of different data stores, data modelling and scaling them    A DevOpsmindset.    You own what you will develop.    Excellent written and verbal communication skills, with strong attention to detail and a head for problem-solving.    Team-player, flexible and able to work in a fast-paced environment     Good-to-haves    Exposure to telephony protocols, ISDN, SIP, WebRTC others like TCP/UDP etc.    Comfortable scripting in at least one of PHP / Ruby / Python Knowledge of Linux    Exposure to AngularJS, Express.js, React, and Node.js and/or other js libraries    Exposure to database like Mongo, Redis, Mysql or other relations dbs    Strong understanding of Microservice design and distributed architecture   Exposure to build and deploy pipeline and tools  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["TCP", "C++", "Linux", "Coding", "MySQL", "Debugging", "PHP", "SIP", "CRM", "Python"]}