{"Job Title": "Software Development Engineer", "Company": "Staffio HR", "Experience": "6 - 11 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   Responsibilities:    As a Lead Software Engineer you will work closely with Principal Engineers and Engineering Managers to design, implement, and deploy applications that impact Rupeek s business with an emphasis on Mobile, Payments, Core Platform, and Analytics.     Drive the architecture and design of large-scale, multi-tiered, distributed software applications, tools, systems and services using object-oriented design, distributed programming, Java, and C/C++.     Gather business and functional requirements from external and/or internal customers and end-users, and translate requirements into technical specifications to build robust, scalable, supportable solutions that work well between a range of complex systems.     Serve as technical lead throughout the full development life-cycle, end-to-end, from scoping, planning, conception, design, implementation, and testing, to documentation, delivery, and maintenance.     Provide design reviews for other engineers, including feedback on architecture and design issues, as well as integration, performance and scalability.     Manage engineers on multiple technical projects and ensure schedules, milestones, and priorities are compatible with technology and business goals.    Desire -Skills & Qualifications    A Bachelor s degree in Computer Science or equivalent combination of technical education and work experience.     6 + years of Software Development experience. At Least 5 years experience handling large scale distributed systems.     Experience in system design, distributed systems, relational and No-SQL databases.     Strong, object-oriented design and coding skills (C/C++ and/or Java preferably on a UNIX or Linux platform)     Solid software development background including design patterns, algorithms, data structures, test-driven development     Any previous experience in working with Big Data or leveraging machine learning in improving consumer experience is desirable.     Excellent verbal and written communication skills.  ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Unix", "Computer science", "C++", "Linux", "Coding", "Data structures", "System design", "Distribution system", "Analytics", "SQL"]}