{"Job Title": "Staff Software Development Engineer", "Company": "Apptio INC", "Experience": "12 - 17 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  We are looking for a Principal Software Engineer who is passionate about building large scale services optimized for performance, efficiency, and handling lots of data. You will be responsible for designing new services, revamping existing ones, and guiding the team s overall system design and architecture.    As part of our growing team, you will:    Build cloud-natives services that solve new and existing business challenges and customer needs.   Design and implement resilient systems and that horizontally scale.   Dive into complex architectures and research and identify new technologies to solve tough problems.   Influence multiple teams and hold a high bar for systems architecture, operations, and quality.   Mentor and foster career growth for junior engineers.     Basic Qualifications:     12 to 17 years of experience in enterprise level software architecture, design, development (architecture, design patterns, reliability and scaling) of new and current systems   Experienced in Full Stack product development   Bachelor s Degree in computer science or a related field   Computer Science fundamentals in data structures, algorithm design and problem solving.   Extensive knowledge and deep understanding of Java and related technologies   Experience with modern software development methodologies: Agile/Kanban, CI/CD, DevOps, etc.   Proficiency in Full Stack product development   Proficiency with Java is essential.   Proficiency with React, TypeScript, JavaScript, HTML CSS is essential   Proficient with REST APIs   Proficient with product development experience on both front end and back end   Experience with AWS and/or other public cloud technologies.   Database Experience (query optimization, index generation, caching) or NoSQL DBs a plus     Preferred Qualifications:     Strong customer focus, ownership, and drive   Demonstrated capability to provide depth and breadth technical leadership   Experience in SaaS Solutions   At least one additional modern programming language, such as Go, Scala, Python.   Good knowledge of advanced concepts in microservices, containers   Experience in mentoring, recruiting, and team-building   Strong communication skills, both written and verbal   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Front end", "Managed services", "query optimization", "Javascript", "Agile", "Data structures", "System design", "HTML", "Python"]}