{"Job Title": "Medical Coder CPC Online Certification", "Company": "Yogam BPO", "Experience": "0 years", "Salary": "Not Disclosed", "Location": "Hosur, Salem, Coimbatore, Erode, Vellore Chennai, Ambur Vaniyambadi, Arakkonam Tiruttani, Asthampatti Namakkal, Ayanavaram Adayar", "Job Description": "Online Training available. Healthcare facilities prefer to hire candidates who have completed formal training and passed exams with quality for professional certifications. Completing online certification program will improve your employment prospectRequired Candidate profileTRAITS AND STRENGTHS NEEDED TO BE SUCCESSFUL IN MEDICAL CODING CPC WILLING TO WORK IN HEALTHCARE INDUSTRYDETAIL-ORIENTEDACCURATE IN WORKGOOD AT ANALYZINGLEARNING NEW SOFTWARE PROGRAMS+ TRAININGPerks and benefitsLEARN ABOUT JOB, EMPLOYMENT OUTLOOK, SALARY TRENDS", "Role": "Fresher,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Other", "UG": "Any Graduate in Any Specialization, B.Ed in Education, B.Com in Commerce, B.A in Any Specialization, B.El.Ed in Any Specialization, B.B.A / B.M.S in Management, BHM in Hotel Management, BAMS in Any Specialization, Ayurveda, BFA in Any Specialization, BCA in Computers, B.Sc in Optometry, Food Technology, Home science, Bio-Chemistry, Biology, Microbiology, Botany, Nursing, Chemistry, Dairy Technology, Zoology, B.U.M.S in Unani Medicine, Any Specialization, B.Pharma in Pharmacy, B.P.Ed in Any Specialization, MBBS in Medicine, B.Tech/B.E. in Any Specialization, B.Des. in Any Specialization, LLB in Law, Graduation Not Required, B.Arch in Architecture, BHMS in Any Specialization, Homeopathy, Diploma in Any Specialization, BVSC in Veterinary Science, BDS in Dentistry, Other Graduate", "PG": "M.A in Any Specialization, MDS in Dentistry, LLM in Law, MBA/PGDM in Any Specialization, CS in CS, Post Graduation Not Required, Integrated PG in Any Specialization, Any Postgraduate in Any Specialization, M.Arch in Architecture, MS/M.Sc(Science) in Nursing, Zoology, Veterinary Science, Bio-Chemistry, Biotechnology, Microbiology, PG Diploma in Any Specialization, CA in CA, MFA in Any Specialization, DM in Any Specialization, MVSC in Veterinary Science, M.Tech in Any Specialization, MCA in Computers, M.Ch in Any Specialization, Other, M.Com in Commerce, M.Ed in Education, M.Pharma in Pharmacy, M.Des. in Any Specialization, ICWA (CMA) in ICWA (CMA), Medical-MS/MD in Any Specialization", "Doctorate": "Any Doctorate in Any Specialization, M.Phil. in Advertising/Mass Communication, Ph.D in Advertising/Mass Communication, Doctorate Not Required", "Key Skills": ["microbiology", "fresher", "zoology", "Biotechnology", "VisionaryRCM", "bpt", "gnm", "Tai Chi", "Vee Technologies", "bsc nurse", "biomedical", "dentist", "Dietician", "Ajuba", "ICD - 10", "medical coding", "medical transcription", "biochemistry", "CPC", "pharmacy", "medical billing", "life sciences", "Yogam BPO", "physiotherapist"]}