{"Job Title": "Software development Engineer", "Company": "Spectrum Consultants India Pvt Ltd.", "Experience": "1 - 3 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "    As a Software engineer, you will be responsible for developing and validating software modules for embedded systems.    Development will primarily on Linux and its framework for embedded platform and you would deal with kernel, user space modules including upstreaming work.    You will interact with Systems, Architecture, FW development, SoC Design and Verification teams to optimize the software components.    Basic Qualifications:    1-3 years industry experience in software development on embedded devices.   Bachelor s/Master s degree in EE    Skills needed:    Experience with programming languages such as C   Concept of Continuous Integration using Jenkins and GIT   Knowledge of embedded system Microprocessor, Arm cores   Knowledge of computer architecture Cache, DMA,   Knowledge peripherals like I2C, SPI,UART, Flash, Display, capture   Knowledge of V4l2, gstreamer, wayland, Weston, QT, python   Development over embedded Linux Device drivers, frameworks, applications   Debugging Linux based application traversing through Linux error logs   Familiarity with heterogeneous core architecture   Knowledge of writing application in areas of Automotive and industrial space   Familiarity with Yocto, makefiles, kernel/user space   Knowledge experience in SE development best practices    Primary responsibilities:    Develop SW Frame work, drivers and application in Linux environment.   Debug device drivers, applications of self-written or customer written software   Able to look the software deliverables from end user point of view ease of use, well documented code, design documents   Analyzes and writes test and procedures for the components developed.   Develop test automation software and test scripts, performing SW optimization for memory performance.  ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Embedded, EDA, VLSI, ASIC, Chip Design,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Semiconductor", "GIT", "Test scripts", "SOC", "Analog", "Embedded Linux", "SPI", "Automotive", "Linux device drivers", "Python"]}