{"Job Title": "MidLevel .Net Software Development Engineer", "Company": "Mitratech", "Experience": "1 - 3 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "    Mitratech is a proven global technology partner for corporate legal and compliance teams. Our approach to work is proactive, collaborative, and committed. The professionals who are thriving at Mitratech are people like you who know how to balance individual excellence with teamwork. We believe our employees enthusiasm fuels great work, so we pursue individuals with a passion for building an environment of ownership, transparency, continuous improvement as well as a dedication to driving the best possible experience for our clients. In other words, if you like people and technology, you will fit right in.      Essential Functions          Design, develop, test, refactor and scale backend implementations of new and existing product features.   Responsible for objectoriented programming (OOP), SOLID Principles and computer science foundations, such as memory management and lowlevel algorithm performance.   Responsible to design and optimize SQL Server 2008/12/16 JSON, Stored Procedures.   Design, build, and maintain AWS Serverless architecture written in C#/Go leveraging a variety of open source that power our services.   Contribute to backend architectural decisions, technical roadmap and timeline estimations related to all aspects of the backend system.   Build a deep knowledge of API design, content management and backend systems, and keep up to date on changes in backend frameworks, languages and overall developer community.   Collaborate with cross functional teams to understand member pain points and come up with solutions.   Proactively identify opportunities for improving the reliability and scalability of our systems   Passionate about building high-quality systems with software implementation best practices while working as a self-motivated and responsible team player.   Deep knowledge of the .NET 4.5/4.6 Framework, REST WEB APIs and GOLang.   Adhere to Agile Methodology.       Good to have Skills:     Knowledge on PostgreSQL.   Knowledge on React Native, IOC and design patterns.   Knowledge on CICD.   Knowledge on AWS.       Required Skills and Experience       Constructively work together as a team, sharing ideas and resources.   Should possesses remarkable resilience and leadership skills.   A high degree of analytical and problem-solving abilities.   Excellent communication skills both written and verbal.   Candidate should be a self-motivated, independent, detail oriented, responsible team-player and exhibit exceptional relationship management skills.   Think out of box, study the requirement, and do research on best practices.   Should be ambitious.   Strong knowledge on SOLID Principles.           Education      Bachelor s degree from an accredited educational institution.     Years of exp: 1-3 years.         ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Content management", "Backend", "Memory management", "Postgresql", "JSON", "Agile methodology", "Stored procedures", "Open source", "Software implementation"]}