{"Job Title": "Software Development Engineer", "Company": "Hotstar", "Experience": "2 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "    Your Key Responsibilities    As a senior engineer you will influence how we build individual features and products,  and bring in best practices and patterns that can be used for engineering lifecycle for living room devices.     You ll take ownership of our continued efforts to scale TV app development across different Platforms,  providing valuable insight on how we can refine our processes and tools to support additional contributors in our architecture and code.     Drive feature development for our well- renowned apps for Roku and Smart TV apps.     Take ownership of end- to- end product quality,  from developing and maintaining core app frameworks that help make the apps more reliable and delightful.     Create prototypes of new ideas and explore new technologies on the forefront of mobile technology.   What to Bring    Bachelor degree in Computer Science or related discipline preferred.     Experience in developing software with hands- on experience in building smart TV & OTT Applications.     Application development experience using Roku SDK,  Bright script,  Roku Debugging tools.     Expert in Building UI components & custom controllers in Brightscript.     Experience with developing apps published on Roku channel store.     Good working experience on Web Service Integration ( REST,  JSON,  XML )     Entrepreneurial spirit,  bias for action & ability to work independently.     Broad knowledge of TV applications pertaining to Media domain like VOD and Linear.     Experience on using analytics,  location and social APIs,  payment gateway,  media content transcoding and cloud integration,  APM tools.  ", "Role": "Software Developer,", "Industry Type": "Internet, Ecommerce,", "Functional Area": "IT Software - eCommerce, Internet Technologies,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Product quality", "Mobile technology", "XML", "Debugging", "Application development", "JSON", "VOD", "SDK", "Analytics"]}