{"Job Title": "Benefits Processor- Operations (Freshers)", "Company": "Aon Consulting Private Limited     ", "Experience": "0 - 1 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": "Roles and Responsibilities    Health & Benefits offer market-leading consulting, broking and delivery     services to clients and their employees across organizations of all sizes,     geographies and industries. These offerings include: end-to-end solutions     to benefits management, alignment of your benefit plans with corporate     strategy and policies, considerable purchasing leverage, systematic and     structured approach.The     Colleague will have a specific focus depending on their functional business     area: Colleague     will administer benefit schemes for the employees of our clients. The     Colleague is responsible for generating reports on member activity and     responding to queries from members, providers and clients and producing     letters and documentation and preparing reports. The Colleague provides high quality administration support for internal and     external clients by:Learning   about clients, systems and tools and being proficient in processing   and checking.Contributing to the team as a whole, supporting the rest of the team based on their          needs. Sharing  best practice with colleagues through process and tool training.Identifying  issues with processes handled in teams and driving a process to find  and implement solutions.Implementing changes to tools and documentation needed to support effective service          delivery.Participating   in new client implementations & understand the reporting.Building strong  relationships with client teams, peers & displaying team workMaintaining   required technical knowledge and behavioral standards and expertise,          especially all regulatory and statutory requirements.  Average     communication skills, both verbal and written. Strong attention     to detail and commitment to provide on-going qualityCollaboration and     Team workBasic     Understanding of email writingBasic knowledge     of DomainMS office and Excel KnowledgeDesired Candidate Profile Perks and Benefits ", "Role": "Associate/Senior Associate -(NonTechnical),", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "B.Sc in Any Specialization, B.B.A / B.M.S in Any Specialization, B.Com in Any Specialization, B.A in Any Specialization", "Doctorate": "None", "Key Skills": ["Corporate Strategy", "Communication Skills", "Excel", "Benefits Management", "Report Generation", "Service Delivery", "Consulting", "Report Preparation", "Email Writing", "Operations"]}