{"Job Title": "Platform Relationship Manager", "Company": "KRDS Software Development Pvt Ltd.", "Experience": "4 - 9 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "   Your responsibilities      In charge of relationship and new business from platform channels like Salesforce, Adobe, Sitecore, Google, and Facebook. Share business opportunities and help us stay on top of their latest features.      Serve as the primary liaison with clients in regards to active and proposed campaigns.      Work with clients to develop their own KPIs to measure success.      Liaise closely with our Account and Project Management teams in supporting projects and revenue growth.    Nurture client relationships, shape and grow their digital strategy      Existing Client Upsells.      Identify and develop new business by prospecting, networking, using social media, and referrals.      Anticipate, proactively address and advise management on potential client or revenue issues.      Build and monitor the sales pipeline to ensure continuous population of immediate and   long-term opportunities.       Your profile     4+ years of relevant experience in digital/interactive marketing or other agency experience.      Demonstrated track record of client relationship development and service.      Ability to thrive in changing environments and a passion for strengthening client-agency relationships.      Must maintain an entrepreneurial spirit.      Excellent command of English, both verbal and written communication.      Experience using tools and platforms including SalesForce, Adobe, Sitecore, and BCG.      Strong interpersonal and communication skills.    Able to skillfully navigate through negotiation phases      ", "Role": "Client Servicing/Key Account Manager,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "Sales, Retail, Business Development,", "Employment Type": "Full Time, Permanent", "Role Category": "Corporate Sales", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["sitecore", "Networking", "Client relationship management", "Project management", "Social media", "digital strategy", "Client relationship", "Management", "Adobe", "Salesforce"]}