{"Job Title": "PHP Developer", "Company": "Courseplay", "Experience": "2 - 7 years", "Salary": "Not Disclosed", "Location": "not specified", "Job Description": "PHP Developer -  Courseplay Cloud Learning Role and Responsibilities The PHP Developer plans,  coordinates,  develops code for the company,  and will work with the rest of the product team. In addition,  this position performs the following roles:Conducts research on the latest software development practices Develops new features of the Courseplay Online Training Platform Fixes bugs found in the software Develops new apps and software solutions to complement our existing offerings Conducts tests on their own code before deploying Brainstorms innovative ways to develop new features Follows software development best practices Writes clean code with comments Regularly tests their own code Works on innovative technologies like chatbots,  SCORM,  xAPI,  Zend Framework,  Responsive Web Design,  video streaming,  AWS,  mobile apps and much more! Skills and Experience Handling deadlines and responsibility Managing projects and processes within the company Possessing a sharp eye for detail Possessing good presentation and communications skills Qualifications Sought Minimum 2 years of PHP and MySQL programming experience Minimum 1 year experience in any MVC Framework is required Knowledge of e- Learning standards such as SCORM,  xAPI and AICC is a **huge bonus** Experience inZend Frameworkis a **huge bonus** What we are looking for People who have unbreakable faith in themselves Curiosity to constantly learnmore Good communication skills Sharp eye for detail A strong sense of loyalty to the company Commitment and dedication to get the work done The work environment An incredible team of smart and supportive people Small,  agile and dynamic team that works fast Opportunity to wear multiple hats and juggle multiple roles Be rewarded with a very competitive package Plenty of opportunities to learn. We have a strong and diverse training program We may ask a lot of you,  but we promise the effort will be rewarded Full- time positions at Firstventure Corporation require a commitment to work a minimum of 45 hours each week,  Monday to Friday.We offer our team members a competitive base salary and additional incentives commensurate with experience and performance over time. Other benefits can be discussed.Your Contact Number * Current City,  Country * Year of Birth * LinkedIn Profile URL * Estimated Start Date * Current Annual Salary (INR) * Please leave this field empty. Before applying,  please ensure you can commute to our office", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["Training", "E-learning", "Project management", "MySQL", "Agile", "PHP", "Bonus", "responsive web design", "Business Executive", "Zend framework"]}