{"Job Title": "Graphic Designer", "Company": "Intelenet Global Services Private Limited", "Experience": "3 - 8 years", "Salary": "₹ 2,50,000 - 5,50,000 P.A. ", "Location": "Chennai", "Job Description": " Job Title: Graphic Designer  Team LeaderLocation: AMBIT - Chennai, Tamil Nadu Position Summary  We are looking for a creative Graphic designer with up-to-date knowledge to interpret our clients needs and to design solutions with high visual impact. He/she will be a key member of development team and will work on a variety of products, including websites, books, PPT designing, Photoshop, Logo designing, VFX, Video ,magazines, product packaging, websites, exhibitions, corporate identity etc. and He/she will cooperate with our designers and sales team.Must Have: Exposure in working with a wide range of media and using graphic design softwareCreative thinking and developing new design concepts, graphics and layoutsIn-depth knowledge in PPT design, Photoshop, Logo designing Good exposure in Video editing, VFX and with web-based applications.Essential duties & responsibility: Cultivate a solid body of workTake the design brief to record requirements and clients needsSchedule project implementation and define budget constraintsWork with a wide range of media and use graphic design softwareThink creatively and develop new design concepts, graphics and layoutsPrepare rough drafts and present your ideasAmend final designs to clients comments and gain full approvalWork as part of a team with copywriters, designers, stylists, executives etc.Responsible for the PPT designing, Photoshop, VFX and Video editingShould be able to deliver in time with quality Should be a good team player Participate in project status meetings as required and provide project status updates with respect to work on handExperience requirement: Relevant software development exposure in designing ,VFX and Video editingProven graphic designing experiencePossession of creative flair, versatility, conceptual/visual ability and originalityDemonstrable graphic design skills with a strong portfolioAbility to interact, communicate and present ideasUp to date with industry leading software and technologies (In Design, Illustrator, Dreamweaver, Photoshop etc)Highly proficient in all design aspectsProfessionalism regarding time, costs and deadlinesTechnical Skills: Programming expertise in  Video creation and PPT presentation  Proficiency in working with VFX Effects and Logo designingDesired: Ability to work on Premiere pro Web technologies. Good Knowledge of Photoshop and  MS Office   Experience in communication package (email). Optional: Ability to work on Web design, HTML, WAP Technologies, MS Front Page Proficiency in MS Access, Function and performance optimization. Experience designing complex applications and reusable components in .NET Software Engineering skills Strong reporting abilities throughout project life cycle Ability to write clean, documented, and maintainable scripts Ability to interpret various aspects of content and to implement accordingly Ability to multi-task and manage multiple assignments  Understands business requirement and delivery timelines. Soft skills, Team Player, Stakeholder Management Good written and verbal communication skills Good Creative thinking in Video making, Logo designing and PPT presentation Good time-management, communications, decision making and organization skills Ability to work well in a team environment Self-Motivated, Self-Plan and Self Organized with Potential Enterprise level impact Proactively initiates, develops, and maintains effective working relationships with team members. Understands expectations that were set with Senior Stakeholders and recognizes when issues/events may affect delivery.  Notice Period : Maximum 15-30 Days immediate joiners are more preferableInterested please share your resume tofathima.begum@teleperformancedibs.comPlease share the resume to both above mentioned ID'sContact Number -7305570295", "Role": "Graphic Designer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "Design, Creative, User Experience,", "Employment Type": "Full Time, Permanent", "Role Category": "Creative", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["PPT design", "Magazines", "VFX", "Video editing", "HTML", "Web Designing", "Logo designing", "Logo Design", "Graphics", "Illustrator", "Photoshop", "Graphic Designing", "Corporate Identity"]}