{"Job Title": "Java Developer", "Company": "LETRIM INTELLIGENCE SERVICES PVT LTD", "Experience": "5 - 10 years", "Salary": "₹ 90,000 - 1,00,000 P.A. ", "Location": "Chennai", "Job Description": "Roles and Responsibilities  Write secure, maintainable and testable, production ready code in a clean and consistent format Contribute to systems integration with existing systems, vendors and third-party providers, ensuring that all systems meet the required specifications for deployment to target environments Maintain up to date knowledge of trends, issues, changes and current and emerging technologies in the market bringing industry expertise to the context of Client and ensuring that Client is on top of application best practices Proactively identify and manage bugs, bottlenecks and issues in code Estimate build effort and supporting planning activities Contribute to the software architecture, development best practices and new technologies Ensure solutions developed are scalable, extensible and maintainable Collaborate with other developers and architects to come up with innovative and forwardthinking solutions Support the services built by your team where required.Desired Candidate Profile  Strong to expert proficiency in Java Strong understanding of Microservice architecture and technologies such as docker/Kubernetes. Extensive experience building and supporting APIs Excellent knowledge of software engineering best practices (e.g. Agile, software development, test-driven development, unit testing, test automation, design patterns, codereviews, design document etc) Are familiar with Cloud platforms such as Azure/AWS/GCP Experience in the following technologies desirable • Spring Boot Kafka/Event hub or similar stream processing software Kotlin Apigee Logging, monitoring or APM tools Swagger framework GIT based source control such as Github/Bitbucket and CI/CD tools such as Jenkins/Bamboo/Azure DevOps Knowledge of shell scripts and JavaScript technology such as NodeJS", "Role": "Java Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Not mentioned", "UG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Java", "J2Ee", "API", "Microservices"]}