{"Job Title": "Backend Developer ", "Company": "xFusion Technologies", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Kolkata", "Job Description": "  Job Description     A minimum of five (5) years of experience in designing, implementing and testing back end web applications and application integration solutions using open-source software products   Experience in emerging technologies and best development practices including all aspects of enterprise integration, Service Oriented Architecture (SOA), server-side processing, data storage, and integration with front end development    Experience in designing, implementing and testing RESTFul API, Swagger and API Test tools   Experience implementing Microservices API using Spring Boot.    Experience working with Continuous Integration and Continuous Delivery (CICD) platform and enabling technologies such as Jenkins, Maven, and Gradle etc.    Experience working with Elasticsearch, Logstash, and Kibana (ELK)    Experience in container technologies such as Docker, Kubernetes and Cloud Environments such as AWS    Experience in JavaScript libraries    Experience working with Agile Scrum methodology and agile tool such as JIRA.    Good understanding of data structures and algorithms.    Excellent problem-solving skills, with an emphasis on moving the business numbers forward    Enjoys the challenges of working on both new and old projects.    Ability to understand business requirements and able to design and develop the module by its own.      Desired Candidate Profile     Education Requirements:      A minimum of bachelor s degree in Computer Science, MIS, related field.    Experience in GraphQL API development with Java Spring boot Node js.    Experience in Automated Test tools such as Selenium    Experience in integrating and delivering APIs through API Gateway    Experience working with GitHub and GitFlow branching model to manage version control    Experience in developing relational and non-relational database systems    Experience working NoSQL Databases such as MongoDB, Neo4j.      Key Skills     A backend developer will require experience in software development as well as the following skills:     Java based web services    Java Spring boot, Maven    RESTFul API    J2EE framework    Object Oriented Analysis and Design    Test-Driven Development   ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "CA in CA", "Doctorate": "None", "Key Skills": ["Maven", "Front end", "SOA", "MIS", "Javascript", "Data structures", "Selenium", "Open source", "JIRA", "Information technology"]}