{"Job Title": "Software Development Engineer II & III", "Company": "Appnomic Systems Private Limited", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "We make ML based products that predict upcoming issues in complex applications running in cloud-native, serverless or host-based environments. Products handle very high volumes of streaming data, and perform complex learnings on structured and unstructured data in near real time. We have multiple positions open for SDE-2 (mid level), and SDE-3 (senior). Based on experience and assessment, we will offer a suitable position to the candidate.Requirement:The ideal candidate should have passion for building products, solving problems, and building data pipeline.• Experience in Java, Big data and knowledge of Spark, Flink.• The basics must be very strong - design, coding, testing, and debugging skills.• BS in CS/EE/CE or related field from a top institution• 5+ years hands-on experience in Java, Clojure or Scala, data structures and algorithms on Linux• Experience with Micro-services, Docker, Kubernetes experience a plus• A demonstrable understanding of software development concepts, problem break down, project management, and good communication.• Experience will product build life cycle of developing, debugging, optimizing and maintaining code.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["Streaming", "Java", "Design Patterns", "Data Structures", "Big Data", "Microservices", "Software Development", "Algorithms", "Multithreading", "Linux", "Docker", "SCALA", "Spark", "Elastic Search", "Clojure"]}