{"Job Title": "Full Stack Lead Developer - Python/Django", "Company": "Acodez IT Solutions", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Calicut/Kozhikode", "Job Description": "Full Stack Lead Developer - Python/Django - Web Solutions Blog Full Stack Lead Developer Python/Django We re looking for an experienced and talented Python Developer (Django Framework) who can architect, develop DB Schema and Restful APIs for our clients based on their custom requirements, by understanding their business objectives.\n\nKey Responsibilities: \n\nCandidate should be able to architect, develop DB Schema and Restful APIs for our clients based on their custom requirements, by understanding their business objectives. \n\nImplementation of end-to-end Solution Development process, and Solution Development Lifecycle process, and to ensure that all products are built with the delivery quality for the appropriate stages- alpha, beta & production Essential Skills: \n\nExperience in Python for more than 4 years, out of which more than 2 years are into Django framework \n\nExperience in designing relational, NoSQL databases like MySQL, Postgres, MongoDB etc \n\nExperience working in Javascript front-end frameworks like AngularJS/React JS/Vue JS \n\nProficient with client scripting technologies like jQuery, Javascript, AJAX etc \n\nShould be very good at developing Rest Based APIs \n\nKnowledge in AWS Lambda functions \n\nAdherence of best practices for Agile software development cycle \n\nHelp to prepare the task-list for a project \n\nEngage team/ coordinators/ Seniors on team meetings/ discussions \n\nLead a team of 5-10 developers Qualification: Computer Science Graduates. BTech/BE preferred\n\nWork Experience: Minimum 5 years\n\nWhat s new Just Inaugurated - our 4th office in India at UL CyberPark SEZ, Calicut\n\nBrand new website for Anchor By Panasonic, fully designed and developed by team Acodez, is now live.\n\nWorking on a brand new website for Axis Bank Forex - right from Information Architecture & UX, UI and Development.\n\nWorking on a brand new website for Titan Sonata. Stay tuned to see it in action!\n\nSigned contract with Panasonic Lighting as their digital marketing agency\n\nBrand new website for CavinKare, fully designed and developed by team Acodez, is now live.\n\nSigned Contract for a 5000+hours Web application for an investor firm in Saudi Arabia\n\nWorking on the Logo and Brand Identity for Remit Money (by Axis Bank)\n\nSigned contract for managing the Social Media accounts of Anchor Electricals\n\nWorking on new E-commerce Portal for Cover Story - by Future Group. Stay Tuned!\n\nLaunched new website for Panasonic Powertools\n\nJust Inaugurated - our 4th office in India at UL CyberPark SEZ, Calicut\n\nBrand new website for Anchor By Panasonic, fully designed and developed by team Acodez, is now live.\n\nRead Our Blog Acodez team delivered everything I wanted. Big Thanks!\n\nFood Blogger, Poland Acodez handled my website's design and they did a tremendous job with this.\n\nSeduction Naturelle PNL, France I will definitely recommend Acodez to such clients who're looking for quality.\n\nChairman & MD, Exotel Holidays P Ltd, India I'm speechless!! It's brilliant! Thank you for the great job", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["Computer science", "jQuery", "Front end", "Social media", "Django", "MySQL", "Schema", "Agile", "Ajax", "Python"]}