{"Job Title": "FrontEnd Developer", "Company": "GREENDARTS INFOTECH PVT. LTD.", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "  Job Responsibilities:   You will be an integral part of frontend development and work closely with the following teams:   oProduct Owner   oBack end development   oProduct design   oDevOps   oQA   You will set a new standard in terms of ideas and technologies and be a part of leading projects from end to end.   You will write high-performance, reusable code for a project s UI (with responsive design in mind) as well as API integration.   You will participate in unit testing, integration testing, and performance testing.   You will work on complex problems and must be able to obtain results or solutions through in-depth analysis and superior troubleshooting skills.   You will contribute towards internal documentation including, but not limited to, the following items:   oProduct requirements   oTechnical specifications   oSoftware documentation   oUnit test plans   You will use Agile methodologies to collaborate, define, and build the given projects.    Requirements Experience:    We are looking for our candidates to have:   3+ years of experience in front end or full stack projects from end to end.   A Bachelor s Degree in CS, Engineering, or a related field. Alternatively, have an equivalent amount of work experience.   Strong experience in Sass, Flexbox, HTML5, CSS3   Hybrid application development is preferred - Including Ionic, React Native   Experience in JavaScript (ES6), Angular 2+   Experience writing unit tests using Protractor (or similar frameworks)   Strong written and verbal communication skills.   Strong demonstrable analytical and troubleshooting skills.   Experience with code repositories.   Experience with various testing techniques.   Experience working in an Agile or iterative software development environment    Additional Skills that would be a strong plus:   A Master s Degree in a related field.   Experience with data analytics.   Experience in writing APIs using NodeJS.   Experience in working with any relational database preferably PostgreSQL   Portfolio of past and current projects. ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Front end"]}