{"Job Title": "PHP Developer", "Company": "Integra Global Solutions Corp", "Experience": "14 - 19 years", "Salary": "Not Disclosed", "Location": "Coimbatore", "Job Description": "PHP Developer\n\nDepartment: Software Development\n\nNo of positions: 3\n\nClass: Full time\n\nJob location: Coimbatore\n\nA division of Integra Corp, USA and Integra Ltd, UK\n\nWhat we are looking for? \n\n• Strong knowledge of PHP web frameworks (such as Codeigniter, Laravel, Yii, etc depending on your technology stack) \n\n• Understanding the fully synchronous behavior of PHP \n\n• Understanding of MVC design patterns \n\n• Understanding of front-end technologies, such as JavaScript, HTML5, AJAX and CSS3 \n\n• Knowledge of object oriented PHP programming \n\n• Understanding of open source projects like Joomla, Drupal, WooCommerce, osCommerce, etc \n\n• Good knowledge of relational databases, version control tools and of developing web services \n\n• Experience in common third-party APIs (Google, Facebook, Ebay etc) \n\n• Understanding accessibility and security compliance \n\n• Creating database schema that represent and support business processes \n\n• Proficient understanding of code versioning tools, such as Git, SVN What would be your responsibilities? \n\n• Integration of user-facing elements developed by front-end developers \n\n• Build efficient, testable, and reusable PHP modules \n\n• Solve complex performance problems and architectural challenges \n\n• Integration of data storage solutions (may include databases, key-value stores, blob stores, etc.) What can you expect from Integra? \n\n• Opportunity to work with international clients \n\n• World class training on multiple skills Planned career growth How could you impress us? Through your previous experience Sound programming principles Good written English Enthusiasm and positive attitude \n\n• Willingness to learn and adapt Why you should join Integra? Excellent working atmosphere \n\n• Salary and bonus always paid on-time \n\n• You work for a US corporation (and a UK company) \n\n• You work for a company that has continuously grown for past 14 years", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["security compliance", "Drupal", "OSCommerce", "Javascript", "PHP", "MVC", "Open source", "Joomla", "Ajax", "CSS3"]}