{"Job Title": "Senior Associate - .Net Developer", "Company": "Sutherland Global Services Private Limited", "Experience": "2 - 6 years", "Salary": "Not Disclosed", "Location": "Chennai( Perungalathur )", "Job Description": "Our development department is currently on the lookout for qualified candidates to participate in the development of web project. We are a group of dynamic and driven individuals. Our team specializes in Microsoft .NET platform, with extensive use of complementary web technologies such as JavaScript, jQuery, Angular, AJAX and ASP.NET MVC. If you are looking to build a fulfilling career and are confident you have the skills and experience to help us succeed, we want to work with you!Roles and Responsibilities  Understand the requirements and work closely with Project Manager to deliver the tasks Deliver across the entire app life cycle concept, design, build, deploy, test, release to stores and support. Build prototypes at tech scoping stage of projects. Working with the front-end developers to build the interface with focus on usability features. Optimizing performance for the apps /web.Desired Candidate Profile Qualifications:Education Requirements: Bachelors degree in any disciplineTo succeed in this position, you must have 3-6 years of Web development experience with .NET core2.1, , SQL server 2012+ /DB , Ajax/j-query/ LINQ HTML 5.0 , MVC , bootstrap will be added advantage platform in the following areas.Programming Language(s): C#, Python (not mandatory)Web API: REST API development in ASP.NET/CoreASP.NET MVC/Core: Complete understanding and working knowledge in MVC pattern using ASP.NETjQuery: Development experience in jQuery concepts and componentsAngular: understanding of AngularSQL: Knowledge in SQL query and writing Stored procedureOthers: knowledge of AI/MLCommonUnderstanding of other compiled languagesExperience on web service integration (SOAP, REST, JSON, XML)Experience of development using web technologiesGood understanding of OO programming and design patternsGood understanding of HTML5, JavaScriptUsing version control (e.g. TFS)Location : Chennai (Perungalathur)Shift Timings : 12:30 PM to 9:30 PM", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Web Technologies", "ASP.NET/Core", "XML", "Javascript", ".Net", "Bootstrap", "JSON", "JQuery", "ASP.Net MVC", "Angular", "Ajax", "SQL"]}