{"Job Title": "UI/UX (User Interface) Developer", "Company": "Epiqsystems India Private Limited", "Experience": "6 - 8 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "Position SummaryThis position entails the development of customer facing web applications that will be deployed in an existing server infrastructure.  Desirable skills include client-side development skills with experience in frameworks such as JavaScript/HTML5/CSS3 for at least 5 years.  The ability to create reusable code for quick orchestration and deployment to meet the needs of the project, along with the creative capabilities to develop intuitive and modern UIs. The role will primarily focus on hands-on coding of the project using the technologies listed below. Proven ability to organize workload and priorities and complete tasks on time & to work effectively in a team environment. Acts as a resource for other software engineers; and a liaison between department manager and other analysts, as well as the business team.Qualification:Bachelors /Masters degree6 - 8 years of experience with UI/UX frameworks.Required Skills:Require excellent working experience on JavaScript frameworks like ReactJS and Knockout. Require Working Experience on JavaScript/HTML5/CSS3 for at least 5 years. Require working experience with frontend frameworks like Bootstrap. Experience in CSS pre-processors like SASS and LESS. Experience working with InVision, Fontello or IcoMoon tools is preferable. Experience working with C# .NET, ASP.MVC is preferable. Should have experience in implementations done using W3 standards. Experience working with Graphic Designers for better user experience is a must. Experience working with source code repository, build process is a plus. Exposure to tools like Git, VSTS is preferred. Candidate must have good debugging skill and familiarity with coding standards. Good understanding of SDLC. Good communication skills.Responsibilities:Works with Team Lead and Product Designer. Owns the product modules and reports to Team Lead for work. Implement the project/modules delegated to him/her. Strives to create intuitive and user-friendly designs in all products. Participate in all Scrum ceremonies such as Daily scrums, Planning, Review and Retrospectives. Developing and delivering custom reports for client requests. Analyzing, designing, and developing frontend with JavaScript frameworks. Revising programs and creating corresponding documentation as needed. Optimizing existing data workflow as needed. Working on multiple teams/products to support feature implementations.", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Other,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Javascript", "HTML", "Angular"]}