{"Job Title": "PHP Developer", "Company": "Rapidlead Softech", "Experience": "1 - 3 years", "Salary": "Not Disclosed", "Location": "Surat", "Job Description": "  PHP developers stay rather busy thanks to the host of tasks they re expected to tackle. These include, although certainly not limited to:     Create, test and deploy new, innovative website applications in a timely and efficient manner, while concurrently working with other developers to meet data acquisition requirements    Identify and fix compatibility issues involving CSS, HTML, and scripting, often between a series of different platforms and browsers.    Test websites on all sorts of browsers (mobile, notebook, tablet), and address issues identified by customer feedback.    Research and explore various architectural considerations relating to the system design process, including web usability, the website s performance, and database design. Explore and assess different alternatives for implementing new application features.    Communicate with and work alongside other development teams and company management to solve conflicts, establish priorities, select the best solutions, or develop criteria for new content.    Develop plans for keeping the website updated and current at all times, recommend improvements for performance, create and finetune style guidelines for the website s content, and choose the most effective design tools, programming languages, and applications.    Provide detailed descriptions of website specifications such as product features, budget, programming languages, communication protocols, functionalities, structure, and deadlines.    Keep up with the latest programming practices and web technologies via reading, continuing education opportunities, and participating in relevant professional workshops, groups, and conferences.    ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Communication protocols", "PDF", "Web technologies", "Database design", "Web development", "Programming", "Tool design", "PHP", "System design", "HTML"]}