{"Job Title": "iOS Developer", "Company": "Ultrafly connexions", "Experience": "2 - 6 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": " We are looking to hire a talented iOS Developer to design, build, and maintain the next generation of iOS applications. Your primary focus will be developing high-end iOS applications for the latest Apple mobile devices. Your duties may include collaborating with the design team for new application features, identifying and fixing application bottlenecks, maintaining the core code, and updating applications published on the App Store.   To ensure success as an iOS Developer, you should have a strong working knowledge of iOS Frameworks, be proficient in Objective-C, and be able to work as part of a team. Ultimately, an outstanding iOS Developer should be able to create functional, attractive applications that perfectly meet the needs of the user.    Designing and building mobile applications for Apple s iOS platform.   Collaborating with the design team to define app features.   Ensuring quality and performance of application to specifications.   Identifying potential problems and resolving application bottlenecks.   Fixing application bugs before final release.   Publishing application on App Store.   Maintaining the code and atomization of the application.   Designing and implementing application updates.     Bachelor s degree in Computer Science or Software Engineering.   Proven experience as an app developer.   Proficient in Objective-C, Swift, and Cocoa Touch.   Extensive experience with iOS Frameworks such as Core Data and Core Animation.   Knowledge of iOS back-end services.   Knowledge of Apple s design principals and application interface guidelines.   Proficient in code versioning tools including Mercurial, Git, and SVN.   Knowledge of C-based libraries.   Familiarity with push notifications, APIs and cloud messaging.   Experience with continuous integration.  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Mobile,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Computer science", "continuous integration", "Backend", "Publishing", "GIT", "Cloud", "Animation", "Mobile applications", "IOS"]}