{"Job Title": "Senior Software Development Engineer in Test", "Company": "Cloudreach", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "      What Will Your Role Be      The Senior SDET is responsible for defining and implementing strategies that enforce a high degree of diligence and confidence across Cloudreach software products. To achieve this they will work closely with both Product Management and Development teams to ensure the correct development and release controls exist and are mandated. The Senior SDET will also be responsible for designing and architecting automated testing solutions and processes. They will also actively mentor software engineers and more junior SDETs.         Key Responsibilities        Design Architecture of automated frameworks       Design Architecture of testing environments and data       Testing Defect Management strategy formation       Junior engineer mentorship       SDET Community promotion        What Are We Looking For        Organization - Able to define roadmap items and specific tasks to achieve them       Independence - Able to operate with autonomy at a strategic engineering level and proactively maintain relationships with SDET stakeholders       Tooling - Advanced uses of common test frameworks, BDD, TDD and codified test environment creation       Functional Testing - Experienced in defining efficient testing needs at system, integration and unit levels.        Non-functional Testing - Experienced in definition and execution of security and load testing.       Technical Writing - Advanced technical writing/reporting experience (dissertation or similar)           Experience Required       Degree in Computer Science or technical discipline      ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Product management", "Computer science", "Load testing", "Technical writing", "TDD", "GCP", "Functional testing", "System integration", "Agile", "Defect management"]}