{"Job Title": "Java Developer", "Company": "Ameex Technologies", "Experience": "3 - 5 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": " As an experienced Software Engineer, your mission is to help lead our team of innovators and technologists towards creating next-level solutions that improve the way our business is run. Your deep knowledge of design, analytics, development, coding, testing and application programming will help the team raise their game, meeting the standards, as well as satisfying both business and functional requirements.         Key Responsibilities      Serve as a key mentor and provide technical guidance to the team   Design and develop key/critical modules within the application   Carry out design reviews/code reviews at agreed points throughout the project life cycle   Contribute in all phases of the application/ system development lifecycle   Ensure designs are in compliance with specifications and system requirements   Code optimization, performance tuning, builds and deployments   Support continuous improvement by investigating alternatives and presenting these for architectural review    Essential Competencies    Strong Core Java development experience   Knowledge and hands on experience on HTML, CSS and Java script   J2EE (Web Services, Servlets) with Tomcat application server   J2EE OO Design Patterns   Java Frameworks (preferably Spring MVC)   Unix tools and shell scripting   Proficiency in SQL and Database development   Strong fundamentals in data structures, caching, multithreading, messaging and asynchronous communication   Understanding of tools like Eclipse, Git, Maven, and databases like MySql, MongoDB   Strong technical development experience on effectively writing code, code reviews, best practices on configuration management and code refactoring    Desirable    Knowledge and hands on experience on HTML5, CSS3, SASS, LESS, jQuery, Angular-JS, Node-JS, Spring boot will be an added advantage   Java RESTful web services development    Essential Experience    3-5years work experience   Excellent Communication and Inter-personal skills, both with business customers and with fellow IT professionals (Business Analysts, Project Managers and Developers).   Experience in Agile development techniques like Scrum   Strong problem-solving skills   A delivery focused approach to work and the ability to work without direction   Ability to multi-task.   Ability to generate enthusiasm in others, and get various teams working towards a common goal.   ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Unix", "Core Java", "Tomcat", "jQuery", "Multithreading", "MySQL", "Shell scripting", "J2Ee", "HTML", "SQL"]}