{"Job Title": "Senior Frontend Developer", "Company": "MNF MyNextFilm", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "New Delhi", "Job Description": "  The ideal candidate must bring extensive, expert-level experience in Javascript, ReactJS, HTML5/CSS3, REST API. You must also be an effective communicator, possess a high degree of passion for product design and development, work well in a team environment, thrive in a fast-paced culture, and bring a proven background in building scalable data-driven solutions.    What is to be done    Product development using front end technologies such as HTML/SASS/JavaScript using frameworks such as React/ Angular, Redux, TypeScript, etc.     Work closely with Engineering, Product and Design teams to cultivate intuitive and easy user experiences.     Implement said features in a variety of applications including single page, isomorphic web apps and browser JavaScript libraries.     Design and Develop high performance web applications used by hundreds of thousands of users globally.     Ability to build, enhance and maintain web applications that support/allow different front-end frameworks to co-exist.     Promote consistent architecture patterns for design and development within and across product development teams.     Use state of the art front end technologies like HTML/CSS/LESS, JavaScript, React, Webpack and NPM to develop highly available applications that can scale to deliver customer facing applications.     Continually evaluate emerging frameworks and technologies to identify opportunities, trends and best practices that strengthen Thomson Reuter s web products.     Work alongside talented developers to implement meaningful software updates.     Work with engineering team to define APIs suited for the front end projects.     Provide mentorship and guidance, including code reviews, training, and feedback.      Must have skills      5+ years professional front end development experience building web application / single page web apps.     2+ years experience with JavaScript frameworks such as ReactJS, Angular 2+ or VueJS.     Experience developing mission critical, high volume web-based software.     Excellent programming skills with solid understanding of software engineering techniques, methodologies and practices.     Fluent knowledge of latest HTML5/CSS3 standards and best practices.     Experience developing web applications that support/allow different front-end frameworks to co-exist.     Experience with CSS pre processors like LESS or SASS.     Solid Javascript and ES6 skills, Functional and Object-Oriented programming.     Understanding of Flux / Redux dataflow, immutability.     Experience with build tools(Gulp,npm,Browserify, Webpack,etc).     Fluent knowledge of browser and device differences / limitations.     Comfortable discussing topics with backend engineers such as microservices, REST API, event sourcing,etc.     Writing unit and integration tests with Jasmine and Karma or similar tools a plus.     Excellent verbal and written communication skills.   Proficiency with GraphQLa plus.      It will be good if you also have      Proficiency using industry standard 3rd party tools such as GitHub.     Strong written and verbal communication skills     Articulation skills     Self-starter who requires minimal oversight     Ability to prioritize and manage multiple tasks     Process orientation and the ability to define and set up processes   ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Backend", "github", "CSS", "Process orientation", "Javascript", "HTML", "Product design", "Object oriented programming", "Python", "CSS3"]}