{"Job Title": "Sr.Web Developer", "Company": "Qtonix Software Pvt. Ltd", "Experience": "1 - 2 years", "Salary": "Not Disclosed", "Location": "Bhubaneswar", "Job Description": " QTONIX is looking for Experienced Sr. PHP Developer for our Bhubaneswar Branch. Number of Vacancies: 2 Desired profile: Ability to handle the team. Hands on experience in Coding,  Implementation/Maintenance Support. PHP and MySQL. Having knowledge of back- end and front- end development,  including creating custom WordPress themes integration. Experience in WordPress core and templates with knowledge in API integration. Should have sound knowledge of implementing CMS- based web sites and different types of payment gateways. In depth knowledge of PHP,  Wordpress,  JSON,  AJAX,  MYSQL,  JavaScript,  jQuery,  HTML CSS is required. Ability to communicate solutions and thoughts fluently with external and internal clients. Right candidate should be able to work independently as well as part of team.. Responsible for both back- end and front- end development. This position requires a combination of programming skills (namely PHP,  MySQL,  JQUERY,  JavaScript,  HTML and CSS). Should have understanding of the entire web development process,  including design,  development,  and deployment is preferred. Responsible for application design,  code development,  testing and deployment and maintenance. Key Skills : PHP HTML /CSS3 Javascript/JQuery CodeIgniter React.js SQL Serve Angular Js ,  Ajax Responsive Design / Bootstrap Design ADDITIONAL BENEFITS: Salary on Time every month 2nd Saturdays Sundays Week off No overtime 14 paid leaves in a year National International Holidays Official Tour Award Programs Interested candidates can be sent their resume to hr@qtonix.com Note: Fresher aren't eligible to apply for this post. ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["jQuery", "Coding", "MySQL", "Wordpress", "Web development", "CMS", "PHP", "HTML", "JSON", "Ajax"]}