{"Job Title": "Mean Stack Developer", "Company": "Aussizz India Private Limited ", "Experience": "2 - 4 years", "Salary": "₹ 1,50,000 - 4,00,000 P.A. ", "Location": "Gandhidham, Ahmedabad", "Job Description": " Position objective: MEAN stack (Nodejs, Sql server, Angular, No SQL) Developer responsible to develop product features & enhancements with backend and user facing front end. Your primary focus will be the development of all server-side business logic, definition, maintenance of the central database ensuring high performance and responsive requests from the front-end. Responsible to work with front end team to develop high level performance components and modules.Roles/responsibilities: - Integration of user-facing elements developed by front-end developers with server side logic- Writing reusable, testable, and efficient code- Design and implementation of low-latency, high-availability, and performance applications- Implementation of security and data protection- Integration of data storage solutions (may include databases, key-value stores, blob stores, etc.). - Responsible to complete tasks with in timeline- Follow the technologies and coding standards- Updated with latest technologies features- Follow the project structure and architectureKey Behavioral Competencies:Problem Solver & Critical Thinking: Blessed with the critical thinking which is a important component of visual thinking that gives the ability to solve problems quickly and effectivelyListening & Communication Skills- The ability to communicate effectively and understand the requirement for the product. Strong Logical Approach: The ability to think logically and understand the given requirement to meet the final goal of the product.Good Team Member:Work with different teams to complete the tasks with quality and performance, also supportive and collaborative.Qualifications:B.E/M.C.A/Msc. IT or Bsc./BCA  in Computer Science, Engineering or a related fieldExperience Required:  2 to 4 yearSkill- Strong proficiency with latest JavaScript standards (ES 6)- Knowledge of NodeJS and frameworks available for it (such as Express, Strong Loop, etc)- Understanding the nature of asynchronous programming and its quirks and workarounds- Good understanding of server-side Tempting languages (such as Jade, EJS, etc)- Good understanding of server-side CSS Pre-Processors (such as Stylus, Less, SAAS etc)- Basic understanding of front-end technologies, such as HTML5, and CSS3- Understanding accessibility and security compliance (Depending on the specific project)-Experience of Web API with Authentication & Authorization, Restful services.-Candidate should have worked on SQL Server, functions, stored procedures, Data Security & query optimization and NoSQL databases- Knowledge of scrapping data and posting data with selenium or other technology. - Excellent debugging & troubleshooting skill to solve bugs and issues easily- Excellent communication skills and positive attitude to work with different teams- Be updated with the latest features and updates of technology stack, also use it effectively-Ability to work independently and multi-task effectively", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers, BCA in Computers", "Doctorate": "None", "Key Skills": ["CSS", "Express", "Html5", "Node.Js", "SQL Server", "Angular", "Ejs", "Stylus", "Front End", "NoSQL", "Mean Stack", "Javascript", "Jade"]}