{"Job Title": "Software Development Engineer", "Company": "Capital Placement Services", "Experience": "4 - 8 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram, Bangalore/Bengaluru", "Job Description": "Job Description\n\nDesign and Implement Micro- services for Collecting,  Processing,  Analyzing,  and Storing\n\nmetrics and Logs Data.\n\nCollaborate with Product Management,  Engineering,  and Devops/ sre Teams For\n\ngathering Requirements,  and Planning Feature Rollout.\n\nEvaluate,  Propose,  and Implement Machine Learning Models for Performing Insights\n\ncorrelation,  Deducing Operational Health,  and Forecasting.\n\nAnalyze Alerts,  Metrics,  Troubleshoot Production Issues,  and Utilize First Hand Learnings\n\nto Implement Features and Solutions that Help Reduce Mean Time to Recovery.\n\nDesign and Develop An Intelligent Auto- remediation System to Help Greatly Improve\n\noperational Excellence.\n\nskills and Experience\n\n5+ Years of Experience in Designing and Developing Distributed Software.\n\nPractical Programming Experience with Some of the Widespread Programming\n\nlanguages (python,  Golang or Similar) is a Must\n\nDeep Technical Roots in Data Center Technologies: -  Large- scale Linux Production\n\nenvironments,  Preferably as Part of a Cloud Service Provider Environment\n\nUnderstanding of Cluster Management Systems like Kubernetes and Docker Based\n\ncontainer Development and Deployment.\n\nPrior Experience Building and Operating Large- scale Data Pipelines\n\nStrong Computer Science Fundamentals in Design,  Data Structures and Algorithms\n\nknowledge of Web Services (rest Api) And/ or Sdk Integrations\n\nPractical Experience of Working with At Least Some of Logstash,  Elastic Search, \n\ncassandra and Kafka Technologies is a Plus\n\nExperience with Ci/ cd Pipelines\n\nProduction Experience with At Least One of Kafka,  Cassandra,  Elastic Search\n\nExperience with Machine Learning Technologies Preferred.\n\nExperience with Kubernetes is a Plus\n\nDemonstrated Proficiency in Creating Detailed Technical Design Documents,  Facilitate\n\ndesign Reviews,  and Execution of Design Implementation Projects\n\nBs/ ms Degree in Computer Science or Equivalent Experience\n\nStartup /  Entrepreneurial Experience is a Plus", "Role": "Software Developer,", "Industry Type": "Real Estate, Property,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Product management", "Computer science", "Linux", "Machine learning", "Data structures", "SDK", "Forecasting", "Analytics", "Monitoring", "Python"]}