{"Job Title": "Software Engineer - Digital Core | Fortune 500 Fashion Retailer", "Company": "ANSR GLOBAL CORPORATION PRIVATE LIMITED", "Experience": "5 - 9 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad, Chennai, Bangalore/Bengaluru", "Job Description": "In this role you will be part of our Digital Core product area, and thereby be one of the key players to get the new platform running around the world. You get the opportunity to work as a combination of SAP and Microsoft integration engineering in a DevOps manner.As a Software Engineer you will work closely with our product teams. You need to be able to understand operational details and the system landscape. This requires high skills in communication, an analytic mind and a dedicated focus on overcoming problems. You will be a part of a growing product area that today consists of around 9 product teams with a mix of H&M employees and consultants. As a Software Engineer at H&M you will work at a global IT department.The product area you will be a part of has expertise in SAP ERP Central Component, the SAP technology stack and Microsoft Azure. You will develop integrations and events with technologies such as SAP idcos, web services via SAP gateway, SAP PI, SAP CPI and various components of Microsoft Azure.Key ResponsibilitiesThe job of a Software Engineer for Digital Core within the H&M group comes with a lot of responsibility  and lots of fun.Being a creative Software Engineer and passionate about problem solving, building new modern solutions, support our stakeholders and master development within SAP and Microsoft integrations and events.Required SkillsJust like everyone within the H&M group, we believe you are a social, open, communicative, sales-minded, and ambitious team player full of drive and optimism.And your skills include:• Must be a self-starter and proactive individual• Team player, open-minded and solution-driven• Be a champion of DevOps mindset and principles, which emphasize automation and end-to-end ownership of solutions• Using software engineering, modern technology and a great service mind to deliver stabile, secure and compliant solutions with a cost-conscious approach• Translate product strategy and objectives into suitable, maintainable, scalable and secure solutions• Master the SAP integration development, including idocs, web services via SAP gateway, PI, CPI• Knowledgeable about Microsoft Azure, specifically Service Bus, Logic Apps, Function Apps and Event Hub• Capability to take ownership on activities, support our customers development, required mix of skills, competence and experience to meet business needsDesired Qualification• Some years of work experience as a software engineer and working according to agile principles and practices• Have been working with SAP SD, MM or GTS-Knowledge of SAP PI/CPI-SAP Gateway-SAP Idocs-SAP Events-SAP ABAP-Microsoft Azure Service Bus-Microsoft Azure Event Hub-Microsoft Azure Logic Apps and Function Apps-SAP ECC-SAP SD, MM and Trade-SAP Retail-Jira, ServiceNow ", "Role": "Software Developer,", "Industry Type": "Food Processing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Azure", "SAP SD", "SAP MM", "SAP ABAP", "GTS", "Devops", "IDOC"]}