{"Job Title": "Senior Software Engineer - Cloud Backend", "Company": "Chowbotics", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": " Chowbotics is looking for a high-caliber backend software developer to join its growing software team. The suitable candidate will have a go-getter attitude, strong computer science fundamentals, and a passion for solving complex software design problems.   RESPONSIBILITIES    Contribute to the development of our cloud backend software, which includes designing and implementing RESTful Web services and APIs.     Write clean, efficient, well-documented, and reliable code.     Write unit tests and automate execution of test cases to ensure that code quality meets a minimum set standard before it is handed to the software testing team.     Collaborate with the various stakeholders throughout the software development cycle to ensure timely delivery of high-quality software to our customers.     Debug customer-reported issues, identify bottlenecks, and design and implement solutions.    QUALIFICATIONS    Bachelor s or master s degree in CS/CE/IT or a related field.     Strong foundation in computer science and engineering: algorithms, programming, software architecture skills, databases, design patterns, virtualization, etc.     5+ years of experience as a software developer with fluency in Node.js.     Prior experience with the following is not required but would be a plus:     Modern microservice-based and serverless architectures and big data platforms     Development in AWS or Azure environment     Python and scripting languages     REST API documentation     Experience in implementing unit tests and testing automation, and excellent debugging skills.     A team player with ability to work well with remote team members, including in overseas locations.     Excellent English communication skills and a flair for working in a fast-paced and results-oriented environment.      ", "Role": "Software Developer,", "Industry Type": "Food Processing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "CA in CA, Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Computer science", "Software design", "Backend", "Chef", "Customer support", "Test cases", "Virtualization", "Forecasting", "Robotics", "Python"]}