{"Job Title": "Drone/UAV Engineer", "Company": "Indiafirstrobotics", "Experience": "0 - 2 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": " We seek applications from experienced Drone Engineers for a fantastic drone development opportunity,  Successful candidates will be able to work well in a small team and have hands- on experience.     Responsibilities and Duties      Can develop technologies from concept,  specification through to implementation    Experience with static drones    Ability to provide drone solutions for specific requirements    Path planning,  localization,  and control algorithms for aerial robots.    Drive the development of path planning,  localization and control algorithms for fixed- wing and multi- rotor UAVs.    Actively participate in all stages of design,  implementation,  testing and product release.    Work closely with multiple teams and keep up to date on the fast- moving robotics technology landscape.    Background in robotics,  computer vision,  pattern recognition,  machine learning,  and autonomous systems.    Self- motivated individual with little guidance and with the ability to work and communicate effectively within a development group is desired.      Key Skills     Drone/UAV,  C,  C++,  Python,  Embedded System     Required Experience and Qualifications     Nice to have:     Entry- level 0 to 2 Years of experience    Working knowledge of ROS,  OpenCV,  Gazebo    Experience with UAVs    Experience running algorithms on hardware for real- world scenarios    Could be Young,  dynamic Engineers that have won drone- related development competitions   ", "Role": "Software Developer,", "Industry Type": "Food Processing,", "Functional Area": "IT Software - Embedded, EDA, VLSI, ASIC, Chip Design,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer vision", "C++", "Opencv", "Machine learning", "Hardware", "Pattern recognition", "Internship", "Robotics", "Python"]}