{"Job Title": "Senior Software Specialist", "Company": "IFF", "Experience": "8 - 13 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "  As Senior Software Analyst, you will be responsible for responsible for leadership and direction of the project, coordinating with business teams, technical teams, and end-users in achieving the corporate deliverables on-time.   You will be required to manage and Deliver SAP HR projects. This involves managing the initiation, planning, designing, development, implementation transition to support and support.   This position reports to Director, Business Relationship Mgmt.    You will spend your time    Strong interaction with the Business, Business Process Engineer, Super Users, Application Engineers, Application Developers and Project Managers are essential.    Collaborate with other IT and Business teams to deliver the Project with High Standards.   Have the capability to understand Vendor tools related to HR and be able to work with them to meet the business requirements.   Able to deliver projects based on sound HR configuration concepts and improvise with newer design approaches.   Act as SME to the Support group.   HR will be the primary focus area although incumbent may also be expected to become knowledgeable of other SAP modules   Priority Time Guidelines:   Projects Delivery 70%   Support Activities and Knowledge sharing 15%   Creativity Innovation Overall user experience 15%          What you will need to be successful  Essential Skills     The ideal candidate should be able to work both on functional and technical aspects of HR Systems (Primarily SAP) and who will perform following tasks:    Expertise in SAP HR. Must have knowledge in the modules:   o Organizational Management  o Personnel Administration  o Payroll (European Countries)  o SAP Cloud for Travel.   Must have RICEFW development expertise along with hands-on development skills in Web Dynpro ABAP and SAP Fiori.    Expertise in integration between various SAP systems and between SAP and third-party systems.   Extensive knowledge on SAP HR logical databases, reporting, infotypes and relevant enhancements.   Design, Configuration, Development and Testing of HR Systems and technologies.   Various phases of SDLC and support of SAP and other HRIS systems.   Ability to work simultaneously on Projects, Enhancements and Production Support.   Experience working with ticketing systems and status reporting.   Should be good with documentation, knowledge transfer and the ability to collaborate and work with the rest of the team.     Essential Experience    Post-Graduation Professional   8+ years of experience SAP ABAP HR.   3 to 4 Years of HR is an added advantage.    Minimum 4 to 5 end to end implementation.   Multiple Support projects   Knowledge in ABAP debug knowledge would be an added advantage.   SAP HANA experience.   SAP SuccessFactors experience    Job Relevant Competencies:  Business Focus    Good in presentation skills.   Strong MS Office skills (Excel PPT Word etc.,)   Good in Communication skills (Verbal and Written)   Solid team work and interpersonal skills; meet challenging time lines.   Ability to establish and maintain a high level of customer trust and confidence in the support team s knowledge of and concern for our end-users business needs    Highly motivated and a self-starter.         ", "Role": "Software Developer,", "Industry Type": "Food Processing,", "Functional Area": "IT Software - ERP, CRM,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Business process", "Payroll", "Ticketing", "Production support", "HRIS", "Organizational management", "MS Office", "Information technology", "Software Analyst", "SDLC"]}