{"Job Title": "Sr. Development Operations Engineer", "Company": "Cargill India Pvt. Ltd.", "Experience": "4 - 7 years", "Salary": "Not Disclosed", "Location": "karnataka", "Job Description": "  * JOB PURPOSE AND IMPACT   The Development Operations Infrastructure Engineer III will strengthen the security automation capabilities which have been identified as a critical area for growth and specialization within global information technologys scope. In this role, you will collaborate with our security leadership, engineers operations center, incident response team and cyber intelligence operations teams to help them use the capabilities of our security automation and orchestration platforms. You will help customers in their use case identification, planning, implementation, development and training to make machine data accessible, usable and valuable to everyone.  KEY ACCOUNTABILITIES   Build and maintain systems used by teams in the command center, build and deploy applications using current technology and continuous integration and scripts that will backup databases and applications on demand.   Implement monitoring and health checks to make sure that the infrastructures are performing at optimal levels and provide reports that show uptime and status of infrastructures.   Participate in the creation of development and operational processes, building and maintaining continuous integration and delivery pipelines.   Provide guidance and technical support within the creation of design, engineering specifications and development artifacts.   Provide delivery of service level agreements, service performance measures, risk mitigation and issues resolution.   Conduct research on new emerging tools and techniques and make presentation on their merits and recommendations.   Independently handle complex issues with minimal supervision, while escalating only the most complex issues to appropriate staff.   Other duties as assigned   * MINIMUM QUALIFICATIONS   Bachelor’s degree in a related field or equivalent experience   Ability to communicate technical details in a clear and understandable manner   Experience using related technologies   Minimum of four years of related work experience   Other minimum qualifications may apply   PREFERRED QUALIFICATIONS   Masters degree   Experience in the area of cybersecurity   Experience using automated testing tools   PRIOR BENEFICIAL EXPERIENCES   Contribute to the design of risk and security solutions, processes or policies requiring a general understanding of risk and security practices and procedures.   Perform routine activities to ensure compliance with risk and security or regulatory policies, standards, procedures and guidelines.   KEY BEHAVIORS   Creates new and better ways for the organization to be successful.   Makes good and timely decisions that keep the organization moving forward.   Builds strong customer relationships and delivers customer-centric solutions.   SKILLS AND EXPERIENCES TO BE GAINED   Advise on the design of risk and security solutions, processes, or policies requiring a thorough understanding of risk and security practices and procedures.   Identify and assess risk and security threats with high business impact, taking appropriate action.   Experience performing high-complexity tasks requiring expert risk and security knowledge.  ", "Role": "Software Developer,", "Industry Type": "Food Processing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["continuous integration", "Automation", "Service level", "Automation testing", "Testing tools", "Information technology", "Operations", "Technical support", "Monitoring", "Risk mitigation"]}