{"Job Title": "Engineer", "Company": "Cargill India Pvt. Ltd.", "Experience": "3 - 5 years", "Salary": "Not Disclosed", "Location": "karnataka", "Job Description": "   We seek an Application Development Analyst II who will maintain, integrate and implement software applications within our organization. In this role, you will help conduct software application testing, quality assurance, configuration, installation and support to ensure smooth, stable and timely implementation of new software and updates to installed applications.    Participate in compiling and prioritizing enhancements and defect resolutions to applications, implementing changes.     Conduct technical software testing and debug systems and software applications, as needed.     Perform standard and moderately complex programming, coding and documentation of systems and applications software.     Analyze business requirements and prepare detailed technical specifications to write applicationsand programs.     Provides input into the strategy and technical planning of system/application technology in accordance with internal and external software compliance standards.     Independently solve moderately complex issues with minimal supervision, while escalating more complex issues to appropriate staff.     Other duties as assigned    * MINIMUM QUALIFICATIONS   Bachelor?s degree in a related field or equivalent experience   Minimum of two years of related work experience   Other minimum qualifications may apply  ", "Role": "Software Developer,", "Industry Type": "Food Processing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Application Development Analyst", "Software testing", "Application testing", "Manager Quality Assurance", "Compliance", "Coding", "Manager Technology", "Analyst II", "Application software", "Supervision"]}