{"Job Title": "Cloud Engineer", "Company": "Cargill India Pvt. Ltd.", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "karnataka", "Job Description": "      JOB PURPOSE AND IMPACT    We seek an Application Development Analyst II who will maintain, integrate and implement software applications within our organization. In this role, you will help conduct software application testing, quality assurance, configuration, installation and support to ensure smooth, stable and timely implementation of new software and updates to installed applications.   KEY ACCOUNTABILITIES    Participate in compiling and prioritizing enhancements and defect resolutions to applications, implementing changes.      Conduct technical software testing and debug systems and software applications, as needed.      Perform standard and moderately complex programming, coding and documentation of systems and applications software.      Analyze business requirements and prepare detailed technical specifications to write applications and programs.      Provides input into the strategy and technical planning of system/application technology in accordance with internal and external software compliance standards.      Independently solve moderately complex issues with minimal supervision, while escalating more complex issues to appropriate staff.      Other duties as assigned     Qualifications   MINIMUM QUALIFICATIONS       KEY BEHAVIORS       SKILLS AND EXPERIENCES TO BE GAINED    Bachelor s degree in a related field or equivalent experience      Minimum of two years of related work experience      Other minimum qualifications may apply      Build partnerships and collaborate with others to meet shared objectives.      Make good and timely decisions that keep the organization moving forward.      Make sense of complex, high-quantity, and sometimes contradictory, information to effectively solve problems.      Gain substantial and broad application development knowledge.      Experience conducting advanced and complex application development activities.     MINIMUM QUALIFICATIONS     Bachelor s degree in a related field or equivalent experience    Minimum of two years of related work experience    Other minimum qualifications may apply     KEY BEHAVIORS     Build partnerships and collaborate with others to meet shared objectives.    Make good and timely decisions that keep the organization moving forward.    Make sense of complex, high-quantity, and sometimes contradictory, information to effectively solve problems.     SKILLS AND EXPERIENCES TO BE GAINED     Gain substantial and broad application development knowledge.    Experience conducting advanced and complex application development activities.   ", "Role": "Software Developer,", "Industry Type": "Food Processing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Application Development Analyst", "Software testing", "Application testing", "Manager Quality Assurance", "Coding", "Manager Technology", "Application development", "Analyst II", "Application software", "Supervision"]}