{"Job Title": "Mobility Solutions Lead", "Company": "Cargill India Pvt. Ltd.", "Experience": "6 - 9 years", "Salary": "Not Disclosed", "Location": "India-Karnataka", "Job Description": "         Position Purpose Summary                Seeking creative, passionate, engineering minded mobile solutions lead for an environment with a core set of values anchored in trust, autonomy and a relentless focus on user experience to build innovative digital solutions in Cargill.              As markets and industries evolve in a digital way, so must Cargill if it wishes to maintain and improve its leadership position in the food, trading and agriculture industries it engages in. As such, Cargill is actively working to realize Digitalization and Analytics (DA) as a core competency throughout its many business lines. Within our Digital Experience Office team (DXO), our product development team provides instrumental software development services, enabling our businesses? digital future.              Strong candidates will have experience throughout the entire development stack and a broad background in custom software engineering.              The role of Solutions Lead falls within the mobility space of DXO which focusses on both external and internal facing mobile solutions for customers. A Solutions Lead is the endtoend owner of a development project across mobility technologies to ensure integrity and quality of project deliverables, helping it stay within budget, timelines, and agreed upon scope while meeting the expectations and requirements of the project.              The Solutions Lead ensures that all mobility development resources are assigned, meeting yields in alignment to the project estimate across multiple mobility technologies within the mobility development team. A Solutions Lead is the single point of contact for the regional application enablement integration consultants and ensure the mobility development factory meets the project deliverables.             The Solutions Lead also ensures Application integrity for global mobility policies and programs, leads research and analytics for mobility projects.              40% Delivery Management                Facilitates work intake/explore discussions, with a mindset for architecture and delivery             Partners with PO?s to understand product roadmap and product vision.             Accountable for successful completion of App SOWs, managing financials, timeline delivery .             Regularly measure and monitors project progress to identify variances from the plan and make needed corrections.             Communicate effectively with regional and global stakeholders on project status to ensure successful completion and transition to steady state.              Create and ensuring staffing plans within the development team and managed service provides to identify effort and required skills to ensure project success.              Provide mentoring and coaching to project team members as appropiate.             Manage risk identification and risk mitigation strategies throughout the delivery of the solution.             Promote a strong team culture by making the team members feel valued and fostering an environment of open communication and teamwork.             Review work completed by the team and provide timely feedback to enable them to improve their performance.                30% Solution Governance                Ensure that the key functional/technical areas are well understood and managed from architecture perspective.             Ensure development teams are well prepared in the understanding of the solution architecture needed to be supported by their technical designs and key infrastructure requirements or impacts are understood and communicated.              Manage and review architecture solutions, ensuring they are aligned to Enterprise Architecture (EA) standards, quality and principles, as well as meet EA guidelines, common solutions and services are leveraged and that they meet financial targets (cost and benefits).             Participate in Solution Architecture Reviews as the primary mechanism of architecture quality and compliance assurance.             Enterprise Architecture Exception Management - to Manage exceptions to Enterprise Architecture standards and policies.              Provide Governance Support - Overall Enterprise Architecture input to all relevant program / solution decisions and champion the usage of Enterprise Architecture assets used within key Integration functional/technical areas across the Tech/Dev Teams activities on a project request.             Perform reviews of software and system solution ensuring they are appropriately scoped to meet business requirements, successful development and are operationally sustainable long term.              Key contributor into the strategy and technical planning of system/application technology in accordance with internal and external software compliance standards.             Ensure strategies, positions, and design patterns used to build deliverable objects from both a technical and functional viewpoint to deliver the solution.                30% Consulting Ideation                Be the product ambassador and expert in our Bangalore office that includes engineers, architects and technical support staff.             Serve as the voice of the customer internally.             Lead solution proposals estimations, working with tech experts (internal/external).             Front end business conversations acting as bridge between stakeholders and tech team(s).             Ideate newer products that having emerging technical capabilities like AI/ML, Intelligent Automation/Vision.             Partners with BRMs and Product Owners to create a relevant demand (incoming portfolio), ensure work intake process bring work to the Pod.                  Education, Experience, Skills               Required Qualifications              Bachelor?s Degree in Computer Science, related discipline information systems or relevent work experience.             Experience with Agile development framework, leading team(s) of engineers.             6 or more years of application mobility development lifecycles, project management and systems integration technologies.             Experience with one or more industry leading development framework(s) such as React Native, Flutter, Xamarin.             Experience with one or more continuous integration and deployment technologies such as: BitRise, Github, Artifactory et. al.             Experience with containerization tools such as Docker, Kubernetes.     [AD1]               Experience working/managing 3rd-party implementation partners in implementation scenarios.             Demonstrated understanding and application of project management principles; including planning, cost, quality, schedule, gated process, and critical path management.             Demonstrated ability to drive work and influence others without a direct reporting relationship including senior level personnel.             Demonstrated ability to be successful in ambiguous environments, driving results in a dynamic setting.             Demonstrated ability to think strategically with strong problem solving/decision-making and conflict resolution skills.             Demonstrated ability to build relationships and communicate at all levels of the organization and cross-function/platform.                Preferred Qualifications              Exposure to working in diverse ecosystem, across regions/geos, for a global organization.             Experience with test-driven development frameworks for application and infrastructure code.             Experience with one or more programming and scripting languages, primarily Javascript, DotNet and/or Ruby.             Experience with one or more cloud-based infrastructure as a service platforms such as AWS, Azure et. al.             Knowledge of components of enterprise architecture.             Industry certifications (Examples include SAFE, ITIL, APICS, six sigma, etc).             Experience of working with ERP?s such as SAP, across environments/integrations.             Overall knowledge of the mobile solutions market, including key vendors and offerings.       ", "Role": "Technical Architect,", "Industry Type": "Food Processing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Solution architecture", "ERP", "Automation", "SAP", "Front end", "Enterprise architecture", "Project management", "Consulting", "Javascript", "Ruby"]}