{"Job Title": "Architect, IOT Edge", "Company": "PEPSI FOODS PRIV LIMITED", "Experience": "8 - 10 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "         Experience in working with IOT edge domain and specifically in Digital Fountain Machine and Vending Machine and their embedded design                 Experience in device edge gateways, Industrial MCUs and their connectivity with Cloud services (IOT Platform) as well as internal to other embedded systems.              Experience in working on M2M communication in IoT Context              Experience with NCITs, monitoring equipment, communication gateways e.g. Ability Edge Gateway, and supervision products (SCADA, CMMS, PLC, Historian)                 Expertise in Cloud computing, with implementation experience in either of Azure (  preferred  ), AWS or PTC Thing Worx or any other IoT cloud along with Network technologies protocols including MQTT, REST, AMQP, HTPS, WebSocket, Modbus, OAMDM, OPC/UA, Zigbee, LoRa, BLE, NBIoT              Implementation knowledge Edge HA. Business Continuity and Disaster Recovery        Payload conversion from OPC to Industry 4.0              Qualifications/Requirements       Years of experience 8-10 years     Advanced knowledge experience in embedded systems         BE / BS / B.Tech / MCA with min. 8 years of work experience in IoT and service-oriented architectures within RD              Edge, and Cloud Technology competencies e.g. Docker, multi tenancy, REST API, Web-Protocols, HTML5, Demonstrated programming depth in Python, C# / Java, Kubernetes and Grafana                 Knowledge of End-to-end security for IoT security spanning across edge layer security, application, transport, network, cloud and infrastructure security controls, data privacy and protection controls.               Knowledge and awareness on IoT gateways products, agents, sensors and devices.               Own and establish best practices in architecture, design and development, command over DevOPs process and tools. Guide and Mentor development teams in driving best practices in engineering and software development.                             Envision and develop end-to-to solution architecture for IoT based business solutions spanning devices, gateways, connectivity, cloud, apps, integration, analytics and security layers, addressing functional and non-functional aspects                            Passionate about the Internet of Things, Cloud Technologies, Micro-services, DevOps technologies, AI/ML/Analytics          Experience working on Linux based Operating Systems               Ability to communicate with stakeholders on different levels (hierarchy, cross organizational, cross company)                      Driver for change management in engineering community, creative innovation driver with strong ownership and commitment                      Target oriented, pro-active and self-motivated      Multi-cultural and convincing team-player     Self-dependent and structured work           Able to work in a demanding and competitive context                 Good to have Azure Stack Edge or Azure Sphere experience     Architect, IOT Edge  ", "Role": "Software Developer,", "Industry Type": "Food Processing,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization, B.Tech/B.E. in Production/Industrial", "PG": "MCA in Computers", "Doctorate": "None", "Key Skills": ["Cloud computing", "Change management", "Linux", "Cloud", "Sensors", "Business solutions", "Monitoring", "Analytics", "SCADA", "Python"]}