{"Job Title": "Expert Application Data Base Analyst", "Company": "Colruyt IT Consultancy India Pvt. Ltd.", "Experience": "8 - 13 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "      Expert Application Data Base Analyst    Overall 8 years of experience   Able to analyze database requirements   Able to design database solutions   Able to design database solutions for at least one of the following database platforms: Oracle   Able to follow defined DBA standards guidelines (SG), database development processes methods   Able to prepare maintain database documentation according to the desired standard*. (*desired standard \" documentation should be functionally meaningful and timely)   Able to acquire functional knowledge of multiple applications within a business domain   Able to acquire technical knowledge to become responsible in at least one technical area / technology of the database domain   Database Analysts (DBA) have the following responsibilities:    Design logical/physical data models and create physical databases for the software development projects   Maintain database throughout the life cycle of a project   Help developers to achieve the desired performance with the database operations optimizing the database objects and queries; also acts as a consult for IMSL service requests   Perform several operational tasks like replication and decommissioning of database, maintaining data in sync between the production system environments, managing the data dictionary (metadata information), reviewing the data exchange services across domains and platforms   Perform the ombuds activities within the scope of database analysis domain   Could be assigned as the person responsible for a project or phase of a project, to act as a project manager for the project or phase   Evaluate data models and physical databases for variances and discrepancies. Validate business data objects for accuracy and completeness.   Guide Programmers and others on performance requirements. Review modifications to existing software to improve efficiency and performance. Examine new application design and recommend corrections if required.       To proactively respond to services and products that have an added value for internal and external customers.   The capacity to understand communication from others, interpret the same correctly and to pass on messages to others clearly.   The capacity and readiness to take a decision (within the framework provided) and to take responsibility for the results of the decision.   The ability to find solutions in the face of problems.   ", "Role": "Software Developer,", "Industry Type": "Food Processing,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Data dictionary", "Analyst", "Application design", "Project development", "metadata", "Database", "Database administration", "Database maintenance", "Oracle", "Operations"]}