{"Job Title": "SAP Application Manager", "Company": "Cargill India Pvt. Ltd.", "Experience": "8 - 10 years", "Salary": "Not Disclosed", "Location": "India-Karnataka", "Job Description": "  JOB PURPOSE AND IMPACT    We seek an Application Development Associate Director who will provide broad oversight and guidance for our medium-sized team that maintains, integrates and implements software applications within the organization. In this role, you will lead individuals who conduct software application testing, quality assurance, configuration, installation and support to ensure smooth, stable and timely implementation of new software and updates to installed applications.    KEY ACCOUNTABILITIES      Develop and foster new and existing relationships with management, consultants, and users to understand business priorities while compiling and prioritizing, enhancements and defect resolutions to applications.     Provide broad oversight and advise supervisors and staff in technical software testing and debugging of systems and software applications, as needed.     Supervise a medium-sized team performing standard-to-advanced and highly complex programming, coding and documentation of systems and applications software.     Provide broad oversight and guidance for activities, which include analysis of business requirements and preparation of detailed technical specifications to write applications and programs.     Help set high-level direction, strategy and technical planning of system/application technology inaccordance with internal and external software compliance standards.     Develop plans and deliver results in a fast-changing business or regulatory environment, while leading and developing a team of experienced professionals and supervisors, coaching and making decisions related to talent management hiring, performance and disciplinary actions. You will also collaborate with managers and supervisors in your organization to ensure staff selections align with current and future needs.      MINIMUM QUALIFICATIONS      Bachelor s degree in a related field or equivalent experience     Minimum of six years of related work experience      PREFERRED QUALIFICATIONS      Three years of supervisory experience      Experience with ITIL procedures      SAP deployment experience      ", "Role": "Software Developer,", "Industry Type": "Food Processing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Software testing", "Career development", "SAP", "Manager Quality Assurance", "Coding", "Debugging", "Deployment", "Application development", "Talent management", "Application software"]}