{"Job Title": "Dairy Veterinary Sales Advisor", "Company": "Cargill India Pvt. Ltd.", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "India-Tamil Nadu", "Job Description": "        JOB PURPOSE AND IMPACT              The Dairy Veterinary Sales Advisor will participate in faceto face and remote selling to our new and existing customers, selling directly or indirectly through various sales channels. We seek a results-oriented professional who, with guidance, will help assess customer needs and suggest appropriate products, services and solutions.              KEY ACCOUNTABILITIES                Contribute to developing and delivering sales bids, presentations and proposals and participating in product demonstrations.               Help identify and contact prospective customers, building relationships to generate future sales and repeat business.               With basic knowledge of products, their characteristics and market, sell and stimulate demand for a series of products.               Plan daily activities, including customer visits and quantitative and qualitative objectives to achieve.               Follow market and competition evolution, passing information to senior staff.               You will work under direct supervision and handle basic issues and problems, while referring more complex issues to higher-level staff.               Other duties as assigned              MINIMUM QUALIFICATIONS          Other minimum qualifications may apply          PREFERRED QUALIFICATIONS          Fresher with full time Graduation willing to travel extensively across Coimbatore areas with Positive attitude.        ", "Role": "Sales Executive/Officer,", "Industry Type": "Food Processing,", "Functional Area": "Sales, Retail, Business Development,", "Employment Type": "Full Time, Permanent", "Role Category": "Retail Sales", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Sales Advisor", "Sales", "Veterinary", "Supervision"]}