{"Job Title": "LEAD SOFTWARE DEVELOPER", "Company": "Collins Aerospace", "Experience": "0 - 2 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  Lead Software Developer     Overview:  Looking for the developer who has good experience in Web Development,   has good understanding on SDLC,  work close with counterpart. Good oral  and written communication.  Position: Lead Software Developer (P2)   Primary Responsibilities:   Must have 3 years of strong Liferay development preferably version 7.0 and above.   Must have min 2 years of experience in Java and Using Enterprise tools such as Tomcat,  Apache,  Portal technology such as Liferay,  Soap and REST.   Must have relevant experience on Liferay hook and ext.   Must have Portal/portlet development experience - using Liferay plugin and Liferay SDK.   Must have strong experience in React JavaScript framework.   Good to have knowledge of Liferay extension environment and how to develop various kinds of Liferay plugins are a must.   Should be experienced in \"\" Responsive Design\"\" using Liferay platform. Expert knowledge of HTML5 and CSS3 ,  AUI script etc..   Relevant experience on Liferay Themes , layouts and Alloy UI.   Must be fluent in web application development.   Experience in Developing web services,  json or RestFul integration with mobile devices.   Must have experience in Jenkins,  Build Management (Ant/Maven).   Must have relevant experience with JavaScript,  AJAX,  jQuery,  CSS,  XHTML.   Relevant experience in database (preferably MS SQL Server,  Oracle).   Development experience with web infrastructure.   Good to have Development experience with at least one other portal framework or web application framework.     Basic Qualifications:    Bachelors/Masters   degree in Engineering/MCA   Primary Skills:  Liferay 7.0 and above,  ReactJS   HTML,  CSS,  JavaScript  SVN/GitHub    ", "Role": "Software Developer,", "Industry Type": "Aviation, Aerospace, Aeronautical,", "Functional Area": "IT Software - Other,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization, B.Tech/B.E. in Production/Industrial", "PG": "MCA in Computers", "Doctorate": "None", "Key Skills": ["MS SQL", "jQuery", "Web development", "Javascript", "XHTML", "HTML", "JSON", "Oracle", "SDLC", "Ajax"]}