{"Job Title": "Junior Software Developer", "Company": "JooMonk Technologies", "Experience": "0 - 3 years", "Salary": "Not Disclosed", "Location": "Coimbatore", "Job Description": "    Job Description   Junior Software Developer Who we are    We are TealOrca! A software company of 10 people like PHP devs, python devs, react devs located in coimbatore. We believe the people and their words more than any process and reports. We believe in results and intention rather than a show off of skills.     We have a clean and spacious office with fast systems (16 GB RAM) and 24 inch monitor with 4 feet table space and confortable chairs (a heaven for developers). But due to pandemic out offices are closed : ( and we value the health of people and we for next 6 to 8 months will be working from HOME. We miss our TT table and carrom matches too.  What is the job    Your Job is SOFTWARE DEVELOPMENT. From the scratch, we will be giving you detailed training on OUR WAYS of development. We will open your eyes to a special world of development and also give you challenging problems to solve and build new software solutions that will be used across the GLOBE for REAL.     You will be building solution for a product based company guided by solution architects and Senior product owners. Working on a Product based solution with challenging problems is always a thrilling journey also we get to learn a LOT !We wanted people who know what they are doing and who knows how to handle a situation and stay in control of it all the time.  What you need to know    You should be eager to learn new technology / Think outside the box / Staying true to our companys core values and needs while lending your own creativity to the mix.  Rather than saying what you know, if you show us what you have done and how you have done and how you mastered a thing / how well you understood a thing / how fast you are able to grasp a concept and requirement / how well you understand clients / how deep you love programming / what have you ever done for your love of programming.    You might have contributed to a open source library / might have took an online class of your fav technology during this pandemic lock down / have done a super secret pet project / have learnt a new technology. Show that tell that speak about you and let us know.  Qualification    MSC BSC BE  well most of you know those are just tags. We prefer the candidate knows all of basics of Computers like Networking, DBMS, Programming, Data structures. We do not care about the degree. Also as a fresher we know what to expect.Here we believe the right mindset and hard work pays itself.  Technical Skillset    Computer science basics     Good Problem solving and programming skills     DBMS, Networks, OS, Data Structures, Programming basics     Strong in any one programming language like C, C, Java, PHP, Python etc.,     Job Type: Fulltime     Salary: per month    Experience:     Fresher    It is STRICTLY WORK from office   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "C++", "Networking", "Programming", "PHP", "Data structures", "DBMS", "Open source", "Software solutions", "Python"]}