{"Job Title": "Software Developer", "Company": "Wizmatrix Consulting Pvt. Ltd ", "Experience": "0 - 2 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru( 2nd Phase JP Nagar )", "Job Description": "Job Overview:Responsibilities: Develop, record and maintain cutting edge web-based PHP application.  Ensure HTML, CSS, and shared JavaScript is valid and consistent across applications Prepare and maintain applications utilizing standard development tools Convey effectively with all task progress, evaluations, suggestions, schedules along with technical and process issues Document the development process, architecture, and standard components Ability to architect and execute scalable, innovative concepts both on your own and as part of a team Coordinate with co-developers and keep project manager well informed of the status of development effort  Keep abreast of new trends and best practices in web developmentRequirements: 1 or 2+ experience with PHP Codeigniter.  Excellent knowledge of PHP based MVC frameworks like Codeigniter, Laravel (optional).  Working knowledge of MySQL database. Open minded to new solutions, forward thinking and strong ability to adapt Ability to learn quickly and operate in a fast-paced environment Proficient understanding of code version tools such as Git, Bitbucket. Expertise in efficiently using Git branches for features/issues. Solve complex performance problems.  Optimization of the application for maximum speed and scalability  Build efficient, testable, and reusable PHP modules. Good to have knowledge of HTML, CSS, JavaScript. ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Electronics/Telecommunication, Computers", "Doctorate": "None", "Key Skills": ["CSS", "Software Development", "MySQL", "Javascript", "PHP", "HTML", "MVC", "Laravel", "Web Development", "Codeigniter"]}