{"Job Title": "Associate Software Engineer / Functional Consultant / Developer", "Company": "Vistex Asia Pacific Pvt. Ltd", "Experience": "0 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": " DescriptionVistex is seeking Associate Software Engineers / Associate Functional Consultants / Associate Developers for a dynamic, enthusiastic team members to contribute to the long term success of the Organization. You will join a group of skilled and passionate individuals working on a variety of interesting and challenging projects. You will be part of a team that is focused on delivering excellence, improving their skills, and working to solve complex problems.Vistex is an SAP software solutions extensions partner serving businesses of all sizes worldwide across a spectrum of industries by managing their master data, contracts, pricing, rebates and incentive programs. Our solutions provide unprecedented visibility into the breadth and depth of go-to-market programs and enable businesses with insightful information that drive revenue, control costs and increase margins. Our deep industry expertise coupled with in-house implementation, delivery and training services makes Vistex a full solutions resource and consultancyWhat We Can Offer You:Great opportunity for an individual who is looking for a fast paced, challenging      environment, where you will experience something new each day. Continued growth within the company and a collaborative environment where you can      share your ideas with other like-minded and passionate people. Flexible working environment.Requirements:Qualification : B.Tech/BE ( CSE,IT & ECE), min 60% aggregateYear of Passing : 2020 & 2021  OnlyGood Communication SkillsExcellent interpersonal, written and oral communication skills.Excellent analytical and problem solving.Ability to learn new technologies quickly.Added  advantage if trained in ABAP/SD/HANAInterview Process:Written Test (Aptitude & Programming)Technical Interviews  2 LevelsHR Interview", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "Doctorate": "None", "Key Skills": ["PP", "UI5", "Aptitude", "SD", "SAP", "ABAP", "FIORI"]}