{"Job Title": "Senior Software Developer - Pune", "Company": "CRISIL LIMITED", "Experience": "4 - 9 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": " ExperienceBE/Masters in Computer Science or equivalent certification8+ years of experience in software development Job DutiesC# .Net developer to work on the front   office trading technology unit, in the market data and analytics team, to   work on the development of high performance analytical engine. The candidate   would be a part of a global team in NY (US), Raleigh (US), London (UK),   Wroclaw (Poland) and Pune (India), and would directly interact with BAs, and   other developers in the team.The job duties would involve:Working on various front office trading technology unit, in the market data and analytics team.Developing the analytics   engine and integrate with quant libraries to produce bond analytics (e.g.   YTW, YTW, next call, discount margin, money mkt yield, DV01, Z spread etc.).Role involves reengineering   of the existing platform and coverage of incremental changes to the existing   platform Working closely with L1 and L2 support teams and provide dev support   for the applicationsSupporting the technical design process by participating in various   technical application requirements.Extensive experience in SDLCProviding quality assurance review and the   evaluation of existing and new software productsMaintaining and tuning applications in   liaison with various business requirementsCoordinating with various stakeholders around   the globe and providing web support to all the applications.Mult-tasking, out of box thinker, quick   learner Skills RequiredExperience in fixed income trade capture, front to back trade flow,   and complete trade and position management.Experienced as developer in software developmentExtensive experience in programming using .NET Framework 4.0/4.5.Excellent organizational, problem solving, and written/verbal   communication skills. Experience with all phases of the systems development lifecycle Very thorough understanding of the .Net fundamentals and design   patterns used in real time transaction processing systemsExtensive experience in server-side programming and high performance   and high availability systems.Good understanding of fundamentals, e.g. algorithms, data structures,   time and space profiling, system integration/networks, infrastructure and   hosting platforms etc.Extensive experience in messaging protocols (FIX, TCP/IP, JMS based messaging:   EMS, MQ)Extensive experience working with distributed and enterprise systems,   SOA.Good experience in RDBMS.Ability to work with front office, QS, and other front office   technology and business stakeholders.Plus: Bloomberg experience and basic database. Roles About CRISIL GR&A: CRISIL Global Research & Analytics (GR&A) is the   largest and top-ranked provider of high-end research and analytics services   to the world's leading commercial and investment banks, insurance companies,   corporations, consulting firms, private equity firms and asset management   firms. CRISIL GR&A operates from centers in Argentina, China, India and   Poland, providing support across several time zones and in multiple languages   to global organizations. It has deep expertise in the areas of equity and   fixed income research (covering global economies, 150 global sectors and over   3000 global companies), credit analysis, exotic derivatives valuation,   structured finance, risk modelling and management, actuarial analysis and   business intelligence.CRISIL GR&A   includes Irevna, Pipal Research and Coalition, firms which were acquired by   CRISIL. For more information, please visit www.irevna.com, www.pipalresearch.com   and www.coalition.com", "Role": "Software Developer,", "Industry Type": "Banking, Financial Services, Broking,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "Doctorate": "None", "Key Skills": ["Software Development", ".Net developer", "C#.Net", ".Net", "ASP.Net", "dotnet developer"]}