{"Job Title": "Looking For Software Developer/ Sr. Developer - Noida", "Company": "Ceasefire Industries Private Limited", "Experience": "3 - 7 years", "Salary": "Not Disclosed", "Location": "Noida, Greater Noida, Delhi / NCR", "Job Description": "Designation : Software Developer/Sr. Software Developer Job Description: Having experience in field of developing software. The person should have expert to operate as per below list:1. .Net core 3.0 2. Angular 8 & above,3. Type script,4. Web API,5. Window Service6. JQuery,7. C#8. SQL Server Must Have minimum 1 year of experience on Angular. About Ceasefire:-Ceasefire, India's most trusted fire safety and security brand is today a holistically integrated Fire Safety & Security solutions conglomerate.Having invested extensively in R&D, the company has a range of over 400 revolutionary lifesaving products that span from prevention to early detection to firefighting to evacuation and post fire damage control. The pioneer brand in the domain, Ceasefire has been the name synonymous with new age technologies that have been far ahead of their times. Today Ceasefire's total green solutions and intelligent protection systems continue that trend.Products aren't assembled at Ceasefire but engineered to perfection. Every Ceasefire product conforms to highest global standards and carries a host of international quality certifications.Backed by state-of-the-art production facility in Dehradun, a team of 2000 reach out to 3000 new customers every month from over 100 branches that cover more than 300 towns and cities across India.No wonder then, the family of Ceasefire customers is today a 2, 00,000+ and a Ceasefire Product is sold every 61 seconds and a life is saved every 9 minutes.Note: Open for 6 days working profile.", "Role": "Software Developer,", "Industry Type": "Office Equipment, Automation,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Software developer", "C#", "angular", "Software Development", "Web API", "jQuery", ".NET Core 3.0", "Type Script", "SQL Server"]}