{"Job Title": "Software Developer", "Company": "RCPC", "Experience": "4 - 6 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": "Roles and Responsibilities  We are looking for an IT Software Developers Leads who can work as a mentor for new or lower-level software developers or programmers, as well as for all the members on the development team. Your primary responsibility will delivering business critical projects whilst maintaining high morale, managing the day to day activities in an efficient and professional manner and ensuring all team targets are met as advised. It also includes recording work progress on a weekly basis. Thus, IT Software Developers Leads plays critical role to the success of any software development team.Requirements: Willing to delegate. Expert in managing team by providing timely solutions addressing and aligning to business requirement. Expert in Working with Solutions Owners, Solutions Analysts, Business Owners and Customers to translate requirements into solutions to meet business needs. Expert in providing guidance, instruction, direction and leadership to a group of individuals Experience in designing, testing, implementing, deploying and managing of applications and services. Expertise in conducting training sessions with employees. Conducting periodic performance review of IT Support Service. Expert hand in researching, designing, implementing and managing software programs. Strong experience in Asp.net technology. Expert knowledge in technologies: MVC, AJAX, SQL Server, Angularjs. Involved in designing database tables and stored procedures. Efficient in requirement gathering and interaction with client. Expertise in transforming client business Requirements into Functional both.Skills: Time management skills Influential in Core Areas Computer programming skills and coding skills. Object-oriented design skills Outstanding interpersonal skills Leadership skills Willing to delegate.Work Experience Required: 4 - 6 YearsQualification: Bachelor's Degree", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["Angularjs", "Software Development", "Stored Procedures", "Coding", "Requirement Gathering", "ASP.Net", "Performance Review", "MVC", "SQL Server", "Ajax"]}