{"Job Title": "Software Developer (C#, .Net)", "Company": "WiseTech Global", "Experience": "5 - 10 years", "Salary": "₹ 20,00,000 - 35,00,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": " Opportunities like this rarely present themselves in your career. Where you can make a difference with the challenge and thrill of a start-up. Combined with the security, benefits, and reputational kudos as an employee in a successful and global company.WiseTech has been around for a while; since 1994, to be exact. And on more levels than time, we surpassed start-up status many achievements ago. Yet we've never lost that mindset, agility, and passion for what we do. With our Bangalore office's success critical to our continued growth, you will be joining a grassroots operation locally while contributing and being supported by a technology powerhouse headquartered in Australia. In FY20, we delivered 1,100+ product upgrades and enhancements to our Cargowise platform, and this wouldn't have been possible without people like YOUa Highly Talented Software Engineer who uses well-defined scientific principles to solve complex problems creatively and with ingenuity.While we have a strong affiliation with Microsoft technologies (dot.net / .Net, C#, SQL Server) we have multiple teams using different tech stacks and programming languages. We use HTML/CSS and JavaScript (Vue.JS and ReactJS) across the product stack as well as Restful APIs. As an organisation we embrace code quality and maintain incredibly low defect rates, through the practices of TDD. We are WiseTech Global, united in our mission to transform global trade once innovation at a time. And you are one step closer to making a career-defining difference. About WiseTech Global:Our innovations and global technology enables, improves and empowers the world’s supply chain. We are a force for good, improving productivity, connectivity and resources usage across more than 160 countries worldwide. We build products using the latest software tools and the best hardware platforms.Having listed on the ASX in 2016, WiseTech Global is an AU$9 billion+ company that is serious about expansion and technical innovation. Through a combination of organic growth and targeted acquisitions, our global employee head count has increased rapidly, and we’re far from slowing down.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["C#", "Microsoft Technologies", "Vue.Js", "CSS", "Software Development", "C#.Net", "Javascript", ".Net", "HTML", "SQL Server"]}