{"Job Title": "Senior System Software Developer (Job code ASPF002)", "Company": "Confidential information technology and VLSI", "Experience": "5 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Roles and Responsibilities Development of Device Driversfor Linux/ThreadX/FreeRTOS.Desired Candidate Profile Sr. System software developerNote:. This is a Developer position. Only Developers need to Apply (This is  Testing /QA position). We don't have the resources to train the fresh graduates. Please look at the experience required before applying.Job description: *  A good understanding on any RTOS/OS like ThreadX, FreeRTOS, Linux*  Familiar with device driver development for one or more devices   Serial/I2C/SPI/USB/Networking/Video/Audio/CAN/ etc*  Sound knowledge on Microcontrollers/Microprocesors, ARM MPU (ARMv7/ARMv8) architectures*  A clear understanding on the board bringup activities from reset*  Should have experience in Linux Internal or RTOS(Preferably Theadx)  IPC (Message Queues, Shared memory, Semaphores), multithreading, Mutex, etc).*  Good Experience in FPGA/SoC  Board bring up from bootloader to Root files system mounting, including hands-on experience with lab instruments like oscilloscopes, waveforms analyzers   *  Experience in driver development for Linux or RTOS.  Device Drivers Like USB, Ethernet, SD/MMC, ALSA, FB Drivers.*  Good Knowledge of Yocto and Git tool, JIRA,Hi*  Familiarity with any IDE like ARM-DS, Keil, IAR, etc.*  Familiarity with any assembly instructions set*  Experience with hardware debugger tools like Lauterbach, ULINK, JLINK, BDI*  Experience with software development life cycle*  Excellent problem-solving and analytical skills  *  Bachelors  or Master degree or foreign degree equivalent in electrical, electronics engineering, computer science, information technology or a related technical field.* Experience with software development life cycle *  A self-managed individual with  Excellent problem-solving skills and Mentor the Junior Engineers. Role ResponsibPerks and Benefits As per company standards", "Role": "System software,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - Embedded, EDA, VLSI, ASIC, Chip Design,", "Employment Type": "Full Time, Permanent", "Role Category": "Not mentioned", "UG": "B.Tech/B.E. in Any Specialization", "Doctorate": "None", "Key Skills": ["Linux/ThreadX/FreeRTOS", "Device drivers Development", "System software developer."]}