{"Job Title": "Senior Software Engineer  DevOps- Developer efficiency tools", "Company": "Visa Inc.", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "      The Platform as Services team is part of Visas Data Platform division. Our mission is to provide the enabling technology and processes to manage Visa data assets and deliver Value Added Information Products and Services to our customers. We are working very closely with PaaS team. Data Platform organization is building the Next Generation Data processing engines with costeffective and distributed applications on commodity hardware using bestin-class technology components. Building next generation applications require collaboration with exceptional group of highly skilled Data architects, software engineers, DevOps engineers, payment experts and infrastructure architects. This is an exciting time for a data professional to join our team to drive technology transformation.       Responsibilities        Help Engineering teams achieve their potential by identifying and addressing gaps via automated and self serve platforms.    Ensure that above toolchains and platforms are extensible by nature. Always design and build as if being used by an external customer.    Make these toolchains and platforms capable of crowd sourcing. Teams across Visa should be able to contribute to these.    Build Tools that can be used by Engineering teams with minimal hand holding; and address issues such as, but not limited to:    Environment creation/provisioning    Build pipelines    Best Engineering and DevOps practices    Test frameworks    Productivity tools      Actively support above tools in order to ensure that newer asks and requirements in light of evolving scope of Data Platform and One VISA needs.    Open sourcing these tools and frameworks across VISA; and by extension; to the wider development community outside VISA    These tools should dogfood the practices and capabilities they tend to serve outside. All best practices and frameworks we build should also be used internally to develop the same.    We are our own customers first      Work with teams across Data Platform and VISA; with the mindset of re-using and re-purposing; not re-creating unless there is an absolute need.    Identify OSS that is of benefit to us; and work with the cybersecurity and other teams to integrate it into VISA toolchains where applicable.      Bachelor degree in Computer Science, Electrical Engineering, Information Systems or other technical discipline (Master preferred)    6 year of corresponding industry experience    Strong knowledge and experience with release engineering, automation frameworks and configuration management.    Knowledge and flexibility in Hadoop and related technologies.    Flexible, adaptable, and able to manage multiple tasks in a dynamic, fast-paced environment.    Strong written and verbal communication skills with the ability to collaborate through all parts of the business.    Strong analytical and problem-solving skills with the ability to identify opportunities and implement process improvements    Strong automation development experience    Hands-on experience with Jenkins, Kubernetes, Chef, Ansible, and at least one programming language.    Knowledge of various best practices across in industry in terms of SCM, environment management, CICD pipelines, configuration management.    Organizational and project management skills and attention to detail with the ability to manage time and prioritize projects under tight time frames    Highly motivated self-starter capable of working independently and as part of a team in a fast-paced environment, exhibiting strong relationship management and interpersonal skills    Strong innovative and creative solution development and deployment capability    Ability to understand data, synthesize information, and develop recommendations    Team oriented, collaborative, diplomatic, and flexible    Ability to communicate complex technical concepts clearly.    Have strong problem diagnostic and debugging skills    Strong communication skills with ability to present complex ideas and document in a clear and concise way    Quick learner; self-starter, detailed and thorough    Proactive sense of urgency and can do attitude    Knowledge of the software development life cycle   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Automation", "Diagnostics", "Configuration management", "Analytical", "Debugging", "Machine learning", "Data processing", "SCM", "Data mining"]}