{"Job Title": "20th March'21 Virtual Drive For Software Developers", "Company": "Daffodil Software Private Limited", "Experience": "2 - 7 years", "Salary": "Not Disclosed", "Location": "New Delhi, Gurgaon/Gurugram, Delhi / NCR", "Job Description": "About Unthinkable:With Unthinkable, we help our customers to disrupt faster by decreasing time-to-market viareducing the time gap between an idea and working software. Combining our experience ofbuilding 100+ software solutions and developing products using decoupled softwarecomponents to reduce redundant code, we are in a unique position to take this unconventionalapproach to software development.About Daffodil Software:Daffodil Software is software services company, that is a technology partner to 80+ dynamicorganizations across the globe. Daffodil s customers range from early stage start -ups to GlobalFortune 500 enterprises. Daffodil s specialty lies in our ability to look beyond technologies anddeliver innovative and progressive solutions.Winner of Deloitte Tech Fast 50 India, Daffodil experiments with latest technologies, designapproaches and development methodologies to build cutting edge software solutions. They areknown for investing in futuristic technologies, AI and Block chain are no exception.Daffodil is also working on some very exciting ideas that can change the world, and is in processof setting up them as startups within Daffodil.Our Goal:\"We, at Daffodil, value innovation, ownership, hard-work and smart risk-taking attitude withcontinuous desire to learn and improve oneself every day.Experience: 2-8 YearsDesignation: Associate- IT / Sr. Associate-IT/ AM-ITPosition: .Net DeveloperLocation: GurgaonKey Technical Skills: ASP.NET MVC, C#, SQL Server, JQuery, MongoDB, Rest Web Services, JSONNice to have Skills: Design Patterns, AWS Lambda, API Gateway, Application security, Angular4.0+ /ReactJS, .Net CoreJob Responsibilities: As a team player, rapidly build Frontend and APIs for new or existing applications Meet scalability, availability, security, and performance goals Hands on experience with triggers, Functions and stored procedures in RDBMS databaseUnderstands software life-cycle management, data modeling, Business Process Modeling,      and system testingCore Competency Requirements: Excellent verbal and written communication skills Must be a team player Working knowledge of agile development methodologies Well versed in Technologies- C#, MVC, SQL Server, JQuery Hands-on experience in RESTful Web APIs Thorough knowledge of Industry Level Coding Standards Learning attitude towards new technologies Excellent debugging and analytical skillsKindly register on below link- bit.ly/20thMarch21 ", "Role": "IT/Technical Content Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Other", "UG": "Graduation Not Required", "Doctorate": "None", "Key Skills": ["C#", ".Net Core", "JSON", "SQL Server", "JQuery", "ASP.Net MVC", "Angular", "Software Development", "Rest", "C#.Net", ".Net", "ASP.Net", "MVC", "Web Services"]}