{"Job Title": "Senior Software Developer  Java", "Company": "Tieto Software Technologies Pvt. Ltd.", "Experience": "5 - 8 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "   With us you will be responsible for     Indepth understanding of the application and its integration with various other systems     Understand the business logic in the front end and integration layer     Understand the business impact of the critical areas     To be a team player and work harmoniously with colleagues and other project teams.     Ensure code quality and follow the process set for the engagements     Ensure code is tested thoroughly before delivery to customer     Take part in peer reviews, testing as per project needs     Train peers if required on identified tasks     Should be aware of standard quality practices      We expect you to have     5-8 years of relevant experience in Java (J2EE, J2SE)     Spring Framework.     Some exposure to Struts and Hibernate is an advantage     Exposure to JBOSS and TOMCAT will add advantage.     Webervices expertise is needed.(like REST API, SOAP)     Shall have experienec of HTML, CSS, Angular JS     Basic PL/SQL and Oracle knowledge     Experice with test driven development.     Exposure to Agile / Scrum methodologies     Willing to work automation tools and DevOps way of working.     Knowledge in automation (like python scripting) is an added advantage.         As a person you are   Team player   Having Customer first attitude   Seeing customer challenges as sales opportunities   Keen on developing existing competences as well as learn new ones     ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Hibernate", "Automation", "Tomcat", "JBoss", "Struts", "PLSQL", "HTML", "Oracle", "CRM", "Python"]}