{"Job Title": "Software Development Engineer II", "Company": "Boomerang Commerce", "Experience": "4 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  @CommerceIQ, you will :      You will be responsible for developing, testing and releasing features within time and with high quality that will drive revenue and margin impact to top brands.    You will be designing your own features keeping in mind the scale and high availability of the systems.    You will be working with the team and expected to perform code reviews, conduct design discussions and mentor other developers.    You will be the owner of your feature and work directly with product teams to drive customer impact.    You will be expected to participate in all phases of the software development cycle as part of a Scrum team.        Experience    : 4-6   Years in developing in designing and developing complex and scalable software modules..     Skillset :      The ideal candidate will be an experienced Java developer with exceptional software system design, problem solving, and object-oriented coding skills    Experience with distributed transaction-processing systems or asynchronous messaging technology is required.    Good understanding of system performance trade-offs, load balancing, and engineering for high availability.    Obsessed about building quality software and owning end to end responsibility for the developed features.    Understanding of enterprise information systems, service oriented architectures, and operational data stores is a plus    BS or MS in Computer Science/Engineering, Mathematics, Statistics or similar degree from a top tier institution.   ", "Role": "Software Developer,", "Industry Type": "Internet, Ecommerce,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Software Development Engineer II", "Coding", "Machine learning", "System design", "E-commerce", "Commerce", "Scrum", "Load balancing", "Operations"]}