{"Job Title": "FSSC Software Developer", "Company": "Cummins India Ltd", "Experience": "5 - 8 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": " *This applied technology position creates software that is sold as an integral part of Cummins products. People in these positions will have involvement in specification, design, implementation, testing and/or release of software that controls the operation of Cummins products in a variety of customer applications.  Investigates embedded software problems, understands causal mechanisms, recommends appropriate action, owns problem resolution and documents results.        Applies and improves embedded software development processes and tools. Processes include model based development, coding, compiling and test. Tools include Simulink, code editors, integration tools, static analysis tools, compilers and hardware in the loop test tools.    Obtains input and negotiates with product and software development teams and delivers verified software features, components, builds to product teams.  Makes decisions in the areas of software requirements, architecture, design, implementation and test that impact the quality and performance of software subsystems and feature classes.   Responsible for review of lessexperienced developers/testers work to ensure robust, reusable, and efficient designs  Provides independent leadership of smaller business impact projects or ownership of complex components, products, systems or services with greater elements of ambiguity over the senior or lead engineer level and with full accountability to the project team.    Delivers independent execution of established and emerging work processes and systems, while still developing technology or product knowledge.  Leads the development and improvement of work processes and systems across a functional discipline area within a business unit site.  Coordinates and directs work amongst technicians and temporary student employees, assists in the transfer of knowledge to lesser experienced engineers through either indirect (scope of influence) or direct management of a small, local group of engineers.    Provides support and guidance to influence technical direction within a project team and continues to develop proficiency in the competency areas critical to success in the role.  Operates as a recognized specialist in a discipline or product area within the immediate team.   Skills   Embedded Software Design and Construction - Constructs embedded software using industry best practices and robust software engineering principles; verifies software updates to ensure quality products.   Product Verification and Validation Management - Coordinates the development of design verification and system validation plans from a variety of inputs to identify failure modes while managing risk and relative priority; evaluates analytical and experimental test results following engineering principles to verify that products meet internal technical requirements and to validate that design solutions meet customer needs; produces recommendations with technical documentation to support product decisions.   System Requirements Engineering - Uses appropriate methods and tools to translate stakeholder needs into verifiable requirements to which designs are developed; establishes acceptance criteria for the system of interest through analysis, allocation and negotiation; tracks the status of requirements throughout the system lifecycle; assesses the impact of changes to system requirements on project scope, schedule, and resources; creates and maintains information linkages to related artifacts.   Product Platform Planning and Architecting - Creates and develops a holistic product platform including key architectural feature and function variants needed to align with market level product plans of future target markets; generates alternative architectures traceable to the requirements and performs trade-off analysis in collaboration with life-cycle stakeholders to ensure a balanced and optimum platform; communicates and maintains traceable information and plans executed by product development teams.   Product Failure Mode Avoidance - Mitigates potential product failure modes, by identifying interfaces, functions, functional requirements, interactions, control factors, noise factors, and prioritized potential failure modes and potential failure causes for the system of interest to effectively and efficiently improve the reliability of Cummins products.   Systems Thinking - Defines the system of interest by drawing the boundaries, identifying its context within its environment, its interfaces, and that it has a lifecycle to aid in planning the problem statement, scope and deliverables ; analyzes linkages and interactions between elements that comprise the system of interest by using appropriate methods, models and integration of outcomes to understand the system, predict its behavior and devise modifications to it in order to produce the desired effects.   Decision quality - Making good and timely decisions that keep the organization moving forward.   Drives results - Consistently achieving results, even under tough circumstances.   Communicates effectively - Developing and delivering multi-mode communications that convey a clear understanding of the unique needs of different audiences.   Builds networks - Effectively building formal and informal relationship networks inside and outside the organization.   Resourcefulness - Securing and deploying resources effectively and efficiently.   Manages complexity - Making sense of complex, high quantity, and sometimes contradictory information to effectively solve problems.    Education, Licenses, Certifications   College, university, or equivalent Bachelors degree in Engineering or other relevant technical disciplines is required. Post-graduate (Masters) degree relevant to this discipline area may be required for select roles.  This position may require licensing for compliance with export controls or sanctions regulations.    Experience   Prior Senior or Lead Engineer equivalent work experience in a relevant discipline area is required with a demonstrated track record of technical problem solving and quality decision making. Knowledge of MS Office tools is preferred    Design, develop and verify embedded controls software for Fuel Systems and follow all Cummins internal software processes      Develop/Enhance controls model using MATLAB Simulink and Stateflow, and generating auto code      Integrate Fuel System components with other software components to build new software      Develop and execute unit, component and system tests using simulated or bench environment to verify the software design      MTech or BTech Electrical Engineering or computer science with embedded controls development focus preferred      5 to 8 years industry experience or equivalent academic experience in development of automotive controls software      Understanding of diesel engines, mechanical systems, especially fuel systems and AUTOSAR a plus      Good communication and presentation skills required for documenting software design, test results and observations  ", "Role": "Software Developer,", "Industry Type": "Automobile, Auto Anciliary, Auto Components,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["AUTOSAR", "Software design", "Architecture", "Coding", "Analytical", "Simulink", "MATLAB", "Automotive", "Embedded software", "Technical documentation"]}