{"Job Title": "Java Software Developer", "Company": "Luxsh Solutions Pvt. Ltd.", "Experience": "2 - 6 years", "Salary": "₹ 2,50,000 - 6,50,000 P.A. ", "Location": "Vadodara", "Job Description": "PRIMARY RESPONSIBILITIES:- Designs and  develops user interfaces to internet/intranet applications by setting  expectations and features priorities throughout development life cycle.-  Completes applications development by coordinating requirements,  schedules, and activities; contributing to team meetings;  troubleshooting development and production problems across multiple  environments and operating platforms.- The role is responsible  for developing software components primarily in Java Spring as well as  implementing best practices and identify performance bottlenecks within  the system.- Person will be bringing own ideas to the table and  contributing to the overall design. The ideal candidate should have  solid experience in Object Oriented Programming in particular J2EE,  Spring Framework, Hibernate, Tomcat, XML coupled with Object Databases  knowledge.SECONDARY RESPONSIBILITIES:- Maintain existing applications and make improvement in them and also add new features as per the business needs.- Support strategic business development where appropriate.- Challenge and develop processes where appropriate.- Work in conjunction with other teams to meet agreed Service Level Agreements.- Project management from start to completion.- Testing, evaluating and implementing new processes and procedures.- Provide cover in the department as and when needed.- Ad hoc duties as and when required.ESSENTIAL EXPERIENCE, SKILLS AND ABILITIES:- Experience of working with J2EE, Spring and Hibernate.- Experience of building SQL, Procedures and functions.- Good knowledge of Jquery, CSS3, HTML, JavaScript.- Ability to respond in a constantly changing environment and remain calm under pressure.You can follow our LinkedIn page for latest updates: https://www.linkedin.com/company/luxsh-technologies/ ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers, BCA in Any Specialization", "PG": "MCA in Any Specialization, M.Tech in Computers", "Doctorate": "None", "Key Skills": ["Java", "Hibernate", "Spring Framework", "Tomcat", "Software Development", "XML", "Javascript", "J2Ee", "HTML", "JQuery"]}