{"Job Title": "Software Developer  Fullstack", "Company": "Ecolibrium Energy Private Limited", "Experience": "2 - 6 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": " Job Role:     Development and design of product primarily the front end M1 Function Software Development M2 Function Information Technology Reports to Lead - Technology     Key Result Areas     Full-stack to design and develop frontend and backend for smartsense   Design develop high quality web applications which is light and easy to use   Contribute, innovate, and be driven about bringing usability and beauty to the products.    Work closely with product managers, UX designers, back-end and test engineers to implement elegant and easy to use front-end solutions   Coaching and guiding colleagues in the progression and development of their personal and technical skills.    Embrace and promote best practices in order to create maintainable, high performance web applications.    Open to innovate in design and development by making the best use of latest technologies available.     Educational Qualifications     B.Tech/BE/ME/M.Tech/MCA from a reputed university.     Relevant Experience     2-6 years of product development in front end web technologies     Desired Skills / Knowledge     Must have 2 years of experience developing modern Web applications.   Demonstrated understanding of web technologies (e.g. Javascript, DHTML, CSS, REST, JSON etc) and experience in creating reusable UI components.    Must have experience on Python or Java, DBMS, Web service    Knowledge of AngularJS, Bootstrap is required Knowledge of Redis, RabbitMQ, Big data will be big plus.    Demonstrated Ability to unit testing.   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial", "PG": "MCA in Computers, M.Tech in Electronics/Telecommunication", "Doctorate": "None", "Key Skills": ["Unix", "IT services", "Linux", "Networking", "Javascript", "JSON", "Unit testing", "Information technology", "Python", "DHTML"]}