{"Job Title": "Software Developer", "Company": "DIGNA PRIVATE LIMITED  ", "Experience": "4 - 9 years", "Salary": "₹ 4,00,000 - 6,50,000 P.A. ", "Location": "Gurgaon/Gurugram, Delhi / NCR", "Job Description": "Apply his/her knowledge of software development methodologies, best practices, and proven processes to deliver a quality software product on budget, within planned schedule with superb quality. Extension, Upgradation & Development of Software Solutions1. Understand the current architecture and enhance/optimize the design of existing software products/solutions3. Responsible for overall Quality of service for the the full suite of software solutions. Ensure quality of products through extensive Testing and Bug fixing on priority3. Define and implement the development methodologies that will achieve availability of these new solutions as quickly as possible while still ensuring great quality4. Keeps current on new technologies and makes recommendations on future directions as appropriate. 5. Develops and maintains domain, product and process knowledge to improve the market alignment, product quality and engineering practices within the Company. Maintain documentation of all products/solutions.6. Drive the program execution of the software from product definition through successful release and ongoing maintenance1. Well versed with database systems, APIs Integration, system architecture and design principles, agile development methodology and comfortable with tools such as Jira2. In depth knowledge of Software Programming & Software Development Methodologies3. Solid knowledge in Web, SaaS Applications Development Processes and Cloud deployments 4. Cultural sensitivity to work with UK teams and customers 5. Deep knowledge of software design/architecture principles and patterns, software implementation skills1. Candidate must possess excellent analytical, troubleshooting, and programming skills in technically complex environments and architectures. Be decisive and effective at issue tracking and resolution. 2. Strong presentation skills, outstanding interpersonal communication skills both written and verbal English.3. Demonstrated ability to establish priorities and organize; well verse with time management4. Quick learner with strong technical skills and data-driven thinking5. Regularly communicate, follow up to all impacted stakeholders6. Demonstrated ability to drive all tasks until objectives and dates are met7. Proficiency in object-oriented programming to support code-reviews and guiding engineers in the following languages: Angular(8,9,10), ASP Web API, Dotnet Core v 3.1, MS SQL 2014,17,19, C#. Additional proficiency in writing Code to interface with IP Cameras, Routers, Raspberry PieExperience in SCRUM & Agile software development methodologies, values and practicesQuick grasp for staying up-to-date with the latest technology through clear appetite for continuous learningWork in UK Office timings (9-5PM), Work from India (Gurgaon Office) & Reporting to UK. B.E Information Technology / Computer Science /Electronics and MBA1. 5-6 years in Software Development with end to end responsibility for software products/solutions. A proven track record of increasing responsibilities. 2. Demonstrable experience as a team player that can work cohesively with business and functional support team. 3. Hands on experience in Front-end (Application UI) and Back-end (Database) Programming4. Extensive software engineering development and design experience with complex and highly scalable products using multiple technologies, platforms and languages.  Demonstrable experience leading and managing SDLC, PDLC. A solid engineering foundation indicated by a demonstrated understanding of product design of complex systems and/or web-based enterprise applications for a SaaS multi-tenant environment. 5. Strong prior experience in software development domain and principles, including design patterns, code structure, programming languages, continuous integration, and deployment architecture. 6. Successful track record of delivering multiple, advanced, parallel programs on schedule7. Experience in estimating software engineering efforts, preparation and execution of software development project schedules8. Experience in managing alpha, beta product rollouts to customers and managing customer experienceFixed plus Variable", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "Doctorate": "None", "Key Skills": ["Web Api", "MS SQL", "Software Development Methodologies", "C#", "Software Engineering", "Object Oriented Programming", "Software Design", "ASP", "SDLC"]}