{"Job Title": "Sr.Staff Software Development Engineer in Test - Python", "Company": "ExecBoardinAsia", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": " As a Member of Technical Staff, the candidate will be part of the Datapath Engineering [QE] team working for the companys app context engine that does all the deep packet inspection of various cloud applications for visibility /policy enforcement, and working with L7 data and content parsers.    Job Responsibilities     Will be working as an SDET in the Data path team responsible for the the companys Deep packet inspection engine, that is the heart of the companys real time protection solution for SaaS and Web.   Involve in requirements\\/design discussions with Product managers development team.   Design test plans test strategy documents for the company inline solutions\\/features and closely work with the development team to cover all aspects of the features being developed.   Development of automation scripts in parallel to feature development to enable CI\\/CD. (i.e Day0 Automation)   Identify, evaluate and propose new test tools for improving product testing.   Work closely with the technical support team to handle customer escalations by reproducing the issues internally. Analyze the test gaps that resulted in customer issues and improve test plan\\/strategy.   E2E ownership from feature testing to production deployment to monitoring alerting.   Identify gaps in the regression test automation and improve automation coverage.   Participate in all test scripts/code reviews.   ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - QA & Testing,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Automation testing", "Test scripts", "Test strategy", "Test planning", "Regression testing", "Product testing", "Technical support", "Monitoring", "Python", "Testing"]}