{"Job Title": "Software Developer - ASP.net", "Company": "Cogencis Information Services Ltd", "Experience": "2 - 6 years", "Salary": "₹ 2,00,000 - 6,50,000 P.A. ", "Location": "Mumbai (All Areas)", "Job Description": "Roles and Responsibilities  Maintain high standards of software quality by establishing good practices and habits. Collaborate with other software developers, business analysts and software architects to plan, design, develop, test, and maintain web- and desktop-based business applications. Design, develop, and unit test applications in accordance with established standardDevelop, refine, and tune integrations between applications.Analyze and resolve technical and application problems.Assess opportunities for application and process improvement and prepare documentation of rationale to share with team members and other affected parties.Adhere to high-quality development principles while delivering solutions on-time.Provide third-level support to business users.Research and evaluate a variety of software products. Desired Candidate Profile  Minimum 4+ years experience as a Software Developer College or University degree in Computer Science or a related disciplineExperience in planning and delivering software platforms used across multiple products and organizational units.Candidate must have a strong understanding of UI, cross-browser compatibility, general web functions and standardsAbility to have a good understanding of the goals and objectives of the program.Deep expertise and hands on experience with Web Applications and programming languages such as HTML, CSS, JavaScript, JQuery and API's.Deep functional knowledge or hands on design experience with Web Services (REST, SOAP, etc ..) is needed to be successful in this position.Strong grasp of security principles and how they apply to E-Commerce applications.Good Exposure of different Design Tools.Extensive prior participation in agile software development processes, with emphasis on requirements gathering, milestone-based development and triage.Experience with client side asynchronous frameworks Working knowledge of several relational databases (SQL, MYSQL).Desire to push oneself to grow and improve as a software engineer.Strong, clear written and verbal communication skills Commitment to excellence and ability to work with other team members Core Competency Requirement  LanguagesC# Web   TechnologiesASP.Net   MVC, JavaScript, Ajax, JQuery, HTML, HTML5, CSS, AngularJS, Bootstrap DatabaseMySql, MS   SQL Server", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "BCA in Any Specialization, Any Graduate in Any Specialization, B.Sc in Any Specialization", "Doctorate": "None", "Key Skills": ["Software Development", "Unit Testing", "Web Technologies", "Javascript", "ASP.Net", "Business Applications", "Process Improvement", "Software Quality", "ASP.Net MVC"]}