{"Job Title": "Opening For Lead Software Developer. Location : Mumbai", "Company": "Receivables Exchange of India Limited", "Experience": "6 - 10 years", "Salary": "₹ 15,00,000 - 20,00,000 P.A. ", "Location": "Mumbai (All Areas)", "Job Description": "Dear Candidate,An excellent opportunity as a hands-on Development Team Leader, leading a team of highly skilled developers and delivering complex internal system developmentprojects across a variety of products and technologies.As an experienced Development Team Leader, whilst being highly technical and hands-on capable, you will lead development projects across predominantly React.JS, Core Java and Oracle  based technologies. Managing the successful delivery of projects will require you to plan, coordinate and lead activities across the full delivery lifecycle. This will include working closely with the departments heads, coordinating business analysts, architects and developers, as well as liaising with key project stakeholders as required.Roles and Responsibilities Coaching, mentoring and personal development of a team of highly skilled developersManaging the delivery of multiple complex simultaneous system development projects from design through to releaseCapable of understanding and contributing to the technical solution from design through to code level. Must have expertise in any 2 of React.JS, Core Java (including writing Restful Web Services) and Oracle Database.Working closely with Business Heads and Business Analysts Provide regular and effective progress updates to and work closely with Development Project Managers to ensure the management of any delivery risks or issuesDefine delivery phases of the project including activities, sub-activities, and milestones ensuring these are documented and used as the basis for the project event log, issues and risk log and any subsequent reportingParticipate in reviews and meetings and provide updates on project progressTake responsibility for ensuring that risks and issues are identified and managed closely and drive all stakeholders to deliver on time and to the required quality standardsWork closely with relevant teams internally to ensure alignment and coordination across operations as part of the seamless implementation of existing and new systemsContributing to post implementation reviews helping to demonstrate success or otherwise of projects Supporting project resource scheduling and department capacity planningContribution to the definition of departmental and systems strategies and progression of any allocated objectivesDesired Candidate Profile Degree in Computer Science, Software Development or related field.Proven hands-on Software Development experience6 ~ 8 years in hands-on software development using core Java. Must be able to write / understand Restful Webservices using Java and have knowledge of working with files (reading and writing) using Java. Must know how to work on Spring Framework.Knowledge of React.JS programming and / or Oracle DB will be a plus.Either Agile Certified Practitioner or PMP from PMI certification will be a plus.Experience on having lead Development teams will be a plus.Analytical mindset and good problem-solving skills.Excellent written and verbal communication.Good organizational skills.Ability to work as part of a team.Technologies:Must have worked on 3-tier architecture. Should show expertise on working with web server deployed in DMZ.Must know sFTP technology and ability to read, write information into flatfiles.Able to write OS scripts for data transfer / exchange from one Host system to another.REST API services. Messaging using JSON.Apache Web Server, Apache Tomcat, Active MQReact.JS Programming skills.Defining basic DB structure with Oracle or MS-SQL or similar.", "Role": "Team Lead/Technical Lead,", "Industry Type": "Banking, Financial Services, Broking,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization, B.Sc in Computers", "Doctorate": "None", "Key Skills": ["Team Management", "Java", "Software Development", "reach JS", "CSS", "Javascript", "HTML", "Rest Api", "Oracle", "JQuery", "Full stack developer"]}