{"Job Title": "Senior Software Developer", "Company": "Faze Three Limited", "Experience": "4 - 6 years", "Salary": "₹ 4,00,000 - 6,00,000 P.A. ", "Location": "Mumbai, Dadra & Nagar Haveli/Silvassa", "Job Description": " The ideal candidate will be responsible for developing high-quality applications. They will also be responsible for designing and implementing testable and scalable code. Responsibilities Develop quality software and web applications Design and develop new features as well as maintain existing functionality. Analyze and maintain existing software applications Design highly scalable, testable code Discover and fix programming bugs Skills Required: Strong knowledge of Data Structures and algorithms. Able to write programs using object-oriented programming concepts. Have relevant work experience using Asp.net Experience writing code in native Languages (C++/Java). Have strong knowledge of HTML5, CSS, Bootstrap, JavaScript, jQuery, and Ajax. Required Knowledge of Backend technologies Microsoft SQL server. Knowledge of handling API requests. Exposure to XML/JSON. Have some certain Knowledge of Cloud Computing and the Handling of Servers. Commitment to collaboration and teamwork and ability to deliver via influence. Knowledge of finance, HRMS, PMS, production, and inventory control. Strong Management Skills, multitasking, and handle overall team responsible for development and coordination with the team.Qualifications Bachelor's degree or equivalent experience in Computer Science or related field. 4 to 5+ years of relevant work experience. ", "Role": "Software Developer,", "Industry Type": "Textiles, Garments, Accessories,", "Functional Area": "IT Software - Client/Server Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Web Technologies", "Javascript", "ASP.Net", "Java", "CSS", "Html5", "Bootstrap", "JSON", "JQuery", "Ajax"]}