{"Job Title": "Senior Software Developer - Python", "Company": "IndustryBuying.com", "Experience": "3 - 6 years", "Salary": "₹ 10,00,000 - 16,00,000 P.A. ", "Location": "Delhi / NCR( Ghitorni )", "Job Description": " We are looking for a talented, skilled and experienced back-end web developer (Python/Django Developer) who can conceptualize and develop our web application products. You will be working alongside a dedicated team of front-end and back-end engineers and graphics designers.Roles and Responsibilities:- Develop backend processes in Django, Django REST Framework that communicate through established REST APIs.- Build web components and containers that interact with REST APIs.- Write documentation as new features and functionality are built.- Write test cases for what you have written.- Proactively identify bottlenecks, areas for improvement and put forth a plans to course-correct.Mandatory Skills:- Bachelors or Masters of Technology in Computer Science, IT, or equivalent course.- Strong understanding of the all key areas of web application architecture.- Strong knowledge of Data Structures, Algorithm and Design Patterns.- Proficiency working in Django, Django REST Framework or Flask.- Proficient in a modern open-source relational database such as MySQL or Postgres- Working knowledge of a NoSQL database (MongoDB preferred).- Hands-on experience with Cloud services such as AWS (EC2, S3, RDS, SQS)- Hands-on experience with automated unit testing.- Ability to do database design and modeling.- Ability to write modular and clean code.Good to have skills:- Experience working with Elastic Search or Solr Search.- Working knowledge of MVC front-end framework such as AngularJS or jQuery.- Working knowledge of LESS / SASS.- Knowledge of Responsive Web Design (RWD).", "Role": "Software Developer,", "Industry Type": "Internet, Ecommerce,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "Doctorate": "None", "Key Skills": ["Django", "Python", "Angularjs", "Front End", "Responsive Web Design", "MySQL", "MongoDB", "MVC", "JQuery", "Web Development", "Flask"]}