{"Job Title": "Software Development Engineer - III Full stack(Product Engineering)", "Company": "EXOTEL TECHCOM PRIVATE LIMITED ", "Experience": "5 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Roles and Responsibilities  We are looking for technically very strong candidates, with a strong understanding of computer systems. We want people who love designing and building infrastructure components and large complex services. We are looking for engineers driven by a passion to create applications systems that can redefine the contact center communication space.You will be a part of the Product Engineering team at Exotel. Specifically, we are looking for full stack engineers for building and operating web apps and dashboards that help customers use Exotel in a variety of ways.Responsibilities include end-to-end software engineering aspects:Designing and architecting and plan systems and servicesDevelopmentTestingDeploymentInstrumentation, dashboarding and monitoringDebugging production issues and handling production incidentsProject & Stakeholder managementMentoring and technical evangelizingDesired Candidate Profile5+ years of full-stack development experience in product engineering organizations.Bachelor / Master's Degree in Computer Science or equivalent.Very strong in Computer Science fundamentalsExperience scripting in at least one of PHP / Ruby / Python / NodeJSExpert in JavaScript, HTML, CSS with an understanding of CSS pre-processors including Sass and LESS.Good knowledge and experience of full-stack frameworks such as React.js, Angular.js, node jsExperience in full-stack development - ie, building the web API backend that would power your frontend.Knowledge of different data stores, data modeling and scaling themExcellent written and verbal communication skills, with strong attention to detail and a head for problem-solving.Team-player, flexible and able to work in a fast-paced environment Perks and Benefits Experience / Interest in UX design and use of design toolsExperience in one of the languages like Java / Go / Scala / C++ / C / C#Knowledge of LinuxExposure to database like Mongo, Redis, Mysql or other relations dbsExposure to Concepts of Microservice design and distributed architectureExposure to telephony protocols, ISDN, SIP, WebRTC & others like TCP/UDP etc.Exposure to build and deploy pipeline and toolsKnowledge of web services / REST APIs / SOAP / RPC.A \"devops\" mindset. You own what you will develop.Experience in using RDBMS (MySQL, Postgres etc), NoSQL (Elastic, Redis, Aerospike etc).Communication skills - excellent written and oral communication to present complex ideas/concepts in clear and concise manner; communicating with key stakeholders with work/project progress.5 - 8 Years of experience", "Role": "Team Lead/Technical Lead,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Telecom Software,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "Doctorate": "None", "Key Skills": ["Angularjs", "Software Development", "Web API", "Production Engineering", "PHP", "Node.Js", "full-stack development", "React.Js", "Ruby", "Python"]}