{"Job Title": "Hiring For software developer", "Company": "Mando Softtech India Pvt. Ltd.", "Experience": "4 - 5 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": "Summary Of Job Profile\"As a Software & Methods Development Engineer, he/she will play an integral role within the Automation Development Team of Computer Aided Design & Engineering. He/She will have exposure to be involved in a broad range of projects modules, including the Generations / Development of Macros, engineering software and simulation tools related to CAE Processes for automobile chasis system (Brake, Steering, Suspension).We are looking for a candidate with good with programmig skills & development of State charts / Flowcharts / Widget descriptions\"Qualification:  B.E/ B Tech/Equivalent (Computer Science Engineering) with minimum 65% score 10th /12th with minimum 65% scoreExperience:   4-5 yearsSummary of Job Profile:Essential Duties & Responsibilities:Independently develop assigned modules / sub modulesInvolve in Technical Exchanges with concerned teams.Quality Conscious software solutions developments.Work Collaboratively with team to Cope with challenging working conditions.Ensure that all work is carried out in compliance with coding , quality and procedural standardsMaintain record of all activities and result for future reference and documentation purposeMust understand & abide by the company policies, ethics and cultureExcellent Communications Skills (Verbal & Non Verbal)Knowledge, Skills, Abilities (KSAs) required to successfully perform the job: Knowledge: CAE Domain Knowledge, Understanding of Autombile Chassis System(Brake , Steering & Suspension), Strong programing concept, SDLC concepts, Familiarity with CAE Tools, CAE CustomizationSkills: Python / C++, GUI development, Agile SDLC and source code maintenance & good understanding of Object-Oriented ProgrammingAbilities: Problem solving Apparoach to provide required solutionsOpen to learn new technologies & good intellectual level.Knowledge on virtualization concepts is a plus", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "Doctorate": "None", "Key Skills": ["Cae", "SDLC", "Python", "Software Development"]}