{"Job Title": "Senior Software Developer- PHP / Laravel Developer", "Company": "Egnoto Private Limited", "Experience": "2 - 7 years", "Salary": "₹ 3,50,000 - 7,50,000 P.A. ", "Location": "Jaipur", "Job Description": "We are looking for Senior PHP developer with best practices in software development, Web App & server development expertise in latest technologies, and a professional track record of effective technical management, information analysis, and the latest web technologies are ideal.Roles and Responsibilities  Write efficient codesFull lifecycle application & website developmentDesign, estimate, code and debug softwarePerform software analysis, risk analysis, reliability analysisIntegrate new software solutions with existing systemsExtract and reverse engineer existing codeIdentify and fix gaps in system reliability, such as production monitoring.Continuously improve the software infrastructure, such as the deployment processDesired Candidate Profile  The candidate must be well versed in CORE PHP. We need developers to handle our existing platform built using PHP, MySQL, JavaScript, Bootstrap, and APIs.Must have demonstrated experience on server frameworks/ MVC Frameworks like Laravel & CodeIgniter framework is a must.Design and develop scalable systems using advanced concepts in NodeJS, TypeScript, Javascript and ReactPayment Gateway Integrations (Stripe, PayPal, WorldPay etc.)1+ years of experience in CMS Shopify and WordPress (knowledge of Magento & Joomla is a plus)Middleware (API handlers) in PHP (mandatory)Experience in Frontend technologies such as HTML, CSS, JSON, REST, JavaScript and Js Libraries, AJAX, JQuery & Node JS/Angular JS Should have experience working with databases such as My SQL. Must know Server side solutions (Server configurations, Domain, Hosting & more)Code optimization techniquesWorking experience on version control tool - GitHubAbility to manage project", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization, B.Sc in Any Specialization, BCA in Any Specialization", "PG": "MCA in Any Specialization, M.Tech in Any Specialization, MS/M.Sc(Science) in Any Specialization", "Doctorate": "None", "Key Skills": ["Laravel", "Core PHP", "Codeigniter", "MySQL", "PHP", "Web Development", "Server Administration"]}