{"Job Title": "Software Developer", "Company": "Microsoft Corporation", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Noida", "Job Description": "    Responsibilities         We are looking for a strong engineer to build systems for the next generation autonomous cloud infrastructure which enable M365 Sovereign and Regulated cloud offerings. Microsoft is uniquely at the center of this opportunity, and we have the responsibility to advance the frontiers of compliance, regulation and security in the ever expanding digital world.     This is a SWE 2 role with opportunity for deep technical impact, product excellence and culture role model with opportunity for advancement. The role involves application of computer science fundamentals, problem solving and growth mindset to design and implement various systems and features for next generation cloud infrastructure.      This role provides significant opportunity to make an impact at massive scale, learning, to experience product development at scale and significant mentoring coaching opportunity with room to grow in IC/Managerial career path      Qualifications        You love this team s mission   You love to work in the transformational cloud infrastructure and technologies   Experience in working with distributed teams.   Experience in working with highly complex software services at internet scale   2 years of experience in cloud and related technologies (e.g. Azure, AWS, K8S, etc.)   Degree in CS or equivalent experience    ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - eCommerce, Internet Technologies,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Compliance", "Cloud", "Infrastructure", "Manager Technology", "microsoft", "AWS", "Room", "Software services"]}