{"Job Title": "Opportunity For Software Developer #ASP.NET || Calibrated Healthcare||", "Company": "Calibrated Healthcare Systems India Pvt. Ltd", "Experience": "2 - 6 years", "Salary": "₹ 2,50,000 - 6,00,000 P.A. ", "Location": "Gurgaon/Gurugram", "Job Description": " Roles & Responsibilities:Translate application storyboards and use cases into functional applicationsDesign, build, and maintain efficient, reusable, and reliable C# codeEnsure the best possible performance, quality, and responsiveness of applicationsIdentify bottlenecks and bugs, and devise solutions to these problemsHelp maintain code quality, organization, and automationSkillsProficient in C#, with a good knowledge of its ecosystemsFamiliarity with the .NET framework ASP.NETStrong understanding of object-oriented programmingSkill for writing reusable C# librariesFamiliar with various design and architectural patternsKnowledge of concurrency patterns in C#Familiarity with Microsoft SQL Server Understanding fundamental design principles behind a scalable applicationCreating database schema that represent and support business processesGood in designing for the prospect of web application.Strong hand in database DesignDesired Candidate Profile Experience: Min 2 Years Qualification: Minimum GraduateShould be flexible working in Rotational Shifts. Male candidates preferred.First preference would be given to immediate joiners.Interested candidates drop their CV on jobs@calibratedhealthcare.com or give a call to 9953780599Kindly Mention Current CTC, Expected CTC, Notice Period and Expected Joining on the top of your resume or on mail body.", "Role": "Associate/Senior Associate -(NonTechnical),", "Industry Type": "KPO, Research, Analytics,", "Functional Area": "ITES, BPO, KPO, LPO, Customer Service, Operations,", "Employment Type": "Full Time, Permanent", "Role Category": "Voice", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["SQL Server Development", "Programming", "ASP.Net", "Software Development", "Software Engineering", ".NET Framework", "software programming"]}