{"Job Title": "Senior Software Engineer/full Stack Developer - Asp/.net/mvc", "Company": "Loyalty Prime", "Experience": "5 - 8 years", "Salary": "Not Disclosed", "Location": "Noida", "Job Description": "Description :  Job Summary :  Loyalty Prime is looking for an experienced Software Developer (ASP.NET, C#, MVC and Sql Server- Full Stack Developer) to design and develop features on new/existing SaaS based product for the organization.   - The incumbent should have exposure to Scrum methodology and can work closely with the product owners and scrum masters.   - He/she must exhibit excellent oral and written communication skills and ability to work in a fact pace changing environment.   Key responsibilities :  - This is an individual contributor role and the incumbent need to depict deep technical skills for developing Cloud based web applications on Microsoft technologies.  - Ability to convert requirements into Tasks and execute them.  - Troubleshoot and resolve application issues and identify deficiencies.  - Participate within the \"Scrum\" process.  - Understand and apply the principles of software engineering and display software craftsmanship.  - Elicit requirements from end users and stakeholders as needed.  - Work with the QA to construct system and integration test plans.Required Candidate profileRequirements :- 5+ years of hands-on experience with software applications development Proficient in C#, ASP.Net, MVC, WCF, LINQ, JQuery & Sql Server.- Should have worked on Service Oriented architecture, and able to code and consume Rest/SOAP services.- Strong understanding of object-oriented programming and concepts.- Ability to write elegant high performance code and display software craftsmanship.- Exhibit advanced troubleshooting and root cause analysis skills.- Understands emerging market trends and ready to learn new tools and technologies.- Ability to perform as an Individual Contributor.- Understanding of Cloud concepts and next gen technologies, and ability to map such tools to context.- Good to have knowledge of AWS services like EC2, SQS, SNS, EBS, S3 etc.Benefits :- A super-modern office space with games zone, chill area with free coffee / drinks, etc- A positive, up-lifting work environment that is built on open communication, trust, mutual support and appreciation- Personal development opportunities. e.g. trainings, personal development plans etc.- Work-Life Balance: You will get 30 days throughout the year to take a well-earned rest. In addition, you will get 10 national holidays which we usually club with weekends.- Flexibility: Work from home options and flexible work schedules.- Competitive remuneration package.- Health Benefits: Medical & Accidental Insurance- Employee Health & Wellness: Loyalty prime is planning to organize an annual health fair, hosts Weight Watchers classes, walking competitions and Zumba sessions and lots of health & wellness activities where teams compete to win gift cards, etc.- Casual Dress policy & Relaxing Fridays: Our Company's objective in establishing a relaxed, casual, and informal work dress code is to enable our employees to work comfortably in the workplace. For e.g, You can come in shorts on every - Friday for work.- Employee Friendly HR policies", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Any Doctorate in Any Specialization, Doctorate Not Required", "Key Skills": ["C#", "LINQ", "OOPS", "Full Stack", ".Net", "MVC", "SQL Server", "WCF", "SOAP Webservices", "AWS", "Rest Webservices"]}