{"Job Title": "Urgent Hiring JAVA Developers & Software Testing Engineers", "Company": "Augeo Asset Management Pvt. Ltd.     ", "Experience": "2 - 7 years", "Salary": "₹ 2,50,000 - 7,50,000 P.A. ", "Location": "Noida", "Job Description": "Dear candidates,We are a reputed Company in the fields of Stressed Asset Management, e-Procurement, e-Auction, Transaction & Strategic Advisory, Enforcement & Repossession Services, Custodial Services etc. We are expanding at fast pace on PAN India basis. We are conducting interviews for below mentioned Positions :1) Sr. Java DeveloperKey Skills : Java, JSP, Servlets, Struts 2.0, Hibernate, Ajax, MySQL, Security Management, Web Services, API Integration (like: EKYC, EMAIL, SMS, PAYMENT GATEWAY, etc., Priority: Hands-on Digital Signature implementation or integrationExperience : Minimum 3 yearsLocation : Noida Salary 3.6 to 6 Lac (Salary not a bar for right candidates)  2) Java Developer: Location (Noida)Key skills : Java, JSP, Servlets, Struts 2.0, Hibernate, Ajax, MySQL, Security Management, Web Services, API Integration (like EKYC, EMAIL, SMS, PAYMENT GATEWAY, etc., Priority: Hands-on Digital Signature implementation or integrationExperience : Minimum 2 yearsLocation : Noida Salary 2.4 to 4.2 Lac (Salary not a bar for right candidates) 3) Software Testing Automation Testing Engineer  Software QARoles and Responsibilities 1. Connect with stakeholders to understand project purpose and functional requirements. 2. Functional and automation testing of different web applications. 3. Setup Automation suite based on requirements, business cases, and User stories. 4. Convert manual test cases into automation scripts. 5. Perform regression testing for Manual and Automation cases. 6. Provide efforts and estimations based on the scope of work. 7. Design documentation of the automated process. 8. Prepare test reports, and defect reviews with required stakeholders. 9. Data verification/validation across MySQL and SQL DBs as per business need.10. Keen to learn and support testing of mobile applications as per business need.Experience : Minimum 2 yearsLocation : Noida Salary 2.4 to 4.2 Lac  (Salary not a bar for right candidates)  We offer promising career opportunities to our employees. Rajender(HR Department)  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "MCA in Computers", "Doctorate": "None", "Key Skills": ["Test Engineering", "software", "hibernate", "ajax", "sql", "EKYC", "QA", "security", "java", "KYC", "testing engineer", "MySQL", "payment gateways", "payment", "softwate developer", "gateways", "struts 2.0", "software development", "JSP", "Software Testing", "testing", "payment gateway", "java developer", "struts", "servlets", "developer", "API", "gateway"]}