{"Job Title": "Software Testing Manual Automation.Engineer & Software Developer", "Company": "Innovation Technology  ", "Experience": "0 - 2 years", "Salary": "₹ 2,00,000 - 5,00,000 P.A. ", "Location": "Pune", "Job Description": "  The Test Engineer should be good in Manual Testing and is expected to:Execute the tests.Assist in creating Candidate knowledge of Core Java,, Analytical and Problem-solving skills level training on automation testing java selenium python. Required Candidate profile  The candidate will work as a Sr. development SFDC resource for the design and development of the Salesforce Development for the client. He / She should be able to complete development, change control activities and possess an understanding of technical & business trends, and uses this knowledge to bring solutions to client/business partners. Perks and Benefits   Experience writing with HTML, CSS, Javascript, and using Web UI frameworks within Visualforce pages and/or Lightning components Strong background in Salesforce Lightning development, SDLC, and Salesforce communities Experience building Salesforce integrations and 3rd-party applications and APIs with the Salesforce platform Thorough understanding of the constraints of the Salesforce platform, (i.e. governor limits) and best practices in delivering business requirements in the context of those constraints Knowledge of the Salesforce test framework, test-driven development (TDD), and iterative development Banking experience and customer onboarding project experience is highly desired Salesforce Certifications Dev 401 (ADM201 is also preferred) Focus on development/ improvement of a framework to support repeatable and scalable solutionsProcess Skills:", "Role": "Testing Engineer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "Doctorate": "None", "Key Skills": ["Selenium RC", "Software Development", "Software Testing", "Javascript", "Automation Testing", "HTML", "Manual Testing", "Selenium IDE", "JQuery", "Ajax"]}