{"Job Title": "Immediate Requirement For Software Developer", "Company": "Freelancer Anila ", "Experience": "2 - 3 years", "Salary": "₹ 3,25,000 - 4,50,000 P.A. ", "Location": "Chennai", "Job Description": "Hash Dhronas is hiring a Software developer position that will allow you to not only expand your capabilities but build equity in a unique adventure startup. As part of Hash Dhronas, you will be able to set flexible timings and even work remotely. However, as a tech startup, there is an opportunity for growth and those with experience in similar areas are encouraged to apply. With Hash Dhronas, you will be able to grow your skills and learn new technologies on the cutting edge. 1. We are seeking part-time to full-time developers who ideally have experience in Javascript, React js / Vue js.Requirements - FRONT ENDDesire to work in a startup environment, able to self-manage and work remotelyProven working experience in software developmentWorking experience in front-end development.Have deployed one or more web apps in life.Experience with third-party libraries and APIsWorking knowledge of architectures, trends, and emerging technologies, Redux,State management, React hooks. Experience working in an agile development processBe proficient in using version control and continuous integration, with tools such as Git.Write clear, maintainable, and testable code that you are proud of.Good communication skills in English Nice to haveFluency with Nodejs.Basic understanding of Backend development.Experience working with typescript,Experience working with WebSockets. 2. We are seeking part-time to a full-time developer who ideally has experience in Javascript, Node js. Requirements - BACK ENDStrong programming skills and experience with Javascript and Node.jsProficiency with algorithms, databases, RESTful API, and expertise in multi-threading and performance-oriented programming.Experience and knowledge of open source software, frameworks, and broader cutting edge technologies around server-side development in Node.js and data platforms. Minimum 2 years of software engineering experienceNice to have:High level of ownership & can work independently.Bias for action.Execute fast, test and iterate.Strong work ethic. Startups require diligence and dedication. Are you ready to put in the work?Strong communication & collaboration skillsPlease Note:- Experience not more than 3 years", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Vue.Js", "Javascript", "Websockets", "Node.Js", "React.Js"]}