{"Job Title": "Software Development Engineer II-Backend", "Company": "Zeta Inc.", "Experience": "2 - 4 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   What is the job like?     Building highly-scalable and secure payments platform   Primary owners of one or more components of the platform and will drive innovation in your area of ownership   Working with various product teams gathering requirements and adding capabilities    Working with some of the smartest people in the industry and will have ample opportunity to learn and grow   Using cutting-edge cryptography to secure payments beyond industry standards   Deriving actionable insights by mining TBs of data   Building low-level infrastructure that aims to push the boundaries of network performance   Participating actively in recruitment and nurturing of engineers as awesome as you      Who should apply for this role?     If you spend time cracking NP hard problems rather than cracking nuts, you are the most laziest person and automates everything, you appreciate beauty of code (bonus if you can sing Finite simple group of order 2 ), you should apply in t=0   Good understanding of Databases   Good understanding of networking (especially with HTTP)   Good understanding of OS concepts   2 years of experience   Should have hands on development experience with Object Oriented Programming (Java is preferred but not compulsory) on a large scale system   Understands and showcase ownership of the products   Good with concepts of scaling and worked with distributed systems   Review and influence new evolving design, architecture, standards and methods with stability, maintainability and scale in mind   Identify patterns and provide solutions to class of problems   Research, evaluate and socialize new tools, technologies, and techniques to improve the value of the system    Be able to multi-task, prioritize and handle dependencies with minimal oversight     Bonus points     Call me maybe is more than just a song for you   You have studied distributed systems like Dynamo, HBase, various messaging and queuing systems and understand nuances of Time, Clocks, and Ordering of Events, rate control, load distribution   You can smell fraud, transaction risks and abuse a mile away  ", "Role": "Software Developer,", "Industry Type": "Internet, Ecommerce,", "Functional Area": "IT Software - eCommerce, Internet Technologies,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Mining", "Backend", "Software Development Engineer II", "HTTP", "Transaction processing", "Cryptography", "Distribution system", "Object oriented programming", "Recruitment", "HBase"]}