{"Job Title": "Senior Software Engineer Ansible Developer", "Company": "CGI Information Systems and Management consultants", "Experience": "4 - 9 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "  General IT Applications Development includes analysis, programming, and configuration of end user applications and/or systems software Including:   Analyzing detailed business/functional/technical requirements and specifications for the application    Coding internally developed applications and/or configuring commercialoffthe-shelf (COTS) applications using programming, scripting, and database languages    Supporting application testing, deployment, maintenance, and evolution activities by correcting programming errors, responding to scope changes, and coding application enhancements   Level: An Experienced Professional (P2) applies practical knowledge of job area typically obtained through advanced education and work experience.    May require the following proficiency: Works independently with general supervision.    Problems faced are difficult but typically not complex.    May influence others within the job area through explanation of facts, policies and practices.    Required Qualifications :      Experience:   4-9 Yrs    Job Description    Good hands-on in Ansible Tower   Good experience in Application Deployment   Ansible Playbook - Know the different between Role and Sub-playbook   WebSphere script - wsadmin, Python, and WAS DM structure   Soap/UI - Java programming understand WSDL   Shell script - Linux Shell, Perl, Python     Skills:    Ansible  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Application deployment", "Linux", "CGI", "Coding", "SOAP UI", "Shell scripting", "Programming", "Perl", "digital transformation", "Python"]}