{"Job Title": "Hiring Java Developers @Temenos -No.1 Banking Software Company Chennai", "Company": "TEMENOS INDIA PVT LTD", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Chennai( Perungudi )", "Job Description": " Temenos is seeking for JAVA developers, they should be able to Design and Develop efficient Technical solutions from the given Functional specification. Design, Coding, Unit testing of new functionality and/or related Support actions. Need to adhere to standard development practice/procedure and coding standards during the development phase, as per the deployed team and as applicable. Participate in Technical analysis in collaboration with other Teams/Consultants/Architects and Analysts  be it in-house/External and On/Off Shore Should be able to create high quality supporting documents like Technical Specification, User/Installation Guide, Traceability Matrix etc. Review program code produced by more junior Software Engineers for quality, clarity, efficiency and adherence to TEMENOS and/or market standards, if any. Contribute to the maintenance/reusability of the Product in line with project assignments, if any. Perform such other duties, functions and services, consistent with status or vocational ability, as may from time to time be required. Providing guidance and support to the developers aboard, if needed be. Skills and Qualifications: Minimum 2- 5 years of experience on Java in Development, Maintenance and/or Support role. Knowledge/implementation on SOAP or REST protocol is desirable. Knowledge on Banking Packages/Tools (say T24/Finacle/BaNCS) are preferred Demonstrate strong Development, Maintenance or Support Skills. Excellent communication/interpersonal skills (both written and spoken English).  Ability to understand and undertake Design activities. Take a lead role in ensuring the contribution of others adds value, if situation demands. Conduct formal reviews of peers work Always demonstrates application of Right First Time.Education:Postsecondary Education in Business or Related Field, Ability to prioritise, Strong organisational skills, Strong web and integration skills, Strong written and oral communication skills, Decisive, Ability to solve complex problems, Professional,Thorough, Detail-oriented", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "Doctorate": "None", "Key Skills": ["Java", "J2Ee", "Spring", "Hibernate", "Spring Mvc", "Javascript", "MVC"]}