{"Job Title": "C# Software Developer", "Company": "Siemens Limited", "Experience": "0 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "    What part willyou play   Responsible for implementation of software solutions based on requirements and within the constraints of architectural /design guidelines   Functional analysis of existing software   Derive software requirements and software functional specification, validate software requirements, provide software feasibility analysis and software effort estimation   Identify potential harmony and for re-use of components / technology   Responsible for the accurate translation of software architecture into design and code   Coding of features and/or bug-fixing and delivering solutions adhering to coding and quality guidelines, for self-owned components   Collaborating with multi-functional and globally located teams   Driving creative solutions within platform constraints and technical limitations.    Useyour skills to move the world forward    Do you have an Engineering Degree with 3 - 6 years of experience in design and development (explicitly code/test-code development within software project using the relevant programming languages and tools as well as relevant technology)  Do you have at least 1 years of experience in a process-oriented software organization.   Programming language skills - good knowledge in C# .NET development.   Good experience in Windows Desktop applications, WinForms, WPF.   Software design and development - good to have knowledge in Object Oriented Analysis and Design (OOAD)   Standard platforms - expertise in software development on and for the Windows platforms.   Good analytical and problem-solving skills.   Debugging skills - ability to find the root cause for defects, fix defects and provide impact on fixes done   Hands-on experience in development and testing.   Experienced in Agile\\Scrum development process is preferred.     ", "Role": "Software Developer,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Software design", "Coding", "OOAD", "Analytical", "Debugging", "Consulting", "Architectural design", "Winforms", "Windows", "WPF"]}