{"Job Title": "Software Developer - .Net", "Company": "Global Talent Corner", "Experience": "4 - 9 years", "Salary": "Not Disclosed", "Location": "Europe", "Job Description": " Job Mission:   Within business line Applications the D&E software groups address the area of complex machine control software. The incumbent is responsible for realization of software in C# in one of the application functions- software teams, contributing to development of the software platform. This is done using a scrumAgile way of working.   Job Description:   - In this position you are a member of the Critical Dimension (CD) metrology, Overlay (OV) metrology, or Diffraction Based Focus (DBF) metrology application software team.   - The teams address development of algorithms for reconstruction and optimization, and integration thereof in new applications and workflows that enhance metrology capability for their customers.   - In the scrum team you take initiative to address user stories in this scope. You are guided by the scrum master (team lead), function cluster architect, and product owner (project lead). Furthermore, you cooperate with other software team members, and involve Customer Support (CS), Holistic Application Development (HAD) team members, and Manufacturing representatives.   - Your eagerness to experience the fit of their solutions at the customer makes you willing to use opportunities to travel.   - As a Software Developer you will act as fast learning software professional, and contribute to software realization using a disciplined agilescrum based way of working.   - You apply software engineering practices such as requirements engineering (user story definition), object oriented analysis and design, implementation in C#, testing, and integration in the software platform.   - You are eager to pick up knowledge on metrology recipe setup, reconstruction and optimization algorithms, and workflows associated with the OV, CD, or DBF application functions.   Main Responsibilities :   - Act as scrum team member   - Demonstrate end-to-end ownership for featurestory based software engineering   - Align specifications with stakeholders in the function team and the software platform lead   - Secure both software and product quality   - Ensure adequate fit of software deliverables in the software platform   - Software realization, including design, testing and documentation   - Act as buddy in pair-programming   - Contribute to continuous improvement of our Agile software development for the software department as a whole   - Transfer knowledge to colleagues in both D&E and sectors supporting operations and providing consultancy (e.g. CS, HAD) .   Required Candidate profileExperience: - 5 years in object oriented development of technical software for high-tech equipment - 2 years of experience with Agilescrum. Extensive experience with pair programming is a pro - 3 years of experience with C# - Up to date knowledge of and experience with recent versions of the .NET framework - Affinity with development and application of algorithms.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required, Any Doctorate in Any Specialization", "Key Skills": ["C#", "CI / CD", "Software Developement", "Agile", ".Net", "Scrum"]}