{"Job Title": "Software Developer - .Net/C#\n", "Company": "HyrEzy Talent Solutions", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": " Job Role : C# Software DeveloperJob Location : HyderabadExperience Required : 5-10 YearsJob Description :The  candidate will join the front office development team working for the  leading equities and solutions franchise in the APAC region.Role Summary : -  This position is a hands-on C# software developer role requires working  with end users to improve and expand the platform. The candidate is  expected to work on new features and performance optimization as well as  enabling the system to be deployed to multiple new markets across the  region.- In order to succeed in this role, the candidate needs  to have an in-depth understanding of developing desktop applications  while being able to learn and apply new concepts in order to meet  business requirements. Strong communication skills are also important as  the role involves interaction with front office users across multiple  trading desks.Role Responsibility :-  Build strong relationships with business users by understanding the challenges that they face-  Design, develop, test and support software systems that meet business requirements-  Be willing and able to adapt to changes in priorities-  Ability to learn and apply new technology to deliver added business value-  Maintain a strong focus on qualityAdditional Information :Essential :-  Proficient in C#, WinForms, WPF, the .NET base class library and runtime environment-  Proficient in multithread and asynchronous programming (TPL, Rx)-  Experience developing user interfaces that display live data-  Experience developing desktop applications-  Attention to detail and code quality-  An open mind and the ability to learn, teach and adapt quickly-  Excellent problem solving and analytical skills in a high-pressure environment-  Strong communication skills and an ability to convey ideas and concepts with clarity-  Fluent written and spoken EnglishDesirable :-  Understanding of application architecture and design-  Experience with C# and .NET on non-Windows platforms-  Understanding of user experience design (UX) and human factors concepts-  Strong relationship skills with a strong customer service-oriented attitudeRequirements :Experience : 5 to 10 yearsNotice Period : Immediate to 30 daysRequired Qualification :Graduation - Bachelor of Engineering - Bachelor of Technology (B.E./B.Tech.)in Other - Not Required Per/CGPAJob InsightsVirtual On-boarding Possible. ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["C#", "Software Development", "User Experience Design", "Application Architecture", "UX", "C#.Net", "Winforms", ".Net", "WPF"]}