{"Job Title": "Backend Software Developer (WFH)", "Company": "Successr HR Tech PVT LTD", "Experience": "4 - 7 years", "Salary": "Not Disclosed", "Location": "India", "Job Description": "Roles and ResponsibilitiesFunction: Backend Software DeveloperAbout This RoleAs a backend software developer, you will be producing scalable software solutionsand will also be responsible for keeping the platform and data service running. Youwill drive and implement new requirements and improvements into the product,including new feature requests, integrating new technologies into the service, andresolve or mitigate commonly hit operational issues. If you are passionate aboutsolving crucial business problems and enjoy working on them in a small, fast-pacedteam, this may be for you.Tech-Stack We UseTypescript, React, Node(Express), Python, MongoDB with AWS as the primary cloudprovider.How You Will ContributeLead an engineering solution to a business problem end-to-end, and communicate it to engineers and customersFind scalable solutions to challenging technical problemsImplement high performance pipelines with Python/TypeScript, Docker, Cloudformation and lots of other modern tools - we are heavy users of AWS and are expanding to other clouds.Leading and developing best practices for the Engineering team and finding the best tools for the job at hand.Since we’re always deploying, you will help us move faster and guide our engineering and product.Partner with our customers and exceptional product leadership to ensure the work we do has impact with our customers and our engineering community.Create security and data protection settings.Write technical documentation.Keeping current with industry trends and developments that can be applied to company needs.Technical Expertise That We Believe Will Make You Successful In This RoleMin 3 years of engineering experience on backend systemsSignificant experience designing and implementing fault-tolerant, data-intensive servicesSignificant experience testing and deploying systems to productionExperience with large-scale event processing pipelines, preferably using streaming technologiesStrong experience working with any NoSQL/SQL databases such as PostgreSQL or MongoDB.Strong knowledge of building effective APIs in Node.js (Express)Professional experience with TypeScript and AWS is desirableBachelor/Master degree in Computer ScienceSoft-Skills That Will Come HandyYou know when it’s time to refactor, and when it's time to shipExcellent written and verbal communication skillsStrong attention to detailHead for problem-solvingHaving a flexible working styleBeing a team playerComfortable with working unsupervisedProduct Based Industry Exp. ONLYWell versed with startup culture; exp. building end-to-end features/app, perf optimization,scaling-up of appSignificant experience designing and implementing fault-tolerant, data-intensive servicesOnly Female MandatoryLocation: Virtual (WFH)", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers, B.Sc in Computers, BCA in Computers", "PG": "MCA in Computers, MS/M.Sc(Science) in Computers, M.Tech in Computers", "Doctorate": "Doctorate Not Required", "Key Skills": [" SQL", " APIs ", "Express", " NoSQL", " Cloud Service", " PostgreSQL ", " Node.JS ", "AWS ", "  Typescript", " MongoDB"]}