{"Job Title": "Software Developer  Python/Golang, Linux, Devops", "Company": "Amdocs Development Center India Pvt. Ltd.", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "  You will design, develop, modify, debug and/or maintain software code according to functional, nonfunctional and technical design specifications.   You will follow Amdocs software engineering standards, applicable software development methodology and release processes, to ensure code is maintainable, scalable, and supportable, and demo the software products to stakeholders.   You will investigate issues by reviewing/debugging code, provide fixes and workarounds, and review changes for operability to maintain existing software solutions.   You will work within a team, collaborate and add value through participation in peer code reviews, provide comments and suggestions, and work with cross functional teams to achieve goals.   You will assume technical accountability for your specific work products within an application and provide technical support during solution design for new requirements.   You will be encouraged to actively look for innovation, continuous improvement, and efficiency in all assigned tasks.              Bachelors degree in Science/IT/Computer Science or equivalent                  At least 3-6 years of experience in Python or Go-lang Development                     At least 3 years of experience in DevOps development and support experience (like Jenkins CI/CD, Nexus, NPM, GIT,Docker monitoring and tracing tools, security, logging)                     Strong fundamentals and experience of Linux OS (like Ubuntu, RHEL)                                Familiar with the agile methodology and tool to implement it such as Jira       ", "Role": "Software Developer,", "Industry Type": "Telcom, ISP,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "GIT", "Linux", "Agile methodology", "RHEL", "microsoft", "JIRA", "Technical support", "Monitoring", "Python"]}