{"Job Title": "Java Software Developer", "Company": "Kyte Tech Consulting LLP", "Experience": "0 - 2 years", "Salary": "Not Disclosed", "Location": "Ahmedabad", "Job Description": " Software Engineer will be a part of the core development team working closely with various stakeholders to implement functionality, to our business success. This role will drive excellence through the design, development, deployment and maintenance of complex software applications by leveraging agile software development practices. Software Engineer will work with Java/Spring technologies to build scalable applications with great user experience.   Roles and Responsibilities:    Contribute in all phases of the development lifecycle.   Write well designed, testable, efficient code.   Ensure designs are in compliance with specifications.   Prepare and produce releases of software components.   Support continuous improvement by investigating alternatives and technologies and presenting these for architectural review.  Technical Skills:    Experience with Core Java, J2EE, Spring, Hibernate, HTML/HTML5, JavaScript, Jquery, Web Services.   Understand and use Messaging Based Services techniques.   Working knowledge with MySQL or similar SQL Databases.   h3 knowledge in Object Oriented Concepts with Core Java.   Good understanding and practical experience with Enterprise Java Concepts and Methodologies.   Good understanding of software development process in an agile environment.   Excellent problem solving and troubleshooting skills.   Solid coding practices including documentation, code reviews and unit testing.   Knowledge of Grails, ReactJS, MongoDB and Junit will be an added advantage.   Proficiency with database management is a plus.   Experience with AWS infrastructure, e.g. S3, EC2, database services (RDS).   Contribute to Production Support and debugging across the platform while working with other software engineers.   h3 experience with Application server development - Service layer patterns using Spring.   Specialized Skills:    Excellent verbal and written communication in English.   Ability to work in a fast-paced environment.   Ability to multi-task on a regular basis.   Ability to accept direction and complete work according to instruction.   h3 analytical skills while maintaining attention to details.   Innovative problem-solving techniques.   Ability to organize, prioritize work, meet deadlines and work independently.   Ability to handle multiple projects and activities in a timely manner.   High Emotional Intelligence for an office environment.   Experience working with office productivity tools; delivery assurance and/or industry standards on deliverables.   Experience working with administrative and/or workflow systems.   Technical leadership of an engineering team to build, deploy, and support a reliable, performant and scalable RESTful platform.  ", "Role": "Software Developer,", "Industry Type": "Strategy, Management Consulting Firms,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial, B.Sc in Chemistry", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Hibernate", "Core Java", "jQuery", "Production support", "MySQL", "Javascript", "Agile", "Workflow", "HTML", "Troubleshooting"]}