{"Job Title": "Senior Software Engineer (IoT Full Stack developer)\n", "Company": "PEOPLESTRONG TECHNOLOGIES PRIVATE LIMITED  ", "Experience": "5 - 7 years", "Salary": "₹ 9,00,000 - 19,00,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": "Job Role: Senior Software Engineer (IoT Full Stack Developer)Job Location: Bangalore / TOP MNC COMPANYEmployment Type: Full Time, PermanentWith our innovative and integrated technology, we support our customers in continuously improving the reliability, safety, and efficiency of products, processes, and plants. Can you help us shape the future? Were looking for dedicated people with the skills and vision to build a  better tomorrow. Join our Digital Process Industries team as a System Engineer and help us create the technology that will transform entire industries, cities, and even countries. What will the future look like? What can we look forward to? We dont know for sure. Thats why we need true pioneers who, while exploring the world of research and development, trigger innovative projects and come up with unusual paths towards a solution our drive to make the impossible possible has no limits!  This is your chance: drive global change with us. Change the future with us!  Full Stack Developer is responsible for developing SW components based on the Architecture /  Design provided  Technical ownership and accountability for specific Components/modules of development projects  Analyze the requirements and come up with estimates for the assigned modules. • Write Feature Specification / Detail Design documents for the modules  Be able to develop and own software components along with helping the team. Use your skills to move the world forward!  We need a B.Tech (Computer Science or equivalent) / M.C.A graduate with 5 to 7 years of experience in IoT/Cloud software development, preferably in the area of industrial automation domain.  Experience in working on IoT/Cloud based projects  Programming experience in Angular / NodeJS / Node-RED / Java  Strong knowledge of IoT communication protocols: MQTT, OPC UA, REST APIs  Knowledge of working with IOT 20XX(2040/2050) / Raspberry Pi / Beagle Bone hardware  platforms  Working knowledge of Cloud Technologies (Azure/AWS), EC2, Cloud Architecture.  Experience in Protocols like FTP, SMTP, Modbus, HART, and Serial Pot and data formats like  XML and JSON.  Knowhow on Linux OS and internals  Knowledge in Data Analytics and streaming data  Practical knowledge/general experience: software architecture, software design, software development, UML. ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "MCA in Computers", "Doctorate": "None", "Key Skills": ["Mqtt", "Java", "Azure", "Raspberry Pi", "FTP", "Fullstack Developer", "Node.Js", "Angular", "IOT", "SMTP", "Software Development", "Rest", "IOT Developer", "Linux", "Linux os", "Software Engineering", "XML", "Data Analytics", "Software Design", "AWS"]}