{"Job Title": "Software Developer", "Company": "Amdocs Development Center India Pvt. Ltd.", "Experience": "5 - 7 years", "Salary": "Not Disclosed", "Location": "New Delhi", "Job Description": "  You will design, develop, modify, debug and/or maintain software code according to functional, nonfunctional and technical design specifications.    You will follow Amdocs software engineering standards, applicable software development methodology and release processes, to ensure code is maintainable, scalable, and supportable, and demo the software products to stakeholders.    You will investigate issues by reviewing/debugging code, provide fixes and workarounds, and review changes for operability to maintain existing software solutions.    You will work within a team, collaborate and add value through participation in peer code reviews, provide comments and suggestions, and work with cross functional teams to achieve goals.    You will assume technical accountability for your specific work products within an application and provide technical support during solution design for new requirements.    You will be encouraged to actively look for innovation, continuous improvement, and efficiency in all assigned tasks.       Bachelor’s degree or equivalent with more than 2 years of mandatory industry experience as follows:    Java engineer.    Enterprise-level design and delivery.    Working awareness and exposure to industry best practices, toolkits, and emerging trends.      Skill Requirements:      Demonstrates sound work ethic.    Self starter with initiative, drive and energy.    A track record of working in a team to develop high quality software on time    A proven aptitude for problem solving and a drive to realize outstanding software solutions    Experience in common Java development tools and frameworks.    Excellent communication skills including oral, written and interpersonal.    Capability to work efficiently, accurately and independently.    Outstanding analytical and problem-solving skills.    Ability to maintain organization and flexibility.    Experience in some common Java development tools, such as :    Version Control (GIT, SVN), branching methodologies    Build Tools (Maven).    Testing Frameworks (JUnit, TestNG, Mockito )    RDBS, NoSQL Databases (Postgres, Couchbase )    JEE Containers and Frameworks (Spring, Portlets, JPA)    User level expertise in Unix/Linux Environment.    Query tuning, application performance tuning.  ", "Role": "Software Developer,", "Industry Type": "Telcom, ISP,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Unix", "Performance tuning", "Maven", "Version control", "GIT", "Linux", "JPA", "microsoft", "Amdocs", "Technical support"]}