{"Job Title": "Software Developer - Java/ Spring/ Hibernate", "Company": "Globocom", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": "   Multinational company requires dynamic and experienced Software Developer with relevant experience in Java, Spring MVC, and Hibernate.    Function: Software Development   Band: Software Developer   Experience: 2-5 years.   Reports to: Tech Head   Location: Malad west, Mumbai   Mandatory requirements   - Server Side: Proficient in Java, Core Java, Multithreading, MySQL, Spring MVC and Hibernate. Additional knowledge on tomcat servers and deployment processes is a plus. Familiar with JDBC connectors and other database pooling plugins.   - Front End Side: Basic knowledge on HTML, CSS, and JQuery is must. Open to learning some good front end technologies if needed in future like React.   - OOPs concepts: Should be comfortable in Object Oriented Programming and basic Algorithms. Good problem solving approach is required for better and optimized development.   - Basic Dev Ops: Basic knowledge of Linux systems mainly shell scripting, crons, basic navigation and basic monitoring techniques for an Ubuntu centos server. The Linux is mainly for basic Dev Ops which will be required for server deployment and occasional setting of automated scripts for monitoring.   Technologies: HTML, CSS, Spring Mvc, JDBC, jQuery, Core Java, Java, hibernate, JS, MySQL   Optional requirements ( good to have but not mandatory )   - any relevant experience in Telecom Value added services ( VAS )   - has some kind of experience with integration of smsc and smpp accounts.   - Could have worked with any of the billers or telecom companies for partner side integration of telecom value added   - Could have worked on wap flow integration   - Could have worked on for back end server side requirements for android apps       ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers, BCA in Computers, B.Sc in Computers", "PG": "MCA in Computers, M.Tech in Computers, MS/M.Sc(Science) in Computers", "Doctorate": "Doctorate Not Required", "Key Skills": ["Java", "Hibernate", "Multithreading", "Spring MVC", "jQuery", "OOPS", "MySQL", "JDBC", "MVC", "Spring", "Algorithm"]}