{"Job Title": "Cybersecurity Solution SW Engineer/Software Developer", "Company": "Siemens Limited", "Experience": "5 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "      Performs Threat risk analysis, PEN testing   Performs software design, implementation and verification activities.   Reviews specifications to determine software engineering requirements and design secure solutions to meet design inputs.   Estimates own work.   Completes the internal software quality process through the execution of design, implementation, unit and integration test activities for assigned software modules within a complex, distributed architecture.   Performs presentations of technical findings and developments   Leads cyber security technical solutions      Technical Requirements:    Software Engineering Experience - 5-8 years;   Java or equivalent Programming Language - 3 Years;   Medical device development (nice to have)   Excellent technical communication skills (written and verbal)   Designs Cybersecurity solutions for embedded medical devices to meet internal and external security requirements (nice to have)   Utilizes tools and techniques to discover and subsequently patch vulnerabilities in medical devices/mobile devices /web applications/ any Internet connected systems, constantly working to reduce the customers and companies exposure to latest vulnerabilities .   Stays on top of latest vulnerabilities and reports threats and action plans to reduce companies risk to upper management   Practical and hands on solutions experience with the 3 sides of the security triangle - Integrity, Confidentiality, Accessibility.   Understands and has designed and implemented Symmetric and asymmetric encryption solutions/Secure Socket Layer/Transport Layer Security (SSL/TLS) solutions/Hashing solutions/Code signing solutions/Certificates, self-sign certificate, certificate authority solutions.   Understands and has used Keystores/Port scanners, pen testing, fuzz testing.   Understands and has performed SQL injection, cross-site scripting, Input and output validation, practiced code obfuscation, code disassembly.   Experience in PEN testing    ", "Role": "Software Developer,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Software design", "Medical devices", "cyber security", "Siemens", "Healthcare", "software quality", "Risk analysis", "SSL", "SQL", "Testing"]}