{"Job Title": "Associate Software Developer", "Company": "Innostax Software Labs Pvt. Ltd", "Experience": "0 - 1 years", "Salary": "₹ 4,00,000 P.A. ", "Location": "Gurgaon/Gurugram( Sohna Road )", "Job Description": "Job SummaryINNOSTAX SOFTWARE LABS PRIVATE LIMITED is a global Software Consulting company specialized in delivering high quality, scalable software development services to companies around the world with value focussed and client-focused approach. We are offering Work From Home till pandemic.The secret to our success till date is the amazing Employees that we have who are extremely smart, highly driven and hold themselves to high ethical standards.We need more people like us to join our Innostax Family at our GURGAON Location for the position of \"ASSOCIATE SOFTWARE DEVELOPER\"This opening is for a FRESHER/1-6 MONTHS experience candidate. There is a 06 month of probation periodYou will be hired as an \"Associate Software Developer \" and the salary will be 4 LPA.Responsibilities and DutiesYou would be hired as a \"Associate Software Developer\" for the first 6 months of the Job.NOTE: 6 months probation period is not mandatory and the training period can be shorter based on your performance.You will be reporting to a mentor assigned to you.You will be expected to go through the material provided (React JS/ .NET/ Angular/ NodeJS) and expected to start contributing as soon as possible. You will need to learn international coding standards and best practicesYou will be working on a live project and would need to make sure you adhere to the coding standardsRequired Candidate profileYou are expected to have high IQ, Good Academics ( > 70% throughout education)You are expected to have good knowledge and understanding of at least 1 programming languageYou need to be very passionate for programmingYou need to be highly motivated and ambitious with a zeal for making it bigBenefitsOpportunity to learn software development skills from the best in the industryWork From Home till pandemic", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers, BCA in Computers, B.Sc in Computers", "PG": "M.Tech in Computers, MCA in Computers", "Doctorate": "None", "Key Skills": ["Angularjs", "Java", "Software Development", "Web Developer", "Programming", ".Net", "Node.Js", "React.Js"]}