{"Job Title": "SOFTWARE DEVELOPER (JOB CODE- SD)", "Company": "Custom Apps and Solutions PVT. LTD.", "Experience": "0 - 1 years", "Salary": "Not Disclosed", "Location": "Gandhinagar, Ahmedabad, gujarat", "Job Description": "Are you looking for an exciting career working with Web 2.0 and emerging technologies in a dynamic, creative and fast-paced environment We currently have multiple entry level full time Software developer positions available at Custom Apps and Solutions Private LTD. The candidate will play a pivotal role, working alongside other skilled web developers. We are looking for candidates with following skill set.We have a Web developer full-time, permanent position available at Custom Apps. The candidate will play a pivotal role, working alongside other skilled web developers.Qualifications:BE/ B.Tech./ M.Tech./ MCA with 0-1 years of Industry experience with web development and Infrastructure. (Freshers Welcome)Requirements:1+ years PHP/ Python/ Ruby web application developmentExperience developing with MVC framework preferred.Experience developing on Linux or UNIX preferred.Deep understanding and solid experience in Web Application development including PHP, HTML, CSS, Javascript, XML, JSONExperience with AJAX development preferred.Knowledgeable and experienced in developing secure web applicationsMysql or other relational database design and development required.Rigorous attention to detail and keen problem-solving skills.Ability to work in a fast paced, demanding and rapidly changing environment.Remuneration commensurate with qualifications, experience, competence and proficiency. Additional performance bonus/ incentive offered for deserving candidates.", "Role": "Training Manager,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "HR, Recruitment, Administration, IR,", "Employment Type": "Full Time, Permanent", "Role Category": "HR/ Recruitment / IR", "UG": "Any Graduate in Any Specialization", "PG": "MCA in Computers", "Doctorate": "None", "Key Skills": ["Unix", "", "HTML", "SOFTWARE DEVELOPER", "Linux", "XML", "MySQL", "Javascript", "PHP", "JOB CODE- SD", "Web developmentSOFTWARE DEVELOPER", "Ajax", "Python"]}