{"Job Title": "Software Developer", "Company": "Hewlett Packard Enterprise", "Experience": "2 - 4 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  Analyzes, designs, programs, debugs, and modifies software enhancements and/or new products used in local, networked, or Internet related computer programs, primarily for end users. Using current programming language and technologies, writes code, completes programming, and performs testing and debugging of applications. Completes documentation and procedures for installation and maintenance. May interact with users to define system requirements and/or necessary modifications.       Responsibilities:       Designs limited enhancements, updates, and programming changes for portions and subsystems of enduser applications software running on local, networked, and Internet- based platforms.   Analyzes design and determines coding, programming, and integration activities required based on specific objectives and established project guidelines.   Executes and writes portions of testing plans, protocols, and documentation for assigned portion of application; identifies and debugs issues with code and suggests changes or improvements.   Participates as a member of project team of other software applications engineers and internal and outsourced development partners to develop reliable, cost effective and high quality solutions for assigned applications portion or subsystem.   Collaborates and communicates with internal and outsourced development partners regarding software applications design status, project progress, and issue resolution.          Education and Experience Required:       Bachelors or Masters degree in Computer Science, Information Systems, or equivalent.   Typically 2-4 years experience.          Knowledge and Skills:       Strong experience in technologies like Swift, Objective C   Programing experience using native technologies including c/C and in the network and security domain would be a plus   Experience with tools XCode, swift package manager   Familiarity with usage of HTTP/Rest API   Experience or Understanding of publishing apps to the store   Experience with Jira/Confluence for bug tracking and documentation   Experience testing software including unit and functional testing   Should have good problem solving skills   Should have good understanding of algorithms and data structures   Good Analytical and problem solving skills   Good verbal and written communication skills  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Publishing", "Coding", "Functional testing", "Analytical", "Debugging", "Data structures", "Issue resolution", "HTTP", "JIRA"]}