{"Job Title": "Software Developer ", "Company": "Integrated Scientific Computing and Information Technologies", "Experience": "1 - 4 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   We are looking for an experienced and selfmotivated candidate with excellent academic credentials from good institutes to work in the field of software development and marketing of the scientific software.       Requirements:     Education:      Candidates with bachelor's / master's / doctoral degree in engineering / sciences (Computer Science, Information Technology, Computational Sciences, Scientific Computing, Chemical Engineering, Material Science, Physics, Chemistry, Mathematics, or similar fields) or BCA / MCA from good Indian institutes with excellent career records.      A candidate with background in Computational Chemistry and/or doctoral degree will be preferred.      Essential Skills:      Experience of software development, preferably scientific software,     Personal Marketing and management skills to market scientific software and to take lead role in managing the company; not necessary to have formal academic degrees in this regard,     Good knowledge in one or more of the programming languages, such as C++, C, Java, FORTRAN is required. Candidate must have a working experience with Windows / Unix / Linux / operating System,     Website development skills, including capability to add scientific contents to the websites,     Strong working knowledge of HTML, PHP, CSS, JAVASCRIPT, JSON, API, etc.,     Working knowledge of MySQL, database management,     A successful candidate must have excellent written and verbal communication skills in English with ability to clearly communicate and present technical details and results to colleagues, clients, and must be able to work independently.      Additional Preferred Skills (will be considered as assets):      Working knowledge of AJAX, XML, RSS,     Knowledge of web scrapping tools and/or experience with them.   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Web development", "Management"]}