{"Job Title": "Software Developer (Fullstack)", "Company": "RGBSI", "Experience": "4 - 9 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru( Wilson Garden )", "Job Description": "Roles and Responsibilities  As a Software Developer with us you will be part of the product development team and will be involved in design, coding and testing of enterprise level software products. You will be involved in all phases of Software Development Lifecycle (SDLC).Desired Candidate Profile  Individual Contributor having Strong knowledge and Hands on Experience doing projects in C#, ASP.Net, MVC, Web API.Hands on experience in Client-side languages like JavaScript, jQuery, Angular JS etc.Good understanding of Microsoft Technologies like ASP.NET Web Applications, Entity Framework, LINQ to Entities.Strong knowledge/ experience in Relational Database Management System (RDBMS)  MS-SQL Server  Database Design, Stored Procedures, Functions, Queries, Triggers etc.Working exposure to Agile/Scrum methodologies.Good knowledge/ experience in HTML, CSS, Bootstrap and a good understanding of Object-Oriented Programming Concepts.Knowledge of debugging Web API with tools like fiddler, Postman.4 to 10 years of experience in full stack software development (web app development).Excellent communication skills.Experience working in a product development background would be preferred.Ability to interact with global cross functional teams & subject matter experts to design robust & efficient software solutions.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Sc in Computers, BCA in Any Specialization, B.Tech/B.E. in Any Specialization", "PG": "MCA in Any Specialization", "Doctorate": "None", "Key Skills": ["ASP.Net", "Entity Framework", "MVC", "C#", "Web API", "CSS", "jQuery", "LINQ", "Javascript", "Bootstrap", "HTML", "SQL Server"]}