{"Job Title": "Software Development Engineer III ", "Company": "Glance IT Solution", "Experience": "7 - 9 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "    What will you be doing            Responsible for solving high complexity issues at a system/domain / vertical level       Responsible for resolution/ escalations within his/her area of expertise.         Using independent judgment in the selection of alternative courses of action.       Innovating new/unique ways to solve known and unknown problems.               What      is required     from you           BS/MS in Computer Science or equivalent from a premier institute         7-9 years of strong product development experience in building a massively large scale distributed internet systems and products       Good experience in working with Hadoop and Big Data technologies like HDFS, Pig, Hive, Zookeeper, Storm, Spark and NoSQL systems       Excellent Java programming skills and expertise in multi-threading and performance-oriented programming.       Strong computer fundamentals and problem-solving skills       Superior organization, communication, interpersonal and leadership skills         Experience and knowledge of open source software, frameworks and broader cutting edge technologies around server-side development in Java and Big Data       Good organization, communication, and interpersonal skills       Must be a proven performer and team player that enjoy challenging assignments in a high-energy, fast-growing and start-up workplace       Must be a self-starter who can work well with minimal guidance and in a fluid environment       Provide good attention to details         Must be excited by challenges surrounding the development of highly scalable & distributed system for building audience targeting capabilities       Agility and ability to adapt quickly to changing requirements and scope and priorities    ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Client/Server Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "SIDE", "Interpersonal skills", "Multithreading", "Mobile phones", "Hadoop", "Programming", "Open source", "big data", "Computer Fundamentals"]}