{"Job Title": "Software Engineer - Software Development", "Company": "GE Transportation", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   Job Summary:      Wabtec is a leading global provider of equipment, systems, digital solutions, and value-added services. Whether its freight rail, transit, mining, industrial, or marine, our expertise, technologies, and people - together - are accelerating the future of transportation. We are looking for a Software Engineer (Mobile Applications) to join our growing Engineering team and build out the next generation of our platform. The ideal candidate is having experience in developing software features, debugging, and documentation. He / She must have technical expertise in software development in Python and MySQL, SQLite technologies. He / She must be at ease working in an agile environment with little supervision. He / She should embody a passion for continuous improvement and test-driven development.      ESSENTIAL JOB FUNCTIONS/RESPONSIBILITIES:     Analyze, design, and develop software or software components   Practice software development methodology in an agile environment   Provide ongoing maintenance, support, and enhancements in existing systems and platforms   Working closely with the internal and external design/development teams in identifying problems   Provide recommendations for continuous improvement   Work alongside other engineers on the team to elevate technology and consistently apply best practices   Help troubleshoot issues, Problem Solving, providing objective feedback to software development project teams        QUALIFICATION      A Master s degree/Bachelors in a computer science or computer engineering        MINIMUM REQUIREMENTS      3 - 6 years of related software engineering experience   Fluent knowledge of programming in Python(PyQT) for IOS, Android, and Windows platforms.   Proficient with Agile development methodologies such as Scrum   Hands-on experience testing/debugging software and providing solutions   Experience in below mention languages and Frameworks.    Python 2.6 and above    SQLite/MySQL Server    Shells scripting   Django 1.3 and above   HTML 4 & 5    CSS       Effective oral and written communication skills; ability to articulate clearly and concisely   Self-driven, quick learner, results-oriented, and a clear focus on high quality   Must be a good team player        PREFERRED      Experience in below mention languages and Frameworks.    JavaScript & JQuery, Java   PyQt V3 and above   Iconic framework     Knowledge on Railroad or Transportation domain   ", "Role": "Software Developer,", "Industry Type": "Courier, Transportation, Freight , Warehousing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["jQuery", "MySQL", "Debugging", "Javascript", "HTML", "HTTP", "Scrum", "Windows", "Android", "Python"]}