{"Job Title": "Senior C#.Net Software Developer", "Company": "Advanced Computer Software Group", "Experience": "4 - 9 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "We're ADVANCED \n\nWe re one of the UK s largest and fastest growing software companies. True partnership is the defining thing that enables us to stand out from the competition. We pride ourselves on delivering focused software solutions for the public sector,  enterprise commercial and health & care organizations that simplify complex business challenges and deliver immediate and high quality value.\n\nPOST TITLE:\t\t\tSenior C#.Net Software Developer \n\nLOCATION: Bangalore -  India\n\nREPORTING TO: Respective Line Manager\n\nEXPERIENCE LEVEL: 9 Years\n\nPROJECT: AHC \n\nJOB DESCRIPTION: \n\nThe Senior C#.Net Software Developer will have sound understanding and experience with: \n\n1. Should have at least 9 years' experience in C#,  sound knowledge of latest .Net Framework,  ASP.NET,  MVC,  WCF,  WPF development including object- oriented programming\n\n2. Should have executed full life cycle projects with significant contribution to design and development\n\n3. Should have at least 4 years of experience in web design & development involving Java Script frameworks such as Angular JS,  Typescript,  Vue JS,  React JS,  Node JS etc\n\n4. Should have atleast 4 years of experience in working with NO SQL databases such as Mongo DB,  Hbase etc., \n\n5. Provide support for setup of Continuous Integration and facilitate smooth functioning of DevOps chain. Knowledge of Git,  Jenkins,  Maven,  containerization platforms like Dockers,  repository managers like Artifactory is a must have \n\n6. Ability to define,  articulate and apply architectural principles and patterns; Perform architecture reviews and assessments. Ensure that the software architecture meets business requirements\n\n7. Experience in supporting planning activities through estimation,  identification of integration points,  technical risks & mitigations,  etc.\n\n8. Should have experience in designing high performance and scalable applications,  experience in defining and reviewing NFR requirements for applications and ensuring the applications meet NFRs\n\n9. Create Architectural Concepts and derive technical roadmap in the area of Data Architecture and related technology fields\n\n10. Should be able to assess safety and security risks related to applications and plan mitigations\n\n11. Should have experience and knowledge of on- premise and cloud based applications,  application modernization\n\n12. Should have knowledge of new architecture paradigms like cloud and microservices\n\n13. Should have had hands on experience working with client- server as well as web based applications\n\n14. Troubleshoot problems,  perform root cause analysis and follow through to their resolution\n\n15. Should have passion to learn new technologies and keep updated with growing trends and industry practices.\n\n16. Coach and mentor team members regarding software design approach,  technology,  tools,  methods and various software quality aspects\n\n17. Provide advice in make or buy decisions\n\nIf you are interested in becoming a Senior C#.Net Software Developer at Advanced -  then please apply now!\n\n", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["Maven", "server", "technical", "software", "methods", "software quality", "WPF", "cloud", "Software design", "java", "web", "devops", "design", "Web designing", "architecture", "development", "SQL", "Data architecture", "HBase", "quality", "GIT", "application", ".net", "developer", "WCF", "c#.net", "support", "applications"]}