{"Job Title": "Senior Software Developer", "Company": "Advanced Computer Software", "Experience": "8 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  About the Role    The successful candidate will be responsible for Care Director application. Along with the general development of the software, the successful candidate will also be involved with the debugging the issues and developing fixes for future releases. A experienced .NET developer with around 8-10 years of strong technical experience in development of web based application with experience in SQL and JavaScript.    In this role you will:     Manage small-scale development projects to delivery schedule.   Learn our applications and become knowledgeable and proficient in their development.   Translate software requirements into concise and robust program code.   Work closely with the Product Owner to refine requirements, estimate development effort and gain their acceptance of the solution.   Working closely with the Test Analyst, use effective automated and manual testing techniques at various levels to ensure the software is correct, performant and robust.   Identify improvements to existing application code and designs, increasing flexibility and reducing future effort.   Provide support, investigating technical issues and advising internal support technicians.   Investigate and resolve software defects with the minimum impact and risk.     Essential Skills     C#.Net     RESTFul and SOAP API design and integration     MSSQL     JavaScript and other JavaScript frameworks (React, Angular etc)     TDD , SonarQube     Demonstrable understanding of SOLID design principles     Secondary Skills     Agile , Scrum , Jira , Confluence     Good Communication skills     Microsoft dynamic CRM will be added advantage  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Manual testing", "Agile scrum", "TDD", "Debugging", "Javascript", "Test Analyst", "microsoft", "JIRA", "SQL", "CRM"]}