{"Job Title": "MOBILE SOFTWARE DEVELOPER", "Company": "McAfee Software (India) Pvt. Ltd", "Experience": "6 - 11 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "    Role Overview:        This position is a key technical contributor to the McAfee Consumer Pathfinding Team. This contributor will work on several projects drawing on their broad experience with diverse technologies and software development best practices. This role is expected to quickly master new technologies, designing and implementing features for McAfee consumer pathfinding projects.    As a mobile apps developer, you will be responsible for the research and development of mobile applications for innovative projects around consumer privacy and security. You will work in a start-up environment where fast pace, continuous innovation and experimentation are a given. You will demonstrate mastery in innovation and security.      About the Role:      You have a start-up mentality who hits the ground running with minimal supervision.    Innovative ideas and concepts around intuitive user interactivity.    Rapid development of mobile applications across multiple platforms (iOS, Android, Web)    Collaborate with other programmers and developers throughout the development process.    Collaborate with PM to understand and define the overall product vision.    Collaborate with the other team or 3rd party vendors to integrate functional component.    Understand user requirements; design and develop applications and APIs for devices that meet real world scenarios.    Solve and articulate complex problems with application design, development, and user experiences.          About You:      You have 6+ years of experience in mobile software development of which 4+ years of experience iOS application design development    Experience with iOS frameworks (Cocoa Touch Framework, SwiftUI, Location, Contacts, Core Data, Audio/Video, Maps, In-App purchase, etc)    You have experience in Objective C, Swift programming    APNS, Memory Management, VPN, VOIP    Unit Test cases, Code Coverage, Automation    iOS Android Design patterns    Instruments: Allocation, Leaks Crash Analysis and Debugging skills    Strong multi-threading fundamentals    Ability to develop for Android (native)    Knowledge of Jira is a plus    Knowledge of Machine Learning is a plus    Knowledge and experience with Linux OS.    Excellent knowledge of Agile Development process.     ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Mobile,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Automation", "Linux", "VPN", "Memory management", "Debugging", "Machine learning", "VOIP", "Test cases", "JIRA", "Android"]}