{"Job Title": "Software Developer PHP", "Company": "CWS Technology", "Experience": "5 - 7 years", "Salary": "Not Disclosed", "Location": "Noida", "Job Description": "  We are looking for a Software Developer who is dedicated to the craft, writes code that can hit the ground running.   The candidate will be a part of a fullstack creative team that is responsible for all aspects of the ongoing software development from the initial specification, through to developing and launching.  Responsibilities Requirements:    Writing clean, fast PHP code/program to a high standard, in a timely and a scalable way   Producing detailed specifications   Troubleshooting, testing and maintaining the core product software and databases   Contributes in all phases of the development cycle   Develop and deploy new features to facilitate related procedures and tools if necessary   Skills Expertise:    Proven software development experience in PHP.   Understanding of open source projects specially WordPress.   Customization of themes, plugins.   Creation of custom themes and Plugins as per client requirement.   HTML to WordPress Conversion (Theming).   Demonstrable knowledge of web technologies including HTML, CSS, JavaScript, AJAX etc.   Sound skills with third party integration, payment gateway integration Database Caching.   Source code repository (SVN/GIT) knowledge is preferable.   Knowledge of MEAN Stack continuous integration and delivery is a huge plus.   Strong oral and written communication skills in the English language mandatory.   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Drupal", "OSCommerce", "Wordpress", "Javascript", "PHP", "HTML", "Troubleshooting", "Open source", "Joomla", "Ajax"]}