{"Job Title": "Software Development Engineer - III", "Company": "getyourjob", "Experience": "2 - 7 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad, New Delhi, Chennai, Bangalore/Bengaluru", "Job Description": " Sr. Software Development Engineer to own the tech vision, strategy, and road map of one of the most important initiatives. You will build and technically lead the customer experience teams to come up with innovative technology web solutions that directly improve customer experience around the world and impact a multi-billion dollar business.   You should be a leader excelling in communication, ownership and customer focus. This is an excellent opportunity to be part of a team architecting a solution within a fast growing business, shape the technology, product and the business. You should bring deep technical and software expertise, the ability to work in a fast moving, startup environment, the ability to deliver solid code that has a broad business impact and the ability to create software that achieves its operational goals.   In this role you will     Architect new end-to-end features that bring shopping innovations to web and mobile     Build solutions that reach millions of new customers all over the world, providing them with a world class shopping experience in their local language, payments, and currencies     Work across all tiers leveraging Service-Oriented Architecture, mobile platforms, user experience, analytics and data mining     Drive customer experience technology for supporting customers all over the world.     Work closely with the business to define the expansion strategy and figure out innovative solutions to help this thriving business continue to its exponential growth    The ideal candidate will:    Be clearly passionate about start-up-like opportunities.     Have a demonstrable track record of success delivering new features or products in cloud-based architectures.     Care about the quality of their code and delight end-users with top- notch user experience.     Mentor junior team members.     Have strong OO design and implementation experience with deep knowledge of the use of web services and front-end development.     Demonstrate strong ownership of their work  ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Front end", "Web services", "SOA", "Manager Technology", "Mentor", "Customer experience", "Data mining", "Operations", "Analytics"]}