{"Job Title": "Senior Software Developer - .NET/ Angular", "Company": "VERIPARK SOFTWARE SOLUTIONS", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Mumbai, Hyderabad/Secunderabad, Chennai, Bangalore/Bengaluru, Delhi / NCR", "Job Description": "At least 5+ years of product development experience in Dot Net technologies (C#, ASP.Net, MVC, MVVM, SQL Server). Prior ATM/banking/financial services experience is a plus.  Knowledge of the .NET technologies, including Visual Studio, C#, ASP.NET, LINQ, ASMX, IIS, WCF Web Services, and ADO.NET.  Ability to work in a collaborative team environment with project managers, developers, designers and IS to develop, implement, and maintain corporate web sites and applications that adhere to brand standards and strategies  Familiarity of database driven environments.  Capable of working with tight deadlines.  Understanding in working with third party APIs.  Proven ability to successfully deliver high-quality, complex systems using Software development methods, independently as well as in a team environment.  Must demonstrate strong analytical skills with the ability to identify problems and generate practical solutions in a logical manner.  Experience with TFS and source control.  Experience in cross-browser compatibility, accessibility and web standards.  Good understanding of mobile and tablet site development and testing.  Solid understanding of object-oriented programming (OOP)  Ability to multi-task and manage multiple projects simultaneously.  At least 2 years of development experience in UI technologies like JQuery, HTML5, CSS3, Angular js, Knockout js, JSON, AJAX, XAML, Razor, Mocking Frameworks  Experience with.Net framework version of 4.x plus preferred  Ability to work in team in diverse/multiple stakeholder environment  Experience and desire to work in a Global delivery environment  Analytical and communication skills Note: Candidates other then Bangalore and Hyderabad can work remotely.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "Doctorate": "None", "Key Skills": ["C#", "XAML", "Mocking Frameworks", "LINQ", "ASMX", "Banking", "WCF Web Services", "JSON", "Visual Studio", "JQuery", "CSS3", "Angular js", "angular", "Software Development", "IIS", "Knockout js", "HTML5", "ASP.NET", "and ADO.NET.", "AJAX", "Razor"]}