{"Job Title": "Hiring For Software Developer(Java8/ Kafka) For Bangalore Location", "Company": "Lakshya IT Consulting Pvt Ltd", "Experience": "7 - 12 years", "Salary": "₹ 8,00,000 - 18,00,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": "We are hiring for Software Developer with the skill - JAVA8/ Kafka Company Name: Lakshya IT Consulting Pvt. Ltd.Client: Atos-SyntelPayroll: Lakshya IT Consulting Pvt. Ltd.Employment: Permanent through Lakshya ITExp: 7+ yearsNotice Period: Immediate to 45 daysJob Location: BangaloreCTC or Budjet: 14 to 20 LPA.We would need Java, Kafka, Couch (or NoSQL DB) and Redis or MemSQL (In-memory database).If we get any 3 of these, we can proceed further  majority of Java would not be a right fit.JD is given again as below:-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------Strong understanding of object-oriented principles with an ability to write clean codeStrong experience of developing multi-threaded and synchronization applicationStrong experience in developing web application using JavaStrong experience working with a variety of relational SQL and NoSQL (Couchbase) databasesStrong knowledge on API development and Unit Testing Framework like MockitoExperience in in-memory databases like Redis, MemSQLExperience with CI/CD process and tools (Stash, Maven, GIT, Jenkins, SonarQube)Self-motivated with a demonstrated ability to work both independently as well as part of a team with good understanding of OOPSBasic high availability techniques and implementation knowledge.Practical knowledge of caching and distributed systemsExperience in working in AGILE methodology and Amex experience preferredShould be able to perform and maintain ongoing BAU activities, utilizes visualization and other techniques to fast-track concepts, provide proactive ideas on continuous improvement / streamlining the applications.Strong analytical and problem-solving skills   ", "Role": "IT/Technical Content Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Other", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Any Doctorate in Any Specialization", "Key Skills": ["Java8", "Kafka"]}