{"Job Title": "Java (Software Developer / Sr. Software Developer)", "Company": "NEEMTREE INTERNET PVT LTD", "Experience": "2 - 7 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "  Responsibilities:   - You will be a member of our Scrum development team to deliver technology solutions in an Agile team which include, sprint planning, standups, and sprint retrospectives  - You will design, analyze, code, test, and deploy applications to satisfy business requirements for large, complex projects.  - You will adhere to firm-wide architecture standards, risk management and security policies.  - You will ensure quality and completeness of the product through unit testing, documentation and maintenance as appropriate  - You will balance application development and application support need    Requirements:   - 3+ Yrs Solid knowledge of Java 8 with experience with Spring framework and database abstraction layers like Hibernate.  - Experience working with SQL databases, query optimization and designing schemas  - High coding standards - understanding of test coverage best practices & test pyramid concept  - Familiar with Continuous Delivery approach  - Experience with Distributed and Concurrent Systems, knowing the tradeoffs between stateful/stateless and synchronous/asynchronous architectures  - Hands on knowledge of system integration patterns - REST, messaging, event streams  - Passion about technology and its relationship with product and user experience  - Ability to work independently - identify problems, create plans and implement solutions to them  - Broad understanding of the concept of minimum viable product (MVP)  - Customer is at the heart of everything you do and this empathy drives all decision you make  - Ability to articulate complex and technical concepts to non-technical audiences  - Knowledge/interest in payment platforms, foreign exchange & highly complex systems        Experience Range:     2 - 10 years      Educational Qualifications:    B.Tech/B.E,BCA,orM.TechMCA      Skills Required :    Java , Hibernate , Spring , AWS , API , Microservices ,   ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization, BCA in Computers", "PG": "M.Tech in Electronics/Telecommunication, MCA in Computers", "Doctorate": "None", "Key Skills": ["Maven", "Hibernate", "Application support", "Coding", "Agile", "Application development", "Scrum", "Unit testing", "Open source", "SQL"]}