{"Job Title": "IT Software Developer Sr", "Company": "Qualcomm Technologies, Inc", "Experience": "5 - 9 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "   Job Overview         Familiarity with Gradle  Good knowledge on SOA, web services and integration technologies like camel, Spring Integration.  Experience using Groovy - Basic knowledge of groovy is nice to have.  Experience working on Hadoop eco system (Preferably MapR) and Spark.     Min. Qualifications 5 to 9 years of enterprise application development with strong technical fluency in java/python technologies.        Preferred Qualifications       Experience in developing with Python and understanding of NumPy, Pandas  Fundamentals in object-oriented design, data structures, algorithms and problem solving.  Real time experience building high available, large scale distributed enterprise grade applications.  Experience building REST APIs and Spring framework  Experience working with message based integrations (JMS/AMQP)  Experience working with NoSQL Databases (MongoDB) as well as relational DBs (MySQL/Oracle)  Experience working on linux based systems.  Experience in working in a devops environment  Experience working in an agile development environment.  Ability and experience in writing reusable code and a know-how of best practices and design patterns.  Knowledge of different types of enterprise systems, their interaction, boundaries within an enterprise.  WILLINGNESS to multi task and work in a fast paced environment.  Must be willing to take ownership and drive tasks to completion        Education -     Required Bachelors degree in technical discipline or equivalent experience required.  ", "Role": "Software Developer,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["JMS", "SOA", "Linux", "Staffing", "MySQL", "Data structures", "Application development", "Oracle", "Information technology", "Python"]}