{"Job Title": "Software Developer II", "Company": "Advance Auto Parts", "Experience": "2 - 7 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "  Job Description    The successful candidate will be experienced in designing,  building,  testing integrations in a large,  complex enterprise organization. The candidate must possess strong technical skills,  HR business functional knowledge (e.g. HCM,  Payroll,  Recruiting,  Compensation,  etc) and work well with internal stakeholders and external vendors. The candidate will be a disciplined selfstarter working well with business leaders,  functional analysts,  operations teams,  vendors,    and internal I.T. In addition this candidate will understand how to drive value out of the Workday platform by building sustainable integrations,  ensuring data accuracy,  all with a laser focus on data security.      Key Responsibilities    Manage system integrations within the architecture of the Workday system and interacting systems   Provide support for Workday inbound and outbound integrations (ie: breakfix,  minor enhancements,  new integrations builds)   Perform routine break/fix support and regression testing and support the inbound/outbound interfaces to the system and middleware   Ensure accuracy and integrity of data and applications through analysis,  coding,  clear documentation and problem resolution   Analyze and translate functional specifications and change requests into technical specifications   Collaboration with business partners,  technical teams,  and end-users on design decisions   Design and develop interfaces and conduct unit and integration tests   Understand and adhere to defined integration/development standards and best practices   Understand and ensure security and data privacy standards   Additional Responsibilities    Ability to work and coordinate with third parties on data related inquiries   Experience with Web Services and APIs (WSDL,  SOAP,  REST and WS standards)   Strong technical experience with XML and Java   Excellent verbal and written communication skills to effectively interact with team members and leadership   Strong problem solving,  troubleshooting and analytical skills   Ability to work effectively in a fast-paced environment and handle both planned and unplanned responsibilities   Ability to prioritize workload and execute tasks independently,  providing timely follow-up and resolution   Ability to work in a team-oriented,  collaborative environment    Required Skills    Bachelor s Degree in relevant technical field (Information Technology,  Computer Science,  Software,  Engineering or related technical discipline)  or equivalent combination of training and work experience   4-7 years of experience in HR cloud technologies (ie: SuccessFactors,  Workday,  etc)   2-3 years working with Workday Integrations (Enterprise Interface Builder (EIB),  Workday Studio,  Workday Report Writer,  and iLoad)  ", "Role": "Software Developer,", "Industry Type": "Internet, Ecommerce,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Outbound", "Payroll", "Coding", "data security", "XML", "Regression testing", "Troubleshooting", "Middleware", "Information technology"]}