{"Job Title": "Lead Software Development Engineer - Full Stack Web Development (JAVA)", "Company": "Amzur Infotech Private Limited", "Experience": "8 - 13 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad, Mumbai (All Areas), Remote", "Job Description": " As a Lead Software Development Engineer at Amzur, you will have the opportunity to work with an experienced team developing new solutions for HR Tech and IoT. You will leverage industry best practices and methodologies such as Agile, Scrum, test automation, Continuous Integration and Continuous Deployment. You will be working with a very exciting technical stack, which includes some of the latest technologies like NET MVC, RoR, Micro Services, NodeJS, Angular, Bootstrap, HTML 5, Elastic Search, MQTT, Selenium, etc...Interact effectively with State-side Partners, stake holders and manages the partnership with in line of business to deliver successful business results based on technology requirementsResponsibilities: Should be very proficient in understanding the scope of work, taking care of devliverables, Non functional requirements, Monitoring the health of applications. Interact effectively with State-side Partners, stake holders and manages the partnership with in line of business to deliver successful business results based on technology requirementsEssential Qualifications:  Possess strong expertise of object-oriented design and development (OOA/OOD) Deep knowledge about best coding & design practices and understand ways to write proficient & performance oriented code Experience working with and applying design patterns to solve problems Experience in building web applications. Ability to adapt and pick up new techniques and technology Solid understanding of MVC, and strong OO skils Acts as a technical expert for modeling, simulation and analysis efforts. Well versed analytical and diagnostic ablity to complex problems. Experience gathering and analyzing information for the development of effective solutions to problems or situations. Can solve highest complexity problems quickly.Desired Qualifications:  Have at least 8 years of strong technical experience in developing commercial/enterprise level software products.  Experience with full stack web development is essential. You should possess strong knowledge and ability in using JavaScript, the AngularJS framework, and the Node.js platform.  Strong programming skills in any of the languages like Java/.Net/RoR is favorable. Strong knowledge Databases: SQL/RDBMS, MySQL, PostgreSql, MongoDB) Have excellent experience using UNIX/LINUX environments to develop, deploy, and manage applications. Strong Data structures and Algorithmic skills Solid experience with RESTFUL Web Services using WebAPI. Experience in Agile methodologies with software development life-cycle experience Others: Regular expressions, Excellent troubleshooting skills. Effective communication skills in both oral and written English, ensuring understanding of both verbal and written material of the highest complexity, with the ability to lead solutions in a clear and concise manner. Proactive and attention to detail. Sense of urgency to solve problems and propose solutionsGood to have:  Experience with the Cloud (Azure, Amazon) Alternative databases and search engines (Elastic Search, MongoDB, Redis) Experience with message queue technologies (RabbitMQ...) Advanced front-end development skills, LessCSS / SaSS, Knockout, Angular", "Role": "Team Lead/Technical Lead,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Angularjs", "Java", "Html5", "MySQL", "Javascript", "Bootstrap", "HTML", "Node.Js", "MongoDB", "Angular"]}