{"Job Title": "Senior Software Developer", "Company": "Skillsoft", "Experience": "4 - 8 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "Senior Software Developer \n\nAre you passionate about learning and intellectually curiousDo you thrive in a fast paced, innovative work environment where team members hold themselves and others accountableAre you energized by trying new things, have an agile mindset and enjoy making an impactIs working for a purpose driven organization important to youIf the answers to these questions are a resounding YES , then read on! \n\nSkillsoft is the global leader in corporate learning. We help businesses solve their biggest challenge - attracting, motivating and retaining world class talent. Our team is recognized for cutting edge digital learning and human capital management solutions. Trusted by the world's leading organizations, including 65of the Fortune 500, we train more professionals than any other company in the world. Our 100,000 courses, videos and books are accessed over 130 million times every month, in 160 countries and 29 languages. At Skillsoft, we believe that knowledge is the fuel for innovation and innovation is the fuel for business growth. \n\nWe are all about Making Work Matter. With over 2000 employees around the world, we are always looking for amazing talent! \n\nWill you be next to join our team \n\nOpportunity Highlights: \n\nDevelop and maintain internal automation applications used to manage servers, applications, and related infrastructure in the Skillsoft hosting environment. \n\nTroubleshoot applications in our testing and production environments and work with Cloud Operations personnel as needed to resolve issues and deploy software updates. Skills & Qualifications: \n\n4 years of relevant software development experience \n\nProficient in C#/.NET, or similar language \n\nExperience building and interacting with REST APIs and/or SOAP webservices \n\nGood understanding of SQL \n\nExperience with source control tools, preferably Git \n\nDeep understanding of common Internet protocols (TCP/IP, HTTP/HTTPS, DNS) \n\nSome knowledge of front-end frameworks such as Angular or React \n\nUnderstanding of Windows (Windows services and Powershell), WMI, and WinRM considered an asset \n\nKnowledge of federated login technologies (SAML, OAuth) is an asset \n\nFamiliarity with Linux operating systems an asset \n\nExperience using containerization technologies and working in a microservices architecture environment an asset \n\nExperience with orchestration and configuration management tools (Ansible, Chef, Puppet, etc) an asset \n\nAbility to independently design and implement maintainable solutions to complex problems \n\nAbility to analyze and troubleshoot problems in a production environment \n\nExcellent communication, problem-solving and analytical skills \n\nExcellent time management and organizational skills \n\nAbility to communicate information and ideas clearly and concisely, orally and in writing \n\nAbility to follow established processes and identify opportunities for improved efficiency \n\nProfessional manner with strong interpersonal skills \n\nSelf-directed work habits \n\nAbility to think strategically and plan for innovation/change; flexibility/adaptability \n\nProven ability to learn new technologies and applications quickly Attributes: \n\nProactive with a strong sense of urgency and competitive drive. \n\nIndependent, entrepreneurial mindset with ability to make independent decisions. \n\nInfluential, and enthusiastic communicator. \n\nAdaptable, embraces change. \n\nCollaborative team player, working across various teams within the organization. \n\nCustomer service minded. \n\nStrong attention to detail, organized and goal oriented. Thank you for taking the time to learn more about us. \n\nIf this opportunity intrigues you, we'd love for you to ! \n\nNOTE TO EMPLOYMENT AGENCIES: We value the partnerships we have built with our preferred vendors. Skillsoft does not accept unsolicited resumes from employment agencies. All resumes submitted by employment agencies directly to any Skillsoft employee or hiring manager in any form without a signed Skillsoft Employment Agency Agreement on file and search engagement for that position will be deemed unsolicited in nature. No fee will be paid in the event the candidate is subsequently hired as a result of the referral or through other means. \n\n", "Role": "Software Developer,", "Industry Type": "Education, Teaching, Training,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Automation", "Web services", "Front end", "Linux", "Configuration management", "DNS", "Agile", "HTTP", "Customer service", "SQL"]}