{"Job Title": "Software Developer - PHP/ Flutter", "Company": "Computer Ware India Pvt Ltd", "Experience": "0 - 2 years", "Salary": "Not Disclosed", "Location": "New Delhi", "Job Description": "SUMMARY: Build a cloud based Wifi Manage+Monitoring Solution which assimilates software development and basic networking concepts to provide a seamless experience of managing, sharing, administeration of WiFi setup. Key goals & responsibilities: - Build cloud based Wifi Manage+Monitoring Solution with multiple modules of focus. Highly Available, offering Predictable and Reliable Internet Experience, and affordably. - Using Flutter/ Linux/ PHP, MySQL, JavaScript/HTML/CSS build the hybrid app which allows a one-click easy WiFi management, access and monitoring. - Combine software development with networking knowledge and concepts applying the latest technologies. Plenty to learn. - Work location: South Delhi - very easy accessibilty- 5 steps away from Green park metro St on yellow line Team you will join: Youthful, committed and focussed, Supportive. Company: More than 30 years in the business of serving and fulfilling client IT needs for business, spanning- Enterprise technology solutions based around devices/ networking/ data security/ storage/ cloud solutions etc. - Bespoke, customised web applications (e-commerce, portals, presence, business apps, etc - Managed WiFi Solutions, SaaS, Cloud based security and or storage solutions etc - Empanelled with NICSI for Enterprise technology solutions/ csutomized solutions What you Have to bring with you : - Self Motivation to learn and grow, think out of the box, ownership and pride of work - 6-12 months yrs hands-on projects done in Flutter, Core PHP, MySQL, JavaScript, HTML, CSS.Preferred- tho' freshers with knowledge of Flutter and PHP can apply as well - Comfort level : working on Linux systems. - Should be able to understand and incorporate existing code. - Ability to work on Linux environments (Ability Setup and troubleshoot apache webserver, database servers to get the apps working) - Ability to determine appropriate architecture, technical solutions and make relevant recommendations - Strong debugging skills /should be able to quickly read and modify existing code. - Adequate knowledge of relational database systems, Object Oriented Programming and web application Knowledge of Hybrid mobile apps is an added advantage", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "BCA in Computers, B.Sc in Computers, B.Tech/B.E. in Computers", "PG": "MCA in Computers, MS/M.Sc(Science) in Computers, M.Tech in Computers", "Doctorate": "Doctorate Not Required", "Key Skills": ["Linux OS", "MySQL", "Javascript", "PHP", "Flutter"]}