{"Job Title": "Senior Software Developer", "Company": "Intelligent Project Resourcing Private Limited", "Experience": "6 - 10 years", "Salary": "₹ 10,00,000 - 20,00,000 P.A. ", "Location": "Hyderabad/Secunderabad, Bangalore/Bengaluru, Delhi / NCR", "Job Description": "Senior Software Developer  Title: Senior Software DeveloperExperience: 7+ YearsExpected: NegotiableStart Date: ImmediateSalary- No bar for the right candidateOpen to all locations across IndiaWork from Home (Full time)Opportunity to work onsite in UK in near future.About UsWe are a product based and one of the most exciting and growing start-ups to join in Noida. We have gone through a stage of hyper-growth and have a team of 15+ people and still growing. We are owned by a high-profile Fin-Tech start-up in the UK, Score Genius, and support all of their development requirements. Check out our websites:www.ooki.ioWe are responsible for the launch and ongoing technology work for all types of applications, including web, iOS and Android.We work on the newest technologies available:C# BackendAngular 6+ FrontendAWS Serverless ArchitectureSQL Server / DynamoDB DatabasesGIT Code RepositoriesAtlassian Suite (JIRA/Confluence) Task and Information ManagementSlack CommunicationWe use the best development methodologies:SCRUM is recognised as the best development process worldwide. All of our projects are delivered using this methodology to ensure world class products are delivered to end-users. We use iterative development when delivering larger projects to simplify delivery, manage quality and ensure timely completion.Your ResponsibilitiesProgramming to deliver high quality software applicationsResponsible for the quality and completeness of assignments, including development, bug fixing, documentation, and general product maintenanceTaking technical ownership of own deliveriesShould adhere to delivery schedulesStrong work ethicYour Experience and SkillsAt least 7 years of development experience in .NET applications and working in agile environment. A minimum of 6 months of knowledge of implementing lambda functions is a plus.Primary skillsC#.NetSql Server 2012+API gatewayAngular 6+ Secondary skills (not required but a plus)AWS Lambda functions/ Serverless technologySQS S3 bucket Cloudwatch Cognito Dynamo db EC2Other skillsExpert knowledge of Object Oriented Programming and design patterns/principles.Expert knowledge of C#, .NET platform, JSON JavaScript and/or jQuery, HTML/DOM/CSSExperience with GIT and basic knowledge of AWSUpdated with latest technologiesUses best practices Possesses Enterprise development experience.Strong customer advocacy including rapid response to the businessExcellent communication skillsExperience working with SCRUM/ Agile methodologies.Strong understanding of the product lifecycleIf you fulfil the requirements mentioned above and the answers to the questionnaire are mostly yes then drop a mail with your resume at saltanat.khan@ooki.io or contact 8826360427.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization, Graduation Not Required", "PG": "Any Postgraduate in Any Specialization, Post Graduation Not Required", "Doctorate": "Doctorate Not Required, Any Doctorate in Any Specialization", "Key Skills": ["C#", "Amazon API gateway", "aws lambda", "front end", "css", "Amazon SQS", "dom", "dynamo db", "javascript", "jquery", "sql server", "angular", "amazon ec2", "s3bucket", "json", "html", "Cognito", "aws"]}