{"Job Title": "Senior/Software Developer Angular 2/4/5/6/7/8", "Company": "Trivium eSolutions Pvt. Ltd.??????", "Experience": "3 - 7 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   You will be responsible for designing and building web applications based on TypeScript.    The primary focus will be to deliver a complete and functioning frontend application for a desktop.    The major focus will be on data processing efficiency and performance as the UI would have to display realtime data.    You will be a part of a team of back-end developers, DevOps engineers.    The project is managed in an Agile way using SCRUM     Required Qualifications:     You should have the educational background of M.Tech / B.E / B. Tech (in IT/CSE) / MCA.    You enjoy working in a highly motivated team with an international mindset and an open culture.    You have a deep understanding of agile software development. Ideally, you have gathered several years of experience in the area of software development and are used to working independently, and have a structured approach to problem-solving.     In particular, the following qualifications are key:      Proficiency with TypeScript, and latest Angular version, and HTML5.       Professional, precise communication skills.     Work experience writing Unit Tests using Jasmine and Karma.     Work experience in applying the best practices of Angular, Web Application development.     Extensive working knowledge of HTML5, CSS3, XML and JSON.     Thorough understanding of Reactive Programming, RxJS framework, Databases, API, Implementing of Caching and RESTful services.       Applying a validation framework, performance tuning using Angular lazy loading concepts.     Working experience in an Agile team especially with SCRUM.     Good understanding of DevOps, CI/CD principles and practices to improve Software Quality Efficiency.     Following skills will be an added advantage:     Work experience with JAVA (Spring Boot or Spring Cloud Services) or .NET backend     Familiarity in working with Containers, Docker, Kubernetes etc   Service / API test to test endpoints as thoroughly as possible    ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial", "PG": "MCA in Computers, M.Tech in Electronics/Telecommunication", "Doctorate": "None", "Key Skills": ["Performance tuning", "Web application development", "Front end", "XML", "Agile", "Data processing", "JSON", "Scrum", "software quality", "CSS3"]}