{"Job Title": "Software Developer", "Company": "enVista", "Experience": "1 - 4 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "     Responsibilities:     Technical analysis & estimation of business requirements   Converting visual designs to visual elements.   Support unit and system testing of application code, as well as execution of implementation activities   Deliver commitments within timelines and quality parameters   Manage multiple competing priorities and changing requirements in a fast paced SaaS environment   Facilitate technical meetings and communicate progress, action items, etc. to the stakeholders   Drive innovation and new ideas that help us improve our customer experience   Work in an agile environment.   Respond to production issues and coordinate with stakeholders and external teams to arrive at solutions   Ability to prioritize work and help the team assess impacts to timelines     Skills & Qualifications Required:    1. Four-year bachelor s in computer science, engineering, or a related technical field with  a. 1-4 years hands-on development experience  2. Solid fundamental knowledge of JavaScript (especially asynchronous programming with JavaScript)  3. We expect you to have well-rounded experience of :  1. Working with NodeJS and a web application framework like express.  2. Understanding of SPA frameworks like Angular/React/Vue.  3. Rest architecture and API designing  4. Responsive CSS framework(s) and fundamentals like Bootstrap Foundation etc.  5. Web & HTTP fundamentals and optimization techniques.  6. Frontend building & linting tools with Gulp, Webpack, ESLint etc.  7. Unit and integration testing with tools like Chai, Mocha & Cypress etc.  8. Docker, Typescript and Flutter experience is a plus  9. Micro-service architecture and some level of distributed system design concepts.  10. Experience with SQL (Any one of Oracle, PostgreSQL, MySQL)  11. Prior experience of Redis, Elasticsearch, AWS or other vendor web services.  4. Experience in Supply Chain and Order Management Solution is a plus. ", "Role": "Software Developer,", "Industry Type": "Courier, Transportation, Freight , Warehousing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Order management", "Software design", "Postgresql", "MySQL", "Javascript", "Agile", "HTTP", "EDI", "Oracle", "SQL"]}