{"Job Title": "Software Development Engineer in Test - Server Side APPZ-SOIC", "Company": "Applicantz, Inc.", "Experience": "5 - 10 years", "Salary": "₹ 10,00,000 - 20,00,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": "The role is currently remote but post-pandemic, the location would be the Bengaluru office Seeking a passionate Sr. test engineer to join a team of professionals who are responsible for building its consumption licensing platform used by thousands of enterprise customers. Requirements:Proficient in test-driven developmentDeep knowledge of test methodologies, writing test plans, mock data/services, creating test cases, debugging & testingExperience working in an agile team, CD/CI with Jenkins and automated deployment Need AWS Server-side Engineering BackgroundHigh attention to detailBS/MS in computer science/engineering or a related fieldResponsibilities:You are the guiding light for the team when required to mentor them agile test practicesExcellent Test strategy skills and to be able to work with team to produce a quality productWork with team to find and fill the gaps on qualityDrive the backlog forward with teamEffectively be able to work with stakeholders on reviewing the requirementsHands-on on any of the programming language such as Python, JavaWork with the team to automate testing of new functionalities and services using existing service architecture, delivery pipeline and test framework Write moderately complex code/scripts to test services and APIsContribute to monitoring product development and usage at all levels with an eye toward improving product qualityCreate test harnesses and infrastructure supporting Windows, Mac & LinuxAnalyze and decompose a complicated software system and design a strategy to test itHas been in driving role for quality in lean scrum team practicesGood experience with CI/CD such as Jenkins", "Role": "Testing Engineer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Linux", "Cross platforms", "Automation Testing", "Windows", "Mac", "Python"]}