{"Job Title": "Software Developer", "Company": "CAST Software India Pvt Ltd", "Experience": "2 - 7 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  Job Detail    Software Developer (C#) - India / Bangalore   CAST is looking for   C# Senior software engineers   with 1-5 years of experience in a software company.     Job definition:     Working at CAST RD means being an important part of a highly-talented, fast-paced, multi-cultural and Agile team based in Paris (France) and Bangalore (India). The team builds a sophisticated source code analysis platform leveraging parsing, control flow, data flow and others mechanisms to fully understand the inner structure of the complex IT Systems developed and used by the Fortune 500 companies.    You, working as individual contributor as part of team, will contribute to the core part of our platform: .NET source code analyzer. You will contribute to the evolution of our technology to support the latest evolution of C# and VB.NET language and all .NET related frameworks. You will have the opportunity to work on the different parts of the analysis chain from parsing to developing new quality rules notably the ones related to the emerging CISQ standard. C# will be your main language of use but you will have the opportunity to leverage also Java or Python experience.     Profile:     The candidate should have a passion for technology and a flexible, creative approach to problem solving.    Must have at least 2 years of experience    Must have expertise in C# core development    Result oriented with a focus on delivery and quality    Must be pragmatic    Hands on TDD addict: writing unit tests    Accept to follow a framework of rules on how to write/design static analyzers    Excellent written, oral and telephone communication skills in English    Desired but not mandatory knowledge of the Application Maintenance Development landscape, preferably through past experiences inside a top Indian SI    Should have exposure to wide range of technologies    Proven track record in achieving stretched goals in a fast paced, innovative work environment    Strong sense of urgency, drive and ownership    Strong analytical and logical skills    Attention to details, well organized  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["VB.NET", "Networking", "TDD", "Analytical", "Agile", "Software Engineer", "Unit testing", "Individual Contributor", "Python"]}