{"Job Title": "Principal Engineer Software Development Engineering (Apps)", "Company": "Western Digital", "Experience": "8 - 13 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   Responsibilities        Design and build highly scalable, cloud-native applications on the AWS platform using core developer services such as IoT Core, API Gateway, Lambda, DynamoDB and EKS.         Design, Develop and enhance video surveillance as a service (VSaaS) system, built primarily in AWS using native AWS technologies.         Design and develop multi tenancy models, hybrid cloud solutions with On-Premise support.      Design and develop networking, security and compliance best practices.      Develop a framework for AWS Managed services cost estimation and optimization.          Help build and enhance a scalable and reliable cloud powered IoT application capable of reliably processing/streaming very large volumes of data/media and include thousands of connected cameras.         Drive requirement analysis, architecture, detailed design, task breakdown and effort estimations.     Qualifications     Degree in Computer Science or an equivalent in closely related fields.         8 to 11 years of experience working on all phases of Software Development Life Cycle.         8+ years of experience in cloud application backend development with NodeJS/JavaScript, Python, or similar programming languages or environments.         Strong knowledge and established experience in S3, EC2, RDS, Lambda, EKS, DynamoDB, CloudWatch, and other AWS services.         Strong programming skills, able to write modular, maintainable, testable code and unit tests.         Strong understanding and experience working with document-oriented/key-value data stores (MongoDB, Redis, DynamoDB, etc) and RDBMS (MySQL, PostgreSQL, RDB, etc).         Familiarity with messaging, data and event streaming services/protocols such as MQTT, AWS Kinesis, RabbitMQ, Kafka.         Familiarity with media streaming technologies such as WebRTC and HLS.       Experience in designing and implementing REST APIs for web/mobile applications.         Understanding of access control services including authentication services such as OAuth2.0, OpenID Connect, JWT.         Understanding of Agile methodologies and experience working in a SCRUM environment.         Understanding of modern cloud-native microservice based application development and architecture using containers and orchestration tools (docker and Kubernetes).         Experience building and debugging secure, scalable, high availability backends and services.       Understanding of DevOps concepts, CI/CD pipelines, application logging and monitoring.     Experience working with Git.   Experience with Linux systems.    Experience with serverless application development, preferably using AWS.      Experience with video streaming technologies such as WebRTC and HLS.      Experience with Azure, GCP or Hybrid-Cloud environments.    Experience in building cloud SaaS applications.  ", "Role": "Team Lead/Technical Lead,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Linux", "Cloud", "MySQL", "Javascript", "Software development life cycle", "Cost estimation", "Application development", "AWS", "Monitoring", "Python"]}