{"Job Title": "Senior Software Developer - Backend (RUBY ON RAILS)", "Company": "Awign Enterprises Pvt Ltd", "Experience": "2 - 3 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   We are looking for young code ninjas who are passionate about giving users the best experience. Have a thirst to learn new technologies and update themselves to find new solutions to meet the needs of our constantly growing business.                 Responsibilities:        Should have 2 to 3 yrs of total experience.     Architect systems capable of serving as the brains of complex distributed products.     Building reusable code and libraries for future use.     Integration of user-facing elements with server side logic.     Thrives in a complex and ambiguous environment, continuously adapting for business users.     Maintain, contribute and adhere to programming best practices and guidelines.              Requirements:        Technically Hands-on, prior experience with scalable Architecture.     Excellent command over Data Structures and Algorithms.     Exceptional coding skills in an Object Oriented programming language (Ruby preferred).     Strong problem solving and analytical skills.     Experience with web technologies, Rails, Java, Python, Linux, Apache, MySQL, ElasticSearch, Redis.     Experience in architecting building real-time, large-scale applications.     Experience with high-performance websites catering to millions of daily traffic.     Knowledge about different design / coding patterns.     Experience working with dynamic document stores like mongodb.     Experience in extracting common code into gems / libraries.     Knowledge of metaprogramming in ruby.    ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Backend", "Linux", "Coding", "MySQL", "Data structures", "MongoDB", "Apache", "Ruby", "Ruby on rails", "Python"]}