{"Job Title": "Software Developer", "Company": "The Media Ant", "Experience": "1 - 2 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   What is the role of Technology Team in The Media Ant      The Media Ant is a tech-enabled media agency. For us, technology is at the core of every business and process. We see the tech team as an enabler to drive convenience and efficiency throughout the organization. Being a new generation media agency, the role of the technology team in The Media Ant is to ensure that deep tech is the backbone of everything that we do at The Media Ant.      Few areas of work include building and maintaining the e-commerce portal for media buying, the dashboard to maintain operations and finance, maintaining a large amount of data generated every day, and building intelligence from the user behavior data.      Summary of the work involved are:        Strong programming skills in -   JavaScript, NodeJS, ExpressJS, MongoDB, HTML, CSS.         Experience of using   ReactJS, AngularJs  ,   or any similar frameworks is a plus.        Ability to take a complex problem and break it down into workable chunks of tasks.        Everyday job involved - Software Developer      Development of new features in our product. Mostly in the following technologies      1. JavaScript      2. NodeJS      3. MongoDB      Academic Qualification       Bachelor s degree in   Computer Application/Information Technology with more than 65% across 10th, 12th, and Graduation.      Work experience requirement      Work experience of 1 - 2 years.      Other important skills and traits required to succeed in this role and The Media Ant, general:      Understanding of REST APIs, MVC architecture, and web applications.        Must be a logical thinker and willing to be a team player.         Must have both functional knowledge and technical competence.     ", "Role": "Software Developer,", "Industry Type": "Advertising, PR, MR, Event Management,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Application programming", "MVC architecture", "Javascript", "Computer application", "E-commerce", "HTML", "MongoDB", "Information technology", "Marketing"]}