{"Job Title": "Senior Software Developer(Cloud)", "Company": "Siemens Limited", "Experience": "4 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  This position is for a Cloud Developer with proven experience in building resilient, scalable and responsive cloudbased applications. The position is located within a dynamic team that delivers product and service breakthroughs within Siemens Healthineers.   Responsibilities   Design and develop applications for Microsoft Azure cloud deployment   Extend applications to use appropriate AZURE services for authentication and authorization, file management, workflow management, queue management etc.   Perform detailed design, coding, documentation and unit testing of functionality/components in accordance with quality/process guidelines.   Deliver committed work package results within the planned time, effort and with high quality.   Learns, explores, and evaluates new technologies/tools for implementation using proof of concepts and prototypes   Collaborate with crossfunctional and globally located teams including architects, project managers and developers.   Qualification:    BE / B.Tech / MCA / MSc (Computer Science)    Experience:    4 to 6 years of experience in software development, preferably in a product organization.   Experience working with multi-site global teams is beneficial   Knowledge and Capabilities   Excellent programming and debugging skills in .NET and C#.   Hands-on experience in RDBMS such as SQL Server, MySQL or PostgreSQL.   Strong knowledge of cloud computing platforms(Azure, AWS) with demonstrable experience in developing using Azure Functions and Web Apps.   Experience with Data Modelling and ETL Jobs Design is beneficial   Knowledge of DevOps/Continuous Delivery methodologies is preferred   Experience in containerization (with docker) and micro-services in a software ecosystem context is beneficial.   Conversant with typical software development processes / methodologies and exposure in working with multi-site global teams.   Must be keen to learn cutting-edge technologies, dive deep into new technology/tools, implement proof-of-concepts with quick solutions.   Certification in \"Developing Microsoft Azure Solutions\" preferred.   Personality Requirements and Skills:    Good analytical and problem-solving skills    Must be able to work in a team environment    Good interpersonal and communications skills    Good written and verbal communication skills    Good organizational skills   Result oriented   Self-motivated   Highly collaborative  ", "Role": "Software Developer,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial", "PG": "MCA in Computers, MS/M.Sc(Science) in Chemistry", "Doctorate": "None", "Key Skills": ["Computer science", "Cloud computing", "RDBMS", "Coding", "Postgresql", "MySQL", "Debugging", "Healthcare", "Unit testing", "SQL"]}