{"Job Title": "Senior Software developer C", "Company": "Siemens Limited", "Experience": "5 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "     We are looking for a senior C developer responsible for building Client server application. The primary responsibility will be to design and develop backend application server which has to be developed in C .   Develops architectural designs and independently develops complex system designs that meet the product requirements.   Design, Debug , code, and maintain efficient, reusable, and reliable C code to develop application server(backend).   Consideration of the system architecture to build interfaces and the advance in software technology.   Provide technical leadership to the team, collaborators and customers.   Define, articulate and apply and implement architectural principles and patterns; Perform architecture reviews and assessments.   Assess current state of software quality and development efficiency of products developed by Siemens software divisions and appropriately, develop offerings including, offerings deck, best practices documents.     Use your skills to move the world forward!       We need a professional with 5 to 8 years in Software development.   Expertise in C , Threading, synchronization, socket programming.   Thorough knowledge of the standard library, STL containers, and algorithms.   Knowledge of low-level threading primitives and real-time environments.   Familiarity with wrapper library functions.   Knowledge of writing native modules for high-level languages such as Node.js.   Excellent code analysis and Debugging skill.   Experience architecting and deploying multi-tiered applications   Experience in using and applying Architecture and Design patterns   Know-how of OPC Unified Architecture   Working experience with SCADA system   Working knowledge on VB6 and C scripts     ", "Role": "Software Developer,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["System architecture", "Socket programming", "Backend", "Architecture", "Manager Technology", "Siemens", "Technical leadership", "software quality", "SCADA"]}