{"Job Title": "Sr . Software Developer / Software Developer - C #", "Company": "Sapiens International", "Experience": "3 - 5 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "    Roles and Responsibilities:         Designs, develops and modifies software      products and/or customer applications using object oriented web development utilizing C#, JavaScript, Dojo Toolkit, XML, SQL Server 2008-2016, MVC, SVN, Web Services, Unit testing, and SOA patterns.       Participates in design discussions and contribute in decision making  Will work on multiple projects providing development and maintenance work.        Have knowledge of how to document program design, coding, and maintenance.       Have experience getting critical project to completion with high client satisfaction.       Applies existing guidelines and procedures to make varied decisions within a department.       Uses sound judgment and experience to solve moderately complex problems.       Uses independent judgment to identify problems and recommend solutions.       Adheres to defined coding standards and other defined quality standards  Client interaction, interpersonal communication, written communication, decision making ability, client focus.         Job Requirements:         Demonstrated and verifiable experience with full lifecycle software development of a complex web based product.        This should include experience developing software requirements, producing design specification, writing high quality software, unit testing, software implementation and integration, and software maintenance and support.         Years of Experience:         Requires 3 to Strong experience designing and implementing multi-tiered applications   3+ years (current) working experience with web development with Microsoft Tools.   3+ years of object-oriented software development and design experience.   3+ years of C#, .NET Framework ver. 4.0/4.6, ASP.NET, and ADO.NET development.   Strong experience with Dependency Injection frameworks.   2+ years of experience working with JavaScript and JavaScript frameworks.   Practical knowledge of one or more JavaScript frameworks and experience implementing JavaScript RIA applications is a plus.   2+ years of experience working with XML/XSLT.   2+ years of experience developing with SQL Server   2+ years of experience writing Unit Tests using MS Test, nUnit or equivalent software.   Experience with MVC, SOA, and OOP design patterns   Microsoft .NET certifications are a plus         Ide   al Candidate will demonstrate the following:         Strong analytical and problem-solving skills       Must be detail oriented and possess effective oral and written communication skills.       The ability to understand the subject matter and customize the message according to the intended audience.       Strong organization skills: must be able to work on multiple tasks during the same time frame and meet deadlines with accuracy and efficiency.        Must be willing to work extended hours to meet project deadlines.       The ability to communicate effectively, both verbally and in writing to a diverse range of audiences and settings.        Must have a positive attitude, be self-motivated, flexible, and a team player.       The ability to maintain the integrity of confidential business information, our own and that of the clients.       Be comfortable working in a distributed team environment.         Education / Certifications / Training:          Bachelor s degree in Computer Science, Management Information Systems, Information Technology, or equivalent work experience.       Insurance industry experience and/or experience with ACORD standards are a major plus.       Experience providing technical consulti     ng services are considered a plus.       Working knowledge of SOA and Web Services technologies       Experience in full software development lifecycle using agile methodologies such as Scrum     ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["SOA", "XML", "Web development", "Javascript", "Agile", "XSLT", "MVC", "Business intelligence", "microsoft", "SQL"]}