{"Job Title": "Senior Software developer", "Company": "Siemens Limited", "Experience": "6 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "     We make real what matters      You will Understand the requirements, user stories, High level and low level design, implementation, unit and integration test to deliver high quality product    Implement new requirements and maintenance adhering to coding and quality guidelines    Identification and implementation of (unit/integration/automation) tests to ensure solution addresses customer requirements    Providing documentation (requirement/design/test specification) inputs, and ensuring delivery conforms to organization and project quality processes    Ensuring integration and submission of solution into software configuration management system, within committed delivery timelines      What you need to make real what matters      You have Masters/Bachelor s degree in Computer Science or related field from a reputed institute with grass-root experience    Overall 6-8 years of experience in Design Development.    Strong C#.Net, OOPS programming skills, Design principles patterns.    You have to Insure integration and submission of solution into software configuration management system, within committed delivery timelines.    You should have experience in Experience in Global Software Development (GSD).    You should have Experience in Agile/LEAN software development.    You have to Understand the requirements, user stories, High level and low level design, implementation, unit and integration test to deliver high quality product.    Take initiative and possess an ability to learn and adapt to changes.      ", "Role": "Software Developer,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Product quality", "Automation", "Coding", "Software configuration management", "Agile", "Siemens", "Manager Technology", "Programming", "Design development"]}