{"Job Title": "Software Developer", "Company": "Angel & Genie", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "    The Software Developer will be a part of Global Information Technology Team and will primarily have responsibilities over the creation and maintenance of company-owned web applications.   The Software Developer will work closely with the developers and QA engineers located within the office in Bangalore, as well as all levels of Management and Leadership teams.    This is an unparalleled opportunity to become part of a growing team and a growing global organization. High-performers will have significant growth opportunities available to them.    Job Responsibilities    Support the entire application lifecycle concept, design, test, release and support   Produce fully functional applications and APIs writing clean code using languages such as Python, JavaScript and more   Approach the development lifecycle with testing in mind Unit, Integration, Regression and more   Troubleshoot and debug applications and databases to optimize performance   Design, Develop and Deliver APIs to support both mobile and web applications   Ensure that all engineering efforts are created/maintained by meeting our quality standards   Research and suggest new technologies, applications and protocols to enhance our eco-system,   Create prototypes for design concepts, mock-ups, and approved designs.   Use knowledge and research to constantly modernize our applications and infrastructure stacks   Be a team player and strong problem-solver to work with a diverse team.    Job Requirements    Bachelor s Degree or equivalent work experience   Fluent in English, with excellent oral and written communication skills   5+ years of experience in Software Development   3+ years of experience using Python (including web frameworks, such as Flask)   3+ years of experience using Linux   3+ years of experience with T-SQL/PL-SQL   Some experience of No-SQL databases   Solid understanding of Test-Driven-Development and Python testing frameworks   Solid understanding of OOP   Solid understanding of Asynchronous Programming   Solid understanding of API deployments, maintenance and integrations   (Desirable) Experience with Cloud Computing   (Desirable) Experience with Docker and Kubernetes   (Desirable) Experience with DevOps   (Desirable) Experience with MongoDB and Graph Databases  ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Cloud computing", "Linux", "Wordpress", "Javascript", "MongoDB", "test driven development", "Information technology", "SQL", "Python", "Recruitment"]}