{"Job Title": "Senior Software Development Engineer", "Company": "Hotstar", "Experience": "2 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   At Hotstar,  we have 300 million users on Play Store & capture close to a billion clickstream messages daily. The engineering team at Hotstar is at the centre of action and is responsible for creating unmatchable user experience. Our engineers solve real life complex problems and create compelling experiences for our customers.     As an engineer in the Personalisation team,  you will build platforms and tools that deliver personalised recommendations to 150+ million users. You will work on building storage solutions and microservices that serve recommendations at a rate of few 100K requests per second. You will build tools that serve recommendations to our users in real- time.     The pace of our growth is incredible. If you enjoy working on problems at scale and if you want to build our platform for the next 100 million,  join us!   Your key responsibilities    You will build robust,  secure and scalable microservices to power the Personalisation engine at Hotstar     You will design and implement low latency caching and storage solutions     You will build stream processing pipelines to compute personalised recommendations for our users in real- time     You will continuously evaluate relevant technologies,  influence and drive architecture and design discussions   What to bring    BE/B.Tech/M.Tech/PhD in Computer Science or a related field.     Strong coding skills (Python or Java or Golang)     Experience building distributed domain- driven microservices     Strong understanding of database and storage fundamentals     Experience with AWS stack  ", "Role": "Software Developer,", "Industry Type": "Internet, Ecommerce,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial", "PG": "M.Tech in Electronics/Telecommunication", "Doctorate": "None", "Key Skills": ["Computer science", "Architecture", "Coding", "Database", "AWS", "Python", "microservices"]}