{"Job Title": "Senior Software Developer ", "Company": "Zelite Solutions Pvt. Ltd.", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "  Job Summary     Work in the Architecture group, designing, reviewing and developing technical solutions for critical issues related to performance, scalability and reliability in various environment.        Responsibilities and Duties     Participate in the full software lifecycle, from initial requirements through QA and monitoring   R D for new project and technologies if any specific requirement.   Handling small size of development team.   Handling client communication for requirement, issues.   Creating software solutions that meet customer s needs   Should be an expert problem solver with a strong understanding of the broad range of technologies and platforms available   Troubleshooting and resolving issues with coding or design   Should have highly analytical mindset with the ability to see both the big picture and the details   Should design functional technology solutions and should review the technical designs   Analyze test results and work with developers and engineers to perform bug fixes   Provide technical leadership to improve system performance, capacity, reliability and scalability   Perform root cause analysis of performance issues and suggest corrective actions   Oversee system performance lifecycle and identify key metrics for performance improvements   Evaluate system performances and recommend improvements   Mentorship and Process Improvement Share technical knowledge and insights with the team.       Qualifications and Skills     Knowledge of various tools, technologies, programming languages, platforms and techniques like Dot Net, Dot, Net Core, Python, Java, JavaScript, Angular, ReactJS, PHP, MySQL, MS SQL, Oracle, Git, AppDynamics, Clean Code, Backend for Frontends.   Any Graduate or post graduate.   Good English communication skills.   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["MS SQL", "Backend", "GIT", "Coding", "MySQL", "Javascript", "PHP", "Troubleshooting", "Monitoring", "Python"]}