{"Job Title": "Lead Software Developer ", "Company": "Siemens Limited", "Experience": "4 - 9 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   What part will you play   As a Technical Lead you will be accountable for leading the software development team, ensure the product releases and head the engineering activities with teams and implement standard methodologies to streamline the activities. You will grow in a design culture that encourages all ideas and which channels the collective talent of our amazing team to build ambitious and elegant solutions that solves our customers problems in a profound manner.    Change the future with us     You will develop back-end features using Python, Django front-end using React/JavaScript   You will design and architect technical solutions for large scale customer implementations   You will build products that can scale with huge amounts of data and varied customer requirements   Your ability to work independently accountable for your own actions and able to act with both urgency and integrity and refactoring existing codebase   You will create pragmatic OO design and clean code for its long-term cost benefits, and testing   You will collaborate with the team to ensure product quality, requirements and timelines   Capturing yourself to the overall software development life-cycle including requirements assembling/analysis, design, development, release/version control, testing, deployment and support !     We don t need superheroes, just super minds     You are a BE/B.Tech, ME/M.Tech with at least 4 years of experience developing and deploying web sites, applications and APIs   You also have similar experience with Django/Python with 2 years working with rich Javascript frameworks/libs - AngularJS, React, JQuery, Bootstrap and the like.   You have good database experience including MySQL and PostgreSQL (queries, design);   You have understanding of software standard methodologies, data structures, algorithms, databases and networks   ", "Role": "Team Lead/Technical Lead,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial", "PG": "M.Tech in Electronics/Telecommunication", "Doctorate": "None", "Key Skills": ["Supply chain management", "jQuery", "Front end", "Version control", "Postgresql", "MySQL", "Javascript", "Data structures", "HR", "Python"]}