{"Job Title": "Software Development Engineer I - Frontend (ReactJS)", "Company": "Attentive AI Solutions Private Limited", "Experience": "2 - 3 years", "Salary": "Not Disclosed", "Location": "Noida", "Job Description": " Job DescriptionCompany  Attentive AIDepartment - TechnologyPosition Description:We are looking for a Software Development Engineer - Frontend (ReactJs) to join our engineering team and help us develop and maintain various software products.As a Front-end developer at Attentive, you will help us in the development of new smart web applications and you will be involved in the development of our internal ML/AI and processing pipelines. We offer an inspiring environment full of young people with a lot of ambition. You get freedom to implement your own designs, solutions and creativityKey Responsibilities: Write effective, scalable and reusable code.Develop and maintain user facing elements integrated securely with internal backendParticipate in system design and architecture discussionsIntegrate user-facing elements into applications Test and debug programs Improve functionality of existing systems Implement security and data protection solutions Assess and prioritize feature requests Coordinate with internal teams to understand      user requirements and provide technical solutions.Required Skills & Experience: In depth knowledge of how the internet, website and browsers work (working knowledge of server technologies, HTTP protocol, CDN and caching concepts)2-5 years of work experience as a Software Engineer (Experience in frontend technologies preferred)Proficiency with HTML, CSS, JavaScript and jQuery.Experience with ReactJS (class and hooks) and relevant libraries such as mobx, axios etc.Understanding of SEO principlesUnderstanding of cross-browser compatibility issues and workable solutionsExperience with designing interfaces for different screen sizes (mobile, tablet, laptop)Team spirit and good problem-solving skills Understanding of cloud services like AWS and GCPTesting frameworks such as Jest, Enzyme, MochaExcellent written and verbal communication skillsExperience working in both start-up and enterprise environmentsExperience in browser automation technologies like Selenium web driverUnderstanding of Geographic Information Systems and related terminologies is preferred Understanding of front-end mapping libraries like OpenLayers, Leaflet etc. Understanding of webpack config, web page speed and size optimizationUnderstanding of Docker build system and deployment configurations.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "Doctorate": "None", "Key Skills": ["CSS", "Front End", "Openlayers", "Web Technologies", "Javascript", "HTML", "JQuery", "Mobx", "Webpack", "Jest"]}