{"Job Title": "20th March'21 Virtual Drive For Software Developers", "Company": "Daffodil Software Private Limited", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": "About Unthinkable:With Unthinkable, we help our customers to disrupt faster by decreasing time-to-market via reducingthe time gap between an idea and working software. Combining our experience of building 100+software solutions and developing products using decoupled software components to reduce redundantcode, we are in a unique position to take this unconventional approach to software development.Unthinkable Solutions is a parallel business unit of Daffodil Software.About Daffodil Software:Daffodil Software is software services company, that is a technology partner to 80+ dynamicorganizations across the globe. Daffodils customers range from early stage start-ups to Global Fortune500 enterprises. Daffodils specialty lies in our ability to look beyond technologies and deliver innovativeand progressive solutions.Winner of Deloitte Tech Fast 50 India, Daffodil experiments with latest technologies, design approachesand development methodologies to build cutting edge software solutions. They are known for investingin futuristic technologies, AI and Blockchain are no exception.Daffodil is also working on some very exciting ideas that can change the world, and is in process of settingup them as startups within Daffodil.Our Goal:We, at Daffodil, value innovation, ownership, hard-work and smart risk-taking attitude with continuousdesire to learn and improve oneself every day.Functional Area: Software DeveloperLocation: Gurgaon Experience: 2-4 yearsJob Description:Key Responsibility:1. Developed 5-6 WordPress projects2. MySQL3. REST API4. Good in jQuery5. Created WordPress Themes, involved in HTML & CSS creation6. Good Communication Skills7. Created custom plugins Good to have skill:1. MongoDB2. Database Tuning & optimization3. Any one MVC platformKindly register yourself: bit.ly/20thMarch21 ", "Role": "Other,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "Other,", "Employment Type": "Full Time, Permanent", "Role Category": "Other", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["CSS", "Wordpress", "HTML", "Software Development", "MySQL", "MongoDB", "MVC", "Rest Api", "JQuery", "Plugins"]}