{"Job Title": "Senior Software Developer", "Company": "AMCS Group", "Experience": "4 - 5 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "  Key Responsibilities     Developing, enhancing and maintaining our environmental software products in accordance with agreed requirements and designs, including:    Member of a team of software developers using Microsoft Visual Studio 2005, 2008, 2010 and 2017(C#, ASP.NET) and Microsoft SQL Server (2005 and 2008 and 2017 versions).    Contributing to the specification, development and test of software solutions to defined standards.    Delivery of software development projects both as stand-alone and as a team member of internal agile and outsourced development teams.    Development of embedded applications (Windows XP Embedded) that utilise GIS related plug-ins (including vehicle navigation and route optimisation).    Develop and deliver project updates to senior management.       Skills and Competencies:     Strong technical knowledge of Web Technologies such as .NET Core, Web API, C#, JavaScript, jQuery and CSS3    Good understanding of Design Patterns and Principles.    Strong experience in MVC and Entity Framework.    Fluent in MS SQL Server, database and programming.    Good knowledge of Object-Oriented Design and Development.    Experience with web services, REST API.    Familiar with security mechanisms including web and web service security and their implementations.    Experience in writing Unit test cases       Qualifications and personal attributes     Degree in Computer Science, Software Development or equivalent.    4-5 years experience in an Information Technology environment, specializing in Software Development, would be a distinct advantage.    Experience developing applications in C#, ASP.NET or SQL Server essential.    Experience working with Angular is preferred    Experience working with a Mobile Development Framework such as Xamarin would also be an advantage    Excellent communication and personal skills, able to communicate clearly, effectively, and form effective working relationships with customers, colleagues, suppliers and third parties.    High levels of drive and energy.    Ability to work in a fast-paced, entrepreneurial environment.    Enthusiasm and general interest in Software Development.    A passion for user interface    Commitment to on-going personal development  ", "Role": "Software Developer,", "Industry Type": "Oil and Gas, Energy, Power, Infrastructure,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["GIS", "jQuery", "Javascript", "Agile", "Scrum", "Windows", "MVC", "Visual Studio", "Information technology", "SQL"]}