{"Job Title": "Software Developer", "Company": "MRR Soft", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Amla", "Job Description": "Responsibilities \n:\nAssist in the design and development of Software Solutions using various Java Script & Dot net frameworks.  \n\nUtilize understanding of the full software life cycle and strong knowledge in Design Methodology UML.  \n\nPerform coding to written technical specifications.  \n\nInvestigate,  analyze and document reported defects.  \n\nPerform maintenance programming and correction of identified defects.  \n\nCreate,  document,  and implement unit test plans,  scripts,  and test harnesses.  \n\nAssist in the support and growth of development platform(s).  \n\nSupport business development activities.  Must understand the MRR Soft quality process and apply the same while executing tasks.  \n\nDeveloping applications based upon customer requirements and industry standards.  \n\nInteracting with test/ quality assurance engineers to define test plans,  identify and reproduce defects and provide fixes as needed;  \n\nEffectively communicate and present all the output to project team.  \n\nInteract with clients to identify their needs and define projects objectives.  \n\nResearch standard extensions/ solutions for common business applications.  \n\nPerform usability testing and assessment for projects,  as well as ad hoc usability evaluations of varying levels of complexity.  \n\nEnsuring customer satisfaction as high- priority,  participating in client calls for status updates and updating the same to the junior team members for rapid delivery.  Nice- to- have \n\nWorking knowledge of mobile development activity.  \n\nWorking knowledge of web hosting solution on IIS7.  \n\nExperience working with an offshore onsite development process \n\nQualifications Role Category: Programming & Design\n\nRole: Software Developer\n\nKeyskills: \n\nMVC Frame,  WorkAngular,  JSbackbone JS,  HTML,  JqueryCss,  CodingWeb,  Services,  REST,  object oriented,  Java Script,  Ecommerce,  JSON ajax,  javascript,  fabric JS,  Three JS\n\nEducation: \n\nUG:B. Tech/ B. E.  -  Any Specialization,  Computers,  Any Graduate -  Any Specialization,  B. Sc -  Any Specialization\n\nPG:M. Tech -  Computers,  MCA -  Computers,  M. Sc -  Computers\n\nDoctorate:Any Doctorate -  Any Specialization,  Doctorate Not Required\n\n", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - eCommerce, Internet Technologies,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["UML", "Coding", "Web hosting", "HTML", "JSON", "MVC", "Usability testing", "Software solutions", "Analytics", "Ajax"]}