{"Job Title": "Senior Software Developer - Product Modeling", "Company": "Siemens Limited", "Experience": "5 - 7 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "   Design and develop CPQ (Configure Price Quote)   You will be responsible for designing developing Product Model/Product Configuration for CPQ Solutions using platforms like Tacton / PROS,   Interact with the business teams to understand the requirements and help to realize the requirements efficiently.    Should also contribute as coach / mentor for co-team members for SAAS based platforms (Tacton / PROS)      Use your skills to move the world forward!      We need a graduate - B.E/B. Tech/MCA/ME/M. Tech/MSc with Overall 5 to 7 years of hands-on experience in Product Configuration / Product Modeling in CPQ Environment.   Should have sound knowledge in OOPS concepts, JavaScript or similar technology   Hands on experience in requirement analysis, concept development, solution implementation, testing delivery   Ability to handle the Quality attributes (NFR) in design/implementation, Ability to understand XML/JSON   Should have experience in Product modeling / product configuration (Tacton) Knowledge on Constraint based programming (or) Rules development   Knowledge on API integration Performance Testing   Understanding of industry standard methodologies in QA Should have knowledge on manual / automation testing   Should have Adequate knowledge on Electrical products   Expert Skill Level in Tacton CPQ Platform, Tacton - Application Configuration, JavaScript / Trampoline, GIT / Version control and JIRA / Confluence   Exposure on Tacton / PROS Certification desired, but not mandatory, basic knowledge of Cloud Infrastructure, CI CD (DevOps) and Agile Methodologies   ", "Role": "Software Developer,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization, B.Tech/B.E. in Production/Industrial", "PG": "MS/M.Sc(Science) in Chemistry, MCA in Computers", "Doctorate": "None", "Key Skills": ["Version control", "GIT", "XML", "Concept development", "Javascript", "Performance testing", "Agile", "Manager Technology", "JSON", "JIRA"]}