{"Job Title": "Senior Software Developer - Interface-Integration", "Company": "Siemens Limited", "Experience": "5 - 7 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "    Design and develop CPQ (Configure Price Quote)   You will be responsible for designing developing CPQ Solutions using platforms like Tacton / PROS and by integrating / interfacing with other siemens systems / subsystems.   Interact with the business teams to understand the requirements and help to realize the requirements efficiently.      Use your skills to move the world forward!      We need a graduate - B.E/B. Tech/MCA/ME/M. Tech/MSc with overall 5-7 Years in design and development and exposure working with multi-site global teams.   Experience in Java/J2EE, Servlets, JDBC, Hibernate, Spring, Microservices, Spring Boot, AOP, Spring Security, JPA, Rest services, Tomcat, and Web logic, Python, AWS Lambda, R, Hadoop, Spark, Star UML   Basic and intermediate skill level in TACTON (CPQ Platform), UI (Java Script, Angular/React) HTML5, CSS.   Advanced skills in Object Oriented thinking, Design principles and patterns, Analytical and Problem-Solving Skills, REST services and unit testing concepts, Software development processes / methodologies and database (MSSQL / MYSQL)   Knowledge Graph/Graph Models / RDF (Resource Description Framework), Graph DB (Amazon Neptune, Blazegraph, Neo4j)   Exposure on full stack development and Git /Bit-bucket   Knowledge of Continuous Integration Continuous Deployment    Conceptualization ability, Flair to learn new technologies   Self-direction, Flexible, Decisive Action-Oriented   Curious to learn and integrate new technologies    ", "Role": "Software Developer,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial, Any Graduate in Any Specialization", "PG": "MCA in Computers, MS/M.Sc(Science) in Chemistry", "Doctorate": "None", "Key Skills": ["Hibernate", "Tomcat", "GIT", "UML", "Analytical", "MySQL", "JDBC", "JPA", "Unit testing", "Python"]}