{"Job Title": "Senior Software Engineer  .Net Full Stack Developer", "Company": "Trimble Information Technologies India Pvt Ltd", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "    Job Purpose:        As a Senior Software Engineer, you will be working with a strong team of motivated engineers with focus on building and delivering next generation web applications. You will interact with product owners and UX designers and convert their ideas into software solutions. You will mentor other talented engineers and encourage innovation in the team.      You will also guide the team on web development best practices and set examples by using them in the solutions you build. This position requires in-depth knowledge of design and development of web user interfaces using Angular , Html and Css. You should have experience with agile methodologies, working experience building scalable and robust user interfaces. Experience in Angular   .js is a must.        Main Responsibilities Skill Set        4 to 6 years of professional experience in frontend, web application development using Angular js       Bachelors degree in Engineering (Preferably in Computer Science)       Experience developing rich web applications and writing cross-browser compatible code with strong proficiency in HTML, JavaScript and CSS        Experience with Responsive web design and CSS frameworks like Bootstrap etc.       Experience with CSS preprocessors (LESS, SASS)       Working experience with state management data query libraries like Redux, GraphQL, etc       Strong expertise with Angular stack       Experience with common front-end development tools such as Babel, NPM, Yarn, Gulp, Webpack, Parcel.js, etc. are additional       Familiarity with usability and accessibility best practices       Familiarity with newer specifications of ECMAScript       Knowledge of testing frameworks like Jasmine, Jest, etc.       Microsoft Web API 2 , .Net core , C# experience is nice to have       Strong experience working with Restful APIs is an added advantage        Experience with Continuous   Integrations/Continuous   Deployment and tools Infrastructure such as Jenkins, JIRA, VSTS etc.       Familiar with source control management using Git and Bitbucket             Key Result Area        Timely delivery of all work products that meet or exceed quality norms.       High and Low level designs.       Coverage of test cases and test runs       Work breakdown at the module level.       Effective team management.          Qualifications Experience        Graduated from a premier institute.       B.E / B.Tech or M.E / M.Tech / M.S. in Computer Science Engineering or an equivalent degree with a good JEE / AIEEE / GATE score.       Should have scored minimum 90% marks since 10th Standard with consistent academic records.       Good score in any of the national level Olympiads or talent search examinations will be a value addition.       Paper presentation in a national level forum, contribution to open source projects, contribution to standards bodies will be a value addition.       Working experience in a tier-1 organization for a period of 4 to 6 years.       Agile / Scrum certification.          Supervisory Responsibility        Mentor a team of 1 to 2 SEs.          Reporting To        Technical Manager / Technical Leader/ Software Architect or above.         Education       Must be a graduate from a tier-1 / tier-2 ranked institute studying Computer Science Engineering with a strong academic record.       10th Grade: State Boards 90%. Central or International Boards: 80%       12th Grade: State Boards 90%. Central or International Boards: 80%       Undergraduate: GPA 8.0 ( Central institutes ) 8.5 ( State institutes ) - In a scale of 10       Graduate: GPA 8.0 - In a scale of 10       A score of 7.0 GPA in a scale of 10 is acceptable if the candidate is from a tier-1 institute     ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial, Any Graduate in Any Specialization", "PG": "M.Tech in Electronics/Telecommunication, Medical-MS/MD in psychology", "Doctorate": "None", "Key Skills": ["Computer science", "Team management", "Coding", "Talent acquisition", "Web development", "Web designing", "Test cases", "microsoft", "Open source", "Logistics"]}