{"Job Title": "Senior Software Developer", "Company": "Akshay Software Technologies Ltd", "Experience": "6 - 7 years", "Salary": "₹ 14,00,000 - 15,00,000 P.A. ", "Location": "Pune", "Job Description": "Greetings!!!We have an urgent requirement for Senior Software Developer. Job Description: Requirements:Minimum of 6+ years of software development experience.Minimum of 4+ years of experience as a Senior Software Engineer.Expertise in one or more of the following programming languages: Ruby, Go,Java,Python.Experience with high-throughput message queueing systems (Kafka/Resque/etc).Experience designing, estimating, and implementing complex systems.Proven understanding of software development best practices and design patterns.Experience working in an agile environment that follows Scrum or other agile methodologies.Demonstrated knowledge of security/access control, scalability, high availability, and concurrency.Experience working with SQL and NoSQL databases, including MySQL, Redis, MongoDB.Self-motivated, go-getter, passion for learning, strong communication skills.Bachelor's degree in Computer Science (or equivalent), or equivalent experience. Core Responsibilities:Being a hands-on contributor is a key responsibility in this role.Design, develop, maintain, and scale Coupas platform systems and services.Participate in operational design and code review.Architect and develop one or more major areas of the Coupa platform.Find creative, elegant and maintainable solutions to complex problems.A good team player, works, and communicates well with others.Advocate best practices (unit/automation testing, code reviews, code quality, etc.)Continually look for opportunities to improve our platform, process and business.Contribute to the development and enhancements of our CI/CD pipeline infrastructure/tools.Note: Candidates with relevant experience only apply Contact on the below given details:Bhavana Thapa8828347802bhavana@akshay.com", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Java", "Software Development", "Python", "Go", "Redis", "resque", "SQL", "Agile Methodology", "NoSQL", "kafka", "MySQL", "CI/CD", "MongoDB"]}