{"Job Title": "Senior Software Developer - JAVA", "Company": "Angler Technologies India Private Limited", "Experience": "3 - 5 years", "Salary": "₹ 3,50,000 - 5,00,000 P.A. ", "Location": "Coimbatore", "Job Description": "We are looking for a Senior Software Engineers -JAVA  who is dedicated to his craft, writes code that can hit the ground  running. We need you to write robust and optimized Programming to a high  standard, in a timely and scalable way. You will be a part of a  creative team that is responsible for all aspects of the ongoing  software development from the initial specification, through to  developing, testing and launching. Candidates with 3 to 5  years of experience in  Java & Spring Boot Frameworks will be considered.What are we looking for?Dynamic Engineers / Graduates & Post Graduates with 3 to 5 years of experience in the IT development sectionExposure to Java8, AspectJ, Spring Boot Frameworks, Hibernate, Sockets, Maven, Grunt, Jasper Reports, Thyme Leaf, MySQL, Mongo DB, AngularJS, NodeJS, AWS & with good analytical skillsKnowledge on web services, Specific on Restful, Messaging experience (Rabbit MQ), Micro services and API based developmentGood technical knowledge & experienceExperience of the full software development lifecycle  from  business / systems analysis, thorough requirements gathering and  functional specification authoring to development.Responsibilities A clear understanding of customer-centered design and user experienceDevelop and write secured coding for given requirement with adherence to international coding standardsPractice self QA to develop quality application.Implement best practices, standards and procedures including quality and delivery methodologies.Perform a technical analysis of requirements & to prepare detailed technical designCommunicating with the client for requirement analysis / clarification", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - eCommerce, Internet Technologies,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Sc in Computers, B.Tech/B.E. in Electronics/Telecommunication, Computers", "PG": "MCA in Any Specialization, M.Tech in Any Specialization, MBA/PGDM in HR/Industrial Relations, Information Technology, MS/M.Sc(Science) in Electronics & Embedded Technology, Electronics, Data Informatics", "Doctorate": "None", "Key Skills": ["Java", "Hibernate", "Spring Boot", "Maven", "Angularjs", "Node.Js", "Jasper Reports", "Rabbitmq", "Jenkins", "GIT", "Docker", "MySQL", "MongoDB", "React.Js", "AWS", "Web Services", "Aspectj"]}