{"Job Title": "Software Development Engineer - Test - Automation Testing", "Company": "Fidelity IT Jobs", "Experience": "4 - 9 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Roles and ResponsibilitiesWe are a talent search agency based in Bangalore and we are currently hiring for one of our client's permanent opportunities for their SDET position for Bangalore location. You can find the detailed job description below. If the position suits well with your aspirations, please get back to me with a resume of yours for further processing. #SDET Engineer #Automation Developer #QA Automation LeadExp : 4 to 12 yrs Notice Period : up to 60 days (Buyout option is AVL)Location : HSR Layout, BangaloreMandatory Skills : Python,linux,unix,rest api, test framework, Python Automation, Custom Framework, Automation Framework, Database, API Automation, Test AutomationKey Requirements :- Bachelor's degree from a tier 1 or tier 2 institution with 4+ years- experience working in QA, developing automated tests for enterprise products or small products.- Core experience in Python to build frameworks.- Worked in core backend, having a Good understanding of databases in application system.- Proven coding skills in Python on Unix/Linux platforms.- Experience with REST or SOAP and a history of working with API based applications.- Experience writing or enhancing test harness/framework is desired.- Strong understanding of databases.Key Responsibilities:- Automate test plans for APIs, User Interface and Other software components in technology stack.- Use Python to build scalable automation use cases/tools.- Able to work independently and with the team to deliver test plans and test cases successfully.- Work consistently with a thorough, thoughtful, data-driven approach and incorporates best practices.- Write automated tests that are maintainable and reusable.- Constructively identify problems and propose solutions, taking on projects that identify and mitigate risk while measuring software quality.- Establish good working relationships with team members and peers working on related software.- Participation in design and code inspections.- Ability to analyze automation frameworks suitable for projects- Perform manual testing, the scope of which will encompass all functionalities of services as a prequel to automation.- Analyze test logs; create test reports, co-ordinate with stakeholders.", "Role": "Testing Engineer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - QA & Testing,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "BCA in Computers, B.Tech/B.E. in Any Specialization, B.Sc in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["SDET", "Automation Testing Tools", "Software Quality Assurance", "API Testing", "Automation Testing", "Testing", "Python"]}