{"Job Title": "Java Software Developer", "Company": "Actolap Solutions India Pvt Limited", "Experience": "1 - 2 years", "Salary": "₹ 4,00,000 - 5,50,000 P.A. ", "Location": "Noida( Sector-59 Noida )", "Job Description": "We are looking for Java Software Developer to join our team. The role requires developer to be a part of the core engineering team and focus on development of robust, scalable, extensible software applications.  If you are passionate about building highly scalable and reliable platforms, thrive in an innovative, cutting edge startup like environment, and consider yourself to be a strong developer, then we could very well be the perfect fit for you and your career.  Work and get exposure on varied technologies including Java, J2EE, NOSQL, MongoDB,  Spring Experience in design and engineering of web services and real time systems Responsible for coding, documenting and maintaining web applications in a fast paced project environment Understanding of enterprise Architecture and distributed processing platforms Experience working in a continuous delivery and integration environment Ability and competency to adjust technical development environments & tasking when required Work on evolution of requirements along with technology and product managers Innovate, research, propose and discuss design with your peers Requirements :-  1 to 2 years of work experience in Core Java and J2EE Must have good understanding and working exposure of  writing backend code. Excellent problem solving skills Ability to take ownership of Modules delivery and leading a team Technology Stack Must Have: Core Java, J2EE, SpringIf that sounds like fun to you and you have experience with some of the technologies below, we'd love to talk to you, so please apply.Interview Process -> Telephonic Discussion, Machine Test and F2F discussion.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization, Graduation Not Required", "PG": "Post Graduation Not Required, Any Postgraduate in Any Specialization", "Doctorate": "Any Doctorate in Any Specialization, Doctorate Not Required", "Key Skills": ["Rest", "Core Java", "NoSQL", "GIT", "Kafka", "J2Ee", "MongoDB", "API", "Spark", "Spring", "Web Services"]}