{"Job Title": "Software Development Engineer - Test - Security", "Company": "Career Infosystem", "Experience": "8 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": " Job Description :   - Acquire a complete understanding of technology and information systems of the respective portfolio   - Plan, research, identify security requirements from business requirements and help design robust security architectures for IT projects within the assigned DUPortfolio   - Perform risk analyses and security assessments   - Reviews security risks, functions and activities, and evaluates client relations in order to determine and recommend nature, scope, direction and thrust of proposed audits   - Research security standards, security systems and authentication protocols   - Implement secure development best practices in the DU and coordinate Vulnerability assessment, penetration testing, code review etc.   - Review test reports, identify ways to eliminate false positives and provide fix recommendation to the development team.   - Reviews internal controls throughout the company by evaluating the adequacy of system controls and recommends improvements.   - Liaise between offshore and onsite customer teams in getting the clarifications sorted out.   - Maintains continued education requirements, certifications and track progress.   Required Candidate profileSkill & Abilities Required : - Should have minimum 8 to 10 yrs of experience in in application security coding, design & architecture, penetration testing, vulnerability management, source code review, network scanning, eliminating false positives etc - Should be BE \\ B.Tech \\ MCA or equivalent . - Must have worked with security engineering tools like WebInspect, Fortify, Paros Proxy, webgoat, Nessus etc - Must have basic development knowledge in .Net Java C++ and should be able to read and understand the coding logic. - Must hold either of the Security Certification (CEH, CISSP, CISA etc) - Knowledge of OWASP tools and methodologies, SANS, MITRE procedures - Ability to coordinate and perform multiple tasksprojects simultaneously, balancing priorities and deliverables. - Should have knowledge of Secure SDLC implementation and have closely worked with Penetration testing team. - Should have very strong stakeholder management experience and should be able to work independently - Competent interpersonal skills, demonstrating the ability to lead projects and mentor others - Ability to evaluate business processes and IT technology, identify risks and evaluate controls. - Advanced oral and written communication skills, analytical skills - Ability to translate business needs and problems into viable and accepted solutions.", "Role": "System Security,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Network Administration, Security,", "Employment Type": "Full Time, Permanent", "Role Category": "Admin/Maintenance/Security/Datawarehousing", "UG": "B.Tech/B.E. in Any Specialization", "PG": "MCA in Computers", "Doctorate": "Doctorate Not Required, Any Doctorate in Any Specialization", "Key Skills": ["application security", "Nessus", "Fortify", "webgoat", "Security", "WebInspect", "Net Java C++", "Testing", "Paros Proxy"]}