{"Job Title": "Senior Software Developer II Java", "Company": "Josh Technology Group", "Experience": "4 - 7 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": "       Roles Responsibility:      Develop high-quality, maintainable, usable, and well-documented solutions to complex product functionality; ensures that all the modules are being implemented as per the best practices, extensible scalable design, and without any defects.   Identify the technical gaps in product requirements and lead a constructive discussion with all stakeholders to resolve the same.   Identify more optimal efficient scalable maintainable ways of implementing product modules discusses the same with product team to get them incorporated.   Troubleshoot applications and do performance analysis of the application.   Participate contribute in project level architecture design discussions, own project level design (post finalization of architecture technologies) and end to end implementation including testing performance deployments.   Work closely with other Developers, Leads Business Stakeholders to rapidly build, iterate, test and deploy new features and products and maintain a high-quality robust codebase.   Mentor team members, and help to build a high performance fast-growing team.   Lead and organize meetings that include all stakeholders at the project level, manage expectations clearly communicate overall project goals and success metrics.   Lead implementations with a complete sense of ownership and accountability.   Identify various bottlenecks in the project resolves the same as appropriate via automation, process changes, introducing best practices etc.   Effectively communicate one-on-one with on-shore off-shore product teams developers; gather and clarify requirements from technical folks product managers business teams.   Proactively assist and serve as a role model for the team members to follow the team software development process; consistently innovate the team processes to improve team productivity and quality.                          ", "Role": "Software Developer,", "Industry Type": "Other,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial", "PG": "MCA in Computers", "Doctorate": "None", "Key Skills": ["Maven", "Hibernate", "Automation", "Tomcat", "Linux", "Postgresql", "MySQL", "JDBC", "Unit testing", "SDLC"]}