{"Job Title": "Senior Java Software Developer", "Company": "System Soft Technologies", "Experience": "3 - 5 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad, telangana", "Job Description": "                     Job Summary:                Senior Full Stack Developer need to 3- 5 Years of experience. Design and develop web application using Service Oriented Architecture (SOA). Design Principles to ensure higher availability,  better scalable y and high performance. Participate in architectural and design sessions. Analyze business requirements and develop technical design document. Apply best practices and new technologies,  wherever applicable. Design and develop new components and software products or enhancements to existing software product. Troubleshoot production issues related to existing software products. Provide technical training to team members on Frameworks and technologies. Guide and provide technical support to team members.                Responsibilities:                Strong experience in Java 8 or above,  Angular 8 or above,  Spring Framework,  Hibernate and Spring Data JPA.                Good Understanding of Micro Services Architecture and Spring Boot.               Experience in design and development involving Java EE (JPA,  JSP etc),  CSS,  HTML 5,  jQuery,  JavaScript,  Angular JS and AJAX               Strong Experience in designing and implementing Frameworks like Struts or Spring               Experience in implementing UI Technologies like Bootstrap and Angular               Experience in implementing persistence layers using Hibernate               Demonstrated experience in Continuous Integration and Continuous Deployment tools using Jenkins and Maven               Strong webservice experience using REST and SOAP               Extensive experience in Core Java,  Multi- threading,  Collections,  and any Web servers               Good understanding of Database design and modeling; Writing complex queries and Pl- SOL               Good experience in working with relational databases like MY- SOL,  MS- SQL and Oracle Good experience in NoSQL,  MongoDB               Experience in Performance Load optimization and Web application testing                Qualifications:                   (UG -  B.T ech/B.E.-  Any Specialization,  Computers) OR (PG-  MTech -  Any Specialization,  Computers,           ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Hibernate", "Core Java", "MS SQL", "jQuery", "SOA", "JSP", "Struts", "Oracle", "Technical support", "Ajax"]}