{"Job Title": "Software Development Engineer (Backend)- Immediate Joiners Required", "Company": "Headsup Corporation Pvt. Ltd. ", "Experience": "3 - 7 years", "Salary": "₹ 25,00,000 - 30,00,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": "The most user-friendly digital primary care platform in India, focused on driving bestin- world health outcomes for users and their families. Client's vision of using data science, personalization and a refreshing user experience to empower users to take charge of their health has been validated by a rapidly growing user base (2 million+ users across 450+ cities) with best-in-world user satisfaction and retention rates. The team comprises of alumni from innovative companies and premier educational institutions (IIT/IIIT/NIT, ISB etc.). The founders are INSEAD and Stanford GSB alumni with a track record of building and growing technology businesses. They are backed by premier venture investors and count on global industry leaders as advisors. More about the role : • Design, build, and maintain efficient, reusable, and reliable code. • Take complete end to end ownership of your features including scoping, planning, design,    implementation, testing, delivery and maintenance. • Conduct design and code reviews for other engineers, including feedback on architecture and   design issues. • Continuous focus and contribution in the areas of performance, availability & scalability,   reliability, and maintainability of the product. On your first day, we'd love for you to have experience with: • Strong understanding of one or more of the following languages: Java and Python or Ruby on    Rails. • Experience designing and building production-level web applications, especially for delivery as   Saas. • Experience crafting and implementing highly scalable and performant RESTful micro-services. • Experience solutioning from requirements and designing extensible database models, in SQL   and/or NoSQL. • Fluency in any one database technology (e.g. RDBMS like MySql or Postgres and/or NoSQL like    MongoDB or Cassandra) • Experience working with cloud service providers such as AWS or Azure.  What we have to offer • Key product role at a start-up that is hitting inflection points in growth and adoption • Autonomy and mentorship • Working with smart colleagues to envision and build innovative technology products that solve     problems that matter • Be a key part of building a fun, safe and great place to work in • All the usual benefits + health and wellness ", "Role": "Software Developer,", "Industry Type": "Internet, Ecommerce,", "Functional Area": "IT Software - eCommerce, Internet Technologies,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "Doctorate": "None", "Key Skills": ["Java", "Ruby", "Python", "NoSQL", "Scalability", "MySQL", "Cassandra", "MongoDB", "Node.Js", "Postgres", "SQL"]}