{"Job Title": "Software Engineer - Java Development", "Company": "S.A.W IT Services Pvt Ltd", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "   Job Description :   Responsibilities :-   - In this position you will Work on the expansion of our Core features and systems   - Re-factor code with a very keen eye on performance improvement   - Work on connections to external systems, e.g. banking systems, payment systems, reporting systems Help finding and resolving acute problems (incidents)   - Ensure that best practices are adhered to   - Design systems to work in a microservice-based architecture   What we value in our engineers :   We are looking for collaborative team players with passion for coding and with a flexible mindset. People that are openminded about cultures, ideas and solutions are the best match for our company. If you are inquisitive, you're not afraid to break silences, ask a lot of questions, voice your concerns and seek for mentorship, then we want to work with you. If you strive to go out of your comfort zone to work with innovative technologies, coding languages and environments, then we would be honored to be a part of your professional journey.    Required Candidate profileAdditional Information : Requirements :- - At least 5 years of experience as a software engineer - Knowledge in Java7/8, Spring MVC/Boot, Jersey (REST-Webservices), Containerization - You have working experience with Java but your mind is not bound to the \"Java Box\" and you dont consider yourself a specialist - You have an interest and a keen eye for increasing the performance and efficiency of a mature platform - Understanding of Continuous Integration, Continuous Deployment and Containerization - Experience developing in an Azure cloud environment Skill Set : Java 7/8SpringBootRest-webservices Required Qualification/Education : Any Graduate", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required, Any Doctorate in Any Specialization", "Key Skills": ["Java", "Azure", "Spring MVC", "System Design", "Continuous Deployment", "Microservices Architecture", "Continuous Integration", "Spring Boot", "Jersey", "Rest Webservices"]}