{"Job Title": "Software Engineer (UI Developer, ReactJS)", "Company": "Amdocs Development Center India Pvt. Ltd.", "Experience": "1 - 3 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "  You will design, develop, modify, debug and/or maintain software code according to functional, non-functional and technical design specifications.  You will follow Amdocs software engineering standards, applicable software development methodology and release processes, to ensure code is maintainable, scalable, and supportable, and demo the software products to stakeholders.  You will investigate issues by reviewing/debugging code, provide fixes and workarounds, and review changes for operability to maintain existing software solutions.  You will work within a team, collaborate and add value through participation in peer code reviews, provide comments and suggestions, and work with cross functional teams to achieve goals.  You will assume technical accountability for your specific work products within an application and provide technical support during solution design for new requirements.  You will be encouraged to actively look for innovation, continuous improvement, and efficiency in all assigned tasks.        Bachelors degree in Science/IT/Computer Science or equivalent   1.5 to 3 years demonstrable experience with the HTML5, CSS, Java Script, React/Redux, nodejs Advance JavaScript, Typescript, Angular 2 .   Experience of unit/integration/e2e testing with frontend projects.   Exposure to REST paradigms and Domain/Resource modelling concepts and its integration with UI.   Understanding of writing automated unit test cases using Mockito, Enzyme or any other UI testing suite   Working knowledge of build tools/Jenkins, and source control (git/perforce)         Why you will love this job:     You will be challenged to design and develop new software applications.  You will have the opportunity to work in a growing organization, with ever growing opportunities for personal growth.      ", "Role": "Software Developer,", "Industry Type": "Telcom, ISP,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "GIT", "UI testing", "Javascript", "Test cases", "microsoft", "Continuous improvement", "Application software", "Amdocs", "Technical support"]}