{"Job Title": "Embedded Software Developer", "Company": "Cyient Limited", "Experience": "6 - 8 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "  Position Responsibilities:       The Software Engineer is responsible for contributing to the development of cutting edge products used in the medical field. Specific tasks include:   Designing, developing, testing and documenting software components and applications.   Assisting with requirements gathering, estimating and planning efforts.   Interfacing with mechanical, electrical, systems, and test engineers.   Troubleshooting and debugging, maintaining, and supporting existing software products.   Supporting labs and surgical evaluations of products.   Representing the company at industry trade shows and customer sites.   Participating in ongoing professional development activities.    Follow Medtronic Navigation product development standards and practices.   Willingness and ability to assume increased responsibility.   Working effectively, independently and in a team environment.   Occasional domestic and international travel may be required.   All activities must be performed in compliance with the Quality System.   Performs duties in compliance with environmental, health and safety related site rules, policies or governmental regulations.   All other duties as assigned.       SPECIALIZED KNOWLEDGE REQUIRED     Proficient programming in C     Unix/Linux experience     Working knowledge of software design, development, debug and test practices.     Oral and written communication skills.     Ability to work in a team environment.       PREFERRED QUALIFICATIONS      Scripting language (Python, Perl, Shell) experience.     Strong knowledge of software design including OOA/OOD and design patterns.     Software development experience in the medical industry or other regulated industry.     Experience developing GUI applications.     Experience building medium to large size C++ applications/libraries.     Strong knowledge of modern, iterative software design processes and development practices including agile and test-driven development.     Project management skills, including planning, estimation and requirements management.     Expertise in one or more of the following: STL, Qt, Boost, XML, XML schemas, OpenGL, Direct3D.           Skills Experience     C , Linux, Python, Shell Scripting, Unix   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Embedded, EDA, VLSI, ASIC, Chip Design,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Unix", "C++", "Linux", "XML", "Shell scripting", "Debugging", "Agile", "Perl", "Troubleshooting", "Python"]}