{"Job Title": "Senior Software Developer", "Company": "Aussizz India Private Limited ", "Experience": "2 - 4 years", "Salary": "₹ 1,50,000 - 4,00,000 P.A. ", "Location": "Gandhinagar, Ahmedabad", "Job Description": " Position objective: The objective of Sr. Software Developer is to meet the requirement with technical skills of Angular JS and ASP .NET to develop the product to its highest level of expertise and help align the company productsRoles/responsibilities: - Integration of user-facing elements developed by front-end developers with server side logic- Writing reusable, testable, and efficient code- Design and implementation of low-latency, high-availability, and performance applications- Implementation of security and data protection- Integration of data storage solutions (may include databases, key-value stores, blob stores, etc.). - Responsible to complete tasks with in timeline- Follow the technologies and coding standards- Updated with latest technologies features- Follow the project structure and architectureKey Behavioral Competencies:Problem Solver & Critical Thinking: Blessed with the critical thinking which is a important component of visual thinking that gives the ability to solve problems quickly and effectivelyListening & Communication Skills- The ability to communicate effectively and understand the requirement for the product. Strong Logical Approach: The ability to think logically and understand the given requirement to meet the final goal of the product.Good Team Member:Work with different teams to complete the tasks with quality and performance, also supportive and collaborative.Qualifications:B.E/M.C.A/Msc. IT or Bsc./BCA  in Computer Science, Engineering or a related fieldExperience Required: 2 to 4 yearSkill-.Net Framework,ASP.NET 4.0/4.5 with C#, C#, Angular.js, ASP.Net MVC, Hands-on experience and knowledge on HTML, CSS, JavaScript, JQuery, AJAX and Bootstrap -Experience of Web API with Authentication & Authorization, Restful services.-Strong concepts of OOPs.-Candidate should have worked on latest SQL Server 2008 /2012 or Latest, functions, stored procedures & query optimization and NoSQL databases-Knowledge of scrapping data and posting data with selenium or other technology. - Excellent troubleshooting and communication skills and willing to learn new technologies.- Should have good experience in application of standard software development principles.-Ability to work independently and multi-task effectively", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "Doctorate": "None", "Key Skills": ["Angular Js 4.0/4.5", "MVC", "ASP.Net MVC"]}