{"Job Title": "Software Developer(Full stack-MERN)", "Company": "App Knit", "Experience": "1 - 2 years", "Salary": "Not Disclosed", "Location": "Chandigarh", "Job Description": "App Knit - A Mobile Application Development Company based in Chandigarh is seeking a team player for the position of Software Developer(Full Stack-MERN) .App Knit is the best App Design and Development Company that focuses on building quality apps for clients from across the globe. Our team of 18 people has been working for the last 3 years to figure out how to make amazing apps for clients with the best design patterns and the latest coding structures. Now, we envision growing the company to 40 people in the next 2 years. This role is perfectly suited for people that love to learn and grow because it requires you to continuously update your skill set and technical abilities.Responsibilities in detail:Understand the requirement of the clients in detailDetermine operational feasibility by evaluating requirementsDevelop Database schema for mongoDB Code Backend Logic using Node Js, Develop APIs using Express JsDevelop Web Front end using react JsWork on problems with the Tech-Leads Work with members in cross functional teams to deliver appsSolve Bugs in backend and APIs when they come up Do R&D on Technology Problems when neededPerform user story review from technical standard pointWork collaboratively with others to achieve goalsRequired Candidate Profile:Experience of working effectively as part of a team.Decent written and verbal communication skills.0-2 years of experience in MERN StackWorking knowledge of MongoDB, Express.js, React, and Node.js.Experience in API design and development.Familiarity with databases.Educational Qualification: Bachelors DegreeExperience: 1- 2 years Future Prospects in the Company: This job is strictly for Software Developer(MERN). As a Software Developer in our company you will be responsible for building backend or front end applications end to end. So, you will have a tremendous amount of exposure and learning. If you have the potential and the hunger to grow this is the job for you.Also, as a young and fast growing company we create new opportunities for our people and help them grow their careers.Looking forward to work with passionate developers. ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Mobile,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Node.Js", "MongoDB", "Express.Js", "Mern Stack", "Software Development", "Express", "Front End", "Design Patterns", "Web Technologies", "Javascript"]}