{"Job Title": "Embedded Software Developer", "Company": "Cyient Limited", "Experience": "4 - 7 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "  Minimum Qualifications        B.E or B.Tech in Computer Sciences, Electronics or Electrical Engineer.  .   4+ years of experience in software design and development is required.   Expertise in C/C++ required in an Embedded Linux, RTOS development environment.   Experience in embedded Linux and real-time applications required   Knowledge of OOA&D and familiarity with UML is strongly desired.   Experience in hardware/software interfacing and design issues required.   Superior written and verbal communication skills required.   Desired experience with Qt, SQLite, Linux Yocto, Security   Strong interpersonal, presentation, and organizational skills   Participate in System design, coordination with teams and internal product management   Working knowledge of networking protocols.   Hands on experience in Embedded / Firmware Device Driver   Awareness on wireless technology is highly desirable   Experience in medical device SW development is added advantage   Ability to define, develop and implement automated unit / integration test solutions   Experience with change control, requirements management, source code control   Excellent verbal and written communication skills.    Excellent time management and professionalism    Perform Code Reviews, Static Code Analysis , Dynamic Code Analysis   Generate Software Metrics for Unit Testing, Integration Testing   Works collaboratively with software engineers, and SW QA.         Nice to Haves      M.S or M.Tech   with 2+ years of experience in software design and development is preferred.   Experience in real-time applications is preferred.   Medical instrument development experiences a plus.   Appreciation of discipline and work required to develop software in a regulated industry   Familiarity with FDA Quality System Regulations (820.30 design controls), European Regulatory Requirements (ISO 13485), and specifically IEC62304 is preferred.   Demonstrates knowledge and understanding of standards and guidance s relevant to the medical device industry       Skills & Experience   C (Programming Language), C Programming Language, Embedded Linux Development, Object-Oriented Analysis And Design (OOAD), QT, Real-Time Operating Systems (RTOS)", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Embedded, EDA, VLSI, ASIC, Chip Design,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "Medical-MS/MD in psychology, M.Tech in Electronics/Telecommunication", "Doctorate": "None", "Key Skills": ["Product management", "Wireless", "RTOS", "C++", "Medical devices", "Software design", "Embedded Linux", "System design", "Firmware", "Embedded software"]}