{"Job Title": "Software Engineer/Developer", "Company": "Alph@linx Technologies Ltd", "Experience": "2 - 7 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Job Description : Required for developing Enterprise- level Software applications. Key responsibilities include Server- side and client- side applprogramming,  designing User Interface and Database. Application programming using Java and advanced Java in J2EE framework. Unit- testing and Report- writing is required. Should be familiar with J2EE frameworks and knowledge in Java/ Struts/ Swings/ Eclipse/ Oracle AS. Familiarity with OOAD and Software Life- cycle Development will be required. Job involves some travel to customer locations within India.\n\nCandidate Profile : Graduate in Engineering /  Technology (B.E/ B.Tech. in CSE/ IT) or Post- graduate in Computer Applications (M.C.A) from reputed universities with minimum 65% of marks in all qualifying exams. Sound knowledge in analysis and design (OOAD,  UML) and skills in Application programming (Java,  JSP,  Servletts,  JavaScript,  EJB,  HTML,  XML,  JDBC,  PL/ SQL) with knowledge in RDBMS like Oracle 9i. Exposure to Linux is preferred. Good communication skills with an attitude for learning advanced technologies. Should possess good communications skills in English and strong aptitude for team- work and team- leading.\n\nLocation : Bangalore with frequent travel to customer locations across India.\n\nExperience : Minimum 2+ years experience in above technologies and ERP functional domain.\n\nTrainee position : 0- 1 year experience.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["development", "erp", "oracle", "rdbms", "software", "level", "JSP", "OOAD", "testing", "developing", "J2Ee", "HTML", "java", "Linux", "application", "UML", "XML", "design", "Javascript", "JDBC", "EJB", "programming", "applications"]}