{"Job Title": "Software Developer", "Company": "Quarec Resources Pvt.Ltd", "Experience": "1 - 5 years", "Salary": "Not Disclosed", "Location": "Ahmedabad", "Job Description": "  Job Description   We are looking our for a .Net Engineer who is:    Enthusiastic about developing the best software available and providing the ultimate customer experience.     Interested in staying current by applying new technologies.     Able to work in a collaborative environment with a willingness to share your ideas.     Able to work independently on modules and complete tasks with high quality, but unafraid to seek out suggestions from other team members.   Job Summary   Skills & Requirements  Strong understanding of OOPs fundamentals. (Must)  Hands on experience with any server-side web frameworks: ASP.NET, ASP.NET Core, Web API.  Experience with web technologies such as HTML5, CSS3, Javascript/Typescript.  Experience with test-driven development, continuous integration.  React/AngularJS, REST API, MS SQL would be an asset.  Experience with Git or similar source-control.  For Trainees/Freshers except first skill, rest are optional and will be trained.  Responsibility & Duties   Responsibilities and Duties:  Development: Work alongside product architects and senior developers to build (design, develop,  test) new features for Vital Objects. Deliver thoroughly tested and functional code.  Design: Working with team members, understand business requirements and participate in  software design.  Research: Work with development team in the implementation of new technologies and  components. Find new solutions to help solve problems new and old.  Debugging: Work on production issues as required.  Provide accurate estimates of work effort and be accountable to those estimates. ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["continuous integration", "MS SQL", "Software design", "GIT", "Debugging", "Javascript", "test driven development", "Customer experience", "ASP.Net MVC", "CSS3"]}