{"Job Title": "Senior Software Developer - I - Ruby on Rails", "Company": "Josh Technology Group", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": " Roles and Responsibilities    Combine excellent abstract reasoning ability to document, architect, develop and test software with the commitment to excellence/defect free before being deployed.   Write and implement low latency applications software solutions that integrate different systems.   Work closely with mentors, team members, team leads, program managers and stakeholders to investigate, fix, optimize, test and deploy high quality solutions.   Drive the technical design, implementation and maintenance of larger tech initiatives geared toward improving and scaling of products.   Accurately schedule and track progress of self team members. Create end to end WBS estimates for modules being implemented.   Participate in planning recognizing inconsistencies (e.g., scope, resources, feasibility, usability, customer value, etc.) in product requirements and alert the Project Mentor. Handle independently or assist the Mentor in building, testing, and documenting product releases.   Support the team in deploying product functionality assist the TLs in troubleshooting in production environment.   Rapidly incorporate new technologies as required deliver successfully by self.   Proactively promote Tech Culture by writing blogs, making presentations which will help you learn grow.   Effectively communicate one-on-one with on-shore / off-shore product teams / developers; gather and clarify requirements from technical folks / product managers / business teams.   Proactively assist and serve as a role model for the team members to follow the team software development process; consistently innovate the team processes to improve team productivity and quality.     Strong Analytical, Problem Solving Skills and participates in all activities with urgency, a results orientation, and a strong work ethic.   Must have technical knowledge of Ruby On Rails.    Knowledge of Angular or React would be an added advantage.   Strong experience with relational (PostgreSQL, MySQL) and/or NoSQL databases.   Strong experience with unit testing and test-driven development.   Experience working with Linux/Unix Operating system comfortable with command line.   Experience with modern software engineering workflows and tools (e.g. Agile, JIRA, Git, CI/CD, Amazon Web Services, ELK, APM).     Experience in all areas of SDLC, including architecture and design, development, and testing.   Demonstrate proficiency in at least one product technology of strategic importance to the organisation; incorporates new technologies as required.   Extremely passionate about code reviews, engineering best practices and mentoring/coaching the developers to make them successful.   Excellent understanding of feature estimation and ability to communicate issues and risks that may impact timelines, budget, or resources.   Experience with Agile development lifecycle.   Can gather and clarify requirements from technical folks / product managers / business teams.   Lead by example act as a role model for the team.  ", "Role": "Software Developer,", "Industry Type": "Other,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial", "PG": "MCA in Computers", "Doctorate": "None", "Key Skills": ["GIT", "Linux", "Postgresql", "Analytical", "MySQL", "Unit testing", "Troubleshooting", "JIRA", "Gaming", "SDLC"]}