{"Job Title": "Software Engineer- BIZAGI Developer", "Company": "Mahindra First Choice Wheels Ltd", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Chennai, Bangalore/Bengaluru", "Job Description": "     Qualification :   B.E / B. Tech/B.SC, M.SC/MCA/M.E    Experience :   3 to 8 years    Behavioural Competencies:     Result Orientation with Execution Excellence   Customer focus   Interpersonal skill       Responsibilities:     Translate applications requirements into web-based software solutions deployed to the Bizagi Work Portal using the Bizagi Suite (Modeler, Studio and Engine) with Microsoft SQL Server 2012 (or newer) and Microsoft .NET Framework 4.0 (or newer)    Develop process applications using the Bizagi Studio tool, to include modelling the processes and then modeling the data, defining the forms, documenting the business rules, defining the performers, integrating the interfaces, and other design, development, and deployment tasks necessary using the Bizagi suite of tools, Bizagi connectors, Bizagi widgets, as well as non-Bizagi APIs, custom components, SOAP and REST web services, data replication, and data virtualization    Serve as a Subject Matter Expert (SME) of the joint team regarding all design, development, and deployment of BPM-based process applications, and instruct/mentor the team in the best practices for such development in accordance with the best practices established by Bizagi itself as well as best practices developed through the Bizagi Developer?s personal experience and knowledge         ", "Role": "Software Developer,", "Industry Type": "Automobile, Auto Anciliary, Auto Components,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial, B.Sc in Chemistry", "PG": "MCA in Computers, M.Tech in Electronics/Telecommunication, MS/M.Sc(Science) in Chemistry", "Doctorate": "None", "Key Skills": ["MS SQL", "Web services", "Design development", "business rules", "Deployment", "Mentor", "Subject Matter Expert", "Virtualization", "Software solutions", "SOAP"]}