{"Job Title": "Sr. Software Developer", "Company": "ABP EMPOWER", "Experience": "4 - 6 years", "Salary": "Not Disclosed", "Location": "Chandigarh, ,(India )", "Job Description": "Sr. Software Developer( Laravel Developer)   Opening-5   Experience: 5yr-7yr(3yr to 4yr Exp Can also Work if Strong Knowledge in Laravel Only)(if Candidate Having Strong Knowledge in Core Php and Done Some Project in Laravel that   required Skills:   Master s And/or Bachelor s Degree in Computer Science or Equivalent.   Minimum of 5 Years Experience Developing Php Applications Through all Phases of   software Engineering.   Providing Guidance and Mentorship to the Jr. Software Assurance Analysts.   Must have Experience in Laravel and other Mvc Frameworks.   Adhering to Project Standard and Recommending Improvements.   Understand the Asynchronous and Synchronous Behaviour of Php.   Integration of User-facing Elements Developed By Front-end Developers.   Build Efficient, Testable, Reusable and Readable Php Code.   Integration of Multiple Data Sources and Databases Into One System.   Good Communication Skills.   Writing Thorough Documents for Use Cases.   desired Skills:   Strong Knowledge of Php 7 .   Strong Knowledge in Laravel and other Mvc Frameworks.   Strong Knowledge in Javascript, Jquery/ajax/json, Xml, Html 5 /css 3.   Strong Knowledge in Oops Concepts.   Strong Knowledge in   Knowledge in Agile Methodologies.   Knowledge in Mysql/mongodb Databases and Their Declarative Query Languages.   Proficient Understanding of Git Code Versioning Tool.   Proficient Understanding of Mantis or Jira.   Basic Knowledge of Nodejs/ruby.   ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["jQuery", "XML", "MySQL", "Wordpress", "Javascript", "Agile", "CakePHP", "JSON", "MVC", "Ajax"]}