{"Job Title": "Sr./Jr. Senior Software Engineer - SQL Developer", "Company": "In4velocity Systems", "Experience": "4 - 9 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  Sr./Jr. Senior Software Engineer - SQL Developer    4- 9+ year of experience     Roles and Responsibilities:      Participates in complex module design, development and testing   Interprets, reviews and authors technical documents including functional specifications, design specifications, detailed design documents, etc.    Provides status of deliverables and progress updates   Provides solutions to a variety of problems of wide scope and high complexity   Accountable for deliverables, anticipates issues and addresses the same proactively   Follows and enforces development processes and standard procedures    Should be inquisitive and take on technical challenges with little inputs   Collaborates well with other engineers and other teams, voluntarily shares information   Significant contributor to organizational goals and objectives        Essential Skills/Qualifications:     4- 10 years of strong experience in SQL Server application development, enhancement and support.   Hands on experience in designing reports using SSRS.   Hands-On experience in Query Tuning.    Expertise in resolving blocking and deadlocks using SQL commands in applications.   Database Development T-SQL(OLTP) ,OLAP etc.,   Strong experience in writing and debugging complex Stored Procedures, Functions, Triggers.   Experience in handling a team as a technical lead by delegating the tasks after the requirement analysis.   Skilled at database performance analysis and tuning using Query Analyser and Profiler.   Created automatically running stored procedures, cubes, backup-restores, packages etc. for day-end operation using SQL Server agent   Exposure to scheduling maintenance jobs/Stored Procedures      Additional Skills :    Microsoft Certified Professionals preferred, SSIS, SSAS, Qlik  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial", "PG": "MCA in Computers", "Doctorate": "None", "Key Skills": ["SSRS", "Debugging", "OLAP", "Application development", "Scheduling", "Stored procedures", "SSIS", "microsoft", "OLTP", "SQL"]}