{"Job Title": "Lead Software Development Engineer in Test  -  FogHorn Systems", "Company": "FogHorn", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "   Location: FogHorn s engineering facility in Pune, India   Do you want to make a huge impact in Industrial IoT at a fast growing, early stage companyFogHorn is an early stage startup driven by the passion to significantly disrupt and invent in the space of the Industrial Internet of Things (IIoT). To handle information at the IIoT scale requires the latest innovations from every area of computer science including artificial intelligence, neural networks, stream and batch data services, distributed computing, large - scale system design, security, user interface design and more.  Who are we   FogHorn is a series - a stage startup whose mission is to make machines intelligent, and help build an ecosystem that enables companies to build smarter machines. Handling the scale of information generated by machines requires innovating in almost every area of Computer Science machine learning, streaming and batch data management, distributed computing, large - scale system design, security and user interface design. FogHorn embraces these technologies to build a distributed computing platform, to enable analytics and machine learning applications for sensors that are geographically distributed or semi - connected to the network. The platform uses sophisticated containers to run analytics applications in environments that include constrained computing devices at the edge or in the fog .  Job Summary   Software Development Engineer in Test (SDET) will be responsible for all facets of quality assurance and testing.    Own the end - to - end quality of the product, signoff releases to production.     Develop an automated integration test suite that exercises all aspects of the product.     Investigate and analyze root causes of technical issues and document software defects.     Help with the integration of tests with Continuous Integration and Build Environment.   Must - have Skills    BE, BTech or equivalent in CS or related branch with 3 5+ years of experience with the following range of testing Functional, End - to - end, regression, Performance, Usability, Longevity, edge - cases, Module integration and Server Side API testing.     Experience in test automation using Selenium Webdriver 2.0, Robot Framework , QTP or Mozmill.     Experience with stress and load testing tools like SilkPerformer, BrowserMob, LoadUI and WAPT.     Experience with using and / or writing UI Performance measurement tools.     Well - versed in scripting languages Shell / bash, Python etc.     Must have working experience with Docker and Unix.     Working knowledge and experience in simple programming in Java and/or C++.     Experience with Continuous Integration (CI) tools like Jenkins to create and maintain automation and manual testing infrastructure.     Experience in using Test Management Tools like Quality Center and TestLink.     Good knowledge of Agile Methodology with experience in Atlassian Product suite (JIRA, Confluence, Fisheye, Bamboo).     Experience in working with Code Coverage tools like CLOVER to create code coverage reports for Sprint Planning.   Nice - to - have Skills    Experience of leading a small QE team across several releases at a product company.     Understand the dynamic of working with other leads in development.     Represent the QE function in a cross - functional product / release team.     Recent experience being part of an enterprise - grade platform product team.  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["Unix", "C++", "Automation", "Manual testing", "Testing tools", "Software Development Manager", "Selenium", "QTP", "Analytics", "Python"]}