{"Job Title": "Senior C#/.NET Software Developer", "Company": "Pi Techniques", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": "Senior C#/ .NET Software Developer -  3+ Years Experience \n\nJOB CODE: PI002 ) Analyze user specifications and requirements\n\n) Design,  code,  test,  debug,  and document programs on large scale,  complex projects\n\n) Revise and update programs and documentation as required\n\n) Perform any other function required for the successful operation of all software solutions provided to our users\n\n) Work with team lead,  business analysts and project managers to develop innovative technology solutions\n\n) Relies on experience and judgment to plan and accomplish goals\n\n) Ability to prioritize and multi- task \n\n) Ability to work under pressure,  and deliver on time\n\n) Participates in the testing process through test review and analysis,  test witnessing \n\n) Complete compliance with all coding standards and best practices\n\n) Able to shift between a creative and a technical focus depending on the project need and/ or the type of project\n\n) Takes responsibility for the success of the project and the company\n\nSkills and Experience \n\n) 3+ years experience in software development with languages like C# and JavaScript\n\n) Minimum 3 years of Microsoft Visual Studio .NET (4.0 Framework) experience developing N- Tier Web and Windows based applications using C#,      ASP.NET,  AJAX,  XML Web Services,  ADO.NET,  LINQ or Entity framework and XML.\n\n) Experience developing .NET applications utilizing Microsoft SQL Server 2005+ as the data source for user- defined functions,  stored procedures     and triggers.\n\n) Experience utilizing Web Application Server technologies such as IIS 7.0/  6.0\n\n) Basic knowledge of XHTML/ HTML5,  CSS,  JavaScript,  JQuery,  AJAX,  and JSON/ XML\n\n) Excellent debugging and troubleshooting skills\n\n) Excellent verbal and written communication skills,  customer service skills and ability to thrive in a fast- paced,  ever- changing,  collaborative team     environment\n\n) Team player as well as a self- starter who needs little supervision\n\n) Working knowledge and experience using Agile with Scrum Methodology\n\n) Leadership qualities to grow as team lead.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["server", "c++", "C", "technical", "software", "HTML", "microsoft", "sql", "coding", "Technical product configuration", "iis", "web", "xml", "design", "MySQL", "JavaScript", "debugging", "c#", "testing", "integration PHP", "windows", "linq", "service", "troubleshooting", ".net", "scrum", "developer", "agile", "applications"]}