{"Job Title": "Senior Software Developer", "Company": "Squircle IT Consulting Services Pvt Ltd", "Experience": "5 - 7 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": "NO Relocation.NO::30DAYS.Senior Software Developer -  Job Description.Pay Rate::8LPA(Can give more hike based on exp ) Educational Qualifications: B.E /  B. Tech or equivalent.Work experience (in years): [5- 7] years of professional software development experience.Mandatory Technical Skills:Java Expert level Object Oriented Programming Concepts Expert level JDBC Intermediate level XML/ XSL Intermediate levelTest Driven Development (TDD) Unit testing Intermediate levelBackend Service Development Intermediate levelMandatory Soft Skills:Structured,  organized and a good communication skills.Delivery- focused with a good eye for detail.Comfortable working with the offshore teams in a multi diversity environment.Willing to share knowledge and skills with other members within the team whilst able to work independently.Nice to have Skills:FPMLSpring and Web ServicesIBM MQSeries,  JMSScripts: Unix/ Linux [Shell Scripting,  ksh/ csh/ awk],  Windows: [Power shell,  WMI]JunitSonar,  Maven,  TomcatProject Brief:Fixlink FIRE is BNP Paribas' primary Regulatory Reporting service to global regulatory bodies.Currently,  the IT team responsible for this platform is spread across 4 locations: London,  Paris,  Mumbai and Chennai. The platform uses a mix of technologies including Core Java,  MS- SQL server,  C#.NET,  Windows Forms,  WCF,  IBM MQ series and Tibco Rendezvous.This role is for Core Java development of server side components. The candidate will work under a local development team lead in conjunction with the team members based in Paris,  London,  Mumbai and Chennai.Expected Role and Key Responsibilities:Ensure that the deliverables are being completed on time and on schedule,  are respecting the business and users expectationsParticipating to production releases and deployments and adhering to team guidelines.Ensuring that the architecture and the platform components are up to date and proposing the migrations and expecting the internal standards.Working closely and collaborating with other developers,  testers and production teams.Coach the Junior dev and co code review  ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["Unix", "JMS", "Core Java", "Tomcat", "MS SQL", "Linux", "XML", "Shell scripting", "JDBC", "WCF"]}