{"Job Title": "Software Developer ASP.Net C# Cadvil", "Company": "Cadvil", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Kochi/Cochin", "Job Description": "Software Developer ASP.Net C#\n\nWe are looking for candidates for a full-time position as ASP.NET with C# developer. The selected candidate will be part of a strong development team, and will be responsible for translating complex business requirements into functional web based applications throughout all stages of the SDLC. The ideal candidate has extensive experience working with distributed, service oriented architecture (SOA) systems, writing clean object-oriented code, worked with RESTful APIs and has worked in cloud based environments like AWS and/or Azure.\n\nDepartment:\n\nIT\n\nResponsibilities\n\n Plan, review, and perform analysis, design, coding and implementation of simple to more complex internet and enterprise applications using Microsoft development products (Asp.net, C#, Visual Studio, MVC 4/5, web API, etc.) and open standard products (JavaScript, AJAX, CSS, etc.) for both traditional browsers and mobile devices\n\n Set up and maintain data structures and database environment\n\n Participate in requirements analysis\n\n Collaborate with internal teams to produce software design and architecture\n\n Write clean, scalable code using .NET programming languages\n\n Test and deploy applications and systems\n\n Revise, update, refactor and debug code\n\n Improve existing software\n\n Develop documentation throughout the software development life cycle (SDLC)\n\n Serve as an expert on applications and provide technical support\n\nSkills\n\n Ability to support and maintain existing systems that use a variety of .NET technologies.\n\n Strong knowledge of C# and ASP.NET, Application Security and MVC framework\n\n Experience in developing responsive web applications.\n\n Experience in cloud based environments such as AWS and/or Azure.\n\n A flair for UI/UX design. Comfortable implementing designs with pixel perfect accuracy.\n\n Strong experience with C#, ASP.NET, HTML5, CSS, AJAX, JavaScript, Web Services, IIS\n\n Internet / Intranet application programming (MS IIS, JavaScript, DHTML, XML, XSLT/XSD, JSON)\n\n Solid understanding of MS SQL/Server database. Experience with TSQL, Stored Procedures, triggers etc.\n\n Solid understanding of relational databases and SQL for implementing database driven, web-based applications\n\n Knowledge of Oracle is an advantage\n\nCadvil Solutions is one of the leading software solution providing companies specializing in custom business app development, product development, mobile app development and software testing. We re recognized for our clear understanding of business needs and delivering solutions that surpass our client s expectations with innovative approaches and commitment. We grow with our clients.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["code", "technical", "software", "microsoft", "Technical support", "DHTML", "cloud", "coding", "database", "web", "design", "asp.net", "Javascript", "mvc", "Oracle", "programming", "Ajax", "architecture", "c#", "solid", "SOA", "mobile", "triggers", "SQL", "MS SQL", "XML", "service", ".net", "developer", "aws", "support", "applications"]}