{"Job Title": "Senior Software Developer C++", "Company": "GILBARCO VEEDER ROOT INDIA PRIVATE LIMITED", "Experience": "5 - 8 years", "Salary": "₹ 10,00,000 - 12,00,000 P.A. ", "Location": "Mumbai", "Job Description": "Location: Mumbai15% Travel RequiredPurpose of Position: The Software Developer/ Senior Software Developer  C++ will be responsible For designing, implementing, and managing software programs Testing and evaluating new programs Identifying areas for modification in existing programs and subsequently developing thesemodifications Writing and implementing efficient code Determining operational practicality Developing quality assurance procedures Deploying software tools, processes, and metrics Maintaining and upgrading existing systems Training new employees / customers / users Working closely with other developers, UX designers, business, and systems analystsKey Responsibilities: Define high level design documents Design, Develop and Build high quality SW applications and features including infrastructures On-line support to customers.Relationships Reports to: Software Development Manager Key Relationships: Product, Scrum Master, System Architect, Other SW team members.Education & Experience: The ideal candidate will haveTotal Experience in years: 5-6/7+ yearsGraduation/ Degree: : IT GraduateBackground and Skills: The ideal candidate will have In depth experience in C++ programming High experience in writing Client / Server applications. High knowledge in design patterns. High knowledge in TCP/IP, XML & WS protocols. In-depth knowledge of PostgreSQL / SQLite / MSSQL  Advantage. Prior experience with CSS, HTML, HTML5, jQuery and libraries or frameworks such as React, Angular,Backbone  Advantage High knowledge on OS environment such as Windows and Linux. Knowledge in working on Visual Studio environment. WOMEN ARE ENCOURAGED TO APPLY.", "Role": "Software Developer,", "Industry Type": "Oil and Gas, Energy, Power, Infrastructure,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization, B.Sc in Computers", "Doctorate": "None", "Key Skills": ["Software Development", "C++"]}