{"Job Title": "Senior Software Developer", "Company": "Channel Fusion", "Experience": "4 - 6 years", "Salary": "Not Disclosed", "Location": "Panchkula, haryana", "Job Description": "Channel Fusion is the trusted channel partner of America s top brands. We bring the passion to serve and drive local brand demand. We specialize in providing custom channel marketing technology solutions and high touch channel support services. These services assist corporations and their distribution network to optimize trade promotion funds and leverage branded marketing assets to drive local demand. \n\nResponsibilities include: \n\nDesign and build ASP.net web tools. Use MS framework 3.5 and 4.0 to develop multilingual applications in an n- tiered environment,  ie presentation layer using ASP.net,  Business Logic layer compiled into dynamic libraries and objects in VB.NET and a data access layer to connect to SQL server. \n\nWrite stored procedures for use in the web tool and utilize an n- tiered objected oriented development approach. Write complex select,  update,  and control stored procedures in SQL Server. To insert/ update data per complex business logic requirements. \n\nDesign and implement back- end database. Create database schema to manage client/ business rules. Include scripts for table design,  foreign key constraints,  indexes,  check constraints,  etc. \n\nWork with clients to secure software development requirements and write documentation for the tool. Follow traditional software development life cycle development model,  ie. analysis,  planning,  design,  implementation,  and testing. \n\nDevelop and perform unit testing on the tool and work with Quality Assurance group through the Quality Assurance testing cycle. Includes unit testing individual pieces of code written before they are integrated into overall application. \n\nProvide technical support to client regarding web tool. Includes providing recommendations on application architecture,  debugging any known issues as well as providing situations for any hardware/ software related components. \n\nRequirements: \n\n4- 6 years of software development experience in ASP.NET web services,  WCF,  MVC,  Entity Framework,  ADO.NET,  .NET console apps,  Windows applications,  AJAX,  Javascript,  XML,  JQuery \n\nExperience in developing REST APIs for complex data sets. \n\nStrong experience with designing relational databases,  programming and optimization of SQL queries using MS SQL Server \n\nIn- depth knowledge of multi layered,  object oriented programming. \n\nExperience in both VB and C# an advantage,  but not required \n\nBuild knowledge like building application and deploying it on server IIS \n\nAbility to work with clients in different countries for requirements independently \n\nExperience managing entire SDLC (requirements,  planning,  development,  QA,  implementation) an advantage", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["server", "code", "technical", "software", "Windows", "vb.net", "Technical support", "sql", "database", "iis", "web", "optimization", "asp.net", "Javascript", "debugging", "programming", "Ajax", "c#", "rest", "testing", "it", "VB", "quality", "MS SQL", "jQuery", "application", "XML", ".net", "WCF", "MVC", "sdlc", "support", "applications"]}