{"Job Title": "Senior Software Developer/Comm100 Network Corporation/Noida", "Company": "Comm100", "Experience": "4 - 8 years", "Salary": "₹ 14,00,000 - 17,00,000 P.A. ", "Location": "Noida", "Job Description": "Comm100 Network Corporation is building a team of highly talented and innovative Engineers in India to work on their most innovative AI Chatbot and associated product suite to meet the market demand and our rapid growth in enterprise.  We are actively looking for Sr. Engineers who can work across the technology stack including backend technologies [.Netcore, C#, ASP.NET] and frontend [React, Angular, Javascript, CSS, HTML5]What we expect:Serving as a key full stack developer on your squad to expertly craft and engineer the product solution being involved in full cycle of product design and developmentInvolved and Participate in complete product life cycle from ideation to live and beyondWorking closely with product, architecture, and engineering and SRE teams to deliver the bestBring your experience to accelerate our product development with growth and quality conscious mindsetIndependently owning full cycle of software development from coding, unit testing, functional automation, and continuous integrationTeaming up with our pool of best engineers to continuously working on new ideas improving the performance and reliability of the system to scale as we are on a rapid growth pathWhat will be your day to day?Collaborating with engineering team to design and launch new features such as AI BOT for new industry vertical.Building new functionalities end to end [frontend and backend] iteratively with high quality standards at comm100Improving existing system performance, reliability, maintainability and scalability of the platform with continuous improvement mindsetParticipating in ideation and discussions around new features or improvementsBrining Thought Leadership around your craft and help others to learn and growHaving Fun in fun filled team activities/eventsKey QualificationsBachelor/Master's degree in Computer Science/Information Technology discipline from reputed institution in India or abroad.Strong hands on experience, proficient and in-depth knowledge in:Backend Skills              (1) NetCore, WebAPIs, C# , Microservices , REST APIs              (2) Database Design, Development, Management and Queries optimisationFrontend Skills       (1) JavaScript Frameworks like ReactJS, AngularJS, JQuery, Web Frameworks              (2)  HTML, CSS, JavaScriptProficient in Object Oriented Programming and declarative programmingSound expertise in Source code management tool e.g GITVery good in quality engineering practices such as code quality, unit testing & Domain Driven Design and Design Patterns such as MVVM, MVC, Entity Framework etc.Working knowledge of performance optimisations, caching techniques, AuthN/AuthR and security covering OWASP top 10 Good understanding of SEO, Accessibility andInternationalisation concepts Good knowledge of test automation across the layers frontend, services/APIs and databaseWorking knowledge of WebSocket, Realtime communication and Service workersShould be able to understand mobile application architectures.", "Role": "Technical Architect,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "MCA in Computers", "Doctorate": "None", "Key Skills": ["Angularjs", "C#.Net", "ASP.Net", "HTML", "Entity Framework", "MVC", "JQuery", "Javascript Frameworks"]}