{"Job Title": "Software Developer", "Company": "Quince", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad, remote", "Job Description": "About the CompanyQuince (formerly Last Brand) is an exciting retail startup concept that promises to democratize luxury essentials by offering them at unbelievable prices. Registered in the USA, the Last Brand was founded in August 2018. As of now, were soft-launched with a small assortment of products with 22 partner factories based in China, Italy, India, Vietnam, Peru, Hong Kong, and Turkey. These are a few of the renowned factories that manufacture for popular brands like Gucci, Prada, YSL, Tory Burch, etc.About Quince EngineeringWere building everything ground-up on the cloud, choosing the best components for the best solution without the limitations imposed by any legacy software. We’re building software solutions in pretty much all the functional areas related to e-commerce and supply-chain, and many more in the area of product sourcing and growth which we feel is going to give us an edge above all others in the industry. Being a data-driven company, our huge tech investment is in building a sophisticated data engineering stack that will fuel all our decisions in product and growth, be it identifying the right number of buttons on a shirt or optimizing the customer acquisition cost on Facebook advertising to name a few.About the RoleQuince is currently looking for someone who’s passionate about delivering high-quality work, being a strong individual contributor, and being able to own, manage projects end to end. Some of the projects that you’ll be working on will be web-based - increasing volume, payment gateways, e-commerce, secondly around supply chain management - tracking the shipment, a few based on finance - pricing, margins, marketplace.If you’re someone who is excited about working with a fast-growing, unique, diverse start-up with an opportunity to own and lead projects and work with a world-class team, we recommend you to apply.Key ResponsibilitiesBuild and deploy scalable infrastructure on the cloud to cater for future growth.Be on the forefront with the business team to learn, understand, identify, and translate functional requirements into technical opportunities.Build intelligent systems to identify potential delays in shipments and predict estimated delivery dates in a multi-leg shipment chain.Implement solutions to evaluate and iterate marketing strategies to accelerate growth and improve customer acquisition growth.Get access to the best talent in your network to help the engineering team grow.Does this sound like you?Experience working as a backend or full-stack developer.Experience with Java, REST API.Experience working on microservices, scaling applications.Experience working in the e-commerce, supply chain industry, or organizations known for tech expertise.High attention to detail.High sense of ownership.", "Role": "Software Developer,", "Industry Type": "Retail, Wholesale,", "Functional Area": "IT Software - eCommerce, Internet Technologies,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Java", "Software Development", "Product Sourcing", "Data Engineering", "Payment Gateways", "Rest Api", "Supply Chain Management", "Microservices", "Software Solutions", "Customer Acquisition"]}