{"Job Title": "Sr iOS Software Developer", "Company": "Finite HR Consulting Private Limited", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": "We are looking for a Senior iOS Software Developer who possesses a passion for pushing mobile technologies to the limits and will work with our team of talented engineers to design and build the next generation of our mobile applications. As a Senior iOS Software Developer,  the candidate will be expected to solve complex engineering problems and contribute their ideas at various stages of the project.\n\n\n  The candidate should have the following skills: \n\n\n\nFluent in writing well- documented code \nExperience in iOS development,  using Obj- C,  Swift and/ or Cocoa Touch \nExperience in designing,  creating and using Representational State Transfer (REST)ful Application Programming Interfaces (APIs) and services \nA degree in Computer Science,  Engineering or similar  \nIntimately familiar with iOS design patterns and coding conventions as well as Apple s Human Interface Guidelines and App Store Review Guidelines \nAbility to prioritize,  as well as be flexible in strategy \nDemonstrated communication skills,  both within and outside the team \nTake pride in and assume responsibility for their work   \n\n When applying,  please provide all documents in pdf or doc format. If you can,  please include URLs to apps that you have worked on with descriptions and tell us about your contribution. If you've got a Github account or similar please provide that as well.Required \n\n \tBachelor's Degree \n \tAt least 3 years experience in iOS Programming \n \tAt least 3 years experience in software development with a demonstrated understanding of object oriented principles \n \tEnglish: Fluent", "Role": "IT/Technical Content Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Other", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["Technical product configuration", "c++", "C", "design", "MySQL", "JavaScript", "integration PHP", "HTML"]}