{"Job Title": "Software Development Senior Analyst", "Company": "NTT Data", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   Experience: 2 years      Primary Skills : JAVA,J2EE, Spring, HTML, CSS, React JS, Integration framework Camel      Secondary Skills : javascript, openCMS Strong Telecom knowledge in inventory management.      Handson experience with all phases of projects, especially Incident Management / Triaging of voice and data networks.      Good programming skills on JAVA,J2EE, Spring, HTML, CSS, React, Integration framework-Camel.      App development skill AND mobile app development in native React or PWA Good Oracle, Teradata Database / SQL knowledge is nice to have.      Conduct end-to-end testing of all new functionality or applications developed on the Remedy platform prior to rolling out to production.      Design, Implement Test application and API level integrations.      Troubleshoot and resolve application related issues, including engaging and submitting tickets to BMC technical support when necessary.      Experience working in a 24x7 production support model with excellent troubleshooting skills is nice to have.      Experience in Application Monitoring tools, Incident management, managing crisis calls is nice to have.      Complete all work order and service requests within service level targets.        Performs analysis and makes recommendations in areas that require a high level of technical competency.      Provides application support to existing applications and additionally works with IT operations, incident and problem management teams in resolving issues and maintaining application availability and stability in production    ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Telecom", "Application support", "Production support", "Problem management", "Incident management", "HTML", "Oracle", "Teradata", "Technical support", "Remedy"]}