{"Job Title": "Senior Software Development Engineer in Test - STG", "Company": "Livestream", "Experience": "2 - 7 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "   Job description       As a Senior SDET, you will be a key member of the product team responsible for product quality.     This product team works within the larger platform group to create and maintain the system that allows for access between the users device and secured content.     We design and deliver those aspects of the platform that streamline and improve developing and deploying applications and customisations.     The team is focused and follows agile methodology for development.     The ideal candidate will be a hands-on craftsman with technology and code.     They should be comfortable in a heterogeneous environment that is rapidly evolving and demands quickly mastering new technologies as we integrate these into our platform.      Job Requirements     REQUIRED SKILLS     Expert in software quality and testing methodologies.  Significant    Experience in working with Cloud(AWS), Kubernetes and Enterprise Technologies.   Experience in integration testing with AD/LDAP,ADFS.   Experience in MS Exchange, Identity solutions (like Ping one, Octa).   TCP/IP protocols like DNS, DHCP, HTTP, SSL, SSH, SMTP and Network Security concepts.   Experience in configuring and troubleshooting Firewall, VPN issues.   Hands on experience with Sniffing tools, configuring Proxy, Certificate Authority servers.   Experience in analysing and troubleshooting network and system related issues based on Logs and events.   Strong analytical skills with excellent problem solving.   Self-starter, driven with passion for shipping excellent product quality.   Excellent communication skills and exceptionally good with multitasking assignments.     DESIRED SKILLS     Strong knowledge of open source tools and how to use them.   Experience testing mobile devices, mobile operating systems, or mobile applications.   Core Java, Python and scripting experience.   Strong expertise on Operating systems CentOS/Linux.     BEHAVIORAL ATTRIBUTES     Must have a passion for quality and a bias towards speed.   Must be a motivated self-starter with a short learning curve.   Must be able to learn new technical areas quickly.   Ability to communicate effectively - Verbal Written  ", "Role": "Software Developer,", "Industry Type": "Media, Entertainment, Internet,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Other", "Doctorate": "None", "Key Skills": ["Core Java", "Linux", "LDAP", "VPN", "DNS", "Network security", "HTTP", "Open source", "Python", "Firewall"]}