{"Job Title": "Software Development Engineer", "Company": "TraceLink Inc.", "Experience": "3 - 5 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": "Digital information sharing is the future of medicine. TraceLink is building the first ever cloud-based network and application platform that helps our global customers share crucial business information while collaborating on manufacturing and distributing billions of medical products worldwide.Tracelink is looking for talented full-time software engineers to build products at one of the fastest growing companies in the Boston and Mumbai areas. If you?re self-motivated, intellectually curious and motivated by designing and developing innovative products for global organizations, you could be a good fit for our team.        The Software Development Engineer in Test assists in building and executing automated tests for the Company's software products. The SDET will build testing tools to enable automated testing of the TraceLink platform and application.               Execute tests on the TraceLink platform and application.     Extend and maintain automation frameworks.     Prepare and present clear reports on defect findings that allow developers to quickly and accurately     reproduce problems and allow the Quality Engineering team to verify that fixes are complete.     Verify defect fixes.     Build tooling for automated testing of the TraceLink platform and application.     Programmatically interface testing tools with the TraceLink platform and application.     Create testing tools that can be configured and used by non-developers and can simulate real-world     transaction volumes involving potentially millions of transactions per day.     Provide high-level analysis to appropriate technologies and architecture to solve conceptual problems     Research and remain informed of new technology and tools, and how such technologies could be applied at TraceLink.     Work closely with engineers building the core TraceLink product to ensure that testability concerns are factored into the design of the product.             Bachelor's degree or foreign equivalent in computer science, software engineering, mechanical engineering, or related discipline.     3 years of progressive, post-baccalaureate experience in a test automation engineering role involving     programmatic interaction with a system under test.     3 years of experience utilizing Java, Eclipse, Ant or Maven, Unix, and an automated unit test framework, such as TestNG.     3 years of experience developing against web-services and Web-based APIs.     3 years of experience developing and executing formal test plans, data sets, and test configurations for assigned feature areas     3 years of experience testing web-based enterprise-class business applications.      ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Unix", "Computer science", "Maven", "Automation testing", "Web technologies", "Web services", "Testing tools", "Eclipse", "Business applications", "Testing"]}