{"Job Title": "Senior Software Developer", "Company": "Ascent Consulting Services Pvt. Ltd.", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Coimbatore", "Job Description": "  RESPONSIBILITIES:        Builds custom configurations using languages such as Groovy, Yaml, Java.  Collaborates with our development team when troubleshooting, customising requests and creating new configurations.  Develop and maintain code that meets requirements, is high quality, and performs efficiently and effectively to provide a great customer experience  Incorporate standards and best practices, including performance, security, scalability, and maintainability  Contributing to improvements in the software development lifecycle (SDLC) utilizing practices such as test-driven development (TDD),  static code analysis, code reviews, continuous integration, continuous delivery, and automated security scanning.  Resolves technical issues through debugging, research, and investigation.  Maintains an awareness of new technologies and their applicability to improving the framework and business     REQUIRED SKILLS:   Should have hands on experience working with GroovyYaml.  GroovyYaml development: 3 years  Experiencefamiliarity with Java EE, Design Patterns, SpringSpring Boot  Must have excellent communication and presentation skills  Must have strong organizational, problem solving and interpersonal skills  A positive, innovative, energizing, collaborative work style  Must be able to work independently and as part of a team  Good to have Payroll domain experience  ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Payroll", "Interpersonal skills", "PDF", "TDD", "Debugging", "Consulting", "Software development life cycle", "test driven development", "Troubleshooting", "SDLC"]}