{"Job Title": "Software Developer / Lead Developer", "Company": "Corient Business Solutions Pvt Ltd", "Experience": "1 - 4 years", "Salary": "₹ 2,50,000 - 6,00,000 P.A. ", "Location": "Mumbai", "Job Description": "Corient Business Solutions Pvt Ltd, is in the field of automation and accounting services and is looking for people who has experience in software development. We are expanding and if you are looking to grow with the organization Corient is the right place for you.  Job SummaryResponsible for both back-end and front-end development using Laravel/CodeIgniter MYSQL etc.Must be proficient in PHP, Codeigniter, Larval, MySQL, CSS, HTML, Java script, AJAX, XMLResponsibilitiesResponsible for both back-end and front-end development, including creating pluginsPHP development in WordPress, Magento, Drupal and other leading open source platformsDevelop complex plugins, extensions, applications and WorkflowsDevelop websites, eCommerce stores, CRM systems and custom web solutionsIntegrate disparate systems using extensive API ProgrammingEnsure on schedule, high-quality programming deliverableParticipate in the development (and possibly, architecture) Experience & knowledge: Must be proficient in PHP, Codeigniter, Larval, MySQL, CSS, HTML, Java script, AJAX, XMLSkills: Willing to take initiative, accountability and timely discharge of deliverablesQualification: BSc. IT/ CS, MSc. IT / CS, MCA, BCA, BE Perks and Benefits Opportunity to work on multiple projectsOpportunity to grow within the organizationFlexible Working Hours5 Days Working - Monday to Friday2 minutes walking from Railway station", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Software Development", "Android Development", "PHP", "Angularjs", "Open Source", "Magento", "MySQL", "Ios Development", "Javascript", "HTML", "Leadership Development", "Codeigniter"]}