{"Job Title": "SOFTWARE DEVELOPER", "Company": "Finejobs Consultant Private Limited", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram, haryana", "Job Description": "First and foremost,  developing high quality software solutions that delight our customers\n\nDevelop software solutions by studying information needs; conferring with users; studying systems flow,  data usage and work processes; investigating problem areas; following the software development lifecycle\n\nDetermine operational feasibility by evaluating analysis,  problem definition,  requirements,  solution development and proposed solutions\n\nDocument and demonstrate solutions by developing documentation,  flowcharts,  layouts,  diagrams,  charts,  code comments and clear code.\n\nDocument system architecture and design choices,  with reference to SITA standards.\n\nEnsure products developed meet wider SITA product and software development lifecycle requirements\n\nWork on software and system optimizations,  helping to identify and remove potential performance bottlenecks.\n\nMake informed decisions quickly and taking ownership of services and applications at scale\n\nWork collaboratively with others to achieve goals\n\nUnderstand business needs and know how to create the tools to manage them. Work with Product Management and Business analysts to ensure product design meets business requirements.\n\nLiaise with the broader SITA Product Management,  Software Development and Architecture organizations. \n\nSalaryPlease refer to the Job description above                                 Education                                     \t Highest Qualification                                         \tAny Post Graduate                                     \t Graduation                                         \tAny Graduate", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Product management", "System architecture", "Business Analyst", "Software development life cycle", "Investigation", "HTML", "Product design", "Operations", "Software solutions"]}