{"Job Title": "Senior Software Developer", "Company": "OSTC", "Experience": "15 - 25 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": " Job Description    The Senior Software Developer will aid in planning and implementing complex software projects and timelines, providing reliable solutions to a variety of problems, using sound problem-solving techniques and ensuring security is considered by design. You will perform technical root cause analysis and outline corrective action for given problems    Your Role & Responsibilities:     Developing and coding review software to meet stakeholder needs.     Monitoring the quality and performance of applications.     Ensuring documentary evidence is maintained on all work for future reference.     Design and update databases where required.     Maintain software products to ensure strong functionality and optimisation.     Recommend improvements to existing software programs as necessary.     Mentoring and passing on your knowledge of technologies and best practices.      Liaising with project stakeholders and advising them on solutions.     Performing technical root cause analysis and outline corrective action for given problems.     Taking full ownership of assigned tasks, ensuring effective reporting while working towards efficient, internal customer satisfaction.     Developing their own capabilities and expertise to provide a high-quality service to the business.     Staying abreast of business updates, current industry trends, new technology, and changes and issues relating to secure development activities.     Qualifications     You are:     A highly organised and proactive full-stack developer, able to work against tight deadlines with outstanding software development skills and experience. You are a problem solver with excellent attention to detail and ability to communicate effectively with colleagues, participants and external stakeholders.   Innovative and creative software development engineer with project leadership experience.    Proven experience with programming languages such as C#     Delivery experience in digital/web/cloud/mobile projects.     Experience in Agile (Scrum) development environments.     Effective and confident communicator (technical and non-technical stakeholders across multiple business units).     Highly organised with strong attention to detail.     Comfortable and highly competent at multi-tasking.     A collaborative approach to problem-solving and task management.     Strong analytical skills, along with a validated problem-solving ability, are both a necessity.     Innovative and creative software development engineer with project leadership experience.     Experience of Web Application development.     Required skills:     Experience of working on commercial projects through all stages of development, incorporating security by design     Proven experience with programming languages such as C#     Delivery experience in digital/web/cloud/mobile projects.     Experience in Agile (Scrum) development environments.     Effective and confident communicator (technical and non-technical stakeholders across multiple business units).     Strong analytical skills, along with a validated problem-solving ability.     Experience of Web Application development     Ability to work using own initiative as well as working with a small team     Ability to manage own projects and portfolio     Excellent communication skills     Comfortable and highly competent at multi-tasking.     Skill Requirements:     A full-stack developer working with the Microsoft stack (C#, ASP.NET MVC, Windows Forms, SQL Server)     Source control (SVN, GIT)     PostgreSQ     JavaScript frameworks e.g. VueJS     Kubernete  ", "Role": "Software Developer,", "Industry Type": "Advertising, PR, MR, Event Management,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Analytical skills", "Web application development", "Root cause analysis", "GIT", "Coding", "Javascript", "Medical insurance", "microsoft", "Monitoring", "SQL"]}