{"Job Title": "Software Developer ( . Net )", "Company": "softobiz technologies Pvt ltd", "Experience": "12 - 17 years", "Salary": "Not Disclosed", "Location": "Mohali", "Job Description": "  Job Summary     As a part of the .NET development team, you will be building various enterprise applications using the latest Microsoft technology stack. You will be working with a cross-functional team of engineers, designers, DevOps engineers, and product experts working on different layers of the project throughout the software development life cycle (SDLC). With this highly challenging and responsible role, you will get an opportunity to build cutting-edge and customized technology solutions that help influential global enterprises to redefine their position in the global market space. If you love solving problems, believe in collaboration, and are committed to quality product development - this role is perfect for you.     Job Responsibilities     Understanding requirements from functional specifications received in requirement document     Performing analysis with design development of the project and creating technical specifications based on functional requirements     Designing, building, and maintaining efficient, reusable, and reliable code     Creating unit tests according to the test plans     Ensuring the best possible performance, quality, and responsiveness of applications     Identifying bottlenecks and devising solutions to mitigate and address these issues      Maintaining code quality, organization and automatization      Experience     Hands on experience with ASP.NET, .NET Framework MVC     Strong understanding of object-oriented programming     Familiar with various design and architectural patterns     Knack for writing clean, readable, and easily maintainable code     Strong proficiency with Microsoft SQL Server and writing SQL Queries     Web development technologies such as HTML 5, CSS, JavaScript libraries such as jQuery, extJS etc.     Exposure to Azure Worker Role, Web Jobs, Scheduler, Service Bus and Event Hub     Working on Angular is a plus      Understanding of Design pattern Microservices is a big plus      Core Skills      Problem solving attitude     Being flexible and focused     Taking initiative with pro-activeness     Good in written and verbal communication skills  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["jQuery", "Web technologies", "Enterprise applications", "Web development", "Machine learning", "Javascript", "Software development life cycle", "MVC", "SDLC", "ExtJS"]}