{"Job Title": "Software Developer", "Company": "ClinConsent", "Experience": "1 - 4 years", "Salary": "Not Disclosed", "Location": "Mysore/Mysuru", "Job Description": " The Software Developer is responsible for building software by writing code, modifying software to fix errors, adapt it to new hardware, improve its performance or upgrade interfaces.     About the position    We are looking for a Software Developer to Research, Design, Implement and Manage software programs. You will work with other Developers and Product Managers throughout the Software Development Life Cycle.    Responsibilities and Duties    Writing and implementing efficient code.   Researching, designing, implementing and managing software programs.   Testing and evaluating new programs.   Deploying software tools, processes and metrics.   Maintaining and upgrading existing systems.   Producing clean, efficient code based on specifications.   Troubleshoot, debug and upgrade existing software.   Integrate software components and third-party programs.   Identifying areas for modification in existing programs and subsequently developing these modifications.      Qualifications and Skills     Bachelor's or Master s in Computer Science or Information Technology.   One must have knowledge about data structure and algorithms.   One must have command on at least one programming language like JavaScript, HTMLCSS, SQL, Python, Java and C# language.   An essential skill for developers is understanding databases.   One must know the fundamentals and mechanism of the operating system like memory usage, communicating with another machine, running a program very slow, tools conflicting issues, blocking issues etc.  ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Computer science", "PDF", "Javascript", "Software development life cycle", "HTML", "Information technology", "SQL", "Python"]}