{"Job Title": "Software Developer", "Company": "redef9skiLLs", "Experience": "6 - 10 years", "Salary": "Not Disclosed", "Location": "Mohali", "Job Description": "  Senior iOS Developer / Team Lead     Job Location Mohali    Salary Upto 14 LPA     Years of Exp 6-12 Years     We are looking for a Senior iOS Developer / Team lead for one of our reputed IT Company in   Mohali   who is a team of enthusiastic and committed IT Professionals. Their main objective has been to provide state-of-the-art products and services in the field of Information Technology using the latest cutting-edge technologies. As they are professional, they can engineer your products beyond your imaginations with their professional knowledge, attitude, experience and expertise.    Industry: IT-Software, Software Services    Role Category: Programming & Design    Role: Software Developer    Employment Type: Permanent Job, Full Time     Desired Skills & Responsibilities     Technical Skills Required:     Work on the iOS app targeting iPhone and iPad with other developers.    Expert in Xcode, Objective C, Swift.    Independently drive the design and development of iPhone/iPad.    Must have good knowledge of all new versions and features like, 3D Touch, Multiplayer connect, Custom keyboard etc.    Must be quality oriented individual and must be good in communication.    Must be a team player, and have a pleasing personality.    Ability to adapt in a cross-cultural environment.    Save my name, email, and website in this browser for the next time I comment.   24/02/2020    React.js Developer Job Location Mohali Salary Upto 9 LPA Experience : 3- 6 Years We are looking for a React.js Developer for one of our reputed IT Company in Mohali who is a team of enthusiastic and committed IT Professionals. Their main objective has been to provide state-of-the-art products and services in the field [ ]    21/02/2020    PHP Developer Job Location Mohali Salary Upto 9 LPA Experience : 2 4 Years (Must have Min.1 year experience in LARAVEL) We are looking for a PHP Developer for one of our reputed IT Company in Mohali who is a team of enthusiastic and committed IT Professionals. Their main objective has been to[ ]  ", "Role": "Software Developer,", "Industry Type": "Strategy, Management Consulting Firms,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["3D", "Application programming", "Consulting", "Javascript", "PHP", "IOS app", "IOS", "Information technology", "Software services"]}