{"Job Title": "Software Development Engineer", "Company": "The Unified Cloud Pvt Ltd", "Experience": "5 - 10 years", "Salary": "₹ 3,00,000 - 8,00,000 P.A. ", "Location": "Noida", "Job Description": " Position & Role Summary:We are looking for individuals with 2 - 10 years of experience in ASP.NET, MVC, TFS, WCF, AJAX, JQuery, HTML/CSS, SQL.As SDE/SSDE, candidate will be responsible for many phases of the software development lifecycle including technical research, requirements analysis, high level and technical design, implementation of enhancements to the product, unit testing, debugging, and maintenance. This is an Exciting opportunity to work on Microsoft.NET platform which would be deployed on cloudJob Description:Candidate should have 2 - 20 years of proven and relevant experience in required technologiesExpert in C# - .Net, ASP.Net (2.0 / 3.5 / 4.0), WCF Services, MVC, ADO.NET, JQuery, HTML, XML, SQL Server Business IntegrationKnowledge about Microsoft Azure & Machine LearningExpert in SQL Server programming, functions, stored procedures, triggers etc.Working experience on Project Architecture, TFSExperience of windows formsKnowledge & experience in system architecture design patternsShould be able to gather and understand business requirementsShould have very good understanding / experience in \"AAA\" ProtocolsAbility to work under pressure and meet tight deadlines.Demonstrated leadership experience as well as the ability to lead a group of software developers and also able to work independentlyAbility to anticipate potential problems, determine and implement solutions.Strong coaching skills. Ability to step outside role confines and help teach and enable other team membersBe familiar with systems concepts design and standards. Provide technical expertise in terms of software usage, functionality, performance, aesthetics, resilience, and reuse comprehensibility Roles and Responsibilities Desired Candidate Profile Perks and Benefits ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "MCA in Computers", "Doctorate": "None", "Key Skills": ["C#", "jQuery", "XML", "ADO.Net", "ASP.Net", "HTML", "SQL Server", "MVC", "ASP.Net MVC"]}