{"Job Title": "Software Development Team Lead", "Company": "Amdocs Development Center India Pvt. Ltd.", "Experience": "6 - 10 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "  You will provide technical leadership to software engineers by coaching and mentoring them throughout the endtoend software development, maintenance, and lifecycle to achieve project goals to the required level of quality; promote team engagement and motivation.  You will provide input to the software engineering manager for estimates, resource needs, milestones and risks; and ensure effective delegation, monitoring tasks, identifying risks and handling mitigation and escalations.  You will provide hands-on technical and functional input to the design, maintenance, build, integration and testing of complex software components according to functional and technical design specifications; you will follow software development methodologies and release processes.  You will analyze and provide input for the requirements and provide impact assessment for new features or bug fixes. You will perform high-level design and establish technical standards.  You will represent and lead discussions related to product / application / modules / team and build relationships with internal customers/stakeholders.  You will enforce quality processes (such as performing technical root cause analysis and outlining corrective action for given problems), measure them and take corrective actions in case of variances, and ensure that all the project’s agreed deliverables are completed to the required level of quality.             Bachelors degree in Science/IT/Computer Science or equivalent  3 years Siebel experience Technically Siebel Configuration, , Workflows EAI, Scripting Mandatories, Siebel eCommunication, eChannel needed. Siebel version 7.7  Good hands on experience in Unix scripting and PL/SQL.                ", "Role": "Software Developer,", "Industry Type": "Telcom, ISP,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Root cause analysis", "Software development methodologies", "PLSQL", "Siebel configuration", "High level design", "microsoft", "Amdocs", "Monitoring", "software development team lead"]}