{"Job Title": "Software Developer iOS", "Company": "Excel Net Solutions Pvt Ltd.", "Experience": "2 - 7 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": "InvestWell: Software Developer iOS Software Developer iOS (Gurgaon) Investments is a complex ecosystem involving Asset Management companies,  Financial Advisors,  SEBI regulations,  online and offline Investors. There is no way to align all these stars without radical engineering innovation. We value strong engineers who are agile enough to jump into most projects and believe that small,  empowered,  self-motivated teams can do big things. Please find the details mentioned below.  \nBachelors in Engineering or equivalent work experience of 2+ Years \nSolid understanding of the full mobile development life cycle \nProficient with Objective-C or Swift {{depending on project requirements}},  and Cocoa Touch \nExperience with iOS frameworks such as Core Data,  Core Animation,  etc. \nExperience with offline storage,  threading,  and performance tuning \nUnderstanding of Apples design principles and interface guidelines \nKnowledge of low-level C-based libraries is preferred \nExperience with performance and memory tuning with tools \nFamiliarity with cloud message APIs and push notifications \nKnack for benchmarking and Optimization \nExperience in Payment gateway integration in mobile apps is a big plus \nA portfolio of iOS apps in the App Store is a plus \nExperience with iOS SDK \nExperience working with remote data via REST and JSON \nExperience with third-party libraries and APIs \nPush Notifications & Toast \nWorking knowledge of the general mobile landscape,  architectures,  trends,  and emerging technologies  What We're Looking For:  \nDesign and build advanced applications for the iOS platform \nCollaborate with cross-functional teams to define,  design,  and ship new features \nWork with outside data sources and APIs \nUnit-test code for robustness,  including edge cases,  usability,  and general reliability \nWork on bug fixing and improving application performance \nBuild and publish applications in app stores \nContinuously discover,  evaluate,  and implement new technologies to maximize development efficiency   2000-2018 Excel Net Solutions Pvt. Ltd.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Performance tuning", "C", "code", "software", "JSON", "tools", "cloud", "optimization", "design", "Agile", "net", "swift", "rest", "development", "Finance", "mobile", "Asset management", "Unit testing", "IOS", "cocoa", "excel", "Mobile development", "application", "Animation", "developer", "sdk", "applications"]}