{"Job Title": "Senior Software Developer", "Company": "Cyber Infrastructure (P) Limited", "Experience": "4 - 5 years", "Salary": "Not Disclosed", "Location": "Indore", "Job Description": "Senior Software Developer Job Code CIS-Python-01 Department Open Source Technology/ Area Python Experience Required 4-5 years Educational Qualification(s) BE/ ME/ B.Tech/ M.Tech/ MCA/ MCM/ BCA/ Msc. PGDCA/ or equivalent Overview of Job This role uses skills of a seasoned, experienced professional with a full understanding company policies and procedures. Resolves a wide range of issues in imaginative and practical ways. Works on problems of diverse scope where analysis of data requires evaluation of identifiable factors. Demonstrates good judgment in select-ing methods and techniques for obtaining solutions. Networks with senior internal personnel in own area of expertise. Normally receives little instruction on day-to-day work, general instructions on new assignments. Duties & Responsibilities \n\nShows appetite and aptitude for owning responsibility of technical decisions and direction for one or many projects. \n\nAptly manages team demands on his/ her time and shows willingness/ ability to delegate technical execution or responsibilities when appropriate. \n\nActs as a primary point of contact for communicating with client side technical expertise. \n\nDirects technical aspect of operations related to escalated client accounts or high severity issues as they affect or confront a project or team. \n\nAttends to both business and technical considerations when designing solutions to project/ team or company related issues. \n\nDemonstrates interest in improving the company s technical awareness, depth and use of technology across the business. \n\nRequired to Maintain Periodic reports and furnish to supervisor as if when needed. \n\nComplies with all confidentiality and non-disclosure policies and/ or agreements and ensures security of information at all time \n\nResponsible for meeting deadlines and adherence to set coding standards. \n\nResponsible for doing Requirement Analysis and provide Estimation to Support Team \n\nResponsible to compile required documents related to project and process excellence \n\nProvide guidance to juniors and support to other teammates in their work as and when required. \n\nResponsible for nurturing and mentoring the assigned resources. \n\nMinimum Requirements Python skills :\n\n- Python 2.x , 3.x\n\n- Strong knowledge of Python language\n\n- Strong Debugging Skill\n\n- Strong problem solving and analytical skills\n\n- Various type of Payment Gateway(i.e. Paypal, Stripe)\n\n- Having knowledge of various API integration\n\n- Social Media and other API integration\n\nRelational databases:\n\n- Good experience on MySql, Postgres, etc.\n\n- If you know NoSQL databases such as MongoDB, Redis, etc would be plus point\n\nServer skills :\n\n- Must have experience in Apache / Nginx / Gunicorn / wsgi.\n\nTest skills :\n\n- Knowledge of unit testing is a big plus.\n\nJS Skills A BIG PLUS:\n\n- Knowledge of client-side Javascript (AngularJS / ReactJS)\n\n- Knowledge of fullstack Javascript dev (NodeJs / Meteor / Meanstack)\n\n- Knowledge of advanced javascript and browser optimizations .\n\nOther Skills :\n\n- Having experience on HTML, CSS\n\n- Excellent in git, github, bitbucket and svn\n\n- Great command over OOPS concepts and MVC structure.\n\n- Must have good communication skills to deal with foreign clients.\n\n- Knowledge of cloud system(AWS, Azure), Docker, Machine Learning, BigData, Data Analysis, Web-Scrapping.ata Analysis, Web-Scrapping. Location Indore Any query related to job \"Ensuring success of our clients and partners through highly optimized Technology solutions while enhancing the quality of life for our workforce and community.\"", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial, BCA in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["server", "code", "technical", "analytical", "software", "methods", "HTML", "cloud", "Coding", "MySQL", "oops", "api", "Open source", "Python", "Data analysis", "Debugging", "testing", "Unit testing", "Apache", "javascript", "quality", "nosql", "developer", "MVC", "support"]}