{"Job Title": "Software Developer", "Company": "Cyber Infrastructure (P) Limited", "Experience": "1 - 6 years", "Salary": "Not Disclosed", "Location": "Indore", "Job Description": "Software Developer - #CIS- PFR- 10 CIS- PFR- 10 1- 3 year Educational Qualification(s) BE/ ME/ B. Tech/ M. Tech/ MCA/ MCM/ BCA/ Msc. PGDCA/ or equal vent Overview of Job Project work undertaken will be development and unit testing of straightforward or low complexity components. The main responsibility is to follow low- level designs, supported by colleagues and team leaders. May assist in any other aspect of the project life- cycle under supervision. Will still be developing technical and team working skills Duties & Responsibilities May assist in requirement gathering under supervision. \n\nTo be a part of developing team of high end PHP/ MySQL applications & portals. \n\nAssist in the design, coding, and testing of technical solutions \n\nUnderstand standard systems development lifecycle processes and apply our methodology effectively on client engagements \n\nDevelops technical knowledge and awareness of those technical areas in which requested to code. \n\nAccurately records own time and accurately reports progress on own work. \n\nComplies with all confidentiality and non- disclosure policies and/ or agreements and ensures security of information at all time \n\nLearning new web related technologies and providing support in implementation in various projects as and when needed \n\nResponsible for meeting deadlines and adherence to set coding standards \n\nMinimum Requirements \n\n1+ years of working experience required in PHP with any framework Symfony, Laravel or YII, Zend, codeigniter \n\nStrong understanding of Technical relevant Concepts \n\nLogical thinking \n\nWilling to learn new technologies \n\nEffective Communication and interpersonal skills \n\nStrong analytical and problem solving skills \n\nGood knowledge of Javascript/ JSON/ AJAX \n\nBasic knowledge of any JS framework. \n\nWork in a team with minimal supervision \n\nGood understanding on DBMS and relational database Any query related to job \"Ensuring success of our clients and partners through highly optimized Technology solutions while enhancing the quality of life for our workforce and community. \"\n\nOur Core Values \n\nAccountability", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["development", "Policies", "technical", "software", "level", "testing", "developing", "quality", "database", "Symfony", "Coding", "web", "Analytical", "MySQL", "PHP", "developer", "DBMS", "MSC", "Open source", "support", "Ajax", "applications"]}