{"Job Title": "Principal Software Development Engineer", "Company": "Hotstar", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": "     As a Principal Software Development Engineer,  you will help define and architect products,  algorithms,  and data systems that deeply integrate core software and services to drive innovations. You will obsess over data,  metrics,  algorithms,  mechanisms,  and incentives that unlock innovation and scalability opportunities across the company. This role is inherently cross- functional,  working with core software systems across the company.    The pace of our growth is incredible if you want to tackle hard and interesting problems at scale,  and create an impact within an entrepreneurial environment,  join us!  Your Key Responsibilities    Serve as a technical lead on our most demanding,  cross- functional projects.     Ensure the quality of architecture and design of systems.     Functionally decompose complex problems into simple,  straight- forward solutions.     Analyze and improve data quality and metrics.     Fully and completely understand system interdependencies and limitations.     Leverage knowledge of internal and industry in design decisions.     Assist in the career development of others,  mentoring on advanced technical issues and helping managers guide the career growth of their team members.     Exert technical influence over multiple teams,  increasing their productivity and effectiveness by sharing your deep knowledge and experience.   What to Bring    BE / B.Tech /M.Tech in Computer Science,  Data Science,  or a related field with 10+ years of experience.     Minimum 8+ years of experience building large scalable systems     Strong experience in architecting and building multi- threaded,  distributed systems.     Strong knowledge of data structures,  algorithms,  and designing for performance.     Outstanding problem- solving abilities.     Ability to achieve stretch goals in a highly innovative and fast paced environment.     Sound business judgment,  proven ability to influence others and strong analytical thinking skills.     Solid background with hands- on experience as a Principal- level software development engineer.     Extensive experience of mentoring junior engineers to success.     Entrepreneurial spirit and willingness to have fun!  ", "Role": "Technical Architect,", "Industry Type": "Internet, Ecommerce,", "Functional Area": "IT Software - eCommerce, Internet Technologies,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial", "PG": "M.Tech in Electronics/Telecommunication", "Doctorate": "None", "Key Skills": ["Computer science", "Career development", "data science", "Analytical", "Data structures", "Technical Lead", "Data quality", "Architecting", "Distribution system", "Principal"]}