{"Job Title": "Senior Software Developer - PHP", "Company": "UrbanDart.com", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "  The right candidate:     You have at least 5 years of experience in application development.     Proficient in PHP, MySQL, Javascript, HTML5, CSS3, Debugging.     Strong understanding of CS fundamentals, Object Oriented Design and Data Structures.     Have experience in basic cross browser support, caching and optimization techniques (css sprite, minify, gzip, data uri) for faster page load times.     Solid knowledge of whole web networking stack: Back-end, Front-end, Databases, HTTP Protocol.     Genuinely excited about technology, have a strong interest in learning and playing with the latest technologies.     Excellent communication and writing skills in English.     A Startup Guy: Self motivated and someone who would not shy away from taking ownership and responsibilities in a challenging environment.     Product Engineering: Passionate about developing amazing products along with a team of product managers and the engineering team. Always excited about problem solving and not scared to make mistakes to learn faster.     Play Smart: You need to get things done. Requires you to have the right mix of experience, understanding of businesses, prioritization skill.     UI/UX Experience, Mobile Development, server administration is a plus. Remember, it's a startup; Time is of essence. You should have the drive to excel in fast paced environment and love what you do. You have an entrepreneurial bent of mindset with curiosity to learn new technologies and anything that adds to growth of the company as well as your personal growth.   Helpful Skills    Experience in working for a startup  Education:   BE/BTech/MS/MTech/MCA/Phd in Computer Science ", "Role": "Software Developer,", "Industry Type": "Advertising, PR, MR, Event Management,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial", "PG": "M.Tech in Electronics/Telecommunication, MCA in Computers", "Doctorate": "None", "Key Skills": ["Front end", "Networking", "MySQL", "Debugging", "Javascript", "PHP", "Data structures", "Application development", "HTTP", "CSS3"]}