{"Job Title": "Engineer - Software Development", "Company": "GRAVITAS", "Experience": "2 - 3 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "              DESCRIPTION    The Software Engineer - offshore will be part of an agile development team, building and working on an enterprise level software system utilizing the JAVA development stack. Our systems need to meet remarkably high standards of quality, performance and reliability, operating around the clock on a large and growing scale.     ESSENTIAL DUTIESRESPONSIBILITIES     Build robust and scalable software in Java Angular Ruby and Rails   Design and create services and system architecture for your projects, and contribute and provide feedback to other team members.   Help improve our code quality through writing unit tests, automation and performing code reviews.   Collaborate with multidisciplinary team of Back-End Software Engineers, Project Managers and System Administrators.   Participate in brainstorming sessions and contribute ideas to our technology, algorithms and products   Participate in peer-reviews of solution designs and related code.   Work with the product and design teams to understand end-user requirements, formulate use cases, and then translate that into a pragmatic and effective technical solution.   Analyze and resolve technical and application problems.   Maintain high standards of software quality within the team by establishing good practices and habits.   Contribute to the technical and process innovation of the engineering department as a whole.   Work autonomously, excited by new technologies and will never back down from the challenges of scale.   Experience in developing software using java language.   Knowing AngularRuby and Rails language is a plus.   Experience working with LinuxUNIX environments   Experience working in OracleSQL serverPostgres database   Knowledge of web services in REST and SOAP   Knowledge in Microservice architecture is a plus   Knowledge in cloud-based services is a plus.   Extensive experience with open-source technology, software development and system engineering.   Excellent communication and organizational skills, and the ability to stay focused on completing tasks and meeting goals within a busy workspace.   Interest in Cloud Engineering and its impact on greater business practices.   Skilled at working in tandem with a team of engineers, or alone as required.     Requirements    Bachelor's or Masters Degree in Computer Science or Engineering; Master's degree a plus.   2 to 3 years experience with all phases of the software development life cycle, best practices and Agile Software Development.   Solid OOP and software design knowledge you should know how to create software that's extensible, reusable and meets desired architectural objectives.   A strong familiarity of Web application technologies including Apache, Tomcat and J2EE.              ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Unix", "System architecture", "Automation", "Software design", "Linux", "Agile", "J2Ee", "Software Development Engineer", "Open source", "Ruby"]}