{"Job Title": "Senior Software Engineer  Guidewire Digital Portal Frontend Developer", "Company": "CGI Information Systems and Management consultants", "Experience": "3 - 9 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "  Works independently under limited supervision and applies knowledge of subject matter in Applications Development.    Possess sufficient knowledge and skills to effectively deal with issues, challenges within field of specialization to develop simple applications solutions.    Second level professional with direct impact on results and outcome.     Consult with project sponsors regarding information flow and content including the facilitation of information gathering sessions   Work with a Business Analyst and/or users to understand requirements   Knowledge of database and development methodology, principles, and procedures is expected   Utilization of software and techniques in the analysis and interpretation of complex data sets is expected   Design and produce comprehensive computerized data queries and reports   Consistently honors promise and commitments and takes responsibility for own actions, words, and work   Able to work with diverse individuals/teams/customers. Able to interact and work with others as part of a team.   Takes the lead to get complex issues resolved. May require assistance for more difficult issues   Ability to work within a changing environment   Good organizational and written/verbal communication skills   Good presentation skills   Positive attitude and team focus are required    Required qualifications to be successful in this role:    EXP :   3-9 yrs   Must have:- Guidewire Digital Portal, ReactJS, NodeJS, Bootstrap, HTML, JavaScript, Css   Hands on experience:- GW Digital Portal Backend knowledge, Gosu Edge Implementation   Project management tools: Jira, Crucible, SVN, Jenkins, Octopus     Skills:    Guidewire Configuration  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["HTML;Javascript", "Backend", "Front end", "CGI", "Business Analyst", "Project management", "jenkins", "bootstrap", "JIRA", "digital transformation"]}