{"Job Title": "Senior Software Frontend Engineer- React Developer", "Company": "INFI TECHNOLOGIES PRIVATE LIMITED ", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": "What you will be doing here: Build global SAAS products from scratch for SMBs Be hands-on in development, including test automation Perform design and code reviews for the team Collaborate with teams and share knowledge via tech talks and promote tech and engineering best practices within the team.Technical Skills Required: B-Tech from Tier 1 engineering colleges 3+ years of relevant experience in front-end engineering Should be skilled in React JS Comfortable with HTML, CSS Should be comfortable in building and optimizing responsive web applications Should be able to work with Browser and device compatibility issues Able to conceptualize visual design and implement the same in code Thorough in testing and front-end testing frameworks Ability to write well-crafted, readable, testable, maintainable and modular code Soft Skills Required: A hard-working, humble disposition. Desire to make a strong impact on the lives of millions through your work. Capacity to communicate well with stakeholders as well as team members and be an effective interface between the Engineering and Product/Business team. A quick thinker who can adapt to a fast-paced startup environment and work with minimum supervision.Why you should join us: Opportunity to build products for SMEs globally from India and have a 360-degree experience of building a global SaaS business. Top class Engineering, Product and Design work in India. Be an early member of a small team of passionate rockstars building scalable and disruptive products having a global impact. Join the startup led by an experienced founder and opportunity to have exponential growth in learning. Goes without saying, ensuring fun at the workplace via regular parties and company-sponsored semi-annual team trips.You will be part of a young but experienced team. Its going to be a long journey and will ensure you have fun, excitement, and inspiration along which will have a lasting impact.  If you are an ownership driven individual, come and have tea/coffee with us. ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Automation", "CSS", "SMB", "react", "SME", "Node.Js", "HTML", "Backbone.Js", "JQuery", "Web Designing", "Codeigniter", "Front End", "MySQL", "Javascript", "Automation Testing", "developer", "React.Js", "device compatibilty"]}