{"Job Title": "Lead Software Engineer - Java Backend developer", "Company": "Informatica", "Experience": "7 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  The Adapter product team is responsible for research, development and delivery of connectivity needs to the Informatica Platform that is at the core of Informatica s products. The adapters need to not only be highly performing, scalable and extensible, but also needs to provide differentiated and advanced features such as change data capture, push down optimization, filtering and update strategy to name a few.      Your Opportunity      The position is suited for highly motivated and energetic individuals with a desire to work on the development of high-performance products.      You will work on delivering new products/product features in an environment that spans all flavors of Unix/Windows operating systems. You will work across multiple product lines and deliver solutions that benefit customers.      Research and Development include areas such as:       Influence and champion Connectivity frameworks (Software Development Kits) to enable productive development of Connectivity solutions. This would include frameworks necessary on our Development Tools as well as our Runtime-platform side.       Influence product direction and architecture while developing our next generation Connectivity solutions. There is a significant future architectural direction and this position involves influencing, defining and refining this for the needs of this product area.       Sustaining product base by responding to reported problems, investigating the cause and working out solutions.       Supporting Product Management on POC s and Customer engagements.       Provide technical leadership focusing on research development of new solutions while enhancing and maintaining existing products.       Deliver high quality products.       Product extensibility, including SDK/API definition for metadata, data and management components of products.       Our Ideal Candidate       One who has advanced problem-solving skills and technical aptitudes that will allow one to adapt to new circumstances and learn quickly when facing new problems and challenges.      One who constantly thinks of innovating and creating great products and features that will solve real customer needs.       Your Responsibilities      As part of the Development team, you will be responsible for:      Active participation in Designing and Development of new products and features       Take the products/features through the full software development life cycle and deliver compelling customer experiences       Mentor junior members in the team       Proactively research and investigate external products and technologies identifying emerging trends and revise software development best practices to take advantage of these       Help architects and management staff envision product direction       Perform an advisory role in several features of a release       Pro-actively review and ensure best design and implementation of features within the team       Your Qualifications       Strong academic background B.E/MS/PhD in Computer Science from top schools.       Strong background in product development particularly in middle-ware / framework level software. Good focus on performance and design issues and expertise with building large-scale enterprise products is desirable.       7-10 years of Enterprise Software Development experience with a strong technical background in Java       Capability of leading the team       Ability to apply abstract concepts and innovative ideas to business problems       Good written verbal communication skills.   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Unix", "Product management", "ERP", "SAP", "Management Staff", "Windows", "Informatica", "SDK", "Oracle", "microsoft"]}