{"Job Title": "Senior Software Development Engineer", "Company": "ExecBoardinAsia", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Noida", "Job Description": "  As a Senior Software Engineer, you will have the opportunity to play a key role in testing, developing, and innovating together as you bring your considerable software engineering skills to their dynamically growing organization.    The ideal candidate would be innovative and have great problem solving, communication and analytical skills.    HeShe should be able to understand how to automate tests, isolate and document issues. And will be comfortable with either a Microsoft or Linux environment.    They are an agile development shop. Collaborate with software engineers, quality engineers, scrum masters, product owners, and their architecture team, to develop multi-tier, multi-layered application layer framework, and functional components.      Responsibilities include:     Plan, develop, review, automate and execute test cases   Guide engineers in developing tests   Participate in product and feature design with developers, usability specialists, user interface designers, and product managers. Participate in functional reviews of specifications.   Participate in cross team and milestone testing activities   Diagnose, track, and manage quality issues to resolution. Scrub tickets by reproducing problems, identifying regressions, clarifying impact, and filtering out duplication   Develop integration tests, performance tests, and scale tests for the company Core products suite   Participate in and contribute to code reviews   Test environments when new builds are pushed   Automate test cases and plans for validating features in a SaaS environment   Adhere to quality best practices throughout the product development life cycle   Take ownership of your work and continuously strive for improvement   Self-motivated to acquire additional technical skills.  ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Analytical skills", "Test case execution", "Linux", "Agile development", "Scrum", "Test cases", "microsoft", "Open source", "Business applications", "Testing"]}