{"Job Title": "Senior Product Software Engineer (Java Developer)", "Company": "Wolters Kluwer India Pvt Ltd", "Experience": "5 - 8 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "     Desired Competencies:           4 years of experience in software development using Java, JavaScript, JEE technologies, any RDBMS.      Experience working in SSIS, spring and hibernate.      Experience working in Agile environment is a plus      Ability to write SQL queries with high level complexity      Good understanding of source control systems (SVN) and release management.          General Responsibilities :           The Software Engineer will take an active role in completely understanding product / customer implementation specifications as defined in the functional / technical / abstract design documents, and implement / enhance / test / configure the custom solutions meeting the quality standards.      The role holder will be responsible for working independently on projects, guiding junior members and for deliverables and ensure on time delivery.      Responsible for understanding business and product / project requirements and translating them to programming / QA deliverables that adhere to the product / project roadmap      Responsible for problem analysis and solution design, mentoring/guiding junior team members, tracking project metrics (KPIs) for the project, and ensure timely escalation of issues to the concerned functional lead      Work and understand the product capabilities really well enough to make the right decisions around design, configuration and implementation.      Keep up with the latest technologies and trends and assist with recommendations on innovative solutions where needed      Responsible for understanding the base products functionality Passport/T360.      Support and assist Associate Software Engineers and Software Engineers by providing advice, coaching and educational opportunities.      Responsible for problem analysis, solution approach in designing, developing, Testing and implementing a maintainable solution      Responsible for fixing defects, troubleshooting issues and ensuring timely delivery.         Role Specific Responsibilities:               Responsible for developing software code with limited or no assistance from the Supervisor and unit testing deliverables to meet quality standards, debugging and troubleshooting problems and time bound delivery of assigned projects .     Follow the development best practices and coding standards      Responsible for working with technical/functional leads in understanding requirements      Tests code to ensure that logic and syntax are correct, and that program results are accurate; assists ASEs and SEs with programming assignments.      Responsible for working with QA team on test automation and continuous integration activities      Focus on improving the quality of code developed.    ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Hibernate", "RDBMS", "Coding", "Debugging", "Javascript", "Agile", "Unit testing", "SSIS", "Troubleshooting", "Release management"]}