{"Job Title": "Senior Software Engineer - Full stack Developer", "Company": "Informatica", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   Your Responsibilities        The successful candidate will be based in Bangalore, INDIA and will be responsible for:        Developing a scalable architecture that meets the needs of massive data in a distributed computing environment         Building highly interactive applications based on open-source technologies, Java, AWS technologies.         Working in a small agile team of highly motivated and energetic professionals         Analyzing, defining and documenting the requirements, driving the design & implementation.         Working with product managers, quality assurance engineers and user experience designers to build the best products for our users         Mentoring junior engineers on technical, architectural, design and related    issuesRepresentative   accountabilities may include, but are not limited to:          Leading and driving the delivery and architecture for large functional areas of the    product.Driving   successful POCs, involving latest cloud based technologies.         Interacting with QA and documentation teams to clearly communicate the features and behaviors of the system         Assisting customers and field engineers with troubleshooting issues and problems         Your Qualifications         B   S/MS/PhD   in Computer Science or related technical discipline         3 or more years of professional software development experience in    developing innovative enterprise products using    object-oriented languages.          You have excellent knowledge and experience in Java and Java Enterprise.         You have experience in thin client technologies like     Java      Script     ,     ES6     , HTML5, CSS3, jQuery,      React JS     .          Excellent coding and design skills in Java    client and    server-side technologies.            Strong experience in development tools like Eclipse,   Maven, Tomcat,   Jira and Perforce   is mandatory   .         Extensive experience   in database concepts, SQL programing is mandatory and     experience in    at least one of the following databases: Oracle, SQL Server, DB2, Sybase.         Deep knowledge of core java libraries and common design patterns.         Strong experience in web technologies like Servlets, Spring, Tomcat         Mastery of multi-threaded computing and high competency with the Java concurrency libraries         Good working knowledge of Hadoop technologies like    Hbase   ,    Tital   ,    Solr   is a plus         Exposure to and experience with applications like Oracle, SAP, Tableau, Power BI,    SalesForce   ,    Microstrategy   , Qlik View, etc. will be an added advantage.          Having experience in OSGi is plus.         Good knowledge of working in a Unix environment (shell scripts, build systems) is a plus         Highly effective communication and interpersonal skills         Able to learn quickly in a dynamic environment.          Strong    problem solving,    troubleshooting   ,   debugging   and analytical   skills   .         Energetic and motivated self-starter   .           Ability to think creatively   .         Familiarity with Agile development process      ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Unix", "Core Java", "Tomcat", "SAP", "jQuery", "Db2", "Informatica", "Oracle", "Troubleshooting", "SyBase"]}