{"Job Title": "Principal Software Engineer (Full Stack Developer)", "Company": "Tekwissen Software Private Limited", "Experience": "8 - 12 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Job Title: Principal Software Engineer ( Full Stack Developer )Duration: 3 MonthsLocation: Bangalore, IndiaACCOUNTABILITIES:Designs, codes, tests, debugs, and documents software according to systems quality standards, policies and procedures.Analyzes business needs and creates software solutions.Responsible for preparing design documentation.Prepares test data for unit, string, and parallel testing.Evaluates and recommends software and hardware solutions to meet user needs. Resolves customer issues with software solutions and responds to suggestions for improvements and enhancements.Works with business and development teams to clarify requirements to ensure testability. Drafts revise and maintain test plans, test cases, and automated test scripts.Executes test procedures according to software requirements specificationsLogs defects and makes recommendations to address defects.Retests software corrections to ensure problems are resolved.Documents evolution of testing procedures for future replication.May conduct performance and scalability testing. RESPONSIBILITIES:Plans conduct and lead assignments generally involving moderate, high-budgeted projects or more than one project.Manages user expectations regarding appropriate milestones and deadlines.Assists in training, work assignment, and checking of less experienced developers.Serves as a technical consultant to leaders in the IT organization and functional user groups. Subject matter expert in one or more technical programming specialties; employs expertise as a generalist of a specialist.Performs estimation efforts on complex projects and tracks progress.Works on the highest level of problems where analysis of situations or data requires an in-depth evaluation of various factors.Documents evaluate and researches test results; documents evolution of testing scripts for future replication.Identifies, recommends, and implements changes to enhance the effectiveness of quality assurance strategies.Key Responsibilities:Design, build, deliver, maintain highly available and scalable products that provide premium customer experiencesExercises considerable latitude in determining technical objectives, without appreciable direction.Work closely with the global development team and senior Solution Architects, and executives to plan ongoing feature development and product maintenanceOwns the products developed and their outcomesDevelop web-based applications using modern web technologiesClearly communicates progress, issues, and statuses as a member of an agile teamEssential Requirements:Full Stack Developer with strong working experience in Java, SpringBoot, MicroServices, Cloud.Expertise in JavaScript, Angular / React, HTML5, CSS3, NodeJS, JQuery.Experience in one of the NoSQL  Mongo / ELK / CassandraHands-on experience in designing and implementation of rich UI on an enterprise scaleExcellent code detective and root cause analysis skills on a variety of platforms and languagesUnderstanding of virtualization technologies.Experience in working on large scale enterprise application development and deploymentsKnowledge of version control, bug tracking systems, automation (Git, JIRA, Jenkins).Experience with CI/CD orchestration with Jenkins / Gitlab CI / Ansible or equivalentKnowledge of Linux (advanced user).Experience with cloud-native architectures and infrastructureKnowledge of using and building Docker-based deploymentsExcellent written and verbal communication skillsAbility and desire to learn new skillsDesired Requirements:Experience in ServiceMesh, API Gateway, Istio Framework is a great plusKnowledge of CPU architecture, Multi-Threaded Environments, Databases, Storage TechnologiesExperience with PythonFamiliarity with Data Engineering Techniques and Data Science toolsQualifications:Bachelor's degree in Computer Science, Information Systems, or a related field with 8+ years relevant experienceTypically requires 10+ years of related experience, 2+ years of experience in leading engineers technically.", "Role": "Technical Architect,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "Doctorate": "None", "Key Skills": ["Application Development", "Java", "NoSQL", "GIT", "Html5", "Web Technologies", "Javascript", "JQuery", "Angular", "Python"]}