{"Job Title": "Software Development Engineer", "Company": "EthicalHat Cyber Security", "Experience": "2 - 7 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": " Software Development Engineer   Our team is looking for an experienced Software Development Engineer who understands how the internet is organized and has experience building applications that run on an Internet - scale. We highly value experience in the Open Source Intelligence community.    Basic Qualifications    BS degree or higher in Computer Science, Engineering or a related field.   Highly skilled in at least one programming language like Python, C# or Java.   Intimate understanding of allocation and assignment processes, conventions, and best practices for domain names and IP addresses   2+ years of non - internship professional software development experience.   1+ years of engineering management experience   1+ years of experience contributing to the architecture and design (architecture, design patterns, reliability, and scaling) of new and current systreferred Qualifications.   Experience in networking and/or anti - Internet - abuse communities.   Knowledge of professional software engineering practices & best practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations.   Experience with No - SQL, Python, AWS Serverless, Containers, Django, and RDBMS   Experience with HTML, XML and CSS  Job Features Job Category Software Engineer", "Role": "Software Developer,", "Industry Type": "Education, Teaching, Training,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["SAN", "Networking", "RDBMS", "Coding", "XML", "HTML", "Open source", "Internship", "SQL", "Python"]}