{"Job Title": "Software Engineer - Android Developer", "Company": "GigipO", "Experience": "3 - 4 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "We are looking for a Software Engineer specialized in Android App development using Kotlin to be a part of our Development Team.Roles and Responsibilities  As an Android Developer, you will develop and maintain our video streaming Android appsWork closely with the frontend web development team and backend NodeJS developers to integrate the app with our product.   Collaborating across the teams, you will get the opportunity to design, develop, test, implement, and optimize our application for efficient functioning and scaling.  Technical Qualifications 3+ years of demonstrated end-to-end experience building, testing, and shipping commercially available Android apps using Kotlin 3+ years of Java development experience Experience interacting with backend infrastructure through RESTful JSON APIs Experience with Flutter and porting app from Kotlin to Flutter will be a huge plus Experience with cloud platforms will be added advantage (preferably AWS)Job Requirements At least 3+ years of experience building highly available backend services that can handle a video streaming platform  Strong team player  Go-getter and problem solver who enjoys technical challenges Hands-on experience in software engineering and best practices Excited to explain complex technical concepts and share knowledge with diverse audiences both internally and externally Able to anticipate future technical needs for the product and craft plans to realize them Bachelor's degree in Computer Science, Engineering or related field, or equivalent training, fellowship, or work experience Experience writing well tested, clean code and building CI/CD pipelines to deliver solutions as quickly as possible Working knowledge of GIT or similar code commit tools", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization, B.Tech/B.E. in Electronics/Telecommunication, Computers", "Doctorate": "None", "Key Skills": ["Android Application Development", "Software Engineering"]}