{"Job Title": "Senior Software Engineer (Java Developer)", "Company": "Agreeya", "Experience": "5 - 9 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "    ESSENTIAL DUTIES AND RESPONSIBILITIES    Design and develop new software by applying techniques of computer science, engineering, and mathematical analysis that satisfies the objectives stated in business requirements. Follow industry best practices, techniques and standardized processes that deliver improved software solutions. Be available for testing/support on scheduled deployment dates that are designated by the standardized change management process. (50%)   Evaluate and select process and logic patterns, programming language constructs, data storage methods, and operating environment interfaces that effectively satisfy business requirements and quantifiable measures; develop appropriate programs and systems documentation according to established department standards. (20%)   Collaborate with architects, systems engineers, project managers, systems administrators, and operations analysts to deploy and implement solutions, and troubleshoot technical issues. (10%)   Participate in collaborative code reviews conducted with colleagues and team members; coordinate the deployment and implementation of software solutions. (5%)   Certify the proper functioning and performance of software components using repeatable, reproducible, and reportable software testing methodologies. (5%)   Evaluate new technologies for inclusion in developed software solutions; introduce new industry standards and techniques that deliver improved software solutions. (5%)     SUPERVISORY RESPONSIBILITIES:     This Job has no supervisory responsibilities but in special circumstances may lead the work of others.     DECISION-MAKING RESPONSIBILITIES:     This job requires some independent decision making, but actions are guided by clearly defined standards and processes. This position functions under the normal level of manager supervision.    EDUCATION/EXPERIENCE:     Minimum Required Education:    Bachelors degree in software engineering or related technical field, or the equivalent combination of education and experience.      Minimum Required Experience:     5 years of experience in software solutions development preferably in medium to large corporate environments or commercial software companies.   Expert knowledge of Java EE (or J2EE) including EJB, Hibernate, JPA   Expert experience with the industry standard IDEs RAD, Eclipse, Visual Studio, WebStorm, VSCode.    Experience with SQL and relational databases (DB2/UDB, Oracle, MySQL).   Experience with data marshalling, data transformation, and data representation technologies (Model entities, JSON, HTML, XML, Stylesheets).   Experience with rapid programming, agile development, software patterning, and refactoring techniques   Experience with process communication techniques (shared memory, message queues, data streams, semaphores).   Experience with creating and consuming distributed data services (REST APIs, Messaging Buses).   Expert knowledge of the strengths and weaknesses of common programming languages (C, C , C#, Java, Visual Basic, JavaScript, TypeScript).        Desirable Education/Experience:     Bachelors degree in software engineering or related technical field.   Working knowledge of JSF, Java Script, JSP   Strong written and verbal communication skills in technical settings and with internal management. Well-developed active listening and presentation skills.   Solid knowledge of IT software development life cycle methodologies and processes, including usage of source control tools   Strong time management, prioritization skills, and techniques for managing customer expectations.   Logistics industry experience.       CERTIFICATES AND LICENSES  :    NA    JOB RELATED COMPETENCIES:     Analytical Skills -     Demonstrated complex analytical capabilities.   Ability to apply understanding of functionality of event driven business models.   Focus on data driven analysis for solutioning and problem solving.   Encourages creative problem solving and lateral thinking to foster innovative solutions.   Identifies opportunities to increase accuracy and optimize resources; develops/recommends/implements solutions.      Communication Skills     Strong verbal and written communication including presentation, facilitation and active listening skills.   Utilizes variety of interpersonal styles and communication methods to effectively adapt to new work structures, processes, or cultures.   Ability to communicate technical data to non-technical audience.   Strong customer service skills to consistently meet the expectations and requirements of internal and external customers, and gain trust and respect.      Time Management Skills -     Strong time management skills with ability to organize, negotiate and prioritize regular workload, special tasks and concurrent projects, allocating time and resources to ensure that work is completed accurately and efficiently within established time frame.   Provides timely and professional support to all internal/external customers and vendors.      Other   -    High-level learning agility.   Passionate, self-motivated; works with a sense of urgency under minimal supervision within a fast-paced environment.   Maintains strict confidentiality, high integrity, and high reliability.   Self-motivated; works with a sense of urgency under minimal supervision within a fast-paced environment.   Team-oriented and strong interpersonal skills. Consults with team members and management as needed to complete assigned responsibilities.   Works cross-functionally; establishes and maintains effective, collaborative work relationships both internally and externally.   Maintains strict confidentiality and has a high sense of urgency, high integrity, and high reliability.       Technical Competencies & Computer Skills    Fluency of Windows applications and Microsoft Office programs such as, Word, Excel, Outlook and PowerPoint.   Quickly learns and achieves proficiency in new software applications as needed.   Ability to learn internal company software applications applicable to position/business unit.   Understands and is familiar with the most widely known and emerging tools, technologies and social applications.      WORK ENVIRONMENT & PHYSICAL DEMANDS -     Work Space      This job operates in a professional office / cubicle environment with moderate noise level. This role routinely uses standard office equipment such as computers, phones and photocopiers.     ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Hibernate", "Db2", "XML", "JSP", "MySQL", "Javascript", "J2Ee", "HTML", "Oracle", "SQL"]}