{"Job Title": "Senior Software Engineer/Developer", "Company": "Freestone Infotech Pvt. Ltd", "Experience": "4 - 8 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": "Roles and Responsibilities Position Title: Senior Software DeveloperOpportunity to work with a Silicon Valley based security and governance startupAbout PrivaceraPrivacera, Inc is a California based start-up company that is looking for Senior Software Engineers to work out of our Mumbai based office. Privacera is a cloud-based product which uses Cloud native services in AWS, Azure and GCP. Privacera is a fast-growing start-up and provides ample opportunity work on all Cloud services like AWS S3, DynamoDB, Kinesis, RedShift, EMR, Azure ADLS, HDInsight, GCP GCS, GCP PubSub and other services. https://www.privacera.comAbout our companyFreestone Infotech is a global IT solutions company providing innovative best-in-class turnkey solutions to enterprises worldwide and is a partner to Privacera in Mumbai. http://www.freestoneinfotech.comWe are looking for motivated individuals who have worked on Cloud and Big Data or keen on working on Cloud or Big Data services. If you want to work in a start-up culture and are ready for the challenge, then join us on our exciting journey.Core Experience:     Strong hands-on experience on Java     Used linux based environment     Used GIT and MavenPreferred additional working experience on some of the below:Big Data - Apache Spark, Apache Kafka and Apache HBaseAWS - EMR, RedShift, Athena, Glue, DynamoDB, S3Azure - ADLS, HDInsight, PowerBIGCP - GCS, DataProc, PubSub, BigTable and Big QueryDatabricks, Snowflake, Starburst Presto, PrestoDB, PrestoSQLDockers and KubernetesJob Responsibilities:Build enterprise grade product using some of the followingCore JavaCloud native servicesLeverage Docker and KubernetesWork with QA and help them testingWork with Technical Writer and help them documenting the features you have developingHelp support team to resolve issues raised by end customers of the productEducation and Experience:Bachelor’s / Master’s degree in Computer Science or Information Technology or a related field.5+ years of experience in software development using Java and/or Cloud Services.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "Doctorate Not Required", "Key Skills": ["Maven", "kubernetes", "Big Data", "databricks", "dockers", "cloud", "Core Java", "Software Development", "Presto", "GIT", "GCP", "snowflakes", "Spark", "aws", "azure"]}