{"Job Title": "Software Engineer - IOS Developer", "Company": "Flatirons Solutions", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "Roles and ResponsibilitiesFlatirons Solutions India Pvt Ltd. is hiring Software Engineers for our Engineering Operations Organization in Chennai, India. Join us as we employ world-class software engineering practices to solve complex Content Lifecycle Management (CLM) problems in some of the most interesting problem spaces in the industry today. Our solutions are used in a wide range of functions within these organizations and include technical engineering order management, documentation authoring and publishing, flight operations manuals, data archiving, and other workflows, documentation, and maintenance products.Flatirons India is recognized as one of the best medium-sized companies to work for in 2020 by the Great Place to Work- Institute.As a Software Engineer, you will :- Be part of a team of 3.5-10 engineers working to install, configure, customize and integrate our CLM solutions for customers across the Aviation, and Aerospace manufacturing industry- Consult with team members and customers to ensure project success, including:- Understanding requirements- Estimating your work timeline to manage your deliverables- Employ Agile/Test Driven Development (TDD) best practices:- Work with Tech Lead to break down your assigned user stories into tasks- Write and test user stories- Write code to implement requirements in a TDD process- Refactor code to improve quality- Track your work in JIRA or other task management software- Write and maintain efficient, reusable, and reliable code.- Ensure the best possible performance, quality, and responsiveness of the applications- Identify bottlenecks and bugs, and devise solutions to these problemsWe'd like to talk to you if you have :- 4-6 years of experience in developing iOS native Apps or Cross-platform applications- Bachelor's degree in Computer Science, Computer Engineering or related field- Strong command over Objective C and Swift- Working knowledge of HTML5 & CSS, SQLite, and JavaScript- Basic understanding of Cordova-iOS and build generation procedures- Proficiency with push notifications and cloud message APIs- Experience with integrating Third-party libraries.- Good knowledge of XCode, Cocoa frameworks such as Core Data, Core Animation, Core Graphics, Core Audio, and Core Text- Familiarity with performance tuning, threading, and offline storage- Strong command over Web APIs, ability to connect IOS apps to back-end services like APNS- Familiarity in publishing iOS Apps to the App Store- Inquisitiveness to become a full-stack developer- Proficient understanding of code versioning tools, continuous integration- Good understanding of Agile process- Familiar with various design and architectural patterns- You must be a good communicator and speak and write fluently in English- Flatirons Offers- An exciting job in a global atmosphere working with state-of-the-art technology, talented, dedicated, and experienced colleagues, and world-class, technology-driven customers. Flatirons is the type of organization where you will be able to have a significant impact in a growing marketplace, make yourself heard, and contribute to our overall success. We offer you a competitive salary and benefits, as well as a high degree of independence and flexibility.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Mobile,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers, BCA in Computers, B.Sc in Computers", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": [" ios Sdk", " Core Graphics", " IOS Developer", " application developer", " Objective C ", " ios developer", "Memory Management ", " mobile software developer", "ios mobile application developer", " Core Data", "Swift", " Mobile Application Developer", "Core Animation", "Cocoa Touch"]}