{"Job Title": "Software Development Engineer -Test Automation,/Python/Networking", "Company": "ViaSat, Inc.", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "  Job Description     As a member of our DevOps team, you will be involved in all aspects of software engineering of components that help build Viasat s products and services.    This includes participation in research, design, development, testing, debugging, automation and operational activities of the software component(s) that the individual or team is responsible for.    You will be responsible for delivering professional quality software using sound software development methodologies with support and guidance of experienced senior developers and architects.    Viasat s product offerings are innovative and involve cutting edge technologies and ideas, which are sure to challenge your creativity and skills. Our production systems run at massive scale and hence systems need to be high performance and robust.   While strong software development skills are a must, an ideal candidate would have a blend of skills in Virtualization, Operating Systems, Network Programming, Networking Protocols, Cloudbased systems and Automation.    Our team members enjoy working closely with each other utilizing an Agile development methodology.    Priorities can change quickly, but our team members are able to stay ahead of deadlines to delight every one of our customers whether they are internal or external to Viasat. Travel up to 10%.      Required Skills     5 year s hands-on experience in test and automation and creating test plans in a team environment with proven success at delivering production quality systems.    Programming skills in Python, Ansible, Go, Scripting.    Strong foundation in data structures and good understand of algorithmic complexity and trade-offs of different implementations.    Creative debugging skills using tcpdump, ping, wireshark, gdb, coredumps and other commonly used tools.    A good understanding networking concepts, network programming, and virtualization is required.    Masters/Bachelor of Engineering/Bachelor of Science or equivalent experience.    Excellent verbal and written communication abilities. You will be required to communicate both verbally and in written form with remote international teams very frequently.      Preferred Skills     Experience with tools such as Splunk, Grafana, AWS constructs, Test Automation Frameworks desired.    CI/CD and Devops exposure is a strong plus.      Additional Requirements and information      Minimum education     BA/BS or equivalent experience.  ", "Role": "Software Developer,", "Industry Type": "Telcom, ISP,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Sc in Chemistry, Any Graduate in Any Specialization, B.A in Other Specialization, B.Tech/B.E. in Production/Industrial", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Network programming", "Networking protocols", "Networking", "Quality systems", "Debugging", "Data structures", "Genetics", "Virtualization", "Python", "WireShark"]}