{"Job Title": "Junior Software Developer", "Company": "Stafford Global", "Experience": "0 - 2 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "   Job Description      Must have good knowledge of Microsoft .NET,C# and SQL Server    Must have good knowledge/training of ADO .NET, .Net MVC and Entity Framework    Develop detailed requirements documentation of future MS .Net / MVC framework landscape, application systems and web development (custom development) roadmap    Provide administration, maintenance and deployment support during user testing and production release    Support custom web application functionality being built on C#, HTML, JavaScript, SQL Server, and search services    Build new web modules, enhancements, fix issues, and other development assuring high quality,performance, scalability, maintainability and best practices.    Develop, test and deploy solutions across web, desktop and mobile platforms using latest technologies tools IIS.    Well versed with Visual Studio 2012/2013 based development (IDE) including JavaScript and JS frameworks, css and dynamic css, masterpages, JQuery html5    Perform thorough unit, integration, system , Performance and regression testing    Document work and make available to team members and communicate    Ensure consistency of naming conventions, compliance with best practices, and integrity of data.    Knowledge of different phases in testing is preferred (unit, system, integration and Performance testing)    Good verbal and written communication skills in English are required      Core Technical Skills   Net Development. SQL Server 2012 or above, Oracle ADO .NET      Nice to Have   Entity Framework. JavaScript      Required Education        Must be a Graduate in Engineering with a minimum of B+ grading    Must have completed a professional training course in .Net , ASP , Visual studio IDE environment.    Must be knowledgeable with working in different databases  ", "Role": "Software Developer,", "Industry Type": "Strategy, Management Consulting Firms,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["IIS", "jQuery", "Web development", "System integration", "Performance testing", "Regression testing", "Entity framework", "Visual Studio", "microsoft", "ASP"]}