{"Job Title": "Software Development Engineer C/C++, Linux, DevOps", "Company": "ViaSat, Inc.", "Experience": "5 - 8 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": " We are a best-in-class team developing and deploying new technologies on a next generation satellite network. Our groundbreaking satellite network is redefining what is possible with satellite-based internet service requiring you to innovate, design and develop in the world of secure software defined satellite communication. Our unique position as a service provider and equipment manufacturer allows you to experience the whole life cycle of networking software development all the way from design to deployment. Your fellow senior engineer teammates will be there to aid in design, documentation, implementation, testing, analyses, test execution, and system support, to ensure deployed production networks delight customers.         Required Skills:    - 5+ years of software engineering experience with coding and debugging skills in C, and C++ on Linux    - Experience with encryption and authentication software    - Experience with OpenSSL crypto libraries    - Experience with bash and Python scripting in Linux    - Problem-solving experience and possess a DevOps approach    - Excellent verbal and written communication skills.    - Bachelor s degree in Computer Science, Electrical Engineering, or related Engineering Disciplines.    - Up to 10% of travel.         Preferred Skills:    - Deep knowledge of OS features like Multi-threading, synchronization, memory management, and networking on Linux or Linux-like Operating systems    - Experience with Linux device driver design, development and test, in addition to kernel crypto module    - Experience with implementing REST APIs and working with JSON (preferably in C or C++)    - Experience configuring/debugging embedded HTTP(S) servers    - Background in data structures and algorithm design    - Proficient in software development tools, source code control environment    - Experience designing and implementing networking protocols at the phy, mac, transport, and application layers    - Experience working in an Agile / Scrum development environment    - Experience with modern updates to the C++ language (C++14)    - Experience with ARM53 CPUs, ARM TrustZone    - Experience with TLS protocols   Additional Requirements and information   Minimum education:   BA/BS or equivalent experience     Years of experience:   5-8 years  ", "Role": "Software Developer,", "Industry Type": "Telcom, ISP,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.A in Other Specialization, Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Networking protocols", "Linux", "Coding", "Debugging", "Test execution", "Data structures", "HTTP", "JSON", "Python"]}