{"Job Title": "Python Software Developer - Electronic Trading Systems", "Company": "HyrEzy Talent Solutions", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": " Job Role : Python Software DeveloperJob Location : HyderabadExperience Required : 5-10 YearsJob DescriptionThe candidate will join the front office development team working for APAC Markets businessRole Summary :This  position is a hands-on Python / SQL software developer role, candidate  needs to have exposure to electronic trading business, proficient in  python and experience building systems for data processingRole Responsibility :- Build and maintain infrastructure for data retrieval, processing and storage- Build strong working relationships with the teams in SG and HK- Be willing and able to adapt to changes in priorities- Ability to learn and apply new technologies to deliver added business value- Maintain a strong focus on qualityAdditional Information:Required Skills :- Proficient in Python / SQL- Good understanding of data base management systems- Experience developing and maintaining systems that handle large amounts of data- Understanding of Electronic Trading Systems- Attention to detail and code quality- Excellent problem solving and analytical skills in a high-pressure environment- Strong communication skills and an ability to convey ideas and concepts with clarityRequirements :Experience :- 5 to 10 YearsNotice period: Immediate to 30 daysRequired QualificationGraduation - Bachelor of Engineering - Bachelor of Technology (B.E./B.Tech.) in Other - Not Required Per/CGPAJob Insights :Virtual On-boarding Possible. ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["Software Development", "Front Office", "Analytical Skills", "Electronic Trading", "Database Management", "Data Processing", "Management Systems", "Strong Communication Skills", "SQL", "Python"]}