{"Job Title": "Software Expert Developer || Full Time Position - Mohali", "Company": "InfoStride Technologies Private Limited. ", "Experience": "6 - 11 years", "Salary": "₹ 8,00,000 - 18,00,000 P.A. ", "Location": "Mohali, Chandigarh", "Job Description": "Job Role and SummaryContribute towards the development of features, implementing parts or in whole for Quark Content Enablement Ability to clearly understand per project based on requirements and existing product features and overall solution.Work closely with Scrum master/Lead in understanding the assignments in context of overall scope and implement the assignments in a timely manner with high quality.Install, Deploy, configuration and Demo product at feature level, must have excellent knowledge on complete product lifecycle.Ability to quickly adapt with regular switching of client assignments; based on priorities without significantly impacting productivity.Senior Software Engineer manage and develops software applications. Performs coding, debugging, testing and troubleshooting throughout the application development process with ownership to review the code repository be Level 1 & 2 software engineers.Determine operational feasibility by evaluating analysis, problem definition, requirements, solution development and proposed solutions.Document and demonstrate solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code.Prepare and install solutions by determining and designing system specifications, standards, and programming.Participating in Agile meetings to contribute with development strategies.Owning critical processes that are highly available and scalable.Producing tremendous feature enhancements and reacting quickly to emerging technologiesEncouraging collaboration and stimulating creativityAssist in the preparation and documentation of project requirements, specifications, and project plan. Support and develop software engineers by providing advice, coaching and educational opportunities.Works on problems of diverse scope where analysis of data requires evaluation of identifiable factors. Demonstrates good judgment in selecting methods and techniques for obtaining solutions. Demonstrates initiative. Interacts with senior internal and external personnel.Full time position based in Chandigarh.What you need to Succeed  BE/BTech/MCA/ME/MTech/ from premier institute in computer science or related field A minimum of 6-9 years of relevant Industry exposure Should be fluent in Core Java, J2EE technologies, Spring Boot & Spring Framework.  Hands-on experience in Integration with Elasticsearch stack, Active MQ, Kafka and Redis cache. Hands building application using AWS cloud platform. Hands on experience building application using Microservice architecture. Hands on experience using Maven & Eclipse Hands-on experience in databases (SQLServer/PostgresSQL) Hands-on experience in NoSQL databases (Cassendra) Sound knowledge of Data structures and algorithms Hands on experience using GIT, branching strategy and CI/CD pipelines  Working knowledge of the Unix/Linux/MacOS operating system Expertise in XML, XML Schema and XPath technologies Deep understanding of overall systems development life cycle using Agile. Proficient in using source control technologies, with Azure DevOps.  Experience with open-source technologies and object-oriented design Must have excellent communication skills Passion for writing efficient highly performant code for enterprsie and mobile platforms. Passion for collaborating with multiple engineering teams that are clients using your software. Expertise in cross-browser developmentPersonal Attributes Flexible and adaptable in regard to learning and understanding new technologies. Strong written and oral communication skills. Strong interpersonal skills. Ability to conduct research into software-related issues and products. Highly logical. Technically proficient. Highly self-motivated and directed. Keen attention to detail. Proven analytical and problem-solving abilities. Ability to effectively prioritize and execute tasks in a high-pressure environment.Reporting Structure: This position will report to the Director/Manager Could report to additional levels based on Project team composition", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Java", "Spring", "AWS", "SQL"]}