{"Job Title": "Software Development Engineer -Applications/ Python/Cloud", "Company": "ViaSat, Inc.", "Experience": "2 - 4 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "             Job description           Job Responsibilities       As a Software Engineer on the Global Broadband Operations team, you will be working on software that is used every day by users and future software solutions that solve some of the most pressing problems in the company.    One of our goals is to help Viasat scale at a global level by providing software solutions and platforms with a focus on efficiency and collaboration to both internal and external customers.      In this position, you will:      Design and build creative, customer-focused solutions from the ground up    Get direct feedback from users and iterate on products    Work with a team that fully embraces the lean startup methodology    Collaborate with other teams within Viasat to build robust and integrated solutions    Have a big impact and influence on the direction of the products and technology stack    Employ machine learning techniques where applicable      Required Skills:      2 - 4 years of application experience.    Familiar with several programming languages including Python.    Experience with software development, debugging and troubleshooting.    Excellent verbal and written communication skills.    Bachelor s Degree in Computer Science, Computer Engineering or other relevant technical field with equivalent experience.    Ability to travel up to 10%.      Preferred Skills:      Cloud platforms including AWS (EC2, ECS, RDS, etc.)    Web service technologies including Django, NGINX, Celery, ReactJS    Workflow engines such as StackStorm    CICD and relevant technologies such as Docker, Jenkins, Amazon ECS, Kubernetes    Machine learning    Software architecture    Visualization ELK Stack    Additional Requirements and information    BABS or equivalent experience              ", "Role": "Software Developer,", "Industry Type": "Telcom, ISP,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.A in Other Specialization, Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "software architecture", "nginx", "Django", "Debugging", "Machine learning", "Workflow", "Genetics", "Troubleshooting", "Python"]}