{"Job Title": "Senior Software Engineer - Windows Developer", "Company": "Zscaler, Inc.", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Chandigarh", "Job Description": " The Mobile team at Zscaler is responsible for developing a cross-platform client application for Windows, MacOS, Android, IOS and Linux, to securely steer endpoint traffic to Zscaler cloud. You will be the MS Windows programming domain expert on this team and bring your endpoint software development experience to the team. You will ideally have worked on a VPN client or like client application and understand the intricacies of multi-version multi-platform client apps. This is a technical leadership position, you will be involved in all aspects of product development lifecycle - requirements discussion/analysis, design, scope estimation, planning, implementation, code reviews and unit testing, documentation, POCs, deployment and continuing engineering.    Primary Responsibility:     Team is responsible for design and development of smart and breakthrough solutions for secure internet/enterprise connectivity and endpoint security client on variety of desktop and mobile platforms: Windows, MAC, iOS, Android, Linux.   Design and Development of multi-platform software using latest software development techniques.   Work with Product Management to understand requirements   Write and execute dev test routines for your modules   Work with QA to create better test routines, reproduce customer issues and deliver better quality product releases.     Required Skills :      5 years software engineering experience, with emphasis in Microsoft Windows enterprise applications development    Experience in leading, architecting, designing and debugging complex networking features on Windows   Experience with Windows UI / API development using C and C# technologies    Experience on Windows desktop application or driver development    Experience on networking domain is an added advantage .    Dealing with interoperability issues is a big plus   Excellent oral and written communication skills     Desired skills :     Hands on Windows Networking programming experience with NDIS or LWF   Understanding of Layer 3 and higher networking technologies - IP/TCP/HTTP/SSL protocols.   Good understanding of one or more operating systems: Mac, Android or iOS is desired.   Good understanding of security concepts such as PKI, VPN or firewall   Strong understanding of network security technologies.     Education Requirements :     Bachelor?s in computer science or related field is required  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["TCP", "Linux", "Networking", "VPN", "Debugging", "Network security", "HTTP", "Windows", "Android", "Firewall"]}