{"Job Title": "Software Developer - Java", "Company": "75F", "Experience": "4 - 9 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "    The Person We Need Has:      A love of, and alignment with, the 75F mission, virtues values.   An Extremely High Technical Aptitude we are an extremely high- tech company!   A love of technical architecting and technology platform solutioning.   Integrity. At all times and in all situations. No compromise here.   Enthusiasm Passion   Insanely superb written and verbal good communication skills and a high level of professionalism along with the ability to effectively collaborate with cross functional teams.   Strong time management skills   A fast learner, comfortable teaching yourself with new skills and can thrive in a complex and fast-paced environment.   A love for analytics and various User experience aspects.   Detail-oriented and highly motivated approach   Quality-first approach for development implementation and team processes   Desire for continuous learning and improvement   Desire to work outside comfort zone      Required Education          Bachelor s Degree or higher in Computer Science, Software Engineering, or closely related technical discipline      And the following Skills:               Develop modules of the initial system plan and work with the team by coding advanced portions of the modules   Ensure a smooth system deployment with the intended functionality   Plan and execute all deployment of system features and monitor for successful integration, maintaining the system throughout its lifecycle   Recommend software solutions to emerging needs.   4+ years of working knowledge in java based unit testing, integration testing, as part of software testing automation   Experience working in a Docker containerized environment   Work with other members of a planning team to develop a prototype delivery for an system when needed   Knowledge of Schema development and exposure to latest BMS protocols and schema - Haystack   Experience with designing databases, programming on Azure services and function apps is an added plus      And the preferred experience:      Previous work exposure in IoT industry embedded M2M industry (i.e. home automation, business automation, health, asset tracking, smart utilities, etc.)    Experience with distributed teams are highly desired   Ability to technically drive solutions across various features. Must be able to seek input when required, prioritize and drive results.   Knowledge of implementing maintainable and well-tested software and relevant support technologies (e.g. Git, SQLNoSQL databases, build pipeline automation, etc.)   Ability to develop resilient and high-scalability applications   Ability to learn quickly and adapt to change in a fast-moving environment   Ability to translate complex business requirements into simple, elegant technical solutions for the development engineers   Highly collaborative approach to technical delivery from the standpoint of business domain and requirements     ", "Role": "Software Developer,", "Industry Type": "Other,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Automation", "Prototype", "GIT", "Coding", "Integration testing", "Schema", "Unit testing", "Analytics", "SQL"]}