{"Job Title": "Software Developer In Test ( SDET) - Complete Remote", "Company": "Techolution India Private Limited", "Experience": "3 - 8 years", "Salary": "₹ 12,00,000 - 20,00,000 P.A. ", "Location": "Mumbai, Hyderabad/Secunderabad, Pune, Chennai, Bangalore/Bengaluru, Delhi / NCR", "Job Description": " This is an opportunity to take ownership of the entire QA process, including setting the technical vision for developing test frameworks and automation efforts. You will be tasked with designing test cases and drafting test scripts for UAT processes along with combining different testing methods and approaches to ensure best testing coverage. Additionally, you will track quality assurance metrics and work with development teams to improve results.Title : Software Developer In Test (SDET)Location: Remote workLooking for some one who can join us in less then a week.Required Skills : Manual Testing Automation testing using Java/Javascript/Ruby/Python(Strong expertise in any one of them. No preference)Ability to build Testcases & Tests planCross browser testingGood Analytical SkillsEye to detail to find bugsGreat Communication SkillsSelf Starter, Proactive & Go GetterKnowledge on CI/CD and scripts integration with pipelineKnowledge on AWS Native Application understanding(ECS, S3, Lambda, SQS, SNS) ContainersAgile Development Environment(Scrum/Kanban)Why Join Techolution?Be part of the next most admired high tech brand in the world and launch the next most exciting billion-dollar IPO. We are looking for talent with amazing technical skills with a great foundation for the open role. The type of personality which do very well at our company are people who are looking to contribute a larger than life cause. People who are looking for a very high growth environment where they are helping the company grow and also personally growing through a very unique and world-class exposure.Work-Life at Techolution:At Techolution, we do things a bit differently. There's no corporate nonsense, and no old-fashioned hierarchy. Instead, we work in dozens of self-sufficient, autonomous teams. Think of them like start-ups within a start-up that learn from each other. You are your own boss! We're going to be upfront, the way we work doesn't suit everyone. But if freedom, autonomy, and life-affirming, head-scratching professional challenges rock your world, we could be a match made in heaven.Why Join Techolution?Be part of the next most admired high tech brand in the world and launch the next most exciting billion dollar IPO. We are looking for talent with amazing technical skills with a great foundation for the open role. The type of personalities that do very well at our company are people who are looking to contribute to a larger than life cause. People who are looking for a very high growth environment where they are helping the company grow and also personally growing through a very unique and world-class exposure.Work Life at Techolution:At Techolution, we do things a bit differently. There's no corporate nonsense, and no old-fashioned hierarchy. Instead, we work in dozens of self-sufficient, autonomous teams. Think of them like start-ups within a start-up that learn from each other. You are your own boss! We're going to be upfront the way we work doesn't suit everyone. But if freedom, autonomy, and life-affirming, head-scratching professional challenges rock your world, we could be a match made in heaven.About Techolution:Techolution is a high-tech consulting company on a mission to accelerate digital transformation for our clients across the globe. We are a very successful start-up that is small enough to care and large enough to be trusted by some of the top brands in the world such as Apple, JPMC, DBS Bank, NBC, Stryker, JCrew, etc. Techolution specializes in UI Modernization, Cloud Transformation, Internet of Things, Big Data & Artificial Intelligence. As a testament to the power of HVPD, we have developed a wealth of world class products, owned by Techolution, in the space of Virtual Reality, Facial Recognition, Smart Water Monitoring and many more cutting edge digital products in the pipeline.Techolution currently serves clients across the United States with our headquarters in the heart of downtown New York City. We recently opened Techolution City in India as our offshore development center as a living and breathing lab for our IoT Smart City products. Techolution also serves APAC stormers from our Singapore office and the Mauritius office supports our initiatives in the African Continent. To know more about Techolution, visit our website: www.techolution.com", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Software Development", "Browser Testing", "Manual Testing", "Web Testing"]}