{"Job Title": "Senior Software QA Developer", "Company": "Mitel Networks Corporation", "Experience": "6 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  Overview:     Mitel is seeking a highly motivated Senior Software QA Developer who is passionate about playing a critical role in the QA organization. Candidates should have the ability to learn new applications and technologies quickly. As a critical member of our team you will be responsible for contributing to scale and performance testing of Mitel products. In your role, you ll be expected to gain a deep understanding of the Mitel products and develop performance validations for these products. The work will involve collaborating with both development and test team members on Agile projects.        Responsibilities:       Design and author performance test scenarios based on a software design document.     Validate and measure system performance through execution of performance test plan and submit defects for violations.     Analyze test results to ensure existing functionality and recommends corrective action.     Work closely with development counterparts in debugging the scale and performance issues.     Be able to troubleshoot issues and requires a review of a variety of factors before confirming on defects.     Review requirement documents, functional and performance specifications, and customer design documents.     Identify, reproduce, document, and track software functional and performance defects.     Understand how technologies/components integrate with each other and need to test keeping the customer perspective and usage in mind.     Be a vocal proponent of quality in every phase of the testing cycle.         Requirements:        Any Graduation/Post-Graduation     6-8 years of experience in software test engineering and methodologies.     Experience working in an Agile development environment     Hands-on experience in executing scale and performance test on telecom network elements,     Ability to analyze the memory dumps and identify the performance vitals like memory, CPU usage, crashes etc.     Experience in profiling of the performance scripts based on the inputs from the design documents and field data.     Experience in handling performance test and monitoring tools.     Experience in scripting/programming languages like Python.     Strong troubleshooting and debugging skills. Experience in SIP protocol desired.     Ability to bring-up testbeds with minimum assistance     Understanding of QA methodology and software development life cycle     Must have strong communication skills, excellent listening skills, and strong work ethics     Must be a self-starter, motivated, detail oriented, and have the ability to work collaboratively with others   ", "Role": "Quality Assurance/Quality Control Executive,", "Industry Type": "IT-Hardware & Networking,", "Functional Area": "IT Software - QA & Testing,", "Employment Type": "Full Time, Permanent", "Role Category": "QA/Testing/Documentation", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Telecom", "Software design", "Software QA", "Debugging", "Performance testing", "Test scenarios", "Software development life cycle", "Test planning", "SIP", "Python"]}