{"Job Title": "Dynamics 365 Developer - Software Architecture - .net/c#", "Company": "Career Infosystem", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Personal Skills and Competencies: - Strong and effective inter-personal communication skills and the ability to interact professionally with a diverse group of clients and staff, while maintaining positive client and staff interactions. - Good work ethic and self-starting attitude, and ability to work well among a team of professionals. - Ability to work capably under stress and to juggle multiple tasks within tight deadlines. - Experience on Agile development team with Agile-related tools and processes. - Strong analytics and problem-solving skills, interpersonal and teamwork skills; - Sensitive to working in a multicultural environment. - Ability to diagnose, troubleshoot and resolve customer issues. Required Candidate profileTechnical knowledge/skills: - Core Development Skills: 1. Software Architecture 2. .NET and C# 3. JavaScript, HTML, CSS, jQuery 4. Database development and SQL 5. REST, oData, JSON - Minimum 2+ years of hands-on experience in Dynamics 365/CE platform development to include: - Understanding of Dynamics 365/CE architecture including platform Configuration and Customization - Server Plugin development in C# - Client JavaScript development including custom web resources and form scripting - Knowledge of PowerApps platform Additional desirable experience: - Experience in designing and development using JavaScript frameworks such as Kendo UI and Angular - Experience in development of .Net Core applications - Experience in SSIS development - Experience with MS Power BI development as well as its integration with Dynamics 365/CE", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization, B.Sc in Any Specialization, BCA in Computers", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["C#", "OData", "jQuery", "MS Dynamics", "Javascript", "Database Design", ".Net", "JSON", "SSIS", "SQL"]}