{"Job Title": "Software App Developer - React Native Programming", "Company": "Independent HR Consulting", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Roles and ResponsibilitiesFor our technology platform client based in Bangalore. Currently Remote.Must Haves :- Proficiency in ReactNative (at least 3 years) with good understanding among Swift/Java/Kotlin- Must have worked on Android application- Candidates from start-up companies and mid-size product companiesStrict No Nos:- Service based companies - Candidates having 90 days notice periodNotice Period: immediate to 60 daysBenefits: Flexible work hours, healthcare benefits.Reports to: Director Of EngineeringRemote work for nowRole- Translate business requirements into user-friendly application code.- Collaborate with internal teams to develop functional mobile application working in a fast-paced environment- Review design documentation and code written by other engineers.- Work closely with Team Leads, Product Managers, and SDET teams to gather data, estimate project timelines and end-to-end delivery.- Should be aware of the agile working model and follow JIRA hygiene- Complete ownership of features worked upon, should be able to perform RCAs and provide quick resolution of relevant issues/production bugs.- Should be mentoring and assisting SDE1s in the team- Keeping up to date with the latest technology, concepts, and best practices for coding mobile apps- Improving and maintaining the performance and quality of the applicationSkills- Experience in object-oriented programming- Should have worked with MVC frameworks, web/client-server architecture.- Exposure to AWS or similar environment- Ability to translate product spec to engineering actionable- Demonstrable portfolio of released applications on the App Store or the Android market- Extensive knowledge of at least one programming language like Swift/Java- Extensive knowledge of React Native- Experience with third-party libraries and tools. Ex: MoEngage, AppsFlyer, OneSignal, Branch, Firebase,- Good analytical skills with a problem-solving attitude- Strong oral and written communication skills- Ability to interpret and follow technical plans- Ability to track and maintain aspects of the mobile applications. Ex: crash-free rate, ANRs, cold start time, hot start time, frozen frames", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Sc in Any Specialization, B.Tech/B.E. in Any Specialization, BCA in Computers", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["Firebase", "Java", "SWIFT", "React Native", "Mobile App Designing", "MVC", "AWS", "Android", "Kotlin"]}