{"Job Title": "Software Development Engineer Networks, DevOps", "Company": "ViaSat, Inc.", "Experience": "8 - 13 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "    Job Responsibilities     You are a capable self-starter, self-motivated software engineer, disciplined in software development methods including Agile/Scrum.    You have experience and ability to perform deployment, management of daily production and develop virtualization environments.    You are familiar with networking & cloud computing concepts. In addition, you have experience with requirements analysis, use case & user story analysis, high- and low-level design, implementation and unit test, system integration test, deployment monitoring, and sustaining product support.    Our team members enjoy working closely with each other utilizing an Agile development methodology.    Priorities can change quickly, but our team members are able to stay ahead of deadlines to delight every one of our customers whether they are internal or external to Viasat. Travel up to 10%.          Required Skills:     8+ years of experience in networking products with good knowledge of computer science fundamentals    Development experience in any of the languages Python (or) Java (or) C++ on a Linux platform.    Working experience with Linux firewalls. - Working experience with docker containers. - Experience with messaging middleware like RabbitMQ. - Experience in developing restful services.    Experience with Database technologies in SQL or NoSQL, Query optimization, Fault tolerance    Familiarity with cloud computing concepts.    Excellent verbal and written communication abilities. You will be required to communicate both verbally and in written form with remote international teams very frequently.    Broad range of technology interests across different disciplines including computer and system architecture, web applications, Scalability, performance analysis, distributed systems design and integration.    Bachelor s degree in computer science, computer engineering or electrical engineering or equivalent technical background and experience         Preferred Skills:     Working knowledge in Shell Scripting - Working knowledge of Linux Kernel - Continuous Integration & Deployment (CI/CD) training or experience    Prior working experience in a devops team is a plus.    BA/BS or equivalent experience  ", "Role": "Software Developer,", "Industry Type": "Telcom, ISP,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.A in Other Specialization, Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["System architecture", "Cloud computing", "C++", "Linux kernel", "Shell scripting", "Middleware", "Virtualization", "Monitoring", "SQL", "Python"]}