{"Job Title": "Software Developer", "Company": "Stefanini", "Experience": "10 - 15 years", "Salary": "Not Disclosed", "Location": "Noida", "Job Description": "   Position is providing programming, debugging, and enhancing software   (primarily using MS visual Studio in .NET and C# environment) with an emphasis on both frontend methodologies and serverside programing, as well as conduct testing, locate potential problems, and solve them in an efficient manner.     S  upporting the client\"s infrastructure, business processes and operations and/or network-based (cloud) product systems; analyzing, installing, acquiring, modifying and supporting operating systems, database or utilities software; and planning, conducting and directing the analysis of business problems with automated systems solutions.      Requires in-depth knowledge and experience.      Solves complex problems; takes a new perspective using existing solutions. Works independently; receives minimal guidance.      Acts as a resource for colleagues with less experience.      Networks with senior internal and external personnel in own area of expertise.     Attendance and schedule adherence are requirements of this position.          Job Responsibilities            Coordinate and lead assigned projects in all technical and communication aspects in order to finalize them according to client\"s requirements and within deadlines.     Determining operational feasibility by evaluating analysis, problem definition, requirements, solution development, and proposed solutions.     Documenting and demonstrating solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code.     Improving operations by conducting systems analysis and recommending changes in policies and procedures.     Providing information by collecting, analyzing, and summarizing development and service issues.     Developing software solutions by studying information needs; conferring with users; studying systems flow, data usage, and work processes; investigating problem areas; and following the software development lifecycle.     Enhance and maintain software applications.     Implement, integrate, and support customer infrastructure and applications.     Interface between customer and third party service providers.     Train and mentor less-experienced members of the team.       Qualifications Job Skills       Bachelor\"s degree required, Masters or graduate certifications preferred.     Typically requires a minimum of 10 years of related experience       Experience developing web applications in .NET, MVC Framework, Visual Studio, Oracle, C#, ASP.NET and .NET 4.0/4.5 Framework technologies.      Familiarity with Web Forms, ADO.Net, Java Script, HTML, jQuery, AngularJS and CSS.      Knowledge in Entity Frame Work 4, Service Oriented Architecture (SOA), SQL Server.       Website / REST experience      Knowledgeable in root cause analysis.     Excellent analytical skills.     Excellent troubleshooting capability.     Excellent customer facing communication skills.     Attendance and schedule adherence are requirements of this position Possesses and applies an expert knowledge of principles, practices, and procedures of particular field of specialization to the completion of difficult assignments.     Adapts procedures, processes, tools, equipment and techniques to accomplish the requirements of the position.     Usually works under general supervision, conferring with superior on unusual matters.     Assignments are broad in nature, usually requiring originality and ingenuity.     Duties and tasks reflect substantial variety and complexity.     Relies on experience and judgment to plan and accomplish assigned tasks and goals.     May serve as a resource to others in the resolution of complex problems and issues and assign work to less-experienced members of the team.    ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["jQuery", "Front end", "SOA", "ADO.Net", "Debugging", "HTML", "Oracle", "Troubleshooting", "Operations", "SQL"]}