{"Job Title": "Software Developer", "Company": "Mars Telecom System", "Experience": "6 - 10 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "Roles and ResponsibilitiesPosition: Senior Software EngineerExp: 6-10 yearsWe are looking for Software Engineer to work with product development in the Edge Router and Carrier Ethernet product areas.You will be part of one of our scrum teams using the Agile software development method to deliver high-quality and innovative products.Your role will be to analyze requirements and then design, implement and verify software. You will also work together with test engineers and technical writers to make sure the product is thoroughly tested and documented. Most of the software development is done in C language in a UNIX environment.Applicants for the position should have at least 6-10 years of Experience with at least one of the following:• On-hand experience with switch-asic based traffic classification, TCAM setup for QoS rules and per port vlan modifications on Marvell AC3X/Aldrin is preferred.• Networking related development; for example routing protocols, forwarding code, or firewall development.• Embedded system programming; for example writing drivers, handling board-bring-up, and troubleshooting of low-level code.We believe that you have expert knowledge on the following:• C programming, preferably in a UNIX/Linux environment.• Data and network communication (Ex: Ethernet, IP, DHCP, OSPF, IGMP,BGP, IGMP, PIM,MPLS).• Operating system internal operations (memory management, process scheduling, interrupt handling, etc.)Experience within the following areas is not required but is a merit:• Layer 2 and Layer 3 network design and/or management• Hardware tools (e.g. JTAG, oscilloscope, etc.)Other characteristics those are required for the position:• Good communication skills• Structured and analytic, likes to solve problems• Willing to take initiative• Likes to work in a team• Have a passionate interest in data com and new technology", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Network Administration, Security,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": [" Networking", " C programming", " L2 protocol stack development ", "Linux", " L3 protocol stack development", " Telecom", " Datacom domain", "Data Com"]}