{"Job Title": "Software Developer", "Company": "Alliance Recruitment Agency", "Experience": "4 - 9 years", "Salary": "Not Disclosed", "Location": "Indore, Pune, Ahmedabad, Gurgaon/Gurugram, Bangalore/Bengaluru", "Job Description": " Apart from the core responsibilities candidate may have to carry some additional responsibilities as well. Like:    To provide technical support to the client and train the end users for the final product   To design backend database for the web application   To find out the information about latest tools and technologies which can enhance the features and performance of the application   To ensure the compatibility of websites with newer software and operating system versions   To understand the software lifecycle and determine the changes needed as per feedback and observations of the testing professionals    Qualifications:    Bachelor degree in computer science      Desired Skills:       Hands on Experience in :: Website Development Maintainance   Mobile Application Development Experience is plus.   Responsibilities:    To develop, design, test, maintain and support custom mobile and web applications   To collect the software requirement by customer and develop the application as per their requirement   Evaluate and research the products and technologies related to software   To design and develop the activities and procedures related to activities and maintenance   To write the high-quality code to meet customer requirement   To design, develop and implement thecritical applicationfor.Net environment   Alienate the project work as per client s requirement and budget      Experience Requirements:    Proven experience Net application developer Familiarity with Net framework, SQL Server and design patterns Understanding of Agile methodologies Familiarity with REST and RPC APIs   ", "Role": "Team Lead/Technical Lead,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["Computer science", "Mobile application development", "Backend", "Investment advisory", "Agile", "Machinery", "Technical support", "Educational sales", "SQL", "Recruitment"]}