{"Job Title": "Mobile Software Developer", "Company": "Finite HR Consulting Private Limited", "Experience": "3 - 5 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Our Client eatfresh.com is looking for Mobile Software Engineer,  Android Job Designation: Mobile Software Engineer,  Android Job Location: Bangalore  Experience: 3- 5Years. Working Days: 6 Days a week (10:00 AM to 7:00 PM) About us -  www.eatfresh.com   Job Description    Eatfresh.com is an online marketplace for chef- made meals. Our chefs source the freshest and highest quality ingredients from local farmers and suppliers and cook a range of delicious hot meals everyday. We deliver the hot meal straight to your doorstep in 45 minutes whether you are at home or work.   Currently live in Sarjapur Rd/ Bellandur area and soon expanding to other locations within Bangalore.    We are fortunate to have Kalaari Capital as investors and partners in our mission to make getting a great tasting hot meal as easy as possible.    You will form the core engineering team at EatFresh. Any software that you write will help us place another fresh,  great tasting,  hot meal on a customer's dining table in a predictable,  reliable and affordable way.    You will design your data,  test cases,  code,  and ship. All of us ship and we ship often.    You will be an ideal fit for us if,  a) You enjoy working in a small team. b) You are comfortable with ambiguity and a fast pace. In fact,  perhaps you have done some of your best work in the past in such an environment.  c) You have an engineering degree either in computer science or in a related field.  d) You have 3- 5 years of experience building and scaling consumer web and mobile products. e) You have expert level proficiency in Java  f) You are proficient in native frameworks,  animations,  geofencing,  activity fragments,  loaders and designing threading  g) You hunt down performance issues and security loopholes like a hawk eatfresh.com Bangalore Technology -  IT & Systems  h) You obsess over writing clean,  extensible code    Skills  Must have Android Development Java Mobile Application  Design Android    This is an Immediate Opportunity candidate with less than one month notice will be preferred.   Please ignore this mail if the above profile doesn t match with your current Job Role.", "Role": "IT/Technical Content Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Mobile,", "Employment Type": "Full Time, Permanent", "Role Category": "Other", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Technical product configuration", "c++", "C", "design", "MySQL", "JavaScript", "integration PHP", "HTML"]}