{"Job Title": "Full Stack Software Developer", "Company": "Nggawe Nirman Technologies Private Limited", "Experience": "6 - 11 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Job Description:Software Engineering : As a member of our Technology team, you work with a multi-disciplinary group of bright and motivated people. You and your team operate autonomously to solve real customer problems with smart and innovative solutions, end to end. You own your product architecture, implementation, deployment and operations. You are empowered and accountable for its full life cycle. You measure success and its impact with data collected from our platform. You will use modern software engineering approaches like micro-services, cloud deployment and auto scaling, continuous and iterative software delivery, and data-driven decision making. In our polyglot environment we work in and on a variety of languages and platforms: .NET, ReactJS, NodeJS, Python, PHP and Typescript which we run on either AWS cloud. We love to be data driven and measure the impact of everything we release, supported by an Analytics group that drives key insights. Our teams have the information they need at their fingertips to create the roadmap of their product and the tools to continuously release and get feedback from our customers. What You'll Do:  Work with rest of the development team to add new features and improvements to the e-commerce application and the backend platform.  Test, debug, perform QA and optimize code for performance, maintainability and standards.  Work with the product management to interpret functional requirements.  Investigate and learn new web technologies.  Participate in code reviews and make recommendations. What you Need : 5+ years of experience working on an enterprise application software.  Experience creating and working with REST APIs.  Familiarity with React and related development tools.  Good knowledge of Typescript/JavaScript.  Experience working with NoSQL database.  Experience with GraphQL is a definite asset  Experience writing unit tests  Proficiency with AWS tools in general, and AWS Lambda / API Gateway would be important assets  Strong written and verbal communication skills .What You Must Have: An obsession for delighting customers  An entrepreneurial spirit that embraces change and challenges with enthusiasm  A sense of ownership and a passionate drive to deliver results and constantly raise the bar  Ability and desire to be scrappy, move fast and operate effectively in a rapidly changing environment. Innate motivation to learn and continuously develop yourself  High degree of empathy and the ability to see others perspective  Commitment to fearless communication  A desire to learn and continuously improve. Work Location: Smart works, Millers Road, Near MG Road, Bangalore.If you match the above skills, please send your CV to ekta.goyal@nirman.io with a copy to raghavendra.ps@nirman.io with the following details.1. Name2. Ph No / Any Alternate number3. Skype ID4. Years of Experience5. Current Location6. Current CTC7. Expected CTC8. Reason for Change9. Offers in Hand / If Any10. Notice Period (Please mention if it is Negotiable / Not)11. Open to Attend Zoom / Skype interview: Yes / No12. Preferred Date & Time for Teams / Zoom / Skype Interview :REQUEST YOU TO REFER ANY OF YOUR FRIENDS / COLLEAGUES WHO ARE LOOKING FOR A CHANGE.RegardsEkta SilEkta.goyal@nirman.io", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Web Technologies", "nodejs", "reactjs", "python", "Graphql", "Rest", "NoSQL", "Aws Lambda", "Typescript", "Software Engineering", "Javascript", "PHP", ".Net", "API Gateway"]}