{"Job Title": "Software Developers", "Company": "PrimeSoft IP Solutions Pvt Ltd", "Experience": "4 - 6 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad, Bangalore/Bengaluru", "Job Description": "   Job Description:      PrimeSoft is seeking senior software development engineers with extensive work experience in C#, ASP.NET, ADO.NET,    SQL Server (or other RDBMS), WCF, etc. to design, develop and deploy enterprise applications. The Sr. Software    Engineer will be responsible for designing and developing new features, enhancing, optimizing and refactoring existing features and work closely with internal team to improve the application deployment & configuration      The desired candidate is expected to fulfill the following expectations:     Ability to learn new technologies and acquire necessary skills quickly   Participate in iterative development process with cross-functional teams (Development, QA, Product Management, Customer Support, etc.)   Participate in activities such as collaborative coding, unit testing, and compliance with coding standards to enhance quality of produced software   Ability to work independently and collaborate in a team-oriented environment   Should have experience working with clients, and client driven projects     Desired Skillset:     Good understanding of SDLC including Requirements Analysis, Design, Development, Deployment and Support   Fundamental understanding of SOLID object oriented design principles   Good experience and knowledge in software development involving analysis, design and development with ASP.NET MVC models   Excellent design and coding skills using C# (3.0 or later), .NET (2.0 or later) on Windows 32 and 64 bit OS or equivalent   Knowledge and working experience in Windows Forms Applications, Windows Console Applications, WPF Applications, WCF, Unit Testing Frameworks, Scripting, Web Forms, MVC and .NET Core is a plus   Experience with Code review tools like Sonar / Resharper etc.   Knowledge of building, packaging software and hands on experience in Windows / MS Installer is desired   Experience in writing automated unit tests using NUnit, Microsoft Unit Test Framework, xUnit.NET, etc.   Should have experience in database design fundamentals, constraints, relationships etc. and hands-on experience with SQL Server or other RDBMS   Experience with Git /Github / Gerrit and Visual Studio IDE is desired   Good knowledge HTTP and familiarity with UI technology stack (HTML, CSS, JavaScript, etc.) is desired   Knowledge in JavaScript frameworks such as Angular / React is a plus   Hands on experience with PowerShell is plus   Knowledge of industry standards in coding and documentation   Proven ability to work in a fast paced Agile-Scrum environment with frequently changing priorities and stringent deadlines   Excellent verbal and written communication skills is desired   MCSD or other certifications is a plus  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "MCA in Computers, M.Tech in Electronics/Telecommunication", "Doctorate": "None", "Key Skills": ["Software Developer", "Javascript", "HTML", "Windows", "WCF", "MVC", "WPF", "microsoft", "SDLC", "SQL"]}