{"Job Title": "CW Full Stack Software Developer", "Company": "Varite", "Experience": "5 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "                 Work closely with product and development teams to create an amazing user experience             Build integration and unit tests along with code. Work in agile development environment with short sprints and standups.             Implement proof of concept, prototypes and production-grade software.             Maintain and support existing software and hardware systems, infrastructure and production.             Assist support staff and team members in trouble-shooting software issues and implementing bug fixes.             Takes ownership of the code base.             Work to continually improve code quality, and get bugs fixed and deployed rapidly Experience in or knowledge of Python, Celery, Go, Elasticsearch, PostgreSQL, SaltStack, Flask, Git, React, Elixir.             Deep understanding and knowledge of virtualization (libvirt, KVM, Xenserver).             Excellent communication and interpersonal skills.             Strong programming skills including software engineering methodologies and best practices. REST/API development.             Strong experience with Python or other scripting languages. Experience working in a Linux development environment.             Strong experience with relational databases, and specifically MySQL, Elasticsearch, Redis.             Excellent HTML, CSS and JavaScript skills. Experience in consuming RESTful APIs.                Skills:               UI development experience with React and NodeJS              Hands-on programming with Python and/or Go             Good knowledge of AWS, Kubernetes             Knowledge on Microservices, API development, GraphQL             Experience with performance testing/tuning for internet scale applications       ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["UI development", "KVM", "GIT", "Postgresql", "MySQL", "Javascript", "Performance testing", "HTML", "Virtualization", "Python"]}