{"Job Title": "Software Developer", "Company": "UL", "Experience": "2 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "              What you ll learn & achieve:       Under direct supervision, supports the analysis, development, modification, testing and maintenance of operating systems software. Supports business leadership and senior development professionals in the analysis of software and hardware system needs, options, risks, costs, and impact on business process and goals. Evaluates supplied software products and applications. Independently analyzes and isolates the application issues and performs problem resolution.          Analyzes system requirements, preparing of specifications, designing, coding, testing, debugging and documenting. Implements complex requirements for multiple platforms, operating systems, and applications.     Resolves problems by devising or modifying procedures. Considers equipment capacity and limitations, operating time, and form of desired results when developing resolutions.     Supports the identification of system requirements by interviewing users, interviewing and selecting vendors (if applicable), analyzing applications, evaluating existing and proposed systems, and recommending solutions.     Independently analyzes and isolates application issues and performs problem resolution.     Monitors progress of software based projects by tracking activity, resolving problems, publishing progress reports, and recommending actions.     Improves systems performance by investigating problems, developing specifications, identifying trends in technology, and recommending solutions.     Assists with formulating and defining specifications for software programming applications and modifies existing applications.     Performs other duties as directed.       What makes you a great fit:       University degree in Computer Science or a related discipline plus generally four years of directly related experience.Strong working technical knowledge and/or software development experience.Strong working knowledge in software application or specific program language requirements of software work.     ", "Role": "Software Developer,", "Industry Type": "Industrial Products, Heavy Machinery,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Business process", "Technical training", "Publishing", "Business leadership", "Renewable energy", "Operating systems", "Coding", "Debugging", "Testing"]}