{"Job Title": "Software Developer", "Company": "Technicolor Animation & Games", "Experience": "2 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": " Job Description     Primary Responsibilities:      Writing tested,  idiomatic,  and documented Python,  and JavaScript.      Experience in both Front End / Back End Developer      Experience working with Python,  Flask,  Django/DRF and SQL in the backend      Experience working with Nuxt.js/Vue.js in the frontend      Deploying applications in AWS.      Experience to containerize all our applications and deploy them into Kubernetes clusters,       Experience on Docker and Kubernetes is also desirable.      Improving our existing CI/CD processes.      Experience with Routing/Migrations and Eloquent ORM      Experience in Developing Responsive Sites with HTML5/CSS3,  AJAX,  JQuery,  JavaScript and Bootstrap 3      Experience with GitHub Version Control      Help adding features to our existing frontend and backend services and developing new applications.      Conception and implementation of Python backends,  APIs and data processing pipelines      Excellent working knowledge of Web application development      Maintenance,  optimization and support existing services and maintaining legacy applications.      Experience working in Agile software development methodology      Understanding of cross platform OS systems like Windows,  Linux or Mac with hands- on working experience      Good communication skills and Email etiquettes,  Quick learner and should be a team player      Communicating with project stakeholders and other departments.      Qualifications     Key Skills:      Participate in the entire development lifecycle -  planning,  implementation,  testing,  deployment,  documentation,  and monitoring.      Develop process driven web applications      Supporting CETA and all relevant webservices interfacing globally      Role entails a combination of development and global support      Produce high quality,  maintainable code with great test coverage      Solve complex performance problems and architectural challenges      Help with designing and architecting the product      Design and develop the web application modules or APIs      Troubleshoot and debug applications     ", "Role": "Software Developer,", "Industry Type": "Animation, Gaming,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["jQuery", "Front end", "Linux", "Agile", "Windows", "Monitoring", "SQL", "Ajax", "Python", "CSS3"]}