{"Job Title": "Software Developer .NET", "Company": "Siemens Limited", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "         This is yourrole. What part will you play?     Build Rich client application Development for EDI Platform, Code Review and (automated) testing   Root cause analysis and defect correction, Responsibility for Azure DevOps Server (TFS) Build Pipelines and automation Environment   Chip in to various DevOps topics, Ensure stable operations for the IT services    Write user documentation, Ensure implementation of internal IT compliance & security guidelines   Participate on regular status meetings, Should possess good, Analytical capabilities, ability to learn quickly and interpersonal skills   Abstraction capability and logical thinking, Social competence: the ability to work in teams and excellent interpersonal skills   Customer-focused behavior, solution-focused, proactive action and initiative   Capability to collaborate with responsibility and respect   Willingness to travel outside India on need basis (occasional and for short periods)     We don t need superheroes, just super minds     You must have BE / B.Tech / MCA / ME / M.Tech qualification with 4 years of confirmed ability?   Must have experience in VB.NET, C#, Windows Forms, WCF, LINQ, ADO NET, Reactive-Programming   Strong Object-oriented programming (OOP), Specialist in using Microsoft Visual Studio and version control (GIT, TFS)   Continuous Integration tools (Team Foundation Server, Jenkins Pipeline)   XML / XSLT processing, JSON, JWT, Click Once deployments, Unit tests with XUnit    Authoritative SQL knowledge (ORACLE), Obfuscation of source code (Dotfuscator)   Knowledge of messaging systems ActiveMQ, ZeroMQ   Knowledge in below areas will have higher edge, Security, SSL, authentication/authorization    Service-oriented architecture (SOA), Know-how in EDI and Siemens SSD, Database (MySQL / PostgreSQL)   Experience with Component one UI controls   Basic German language skills   Container technologies (Docker, Kubernetes, OpenShift)   Virtual Collaboration and working in international teams  ", "Role": "Software Developer,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial", "PG": "M.Tech in Electronics/Telecommunication, MCA in Computers", "Doctorate": "None", "Key Skills": ["Automation", "SOA", "XML", "MySQL", "XSLT", "Application development", "WCF", "Oracle", "microsoft", "SQL"]}