{"Job Title": "Senior Software Development Engineer  -  Testing", "Company": "Pegasystems Worldwide India Pvt. Ltd.", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "  Senior Software Development Engineer  -  Testing   Job Category: Product Management   Location: India  -  Telangana  -  Hyderabad    Compartir esta p gina     Copied!     Meet Our Team:   Pegasystems is offering exciting opportunity to join our Pega Robotics Automation team as a Software Development Engineer for Testing (SDET). Pega Robotics Automation is one of the leading Robotics Process Automation (RPA) products in the market. The SDET will be a key resource that is responsible for software testing and create scalable testing infrastructure, so developers can test their code.         Picture Yourself at Pega:   The Senior SDET will be responsible for working with product managers, developers and designers in our agile team structure. Partner and collaborate with the engineering teams to achieve quality through continuous build, test automation, release engineering and software testability and Translate test plans and cases to code. We are seeking experienced technical professionals who can demonstrate creativity, teamwork, a results - driven attitude, and a dedication to customer success.   What You'll Do at Pega:    Work with Pega Robotics, unique technology that automates and monitors the user interfaces of desktop applications     Analyze and test software while working with variety of languages and platforms.     Work with a collaborative team in an Agile environment that enjoys solving complex issues.    Who You Are:   The ideal candidate for this role is a person who is passionate about debugging software and enjoys working with developers to create a scalable testing infrastructure. Person having good analytical and communication skills with in depth experience/knowledge on Automation, Manual Testing and interest to learn new tools and technologies can be successful in this role. Person who is self - motivated, self - organized and with high collaborative skills has high chance to succeed in this environment.   What You've Accomplished:    Bachelor of Engineering or equivalent     4 to 5.5 years of experience serving as a Software Test Engineering is a must. A true tenacious desire to learn with career discipline and methodical style are the key ingredients.     Hands - on programming with .NET/C#     Strong debugging and problem - solving skills     Good understanding on Software development methodologies and quality processes     Passion for breaking software and debugging     Understanding of object - oriented design     Must be able to perform in a fast - paced interactive development environment     Self - motivated, highly intelligent and ability to work with minimal supervision    Pega Offers You:    Gartner Analyst acclaimed technology leadership across our categories of products     Continuous learning and development opportunities     An innovative, inclusive, agile, flexible, and fun work environment     Competitive global benefits program inclusive of pay with bonus incentive, employee equity in the company    (all fields are required)           First Name            Last Name            Phone            Email    Country of Residence   How did you learn about Pega   Upload your Resume     ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["Product management", "Object oriented design", "Automation", "Manual testing", "PDF", "Analytical", "Debugging", "Agile", "Pega", "Test Engineer"]}