{"Job Title": "Software Developer", "Company": "Ascent Consulting Services Pvt. Ltd.", "Experience": "3 - 5 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  SKILLS REQUIRED:    Proficient in Java, with hands-on experience in developing medium to large applications   Hands on experience in designing and developing applications using Java EE platforms   Comprehensive knowledge of object-oriented programming   Familiar with various design and architectural patterns concurrency patterns in Java   Familiar good working knowledge of MVC, JDBC, and RESTFUL concepts   Familiar with Java GUI frameworks   Experience with contemporary web application frameworks   Good understanding of the class loading and memory management mechanisms in Java   Proficient understanding of code versioning tools, such as Git   Familiarity with continuous integration and with build tools such as Ant, Maven, and Gradle   Excellent knowledge of Relational Databases, SQL and ORM technologies (Hibernate )    RESPONSIBILITIES:   Translate application storyboards use cases into functional applications  Design, build, maintain efficient reliable Java code   Ensure designs code modules are in compliance with specifications   Ensure performance, quality, responsiveness of the applications   Identify bottlenecks defects early in the development cycle effectively address the issues   Perform code reviews of peers junior developers   Prepare produce releases of software components  Distributed system application development.  Micro service development experience -API Testing.  ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Maven", "Hibernate", "GIT", "PDF", "Memory management", "Consulting", "JDBC", "Application development", "MVC", "SQL"]}