{"Job Title": "Software Developer", "Company": "Global Talent Pool", "Experience": "5 - 9 years", "Salary": "Not Disclosed", "Location": "Mumbai, Ahmedabad, Bangalore/Bengaluru", "Job Description": "Candidate will be responsible for developing and implementing software solutions to address complex business issues, and providing technical leadership within the IT department. The ideal applicant will able to thrive in a highly collaborative workplace and actively engage in the development process.  4 years of experience in building software applications.  Proficiency with .NET, C#, Entity Framework, SQL Server, WCF, ASP.NET, LINQ, Web API, MVC (Mandatory), Entity framework.  Strong experience of developing applications with OOAD (Object-Oriented Analysis Design) concepts.  Ability to quickly adapt to changes, enhancements new technologies.  Should have knowledge of security, encryption, HTTPS etc.  Write well designed, testable efficient code.  Experience working on complex software projects  Strong with Data Structures and Algorithms  Very good communication (both verbal written) skills  Strong analytical and logical skills.  Knowledge of object-oriented programming, security and open source technologies would be a plus.  Role and Responsibilities :  Design, develop and execute multiple software solutions to address business issues.  Provide technical leadership to the development team  Hands on experience of API Web Services development and integration.  Responsible for Database Design, Implementation and Performance Optimization.  Collaborate with peer organizations, quality assurance end users to produce cutting-edge software solutions.  Troubleshoot code level problems quickly and efficiently.  Work closely with cross-functional teams and drive quality of code/deliverables.  ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Manager Quality Assurance", "LINQ", "Database design", "OOAD", "Data structures", "Entity framework", "WCF", "MVC", "Open source", "SQL"]}