{"Job Title": "Software QA Test Developer", "Company": "NVIDIA", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": " Nvidia is looking for a highly motivated Software QA Test Developer for our Tegra Software Validation Team with good understanding of and experience in SW Safety & Security, ARM architecture, Linux & QNX OS, programming skills to help us validate fast, robust and safe systems used in Automotive and Embedded products.     Quality is an integral aspect of our products, and as an Embedded SW QA Engineer you will have a significant impact in helping us to deliver world-class products to customers in a fast paced and rapidly changing environment. You will bring your upbeat personality with excellent communication and interpersonal skills, attention to detail, and real passion for a positive user experience.      What youll be doing:       Design, Execute and Automate tests (White/Grey/Black box testing) on Embedded Automotive platforms.       Participate in reviews and provide feedback on product feature requirements, specifications, and technical design documents.       Work closely with various team including project management, hardware, and software developers, provide technical analysis of the bugs and periodically publish statistical reports to all stake-holders.       Develop/Enhance Tools, Application or processes to improve the Quality and Test efficiency.         What we need to see:       Bachelors/Masters degree or equivalent experience in Computer Science, Electronics or related fields       At least 4+ years of professional experience in System SW (bootloader, bootburn, BootROM, Board Support Package (BSP), ARM Trusted Firmware, Trusted OS (TOS), Quick Boot, Secure Boot) and/or low-level firmware Validation.       Good programming skills (Python, C or C++).        Solid knowledge of QNX or Linux based operating systems.       Prefer that you to have detailed understanding of operating system concepts, specifically boot sequence.        Excellent data analysis skills and demonstrated ability in solving complex issues involving multiple software or hardware components.       Strong collaborative and interpersonal skills, specifically a proven ability to effectively guide and influence within a dynamic matrix environment.         Ways to stand out from the crowd:       Solid understanding of QNX/Linux internals and working knowledge of ARM based platforms.       In-depth knowledge of GCC and the build process      Experience in white box System Software QA              ", "Role": "Software Developer,", "Industry Type": "Broadcasting,", "Functional Area": "IT Software - QA & Testing,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "C++", "Data analysis", "Project management", "Black Box Testing", "Firmware", "System software", "Automotive", "Python", "White box"]}