{"Job Title": "Senior Web Developer/ Software", "Company": "Modulesoft Solutions Private Limited", "Experience": "1 - 5 years", "Salary": "Not Disclosed", "Location": "Bhubaneswar", "Job Description": "This box is for spam protection -  please leave it blank: Signup for Hosting Select Hosting Plan Prefer Mode of Payment Credit Card / Debit Card Direct Bank Transfer Paypal /  2Checkout /  MoneyBookers Details  Web Developer Web Design company India | Magento E- commerce Professionals & Prestashop Web Developers India Vacancy for PHP Web Developer at Modulesoft Bhubaneswar,  Odisha \n\nLooking for experienced and able senior developers\n\nDevelop your career in a rewarding way \n\nWe are looking for PHP web developer with strong skills in real time development. who should understand clients requirement properly and present the same in the implementation.Good knowledge of PHP5(oops) ,  MySQL 5,  HTML4 & 5,  CSS3,  Javascript,  Jquery & AJAX.\n\nJob Detail Description: \n\nRole: \n\nSenior Web Developer/  Software\n\nResponsibilities: \n\nUnderstanding and implementing of Web projects - Managing and delivery of projects from conceptualisation visualisation to technology mapping and final execution of projects - Managing Project scope and change requests (CR)  \n\nInteract with the client to create technology specifications from business requirements for modules within the project. \n\nCreates efficient and logical databases for clients. \n\nDesigns and codes superior technical solutions. \n\nEasily recognizes system deficiencies and implements effective solutions. \n\nConsistently delivers high- quality services to clients. \n\nKeyskills: \n\nE Commerce( Magento,  Open Cart,  prestashop)  \n\nJoomla,  WordPress,  Drupal \n\nOpen Source Script Customisation & Module Development. \n\nClient Interface Managing \n\nPHP,  MySql,  HTML5,  CSS3,  JavaScript \n\nJQuery,  Ajax,  XML,  Scripting Education: \n\n(UG B.Tech/ B.E. Computers,  Electronics/ Telecomunication,  B.Sc Computers,  Electronics,  BCA Computers)  OR (PG MBA/ PGDM Information Technology,  Systems,  M.Tech Computers,  Electronics/ Telecomunication,  MCA Computers,  M.Sc Computers,  Electronics,  PG Diploma Computers,  Electronics)  \n\nA minimum of 1- 5 years of total work experience including 1+years of relevant software development experience in reputed IT organizations.\n\nSound knowledge of web development & custom PHP programming with one or more open sources such as Joomla,  Drupal,  CakePHP,  and Magento etc. \n\nProven experience in planning,  execution and implementation of high quality software projects. \n\nExperience in client relationship management,  project co- ordination and delivery management in an onsite- offshore model. \n\nProficient in iterative development methodologies like Agile,  RUP etc. \n\n PMP Certification and ZEND Certification will be an added advantage. \n\nGood Communication Skills & Time Management - Good at visualisation & making Clean Web layouts \n\nShould be able to handle stressful situations and deadline pressures well \n\nAbility to understand how to think around obstacles and execute deliverables on time \n\nDesire to change the existing paradigms,  think out of the box and sharp analytical mind \n\nMust have high initiative,  leadership qualities,  good Interpersonal skills and problem solving abilities. \n\nWhy Use Modulesoft  6th Floor,  NB Tower, Nayapalli, \n\nBhubaneswar ,  751 012\n\nOdisha,  INDIA\n\nICD# 12171830 \n\nCertified by Crazy Domains\n\nThis domain name has passed the International Domain Certification Authentication process utilizing the contact information provided by the registrant. Certified Domain licensing confirms the validation of the registration as well as authenticating the global WHOIS information,  including the email address and phone numbers provided at the time of registration.\n\nOctober 10,  2018\n\nPlease fill out the form below and we will get back to you as soon as possible.\n\nWarning : Sorry,  file transfer is limited to 5 files at a time. Please try the following file(s)  again :\n\nClose \n\nWarning : Sorry,  file transfer is limited to 50mb per file. Please compress the following file(s)  and try again.\n\nClose \n\nMessage cannot exceed 5000 characters\n\nDrop files here to upload \n\nPlease fill out the form below and we will get back to you as soon as possible.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["bca", "technical", "analytical", "software", "mca", "scripting", "pmp", "Web technologies", "web", "MySQL", "design", "Javascript", "PHP", "zend", "Web designing", "email", "programming", "Ajax", "magento", "development", "it", "Joomla", "quality", "offshore", "Drupal", "jQuery", "XML", "developer"]}