{"Job Title": "Software Principal Engineer ( Automation Lead Developer)", "Company": "Dell International Services IndiaPrivate Limited", "Experience": "10 - 15 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Title: Software Principal Engineer (Automation Lead Developer)Dell Overview:Dell provides the technology that transforms the way we all work and live. But we are more than a technology company — we are a people company. We inspire, challenge and respect every one of our over 140,000 employees. We also provide them with unparalleled growth and development opportunities. We can’t wait for you to discover this for yourself as a Director of Engineering on our client product development team in Bangalore.Dell creates technology solutions for a changing world. Our Information Technology (IT) Architecture team translates our customers’ business requirements into total enterprise-wide solutions. It takes deep technical knowledge to create architectural designs that exceed service requirements. We’re skilled in analyzing the customer’s business goals, objectives, needs and general business environment to create technical system solutions. Our expertise includes integrating hardware, processes, methodologies and software into the customer environment.About Business Unit:Our Client Solutions Engineering team ensures that our customers have the software systems they need for a changing world. Working at the cutting edge, we design and deliver software systems modifications as well as enhancements of new products. We oversee product development at all stages: planning, designing, developing and testing of software and hardware products.This position is for Software Automation Lead Developer in Dell Client Product Group, Bangalore. The team tightly integrated with most of the development organizations, including platforms, OS engineering, systems management, cloud, and Telemetry. This position works very closely with its US, China, Taiwan counterparts: Engineering, Marketing, Quality, Product test, support, and core teams.Key Responsibilities: Automation Lead will be responsible work closely with Architect for driving end to end automation strategy for respective client software team.Demonstrate Strong technical hands-on skills in the following competency areas – Selenium, RestAPI, C#, Python/Java and PowerShell and Automation Frameworks; Intergration with CI/CD pipelinesGood knowledge about business and process know-how in line with Automation.Good knowledge at understanding and analyzing the trends in Automation industry (End to End Automation) Good knowledge latest technologies in Automation & Control industry such as IoT, Cyber Security, Cloud, etc.Ability to discuss complex technology and work with the team to implementMentoring skills – ability to build, groom, and lead a teamEssential Requirements: Typically requires 10+ years of related experience in implementing automation frameworks from the scratch using pytest, TestNg, Junit.Should have worked on developing test automation frameworks(either TDD or BDD)Must have experience working on API automation (REST + python preferred).Must have of experience working on automation development using any programming language preferably python.Must have experience working on UI automation using Ruby or Selenium(either Java/Python).Desirable Requirements:Knowledge in network infrastructure, security, and application development.Knowledge of technology solutions and ability to learn, understand, and work quickly with new emerging technologies, methodologies, and solutions in the Cloud/IT technology space.BS or MS Engineering degree in Computer Science/IT/Electronics/Electrical Engineering", "Role": "Technical Architect,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Application Development", "Java", "Bdd", "TDD", "Testng", "Pytest", "Ui Automation", "Automation Testing", "Selenium", "Ruby"]}