{"Job Title": "ThreeG/4G LTE Senior Software Modem Developer", "Company": "Finite HR Consulting Private Limited", "Experience": "3 - 7 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "Design,  develop,  test and debug embedded software for Mobile Hotspots,  USB dongles,  and Embedded Modules. \nFamiliarity with large system level feature integration and validation. \nExpertise in C and programming/ debugging for RTOS. \nFamiliarity with Qualcomm MSM/ MDM family of chipsets and AMSS reference design. \nDemonstrate expertise in CDMA,  legacy 3GPP,  4G LTE wireless technologies \nUnderstand UMTS/ GSM/ GPRS/ LTE system architecture,  1x/ EVDO system architecture. HSDPA/ UPA,  EVDO rev B knowledge a plus. \nHave a proven track record of trouble- shooting and testing wireless mobile devices with a solid understanding of best design practices for RF conformance \nAbility to debug C program on Embedded Real Time Systems using JTAG,  Trace32,  etc. \nAbility to use wireless communication test equipment,  analyse test logs and isolate test failures \nModem over the air log analysis and debugging modem and application processor software using diag logs \nFunctionally operate and configure R&S CMW500  \nUtilize LTE/ CDMA/ EVDO diagnostic monitor tools including Qualcomm s QXDM,  Spirent s UDM,   \nWire shark to support troubleshooting activities \nFamiliarity with NA wireless carrier requirements and certification cycles. \nSupport dedicated Test Engineers with CDMA and LTE Pre- certification testing,  providing technical guidance,  debug and issue resolution as needed. \nFamiliarity with software configuration management tools like SVN. \nBackground in automated,  Certification Level testing using Telecom Industry and Verizon Wireless requirements (EIA/ TIA- 98/ 2000/ 866/ 898/ 919/ 3GPP/ 3GPP2/ / LTE). \nWork collaboratively in a team environment,  exercising good communication skills.Prefer 4- year degree B.tech/ M.tech with a strong background in wireless devices,  minimum 2- year degree required. \nGood mobile wireless technology knowledge,  preferably including expertise with handset manufacturers,  (Motorola. Samsung,  LG) network equipment vendors,  chipset vendors (Qualcomm,  TI,  Broadcom) and/ or test equipment vendors.", "Role": "IT/Technical Content Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Other", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["Technical product configuration", "c++", "C", "design", "MySQL", "JavaScript", "integration PHP", "HTML"]}