{"Job Title": "Software Engineer ( API Developer )", "Company": "Advanced Computer Software", "Experience": "1 - 5 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  About the Role    As an API Developer you would be able to implement RESTful Web API definitions into JavaScript code and other languages into new and existing products, creating concise and robust programming code. You will also robustly test APIs using TDD and specialized API test suites to achieve continuous integration and agile delivery. You will be good at troubleshooting and able to devise possible solutions to predictable problems and evaluate other options.   Working to move the technology for API first development forwards you are able to balance your passion for technology with commercial awareness and are able to communicate with business stakeholders in a professional manner.&     In this role you will:     Be effective in understanding and enhancing REST Web API definitions (OAS 3/Swagger)   Be knowledgeable in how to map API controllers to new and existing software in products   Working with the team to develop on medium-large scale development projects   Translate software requirements into concise and robust programming code   Working closely with Product Owners to refine requirements, estimate development effort and gain their acceptance of the solution   Use effective automated and manual testing techniques at various levels to ensure the software is correct, performant and robust   Identify improvements to existing application code and designs, increasing flexibility and reducing future effort   Encourage and foster XP techniques and agile software development always   Triage, investigate and resolve software defects with the minimum impact and risk   Further your knowledge through self-improvement and training   As a Developer at Advanced you will be expected to deliver excellence in everything you do. Work at pace and always do the right thing.      Work collaboratively with the team, so you will:     Identify problems and take action and responsibility for resolving them   Aim for self-improvement and continuous learning   Ask for help and help others   Clearly explain and discuss technical points with both technical and non-technical people   Say what you will do by when and work to do it in time   Appreciate challenge and feedback from colleagues     About You    You have sound understanding and experience with:    Software development and current programming practices   Have had some experience implementing Web APIs   Knowledge of at least one programming language, preferably including Javascript ES6, Java, .net   Source Control, preferably Git and GitHub – Good to have    You have a good understanding of:    Relational databases (document databases also beneficial) – (SQL, My SQL, Mongo DB, Dynamo DB)   JavaScript   Web APIs (REST preferred)   Web API Testing. Automation testing would be beneficial – (Soap UI, Ready API, Newman, postman)   Test-driven development    Beneficial skills    AWS – Good to have   .NET Core or Java   API design   Serverless architectures  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["github", "GIT", "Web technologies", "Manual testing", "TDD", "Javascript", "Agile", "Programming", "test driven development", "Troubleshooting"]}