{"Job Title": "Lead Software Developer", "Company": "Ally.io", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "  As a lead software engineer, you will be the technical lead for a team that focuses on building software applications that scale well. You will play a significant role in shaping our software architecture that provides measurable customer value. You understand both technology and business to know the right tradeoffs to make. You will be a technical mentor for your team members. You will work closely with your peers, managers, product, design and operations teams to create solutions that meet business requirements. You will drive engineering and operational excellence across Ally. You will collaborate with other engineers to surface common pain points, develop solutions and evangelize best practices.     Qualifications       4 years of professional software engineering experience building customer-facing web and/or mobile applications    Strong coding skills using Ruby, Java, C/C , Scala (or equivalent programming language)    Excellent knowledge of Data Structures and Algorithms    Bachelor or Master degree in Computer Science or a related discipline    Experience working in an agile environment    Self-starter, quick learner and passionate problem resolver    Excellent debugging and troubleshooting skills, with an enthusiastic attitude to support and resolve customer problems    Good oral and written communication skills    Above all, an insatiable desire and ability to learn      Nice to have skills   :     Experience with large-scale SaaS applications    Experience building web and mobile applications    Experience designing services on top of cloud infrastructure like AWS, Azure, etc    Knowledge of Ruby on Rails    Prior experience as a technical lead      ", "Role": "Team Lead/Technical Lead,", "Industry Type": "Real Estate, Property,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Computer science", "Operational excellence", "Coding", "Debugging", "SCALA", "Agile", "Data structures", "Product design", "Medical insurance", "Troubleshooting"]}