{"Job Title": "Software Development Engineer / Senior Software Development Engineer", "Company": "Unify Cloud Pvt Ltd", "Experience": "2 - 6 years", "Salary": "Not Disclosed", "Location": "Noida", "Job Description": "     Position & Role Summary:     We are looking for individuals with 2 5 years of experience in ASP.NET, MVC, TFS, WCF, AJAX, JQuery, HTML/CSS, SQL.  As SDE/SSDE, candidate will be responsible for many phases of the software development lifecycle including technical research, requirements analysis, high level and technical design, implementation of enhancements to the product, unit testing, debugging, and maintenance. This is an Exciting opportunity to work on Microsoft.NET platform which would be deployed on cloud     Job Description:      Candidate should have 2 5 years of proven and relevant experience in required technologies   Expert in C# .Net, ASP.Net (2.0 / 3.5 / 4.0), WCF Services, MVC, ADO.NET, JQuery, HTML, XML, SQL Server Business Integration   Knowledge about Microsoft Azure & Machine Learning   Expert in SQL Server programming, functions, stored procedures, triggers etc.   Working experience on Project Architecture, TFS   Experience of windows forms   Knowledge & experience in system architecture design patterns   Should be able to gather and understand business requirements   Should have very good understanding / experience in AAA Protocols   Ability to work under pressure and meet tight deadlines.   Demonstrated leadership experience as well as the ability to lead a group of software developers and also able to work independently   Ability to anticipate potential problems, determine and implement solutions.   Strong coaching skills. Ability to step outside role confines and help teach and enable other team members   Be familiar with systems concepts design and standards. Provide technical expertise in terms of software usage, functionality, performance, aesthetics, resilience, and reuse comprehensibility.  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial", "PG": "MCA in Computers", "Doctorate": "None", "Key Skills": ["Computer science", "System architecture", "jQuery", "XML", "Debugging", "HTML", "Stored procedures", "Unit testing", "SQL", "Ajax"]}