{"Job Title": "Software Development Engineer (Core-Java)", "Company": "SpectraMedix India Private Limited", "Experience": "4 - 6 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad( Begumpet )", "Job Description": "Role: Software Development Engineer (Core Java Backend Development) Location: HyderabadExperience: 4-6 YearsDescription:He/she will work closely with lead developers, architects and data/business analyst. This person will implement, test and document as needed. Occasionally the developer will be client interacting, he/she should feel confident publicly speaking and explaining technical configurations. This person will also work with the client relations and project management teams insuring the SpectraMedix product is meeting the highest standards of quality and satisfying its customers.Job Description:Develop Code as per scope defined in Sprint or as per Project Plan based on High Level Design documentCreate Unit Test and Integration Test Scripts following TDD approachFollow Security and Coding Guidelines when developing CodePerform Code Review for PeersPerform Unit and Integration Tests and fix issues in Unit/Integration TestingFollow SDLC process and meet Sprint/Project Timelines, while contributing to CI/CDEnsure High Quality Deliverables in Design, Code and Unit TestsExpertise in Core Java Technologies involving Multi-threading, Spring, XML; Preferred Apache Camel, JMX, JAX-RSDesired Candidate Profile:4-6 years of hands-on experience in Core Java DevelopmentBachelor / Masters or equivalent degree in any engineering or technical / quantitative fieldTechnical Expertise:Core Java and OOPSmulti-threading, collections, exception handlingSpring frameworkRest API / JMX / JAX-RSRDBMS (SQL Server)Data Structures / algorithmsPreferred: Apache Camel", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Sc in Any Specialization, B.Tech/B.E. in Any Specialization, BCA in Any Specialization", "Doctorate": "None", "Key Skills": ["Spring", "Core Java", "Multithreading", "Hibernate", "web services", "OOPS", "exception handling", "J2Ee", "Spring Boot", "SQL Server", "SOAP", "Java Developer", "REST", "Algorithms", "JMX", "Concurrency", "struts", "Apache Camel", "Collections", "Back-end Developer"]}