{"Job Title": "Software Developer", "Company": "CareersUnbound", "Experience": "1 - 3 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": " Qualification: B.C.A, B.E(I.T),M.C.A, M.Tech (I.T, C.Tech, Computer Science)   Experience: 1- 3 years   Job Responsibilities:      Extensive experience in Java, MVC frameworks and ORM in developing large scale web applications.   Expertise in HTML5, JavaScript, Jquery and other scripting libraries, JS, JSON, AJAX, Web services, XML REST, HADOOP, Big Data.   Know tools like Eclipse or Netbeans   Be conversant with working on Linux at command-line mode.   Be aware of issues of efficiency in programming (both CPU and memory), modular design, standard OOP practices   Should be well versed with Machine Learning Techniques, such as Support Vector Machine, Neural Networks, Genetic Algorithms and Programming, Graph Theory and Graph Algorithms, Numerical Algorithms etc Utilise their understanding in providing web solution to the client.   Analyse business requirement and apply their understanding to the limits of the tools being used.   Translate the client s business requirements into systems design.     Good to Have Skills:         Developing web-scale applications.   Auto-scaling, load balancing, high availability, automated backups (AWS automation) NOSQL, Hadoop and other big-data technologies.   Build process automation, source code control, procedures for hot updates on live server Machine Learning, data mining, web mining.   Predictive Data Analytics, and one of the modern languages platforms such as R, Python, Scala etc.   Write bug-free code, refine optimize the code   Effectively debug code Sets standards for the team   Identify problem areas in the module and actively work to fix them   Move the code for further testing to make it absolutely bug-free.   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial, BCA in Computers", "PG": "M.Tech in Electronics/Telecommunication, MCA in Computers", "Doctorate": "None", "Key Skills": ["Computer science", "jQuery", "Linux", "XML", "Eclipse", "JSON", "MVC", "Data mining", "Ajax", "Python"]}