{"Job Title": "Software Developer", "Company": "Cerence Inc.", "Experience": "2 - 3 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "   Responsibilities    We are looking for a motivated Software developer. Your main responsibilities will be, but not limited to:    Participate to the technical aspects of the software solution through the full lifecycle of the development including requirements, design, implementation, testing, documentation, maintenance, training and support   Update NLPS profiles to customize the business logic of different customers   Develop the NLPS Web Client that is used for usability testing. Tool available as a web interface or on a mobile device.   Using Spring, support and develop software that is based on a microservices framework   Write Java code that is performant and maintainable   Play an active role in daily scrums, weekly grooming sessions and sprint planning sessions   Conduct code reviews to ensure high quality   Collaborate with QA engineers to define the best test strategy and how it integrates into our CI/CD pipelines   Collaborate with DevOps engineers to define the best deployment and monitoring strategy using Docker, Kubernetes, Graphite, Grafana   Collaborate with the Documentation Team on official product documentation   Help troubleshoot and fix production issues           Qualifications    Number of Years of Work Experience: 2-3 years software industry experience      Required Skills     Experience with Backend Java Development   Scripting experience e.g. bash, shell, python   Experience in cloud computing (AWS, Azure, or equivalent)   Hands-on experience with the \"container ecosystem\" e.g. Docker, Kubernetes   Linux System administration and/or engineering experience   Software Development Life Cycle, Test Driven Development, Continuous Integration and Continuous Delivery   Extensive experience in OO design and design patterns   Demonstrated ability to focus and complete tasks on time   Strong team player   Show flexibility under changing conditions   Ability to analyze and solve complex problems quickly and creatively   Desire to learn new technologies   Self-starting, self-motivated, self-directed, and self-sufficient   Fluency in both written and spoken English is a must       Preferred Skills     Experience with client/server software architecture and SoA (Service-oriented Architecture)   Familiar with monitoring technologies (e.g.: Graphite/Grafana, ELK, etc.)   Speech recognition industry experience   Versioning and Deployment: GitLab, GitLab-CI, Github   Experience with C         Education     BS/MS University degree in Electrical Engineering, Computer Engineering, Computer Science or equivalent.   ", "Role": "Software Developer,", "Industry Type": "Automobile, Auto Anciliary, Auto Components,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Cloud computing", "C++", "Backend", "SOA", "Test strategy", "Usability testing", "Monitoring", "Automotive", "Python"]}