{"Job Title": "Software Developer", "Company": "Xogene Services LLC", "Experience": "4 - 9 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": " Job Description   Qualified candidates should be motivated by defining and building great products, working with complex data models, and laying strong technical foundations. This team is involved with working on large-scale, mission-critical   Python   web applications using Django.   The position requires the application of creative problem-solving skills to the conception and development of scalable and maintainable software in an agile team environment. The engineer will work on defining and implementing new features, enhancing core functionality, and integrating with other platforms and services.    Functions of the Role      Work within a development team to grow and support large, complex web applications   Work with the senior developer, business analysts and managers to plan and execute new products, features and improvements   Write and maintain unit tests and integration tests for automated testing   Maintain and enhance automated build and deploy processes   Conduct load testing and code optimizations to improve application performance   Create APIs and functionality to federate data from core platforms   Author and maintain technical documentation   Collaborate with other product teams, ad operations, and vendors as needed   Job Requirements   2+ years of proven experience developing large-scale web applications   2+ years of on-the-job development in Python    Expert in Python principles, idioms, and design patterns   Experience with AWS, automated build and deployment   Strong OO development methodology and familiarity with functional programming paradigm   Experience writing unit tests, smoke tests, integration tests and continuous integration   Excellent understanding of web technologies, including web servers and relational database servers   Experience writing and consuming RESTful web services   Great debugging and reasoning skills   Expert level Linux command line   HTML and JavaScript expertise (CSS a plus)   Strong written and verbal communication skills   Familiarity with agile development tools    Desired Knowledge, Skills and Characteristics:     Preference for small, agile teams that strive to regularly deploy to production   Passion for continual learning and improving the team around you   Interest in web architecture and contemporary web frameworks    Minimum Job Requirements:     Bachelor s degree from a four-year college or university or 4 years of commensurate experience ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["continuous integration", "Web technologies", "Web services", "Linux", "Agile development", "Debugging", "Javascript", "Agile", "HTML", "Python"]}