{"Job Title": "Senior Software Engineer - DSP Software Development", "Company": "Azcom Infosolutions (India) Pvt. Ltd.", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": "Job Description\n\n The Physical Layer ( PHY ) team at Azcom (India) owns the delivery of DSP software for 4G,  NB- IoT and 5G physical layer implementations for small cell,  tactical and eMTC systems. PHY is the bedrock of embedded system design,  and critically impacts end to end system performance. We meet this challenge head- on every day and deliver world- class,  high- performance DSP software.\n\n Currently,  the PHY team is looking out for passionate software engineers who can deliver high quality and optimized firmware software. You will be reporting to technical team leaders.\n\n As a DSP software engineer,  you will be responsible for design,  implementation and simulation of Layer 1 signal processing per the 3GPP specifications. You will also be responsible for evaluating and improving code performance for the components and subsystems. You are also expected to handle technical interactions with Azcom s global customers off- site and on- site as required.\n\n Location: Gurgaon\n\n Work Experience Required\n\n The DSP software Engineer should possess 2- 5 years of working experience in Physical Layer development for the wireless domain,  preferably in 4G,  NB- IoT,  or 5G.\n\n Mandatory Technical Skills\n\n Strong in C/ C++,  Data Structures and Algorithms Hands on experience in realization of 4G,  NB- IoT,  and/ or 5G PHY functions with Digital Signal Processors in Fixed point implementation Experience in the development of real- time software systems Profiling and optimizations of software components Experience of project execution in an agile environment Test case development and execution for unit level tests and Module tests Experience of working in state of art software development environment,  including IDE,  development automation tools and version control Mandatory Behavioural Skills\n\n Self- motivated and team player Excellent analytical skills and problem- solving ability Excellent writing and verbal communication skills", "Role": "Software Developer,", "Industry Type": "Telcom, ISP,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Wireless", "DSP", "C++", "Version control", "PDF", "Simulation", "Agile", "Signal processing", "Data structures", "Firmware"]}