{"Job Title": "Software Development Engineer - Backend", "Company": "Seeq Corporation", "Experience": "1 - 3 years", "Salary": "Not Disclosed", "Location": "Remote", "Job Description": "  Nature of Job:   Remote   Our technology stack is largely JVM languages (Java, Kotlin) with some C#/.NET. The core of our product is a full-featured calculation engine that can perform complex math and execute machine learning algorithms on streaming time series data.     SKILLS & REQUIREMENTS      You love computers and programming. You?ve done projects that you?re very proud of. You have (or will soon have) a degree in Computer Science or a related technical field or equivalent experience.    You want to learn to work with databases (Postgres, Cassandra), distributed computing (Spark, Kafka) and cloud platforms (EC2, Azure, GCE). You're interested in finding the best tool to solve a problem without getting caught up in whether it's the new hip thing.    You?re disciplined with a high attention to detail. You learn things quickly.    You listen really well, and you know how to make your ideas be heard without turning people off.    You are up for traveling periodically to hang out with your colleagues and get some face-to-face time.    You know how to balance life & work, and you don?t want a job that forces you to choose between them.    You want to work with a bunch of really smart people that love working together. And you want to work at a startup with lots of happy customers, good investors, and a bright future.    You?ve read this far and are determined to apply directly through seeq.com/careers and not through a third-party hiring site.   ", "Role": "Software Developer,", "Industry Type": "KPO, Research, Analytics,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Backend", "Software Development Engineer"]}