{"Job Title": "Sr . Software Development Engineer", "Company": "Resource Access Management Solutions Pvt. Ltd.", "Experience": "10 - 13 years", "Salary": "Not Disclosed", "Location": "Noida", "Job Description": " RMS is looking for engineers who are excited and passionate about tackling complex leading-edge software engineering challenges, processing large amounts of data at runtime within the context of a highly analytical, model-based computation framework. We are looking to solve incredibly challenging business and science real-world problems that will have a real impact.    Responsibilities:     Design, develop and maintain high-performance risk analytics, enterprise application designs, and software infrastructure using object-oriented design and analysis, using Java/Scala.   Experience working with Linux applications.   Experience working with Microsoft SQL Server writing Stored Procedures, complex sql.   Experience working with Microsoft SQL Server writing Stored Procedures, complex sql queries.   Experience working on distributed computing application on Linux platform.   Experience working with Kubernetes, docker.   Self-starter and self-motivated to learn new tech stack.   Champion coder.   Should have lead team design and development efforts in the capacity of tech lead for 3 years.   Must have excellent debugging skills on multi-tenant cloud environment.     What Youll Be Doing:     Utilize modularity and layering to enable high scalability and maintainability for software applications.    Write high-performance computer algorithms and software code for Risk Analytics suite of applications.    related artifacts. Translate design inputs into development work items. Assist in providing estimates for levels of effort required to accomplish expected deliverables.    Collaborate with fellow engineers, Product/Project Managers and Quality Assurance engineers to develop multi-tier, multi-layered application layer framework and functional components, following coding, documentation and design standards.    Research new technologies and techniques to support leading-edge development.    Provide an active contribution to the team responsible for the design, development, and implementation of critical enterprise scale applications.     Required experience and skills:     Expertise in Java   Expertise in designing and developing REST APIs in java   Nice to have Scala   Nice to have snowflake experience   Master of Science in Computer Science or Bachelor of Science in Computer Science with 5 or more years experience.   10+ years of programming experience     Desirable experience and skills  :     Familiarity with scripting languages such as Python or R   Experience in performance measurement, bottleneck analysis, and resource usage monitoring   Significant experience in multi-threading and memory management   Familiarity with probabilistic and stochastic computational techniques   Experience with data access and computing in highly distributed cloud systems   Experience in agile development.   ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Sc in Chemistry", "PG": "MS/M.Sc(Science) in Chemistry", "Doctorate": "None", "Key Skills": ["Software design", "Manager Quality Assurance", "Linux", "Coding", "Debugging", "Stored procedures", "Risk management", "Monitoring", "Python", "Recruitment"]}