{"Job Title": "Software Development Engineer III", "Company": "Delphix", "Experience": "6 - 11 years", "Salary": "Not Disclosed", "Location": "Noida", "Job Description": "     The Role    We are seeking a software engineer to join our Virtualization team.   We are seeking software engineers experienced in analyzing, debugging and diagnosing complex software systems to join our growing team. In this role, you will play a key role in architecting, designing and building large components of the product. You will help drive process improvements, help adopt best practices, and constantly help to improve the customer s experience.  Responsibilities    Architect, design and implement large scale components of the product.     Lead a team of engineers to deliver complex projects by defining structure in areas of uncertainty, identifying and expressing discrete deliverables, and managing interactions between different teams     Respond to time sensitive issues within multiple familiar software modules or subsystems, root cause issues, and proactively improve robustness of individual features     Proactively help team by establishing best practices, architecture, and mentoring others against them     Assess the impact of issues to identify and drive systematic improvements within an area     Work with engineering teams, product management, sales, and customers to understand requirements and develop solutions     Work with support, the field and customers to collect relevant data to come up with solutions and/or workarounds on complex, critical customer problems   Requirements    6-11 years of experience building and architecting enterprise products.     Experience in analyzing, debugging and diagnosing complex software systems - considering complexities like Performance, Scale, Interaction with Operating Systems, Multi-threaded interactions, etc.     A desire to build great products, learn new technical areas, and dive in wherever there is a need     Strong coding and architecture background in Java, with hand-on experience with industry best practices     Excellent analytical and problem-solving skills     Ability to handle critical situations involving high priority customer issues, manage multiple priorities and meet deadlines     Ability and desire to work in a test-driven, agile, collaborative, and iterative programming environment     Excellent written, verbal communication, and interpersonal skills. Ability to engage effectively with internal / external stakeholders to meet business objectives. Prior experience of working with teams in the US or other countries.     Minimum undergraduate college/university degree in computer science     An obsession for providing good experience to customers   Nice but not required    Experience with large/complex relational databases and data warehouses like Oracle, SQL Server, DB2, Azure, Amazon RDS, Teradata, etc.  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Product management", "Computer science", "SAP", "Db2", "Coding", "Debugging", "Agile", "Teradata", "microsoft", "Virtualization"]}