{"Job Title": "Staff Software Development Engineer in Test", "Company": "Hortonworks Inc.", "Experience": "8 - 14 years", "Salary": "Not Disclosed", "Location": "karnataka", "Job Description": " We are looking for a motivated and experienced Staff SDET for one of our promising team within Cloudera.     Requirements     Lead/contribute to engineering efforts from planning and organization to execution and delivery to solve complex engineering problems in quality and development.     Design and build advanced automated testing framework, tools, and automated test suites, in Python (pytest), Java (TestNG/JUnit).     Understanding of a variety of open source big data technologies.     Good knowledge of test methodologies, creating test cases and test plans.     Define the optimum suites for sanity, regression, smoke, deployment verification and advanced aspects of system testing automation.     Debugging, and deploying software for highly scaled cluster applications, involving thousands of servers, or enterprise applications involving large data centers.     Provide valuable fixes to our product development teams to the issues you ve found during exhaustive test runs     Work with product and field teams to make sure our customer simulations match the expectations and can provide valuable feedback to our customers     Develop automation to expand coverage and prevent regressions     Be a part of a great culture - Transparent and open meritocracy. Everybody is always thinking of better ways to do things, and coming up with ideas that make a difference. We build our culture to be the best workplace in our careers.       Preferred Qualifications     BS/MS in Computer Science or related field.     8-14 years of experience in test development, automation tools development, and/or data center administration.     Strong knowledge in at least 1 of the following languages: Java / Python     Mine and analyze data from product code base and automation to enhance quality. Develop automated tests for web, APIs and performance.     Excellent communication and collaboration skills. Ability to work effectively both independently and as part of a team.     Confidence with Linux environments     Working knowledge of the Hadoop ecosystem, Big Data is an added advantage.     Ability to identify critical weak spots in distributed software systems     Experience in developing automated test cases and test plans     Ability to deal with distributed systems     Ability to work independently on multiple tasks     Self-driven motivated, with a strong work ethic and a passion for problem solving     Innovate, automate and break the code   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "cloudera", "security architect", "Automation", "Linux", "Enterprise applications", "Debugging", "Test cases", "Open source", "Python"]}