{"Job Title": "Software Development Engineer - UI Engineering", "Company": "Delphix", "Experience": "6 - 10 years", "Salary": "Not Disclosed", "Location": "Noida, New Delhi", "Job Description": "  We are seeking an experienced, detail-oriented engineer to join our growing team. In this position, you will play a key role in the overall success of our product development organization via planning, managing, and monitoring engineering functions. You will be responsible for various engineering projects, processes and timelines, and making any necessary adjustments in order to ensure successful completion.         Responsibilities       Be a hands-on developer, make regular code contributions in front-end technologies    Create detailed engineering plans, processes, and procedures for engineering staff to use and abide by   Check and confirm the accuracy of work and the methods used by engineering staff   Monitor and determine various staffing and training needs   Hire, train, and supervise engineering staff members   Administer employee performance evaluations and provide constructive feedback   Identify opportunities for innovation in product and processes   Communicate and collaborate with other managers, product management, customer support, and other stakeholders       Must have     6 years of experience building software    Prior experience building high-performing engineering teams, proven ability in recruiting and growing a strong technical team   Excellent written, verbal, and interpersonal skills   Ability to engage effectively with internal/external stakeholders to meet business objectives   Hands-on experience contributing to a large code base    Experience analyzing, debugging and diagnosing front-end software   Fluency with object-oriented design patterns   Experience with modern Javascript frameworks, preferably Angular/AngularJS   Experience writing automated unit tests, preferably using Jasmine   Minimum undergraduate college/university degree in computer science   Good understanding and prior experience of the Agile process (Scrum or Kanban)     Good to have     Experience using GraphQL (a.k.a. GQL, a.k.a. Apollo)   Code Build and Deploy experience using either of the following tools: Angular CLI, Webpack, Yarn, Ant, Grunt   Conceptual knowledge of Relational Database design   Experience contributing to the design of REST API signatures, including consideration of Pagination, Sorting and Filtering   Experience working with Experience Design to promote clean interactions, consistency and accessibility   Experience working with product management to prioritize projects/features and define roadmaps  ", "Role": "Team Lead/Technical Lead,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Product management", "ERP", "Front end", "Database design", "Debugging", "Javascript", "Agile", "Scrum", "Oracle", "Monitoring"]}