{"Job Title": "Senior Software Development Engineer - VSDK", "Company": "Delphix", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Noida, New Delhi", "Job Description": "  We are seeking a software engineer to join our Virtualization SDK team.     As part of this team, you will contribute to the SDK that can be used to write plugins that extend the Delphix platform to support a variety of new data sources. Our team works closely with plugin developers to figure out new and interesting ways to build extensions for the platform, whether that is no-SQL data sources like MongoDB or Cloud native sources like AWS RDS.        The SDK is used both within Delphix Engineering and Field Services, as well as by Partners and Customers to develop data source plugins and extensions. The team works on a full software stack that consists of a Java based backend with REST API web services and a Python based SDK.        You will design and implement new features in critical components of the product, and solve interesting problems that help extend the Delphix Virtualization Platform and SDK.     Here are some examples of recent projects that our team has delivered:Released the open source Virtualization SDK last year to make it generally available to Delphix Engineering and Field Services as well as external Partners and CustomersDeveloped support for allowing plugin developers to upgrade plugins seamlessly as they ship new features        Links:    GitHub Repository    Developer Documentation        We are a geographically diverse team currently working from home due to the ongoing pandemic. We foster a collaborative and inclusive work environment. As part of the broader Delphix engineering community, you will have the opportunity to drive process improvements, help develop and drive adoption of best practices, and contribute new ideas to help make Delphix and its products better.        Qualifications     Strong coding skills.   Good programming experience in at least one language out of Java or Python. At same time open to learning the other one.   An interest in learning new technologies.      Nice but not required     Experience with relational databases and data warehouses like Oracle, SQL Server, DB2, Azure, Amazon RDS, Teradata, etc.   Experience developing or using SDKs.  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["ERP", "Backend", "Db2", "Coding", "MongoDB", "SDK", "Teradata", "Open source", "Virtualization", "Python"]}