{"Job Title": "Technical Lead , Software Development Engineering", "Company": "Vertafore", "Experience": "4 - 6 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": " Job Description    As a Technical Lead, Software Development Engineering in Test, you will be instrumental in Vertafore s ongoing success within the insurance industry. Our leads work with our development, product teams focusing on the providing the best products for our valued customers. This is a fast paced, ever changing environment. We continually challenge ourselves to exceed objectives, remove barriers, meet crucial deadlines, and maintain multiple projects, all while pioneering ways for efficiency with a team player attitude. If you have a passion for product quality, love technology, and enjoy thinking outside the box, you are who we are looking for.     Core Requirements and Responsibilities:     Essential job functions included but are not limited to the following:    Create testing and automation strategies and approaches in alignment with overall organizational goals    Write test cases    Establishes overall test infrastructure, creates and coordinates test systems    Coordinates testing across products and establishes best practices    Reviews testing documentation provided by others on the team, providing feedback and integrating documentation     Skills/Requirements     -Demonstrated leadership in development of software products    -Can handle problems of complex scope    -Has 4 to 6 years of direct development test experience    -Drives and develops automation test plans across teams    -Extensive mentoring and coaching of junior engineers  ", "Role": "Team Lead/Technical Lead,", "Industry Type": "Insurance,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Product quality", "Automation", "Lead Software", "Product innovation", "Manager Technology", "Infrastructure", "Technical Lead", "Test cases", "Management", "Testing"]}