{"Job Title": "Architect, Software Development", "Company": "Aptean", "Experience": "2 - 7 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  Job Summary:    The Architect will plan, design, develop, and execute new ideas and products for software applications and solutions. The Architect will be accountable for resolving complex problems that impact design success of at least one or more, current or developing products. The Architect will lead the research, design, definition and implementation of the product software architectures.      Essential Duties & Responsibilities:    1. Identifies product needs and potential enhancements, designs, develops and implements software applications and solutions in conjunction with the Product Development Manager or designate.   2. Leads in the development and testing of new software applications and solutions.   3. Builds and assembles prototype assimilations of software applications and solutions as directed.   4. Writes code, completes programming and debugs software applications and solutions.   5. Deliver high quality software applications and solutions that are extensible and scalable within the specified timeline.   6. Lead the research and development initiatives to identify Customer/Partner driven product features for improved product usage and promotion.   7. Responsible for the software architecture of complex systems and/or services provided to the customer.   8. Leads a project or project section as required. In addition, reviews projects against goals and provides status reports.   9. Advises management (and Customer/Partners from time-to-time) on technical problems and direction.   10. Actively interfaces with the product marketing, global services team and Customer/Partners to plan new or custom features.   11. Identify product requirements and potential improvements and discuss them with the Product Development Manager.   12. Participate in the complete software development life cycle from requirement gathering to deployment of the product.   13. Participate in interviewing and hiring practices as directed and advised by management team   14. Mentors Leads and Software Developers.   15. Reviews critical code, design documents and architecture.   16. Retains and keep appraised of industry intelligence, changes in the market place and trend analysis of visionary usage and opportunity for current and new products relating to support software.   17. Undertake any other assignments for which the companys management may request your participation from time to time.   18. Acts in the capacity as the liaison point for business and technical issues between the internal management, the Customer/Partner and Company as required. ", "Role": "Technical Architect,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["software architecture", "Prototype", "Architecture", "Trend analysis", "Software development life cycle", "Management", "Research", "Application software", "Product marketing"]}