{"Job Title": "Software Development Engineer III - Reactnative", "Company": "Bigshyft Hiring for Swiggy", "Experience": "5 - 10 years", "Salary": "₹ 20,00,000 - 35,00,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": "About the team-The Instamart Supply chain technologies team is looking for senior mobile engineers to build a new app for supply chain use-cases at our own warehouse and POD’s. This app will be used by POD executives (Picker, Loader, QA,etc) and Store managers for Inwarding of shipments received at POD’s using barcode technologyWhat Makes you a great fit:Experience in designing, refactoring, re-architecting, deprecated and/or implemented an app from start to finish.Good understanding and experience in building a React Native app.Deep understanding of the Android SDK - Software development kit which has a source code, development tools, an emulator,,and libraries that is used to build android applicationsPrior experience in shipping Android Apps for consumersStrong problem solving and debugging skillsWhat You'll do:Design and writing clean, testable, readable, and maintainable code to build mobile user experiences that scales and performs well for millions of orders.Participate in the discovery phase of Engineering projects via collaborating with cross-functional teams; implementing proof of concepts to ensure concept is feasible.Work with POD operations teams to ensure applications and services are highly available,usable and reliable. Participate in code reviews for peers and junior engineers.Use Test-Driven and Experiment Driven DevelopmentWork with Other Senior Engineers across multiple teams to build mobile solutions to optimizing supply chain managementPerks and Benefits Day care facility 5 day work week Health care benefits Option to 'work from home' Flexible work hours", "Role": "Software Developer,", "Industry Type": "Internet, Ecommerce,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "Doctorate": "None", "Key Skills": ["POD", "React native", "Android SDK", "Android"]}