{"Job Title": "Software Development Engineer - Bangalore", "Company": "Upman Placements Pvt Ltd     ", "Experience": "4 - 9 years", "Salary": "₹ 18,00,000 - 30,00,000 P.A. ", "Location": "Bangalore/Bengaluru", "Job Description": " We at UpMan Placement have a wonderful opportunity for the profile of Software Development Engineer\" for “Bangalore\" Location.We have an urgent opening with one of our client is into “Financial Services”Designation: - Software Development EngineerLocation: - Bangalore Requirement: Extensive and expert programming experience in any one programming language (strongOO skills preferred). Deep experience in java programming language A solid foundation in computer science, with strong competencies in data structures,algorithms, and software design. Have a penchant for solving complex and interesting problems. BE/BTech, MTech in Computer Science or related technical discipline (or equivalent). Excellent coding skills – should be able to convert the design into code fluently Good skillsto write unit & integration tests with reasonable coverage of code & interfaces - TDD is a plus Experience in building highly scalable business applications, which involve implementinglarge complex business flows and dealing with the huge amount of data. Experience withmulti-threading and concurrency programming Ability to switch between the technologies and learn new skills on the go. 3+ years and above exposure in the art of writing codes and solving problems for largescaleKindly Note : If interested then kindly call on 720880379 or send your update CV on assignment@upman.sg ", "Role": "Testing Engineer,", "Industry Type": "Other,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers, B.Sc in Computers, BCA in Computers", "PG": "MS/M.Sc(Science) in Computers, M.Tech in Computers, MCA in Computers", "Doctorate": "None", "Key Skills": ["Java", "Software Development", "Multithreading", "Algorithms", "TDD", "Coding", "Data Structures", "Programming", "Business Applications", "Software Design"]}