{"Job Title": "Senior Staff Software Engineer, Development - VisaNet", "Company": "Visa", "Experience": "12 - 15 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": " Job Description     Position Summary    This position is ideal for an experienced software engineer who is passionate about solving challenging business problems and building applications that provide an excellent user experience. The candidate will be extensively involved in hands-on activities including POCs, design, documentation, development and test of new functionality. You will be an integral part of the Open VisaNet development team. Open VisaNet; The Next Generation payment processing platform for Visa, will push the envelope of building highly scalable, secure, cost effective and distributed application on commodity hardware using best-in-class technology components. Open VisaNet is one of Visa s Key initiative that will provide Visa an opportunity to move away from Proprietary Mainframe type systems. It is built as a modern distributed architecture based on micro services with goals of five 9 s availability, fault tolerance, horizontal scalability and real time latency for largest scale transaction processing. Open VisaNet leverages state of the art Open Software technologies to achieve these goals on commodity hardware, such as Golang, Scala, Apache Kafka, Cassandra, Docker, Kubernetes, Elastic Search etc.    Responsibilities     Design, develop and own mission-critical systems for highly scalable infrastructure for low-latency and high-throughput core payment processing system that has six 9 s availability.     Design and develop world-class software for Cloud components. Marshall industry coding standards , design patterns and practices within Visa     Technical hands on skills, ideally in multiple technology stacks for software development and deployment on diverse platforms.     Deliver zero defect code and be responsible for insuring the team's deliverables to meet or exceed the prescribed defect SLA      Build tools to improve operational efficiency of cloud infrastructure in all areas of Infrastructure Automation i.e. Provisioning, Scaling, Availability, Upgrade, Maintenance, Security and Governance     Partner with internal and external stakeholders to understand business problems and then design and develop required solutions      Partner with architects to ensure that the developed solutions adhere to established best practice and architectural target state.     Break down architected solution into smaller and achievable tasks     Understand E2E implementation and architecture of products/apps in production to optimize and ensure efficiency     Lead the development of new products iteratively by building quick Proof of Concepts and converting ideas into real products     Technically lead and mentor a team of bright and enthusiastic developers with emphasis on excellence in all of what we do     Ensure proper metrics and instrumentation in software components, to help facilitate real time and remote troubleshooting/performance monitoring     Ensure proper documentation and internal publishing of design tradeoffs, code best practices and lessons learned     Performance Tuning and Increase Operational efficiency on a continuous basis     Create an outstanding engineering culture of creativity and innovation embodying whatever it takes attitude with ownership and pride in work     Evaluate and introduce technology tools and processes that enable Visa to develop products and solutions, to embrace technical/business opportunities and/or improve operational efficiency      Qualifications     Basic Qualification     12-15 years of work experience with a Bachelor s Degree or     8-10 years of experience with an Advanced Degree     4+ years of proven experience leading teams that have delivered high quality enterprise class applications that supports high-throughput / availability / resiliency / low-latency at scale     Strong on elegant coding; can write very solid prototypes or core components quickly     Experience with programming languages like GoLang/Java     Experience with container technologies like docker, kubernetes and NoSql databases     Understanding of architecture and operations of micro-service oriented systems     Must be high impact individual with a technology background and the ability to engage in high bandwidth conversations with executives.     Understand and own component security analysis, including code and data flow review. Collaborate with security team to implement and verify secure coding techniques.      You have strong experience with agile development incorporating Continuous Integration and Continuous Delivery (CI/CD), utilizing technologies such as GIT, Maven, Jenkins, SonarQube, Checkmarx      Outstanding verbal, written, presentation, facilitation, and interaction skills, including ability to effectively communicate architectural issues and concepts to multiple organization levels     Preferred Qualification     Master's degree in computer science or a related technical discipline     Domain experience in Payment technologies     GoLang, event driven paradigm, development and maintenance of micro-services, alignment towards- uptime, observability, monitoring      Expert knowledge in hardware, software, and distributed applications environments and solid understanding of their associated capacity and performance indicators     Knowledgeable about network architecture, VIPS, and Firewalls    Basic Qualification     12-15 years of work experience with a Bachelor s Degree or   8-10 years of experience with an Advanced Degree   4 years of proven experience leading teams that have delivered high quality enterprise class applications that supports high-throughput / availability / resiliency / low-latency at scale   Strong on elegant coding; can write very solid prototypes or core components quickly   Experience with programming languages like GoLang/Java   Experience with container technologies like docker, kubernetes and NoSql databases   Understanding of architecture and operations of micro-service oriented systems   Must be high impact individual with a technology background and the ability to engage in high bandwidth conversations with executives.   Understand and own component security analysis, including code and data flow review. Collaborate with security team to implement and verify secure coding techniques.    You have strong experience with agile development incorporating Continuous Integration and Continuous Delivery (CI/CD), utilizing technologies such as GIT, Maven, Jenkins, SonarQube, Checkmarx    Outstanding verbal, written, presentation, facilitation, and interaction skills, including ability to effectively communicate architectural issues and concepts to multiple organization levels     Preferred Qualification     Master's degree in computer science or a related technical discipline   Domain experience in Payment technologies   GoLang, event driven paradigm, development and maintenance of micro-services, alignment towards- uptime, observability, monitoring    Expert knowledge in hardware, software, and distributed applications environments and solid understanding of their associated capacity and performance indicators   Knowledgeable about network architecture, VIPS, and Firewalls  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Computer science", "Performance tuning", "Maven", "Automation", "Publishing", "GIT", "Coding", "Apache", "Troubleshooting", "Monitoring"]}