{"Job Title": "Software Engineer - NiFi Development", "Company": "Amdocs Development Center India Pvt. Ltd.", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "    You will design, develop, modify, debug and/or maintain software code according to functional, non-functional and technical design specifications.  You will follow Amdocs software engineering standards, applicable software development methodology and release processes, to ensure code is maintainable, scalable, and supportable, and demo the software products to stakeholders.  You will investigate issues by reviewing/debugging code, provide fixes and workarounds, and review changes for operability to maintain existing software solutions.  You will work within a team, collaborate and add value through participation in peer code reviews, provide comments and suggestions, and work with cross functional teams to achieve goals.  You will assume technical accountability for your specific work products within an application and provide technical support during solution design for new requirements.  You will be encouraged to actively look for innovation, continuous improvement, and efficiency in all assigned tasks.        Bachelor's degree in Science/IT/Computer Science or equivalent   Experience in Developing Nifi Pipelines with the following characteristics:    Generic processor groups for shared functionalities like error handling, monitoring, logging, etc.   Understanding of HTTP request and listener processors   Understanding of working with/connecting to AWS services (i.e. S3, SQS, API Gateway, etc.)   Knowledge of working with DB controller services for Oracle   Good understanding of JSON and JSON Schemas   Good understanding of XML   Knowledge in script processors: Groovy, Python   Knowledge in building custom processor a plus: Java development   Understanding of underlying Nifi data handling: flow files repo, content repo, provenance repo   Experience in developing pipelines for Nifi Clusters.   Experience in Nifi server administration   Installation   Upgrade   Troubleshooting   Security configurations   Understanding of working with Nifi Registry   Understanding of Nifi variable and controller services scopes            Why you will love this job:     You will be challenged to design and develop new software applications.  You will have the opportunity to work in a growing organization, with ever growing opportunities for personal growth.      ", "Role": "Software Developer,", "Industry Type": "Telcom, ISP,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "XML", "HTTP", "JSON", "Oracle", "Troubleshooting", "Amdocs", "Technical support", "Monitoring", "Python"]}