{"Job Title": "Product Development Manager  Software Engineering", "Company": "Itron Inc.", "Experience": "4 - 9 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "     Responsibilities:      Recruit, mentor, coach, and make effective world class engineering teams.     Daily management of objectives, priorities, tradeoffs, risk and performance management of all reporting staff.     Provide technical leadership, career development, and mentoring to team members.     Assign areas of ownership, ensure engineers have clear priorities and adequate resources.     Maintain high morale and motivate engineers to go above and beyond.     Participate in architecture discussions and planning with Product Management,    Customer support and delivery organizations.     Communicate status, risks to delivery dates, and offer mitigation strategies to ensure on-time delivery of all committed projects to cross functional teams.    Develop, implement, enhance, and maintain build and release management tools.    Be operational savvy and look for process and product improvements to drive operational efficiencies.    Develop junior members by coaching, empowering, reviewing results, both in technical areas and in “soft” skills.    Be self-driven and identify gaps knowledge gaps and prepare plan to address those gaps.    Analyze requirements to develop and execute consistent procedures, automation of builds, continuous integration, upgrading source code management practices and structuring source tree for efficiency and stability.      Requirements:  Education   o BS/MS degree in Computer Science or related fields and/or equivalent work experience.   People and Project Management Skills  o Excellent verbal and written English communication skills, impeccable organizational and time management skills.  o Ability to lead and mentor heterogeneous engineering teams in complex projects.  o Incredible work ethic that thrives in fast paced, dynamic work environment.  o Ability to multitask between projects with minimal loss in productivity.  o Proven ability and desire to deliver projects on time, on quality.  o Able to cope with and thrive in uncertain and changing project requirements.  o Ability to motivate people, instill accountability and achieve results.   o Agile, proactive, comfortable working with ambiguous specifications and can prioritize on the fly.   o Experience in short release cycles, the full software lifecycle, and have worked on a product that was actually released to market.     Experience:   o Experience of minimum of 14 years in product development with at least a min of 4 years in product development management  o Must have 4 years of SW Development Manager level experience managing complex applications development and leading large teams.  o Must have experience on Enterprise and client server architecture applications.  o 6 years of professional .NET, C#, WPF, WCF, ASP .NET, Java script, development experience.  o Experience with important open-source technologies will be big plus.  o Experience in IOT or automation domain will be a great advantage.   o Prior experience in building services on cloud/Azure platforms will be huge plus.  o Experience in managing complex projects that require a deep understanding of the application logic and dependencies.  o 3 years of professional RDBMS development experience that leveraged complex SQL, DML, DDL, and well-designed schemas.  ", "Role": "Product Manager,", "Industry Type": "Oil and Gas, Energy, Power, Infrastructure,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Product management", "Automation", "RDBMS", "Agile", "Customer support", "WCF", "WPF", "Open source", "Release management", "SQL"]}