{"Job Title": "Software Development Engineer Testing", "Company": "PRI INDIA IT SERVICES PRIVATE LIMITED.      ", "Experience": "4 - 8 years", "Salary": "₹ 4,00,000 - 8,00,000 P.A. ", "Location": "Pune", "Job Description": "RI Global is a leading-edge workforce, information technology, cyber security, and innovative business solutions company. PRI Global was established in 1997 in St. Louis, Missouri with locations in California, New Jersey, India, and the Philippines. At PRI Global, every employee has a stake in the companys success. Everyone is team-driven and operates to put collective goals ahead of everything else. Our employees adhere to a core set of values and guiding principles and takes a pledge to the company.I am Swati Kulkarni your Sr Talent acquisition specialist working for PRI and operates from Viman Nagar, Pune.We at PRI are looking to hire Software Engineer Tester to support one of our top clientPlease find below the details of the same:OverviewPush Payments Development team owns a number of applications, primarily focusing on the Client Send application.Client send is an API based application which primarily focuses on P2P, Disbursement and cross border transactions.This position will be responsible for driving best practices and automated testing within Push Payments team to deliver applications and solutions that meet the needs of our stakeholders.Are you passionate about building new technology services and interested in sharing that knowledge and passion with others?Do you love to solve problems and find creative solutions?Do you want to be part of an agile software development, collaborative environment?RoleParticipate in requirements review/story elaborations and testing activities to deliver high quality products and incremental value with every iteration.Document test plans and acceptance criteria using Rally or similar life cycle management tools.Develop test scripts and perform automated and manual exploratory testing to ensure software meets business and security requirements and established best practices.Leverage available tools and frameworks to produce durable tests and avoid application fragility.Follow through to ensure defects are reported and escalated appropriately.All About YouBachelor's degree in Information Systems, Information Technology, Computer Science, Engineering or equivalent work experience.Expertise knowledge using Selenium and any BDD framework (Cucumber, Jasmine or JBehave).Intermediate Knowledge in REST API testing and knowledge of any API automation framework (Restassured, Spock or Karate).Intermediate Knowledge of StormRunner or other performance testing tools.Intermediate knowledge in core Java, Groovy, Node.js, and ReadyAPI.Advanced experience writing user stories and acceptance criteria.Strong communication and problem-solving skills.Experience with software development methodologies, particularly with Agile/Scrum methodologiesIf the opportunity interests you, please reach out to me on swatip@priglobal.com.If you could help us in passing on the opportunity to the job seekers , we would be grateful.", "Role": "Testing Engineer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Any Doctorate in Any Specialization", "Key Skills": ["Java", "Automation", "API", "Selenium"]}