{"Job Title": "Software Development Engineer - II", "Company": "Bigshyft Hiring for MindTickle", "Experience": "3 - 6 years", "Salary": "₹ 11,00,000 - 21,00,000 P.A. ", "Location": "Pune", "Job Description": "What You'll Do:Design and develop software solutions that manage the life cycle of MindTickle deploymentsOptimize and improve deployment workflowDeliver solid Infrastructure as a Code by using automation tools such as Terraform/Ansible/PythonBuild and deploy monitoring and alerting systems across our entire infrastructureTroubleshoot and resolve live production issues by analyzing logs from different sourcesEnhance and maintain our metrics and logs collection, processing and visualization infrastructureBuild and maintain container orchestration PlatformAbility to quickly learn new processes, applications, and tools as requiredMaintain, review, propose and implement improvements to existing infrastructure, tools and processesContribute to open-source software projectsEvangelizing best practices to the wider engineering organizationWhat Makes You A Great Fit:Experience coding in higher-level languages (e.g. Python/Golang/Java). This role will require the ability to understand others code and to write your own for some automation tasks.Experience with Cloud IaaS (primarily AWS, Azure, GCP)Experience with containers and orchestration (Docker, Kubernetes)Working experience of source code management systems like SVN or GitExpert knowledge of cloud architecture and implementation features (OS, multi-tenancy, virtualization, orchestration, elastic scalability)Solid understanding of load balancing, Linux/Unix-related network services, TCP/IP networking, CDNsExperience with modern software components (Nginx, Mongo, Postgres, Redis, ElasticSearch, RabbitMQ, JVM, Play)Experience with a non relational database (Mongo, Couchbase) and cache layers (Memcached, Redis)Configuration management using tools like Ansible, Puppet or ChefMust have well-executed planned application/database or infrastructure changes with zero downtimes.Perks and Benefits Flexible work hours Health care benefits", "Role": "Software Developer,", "Industry Type": "Internet, Ecommerce,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "Doctorate": "None", "Key Skills": ["Golang", "Java", "Docker", "Python", "Kubernetes"]}