{"Job Title": "Remote Software Development Manager (Nodejs, AWS, MEAN Stack)", "Company": "RemoteStar Ltd", "Experience": "6 - 11 years", "Salary": "₹ 15,00,000 - 30,00,000 P.A. ", "Location": "Pune, Bangalore/Bengaluru, Delhi / NCR", "Job Description": "Remote working is the new norm. Do you want to avoid a daily commute, reduce stress, achieve work-life balance, spend more time with your family, be more creative and improve productivity? At RemoteStar, we follow a remote-first work policy. If youre passionate about working from home or a nearby co-working space with leading start-ups and scale-ups, RemoteStar can be a great fit. At RemoteStar we help both employers and employees to build a great remote-team culture, reduce overheads and improve productivity.About Role - Remote Software Development Manager (Nodejs, AWS, MEAN Stack)A London based Start-up is building an innovative and disruptive digital health platformYou will be reporting directly to the CTO based in Cambridge, UK. As Team Lead youll participate in all development aspects of the solution. Your mission will be to drive the progress of the web application and the development team while providing the best user experience imaginable. This is a full-time permanent role for a true self-starter, someone who wants to build something from the beginning. As our Software Development Manager (Nodejs, AWS, MEAN Stack), you’ll be responsible forOwning products and problems from initial inception through to delivery, monitoring, and support,Providing input and assistance to Engineers, to ensure the delivery of well tested and high -quality solutions,Understanding the business requirements and providing the best possible solutionManaging the overall SDLC process and ensuring timely delivery,Exploring new technologies and advising on appropriate tools and practicesShine with engineering excellence by developing test infrastructures, writing documentation, ensuring high performance, and following an agile development methodologyEnsure development best practices are followed (Clean Code, Clean Architecture, code reviews)Reviewing code and giving concrete feedback to developersActively communicate with the stakeholders, team members, and clientsWhat do we value?Has a background from a very senior developer with a wide range of programming, design, and architecture experience.MEAN Full-Stack hands-on development experience Good cloud hosting experience(preferably AWS) and container orchestration such as Docker Working knowledge of database concepts, SQL/NoSQLAgile /DevOps delivery methodologies and its best practiceUtilizing various technologies to maintain and optimize a CI/CD pipelineCapable of managing cross-functional remote  agile deliveriesHave  delivered several agile software projects in the past covering a variety of product including responsive web applicationsHas a strong understanding of Security, scalabilityA good understanding of agile development process(SCRUM/KANBAN) and how to apply themAbility to work in a diverse, multi-cultural, remote-team environmentGreat communication and collaboration skills and a strong teamwork ethic.Able to proactively communicate with non-technical stakeholders, manage expectations, and explain the value of addressing technical debtWhat is on offer?Participate in an open, fun, entrepreneurial, and creative company culture Global organization and international opportunitiesWork from the location of your choiceCompetitive SalaryFeature ownership — combine data and customer feedback to create meaningful solutions to the everyday problems our users face.Unlimited annual leave; we do our best work when we’re feeling refreshed so take the time you need to relax! Flexible working — we trust you to work whenever and wherever you feel most productive.Found a great book, meetup, or conference? We’ll pay for the tools and resources to support your continued learning!It’s important to stay healthy, so we’ll pay towards your gym membership or fitness apps, and have Self Space appointments availableBYOD – You are welcome to work from your own choice of laptopWho are we?We are RemoteStar, a team of experienced engineering and people managers on a mission to transform the future of work. We’re not your typical workplace. At RemoteStar, we believe in data-driven decision-making and the importance of flexibility, fun, passion, personal growth, and transparency. And we’re doing everything we can to make sure you’re enjoying every minute you spend with us.Here at RemoteStar, we’re passionate about creating an inclusive culture that encourages, supports, and celebrates the diverse voices of our employees. Everyone is welcome. We don’t discriminate on the basis of any protected characteristic including race, religion or belief, gender or gender reassignment, age, sexual orientation, marital status, or disability. We want to facilitate everyone in bringing their best selves to our interviews, so if there are any adjustments we can make for our process to be more inclusive, please let us know. Additionally, trust and privacy are key to our success at RemoteStar, so we would like to let you know that in compliance with the Data Protection Act 2018, upon submitting an application, your CV and personal details will be added to our database and may be used to match you to any future, suitable vacancies as they arise. Of course, we will remove your details at any time should you wish us to do so. ", "Role": "Technical Architect,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "MCA in Any Specialization, M.Tech in Any Specialization", "Doctorate": "None", "Key Skills": ["Mean Stack", "CI/CD", "Devops", "Container", "Software Development", "NoSQL", "Scalability", "Build", "SQL"]}