{"Job Title": "Software Development Lead", "Company": "Simba Technologies", "Experience": "9 - 14 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   Overview:      Magnitude Software is looking for the best and brightest talent to join our software engineering team, working on novel data management    products    .    .      We are looking for candidates with:       A passion for high quality software engineering and technology        An interest in working    on large-scale data challenges across different technologies        Strong educational credentials        Drive and ambition to achieve, thrive, and succeed        Likes to solve challenges in connectivity space which offer mostly desktop system software experience       Tasks:       Analyzes, designs, develops and documents commercial software    products        Work on the research, development, testing, and maintenance of new and existing    odbc    and    jdbc    drivers        Demonstrates high aptitude in a variety of software engineering conc    epts, practices, and procedures        Relies on extensive experience and judgme    nt to plan and accomplish goals        Take ownership of development work through to delivery, including fully automated testing of components        Work under the supervision of the Manager to accomplish engineering tasks and objectives        Adhere to defined coding standards and best practices.        Participate in design and code reviews        Provides technical support to project te    am members        Will    perform team lea    dership for a team of engineers       Desired Skills and Experience:       9 to 14 years    of experience designing and building software. Previous experience developing commercial software is desirable but not required        Our product suite is built using a diverse set of programming languages and technologies. More than just a great coder, we are looking for someone with flexibility and the ability to quickly learn new languages and technologies.    Ability to learn and move to different stack    as the project demands    is a must.        Experience in C    ++    and SQL    is a must.        Knowledge of    C    #    ,    Java,    xml    , test automation environments    are added    advangages    .        Experience in protocols, specifications, drivers will be an added advantage        Experience developing in the Microsoft technology stack desirable        A good understanding of Win32, Unix    odbc    environments will be an added advantage.        A    Bachelors    degree or higher, in a computing-related discipline       Personal Characteristics:       A good understanding of the processes involved in commercial software product development        Excellent written and verbal communication skills        Works well in a team environment, and makes reaching team goals the highest priority        A self-starter who can recognize impediments and finds ways to overcome them        Ability to work with stake holders from North America     ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Unix", "Data management", "Coding", "XML", "JDBC", "Software product development", "Software Development Lead", "microsoft", "Technical support", "SQL"]}