{"Job Title": "Professional - Software Development", "Company": "Sutherland Global Services Inc", "Experience": "3 - 4 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad, telangana", "Job Description": "   Job Description      Sutherland is looking for the   developers   to join the   Healthcare Digital Engineering   team for the Automation projects and will be responsible to deliver the automations that included the development of software, testing & deployment. The person should have hands-on experience in C#.NET, VB Script, Java Script, Any of the automation tool (Blueprisim, Goanywhere etc.). We are a group of dynamic and driven individuals. If you are looking to build a fulfilling career and are confident you have the skills and experience to help us succeed, we want to work with you!    Responsibilities  :    Keep management updated  : Should update the management on the status.   Analytical skills  : Good analytical skills and able to think End to End solution for the requirements provided.   Development activities  : Responsible for design, coding, Testing and deployment (if required) of the complete application for the requirements provided.   Define Sutherland s reputation  : Oversee and manage performance and service quality to guarantee customer satisfaction; provide coaching and feedback to CSRs   Strengthen relationships  : Should work as a team and able to communicate effectively with customer and team members   Take the lead  : Able to debug the production issue quickly and provide the root cause analysis with resolution for the issue.    Qualifications:    To succeed in this position, you must:    Software developer with 3 - 4 years of experience in the .NET technologies.  Primary responsibilities  Hands-on experience with .NET Framework, C#, SQL Server, Web Services.  Experience with client-side scripting (JavaScript, jQuery, AngularJS)   Problem solving skills & good team player  Completing the assigned tasks by adhering to the coding standards and quality processes  Key competencies   Experience on mobile applications will be an added advantage (familiarity with RESTful APIs to connect Mobility applications to back-end services and familiarity with Android SDK, etc)  Functional Domain: Exposure to the U.S Healthcare domain knowledge will be an added advantage.  Process: Working experience in the Agile SCRUM methodologies.  Educational Qualification: B.E / B.Tech / M.C.A    ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "PG": "MCA in Computers", "Doctorate": "None", "Key Skills": ["Analytical skills", "Automation", "jQuery", "Coding", "Talent acquisition", "Healthcare", "Android SDK", "Service quality", "SQL", "Recruitment"]}