{"Job Title": "PMTS-Software-Development-Eng_", "Company": "Advanced Micro Devices, Inc", "Experience": "3 - 7 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Job Description\n\n AMD is looking for an experienced engineer for an exciting role for edge inference team. This person will be a member of a core team and will work with the latest hardware and software technology. The person will interact closely with key AMD technical experts to ensure the best possible performance and results on AMD platforms.\n\n The successful candidate for this position will be responsible for developing/ optimization and testing of the edge inference software for AMD processors. This is a great opportunity to work as a part of highly regarded team to deliver leading edge solutions.\n\n  \nMinimum Requirements /  Desired Skills:\n\n         Graduate/ Post Grad degree in Computer Science or related fields\n\n         Good background in Machine Learning concepts (ML) and ML frameworks like TensorFlow,  Caffe,  Pytorch.\n\n         Three years or more of relevant work experience\n\n         Experience in analyzing performance bottlenecks,  and implementing optimizations to relieve analyzed bottlenecks\n\n         Knowledge of one or more CPU Profiling tools\n\n         Knowledge of GPU,  GPU programming would be added advantage\n\n         Experience in contributing/ maintaining to open source projects\n\n         Strong technical skills and experience in software product development using C /  C++ in Linux and Windows environment \n\n         Ability to quickly learn new skills and drive completion of business goals\n\n         Experience working in a multi- site environment and ability to travel occasionally to meet with developers\n\n         A team player,  who is very self- motivated,  loves difficult challenges,  and is goal driven \n\n         Excellent verbal/ written communication and evangelizing skills with an entrepreneurial spirit to drive results is a plus", "Role": "Software Developer,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Graphics", "Computer science", "C++", "Linux", "Machine learning", "Software product development", "high performance computing", "Windows", "Open source", "Gaming"]}