{"Job Title": "Manager , Software Development", "Company": "Xactly Corporation", "Experience": "5 - 8 years", "Salary": "Not Disclosed", "Location": "India", "Job Description": " Job Description    Job Title: Software Engineering Manager     Function: Engineering     Location: Bangalore     Position Type: Full - time     Position Level: Managerial     Travel Requirements: Travel Required  -  Medium     Named among the best workplaces in the U.S. by Great Place to Work six times, honored on FORTUNE Magazine s inaugural list of the 100 Best Workplaces for Millennials, and chosen as the Market Leader in Incentive Compensation by CRM magazine, Xactly is proud to be disrupting the incentive compensation market space. We re building a culture of success and are looking for motivated professionals to join us!      THE OPPORTUNITY      Xactly s engineering team is growing rapidly and we are looking for engineering managers to our fast growing Bangalore office. You must be a curious engineer at heart who is adventurous enough to explore open source code, forums, meetups, vendor resources and other knowledge base avenues. You must be strongly committed to good engineering discipline and process. The ideal candidate will share our passion for SaaS products. You must strongly believe in Continuous Integration and Deployment as well as a DevOps culture. Working in a dynamic agile environment, you will collaborate daily with peer managers, product managers, software engineers and architects, technical writers, QE engineers, and data center operations engineers.      Be a highly technical manager with deep experience in software and systems       Lead from the front during problem solving sessions by understanding and empowering the team by articulating clearly the context and business rationale.       Partner with peer engineering managers and leads to drive continuous process improvements and innovation.       Be a subject matter expert, lead the team by example and have a strategic influence.       Establish trust and coordinate with distributed product management, support, data center operations and other peer engineering teams.       Maintain balance between building high quality products and shipping code fast       Be a functional manager       Help engineers to develop their career plans and assign project work tailored to their skillsets and aspirations.       Metrics driven to measure and track progress of feature development, quality of the code, and productivity of the team.       Work with other engineering leaders to continuously improve the overall development processes.       Able to work with cross functional teams and translate functional requirements into technical design and implementations.       Ability to pickup functional knowledge of the product at a fast pace.       Partner with the recruiting team through the entire hiring process which includes sourcing, interviewing and onboarding.       Provide continuous feedback and create action plans for both under and high performing team members       THE TEAM      The Xactly development team executes quickly and is full of smart engineers from well - respected companies and universities. They look to their engineering leaders for mentorship, career development and organizational transparency. In order to build and ship high quality products extremely fast, efficiently and in a continuous manner, Xactly engineers rely on their leaders to remove any obstacles and guide them through engineering practices. At Xactly, we build teams that are helpful, respect each other, maintain a high level of customer focus, inclusive of everyone and we strive for strong product ownership by the team.     Not only do we offer strong growth opportunities for top performers, but we also have a top - notch culture, benefits (check them out below) and more. Our strong C.A.R.E. values Customer Focus, Accountability, Respect & Excellence guide our every move, allowing us to be a leader in the incentive compensation & performance management market. We set the example with excellent customer experience and deliver an award winning SaaS (Software - as - a - Service) product!      Required Skills :       2+ years of prior relevant technical lead or management experience       Master s plus 7 or Bachelor's plus 10 years experience in web application or platform development and architecture       Solid hands on and management experience with Java , Spring Boot and REST       Solid understanding for internal working of relational databases such as Postgres, Oracle       Hands on experience with Hadoop, Spark and various big data ecosystem components       Solid understanding of multidimensional OLAP cube       Experience with building real time data processing flows on distributed system       Experience managing or engineering system software (SQL query engines, Linux, multi - threaded and distributed systems)       Management or hands - on experience with data integration / ETL software such as Actian, Pervasive, Mulesoft, Informatica and Talend       Experienced in mentoring, managing engineers, recruiting and retaining top talent.       Strong commitment to good engineering discipline and process including code reviews and delivering unit tests in conjunction with feature delivery       Ability to make decisions and work with minimal direction even under pressure.       Prior experience demonstrating the ability to understand a technical architecture, review design work and provide feedback to a talented team of engineers.       Experience establishing and reviewing business metrics with the ability to articulate and provide visibility to the team on various business metrics ensuring every new feature developed meets and is tracked towards those metrics.       Ability to manage priorities, set appropriate expectations with peer engineering management and deliver features on time with high quality.       Ability to identify training needs of various team members and ramp new hires on products, process, and technology.       Technically deep enough to participate in roadmap prioritization.       Familiarity and experience with agile (scrum) development process       Strong listening, written and verbal communication skills.       Highly Desired Experience:      Prior hands on experience with open source technologies such as Spring, Hibernate, JBoss, SpringBoot.      Experience working within a distributed engineering team including offshore       Experience using chef, puppet or other deployment automation tools       Hands on experience in deploying services on AWS, Azure or Google Cloud platform       Bonus points if you have contributed to an open source project       Experience with agile (scrum) development process as an individual contributor and as a functional manager       Team lead or Scrum master experience       Proven track record of identifying and championing new technologies that enhance the end - user experience, software quality, and developer productivity       Past experience working in a fast paced environment.       WITHIN ONE MONTH, YOU LL:       Attend New Hire Training       Learn the Dev and QE processes       Gain exposure to Xactly s product suite       Learn about Xactly s tools and technologies       Get to know your team       WITHIN THREE MONTHS, YOU LL:       Discussing and building out product roadmap       Work with recruitment on hiring for your team       Participate and lead scrum meetings       WITHIN SIX MONTHS, YOU LL:       Train and integrate your team into Xactly and dev processes       Ensure the best dev practices are being used       Ensure that we are releasing high quality product       Participate and contribute in maintenance and new product development       WITHIN TWELVE MONTHS, YOU LL:       Be an expert on Xactly Data Platform product       Partner and work cross functionally with other dev teams and the QE team       Take full ownership of features and processes of the product       Continuously coach and mentor your team to achieve their career goals       Continuously think about and work on process improvements for an always high - quality product       Benefits and Perks       Paid Time Off (PTO)       Comprehensive Insurance Coverage       Tuition Reimbursement       XactlyFit Gym/Fitness Program Reimbursement       Kitchen Stocked Daily with Tasty Snacks, Fruit, and Drinks       Parking & Commuter Benefits       THE XACTLY STORY:      Xactly is a leading provider of enterprise - class, cloud - based, incentive compensation solutions for employee and sales performance management. Our vision: Unleashing human potential to maximize company performance. We address a critical business need: To incentivize employees and align their behaviors with company goals. Our products allow organizations to make more strategic decisions, increase employee performance, improve margins, and mitigate risk. Our core values of Customer Focus | Accountability | Respect | Excellence are key to our success, and each day we re committed to upholding them by delivering the best we can to our customers.     We were the first 100% cloud - based, multi - tenant provider focusing solely on the incentive compensation and employee and sales performance management market, and we achieved our leadership position through domain expertise and innovative technology. We deliver our solutions through a Software - as - a - Service (SaaS) business model.     Xactly is proud to be an Equal Opportunity Employer. Xactly provides equal employment opportunities to all employees and applicants without regard to race, color, religion, sex, age, national origin, disability, veteran status, pregnancy, sexual orientation, or any other characteristic protected by law.     We do not accept resumes from agencies, headhunters, or other suppliers who have not signed a formal agreement with us.  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["Hibernate", "Linux", "JBoss", "OLAP", "Scrum", "Informatica", "Oracle", "Open source", "SQL", "CRM"]}