{"Job Title": "Manager , Software Development Mgmt", "Company": "TiVo Inc", "Experience": "11 - 13 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": " We are looking for a Software Manager with a proven track record of managing a team of 10 engineers. You should be experienced in the design development of at least one of iOS and Android applications. You should also possess a thorough understanding of agile development practices. You should have good communication skills to interact with the several cross-functional teams.    THE EVERYDAY VIEW    Manage an agile-based cross-functional engineering team focused on development of high quality, Android and iOS applications. This involves overseeing the design and development of all layers of the apps and driving end-to-end solutions for MSO and retail customers. You will also resolve technical issues, scope feature deliverables, and take part in design and code reviews. You will also help in running the scrum for the entire team.    RESPONSIBILITIES     Manage a team of 10 mobile engineers both in iOS and Android platforms.     Motivate and mentor the engineers in the team and track their deliverables.     Regularly participate in design and code reviews of the team members.     Participate in scoping of new features.     Continuously evolve and improve the development practices in the team.     Be regularly involved and help scrum masters in running the daily scrum     Work directly with multiple disciplines program management, product management, consumer design, quality assurance, operations and marketing to manage deliverables, dependencies and schedule risks     Continuously evaluate and communicate project status, risks, and issues to upper management and external partners       REQUIRED SKILLS     11-13 years of professional experience with at least 3 to 4 years of prior management experience.     Education: Bachelor s degree in Computer Science, Computer Engineering or equivalent combination of education and experience.     Must have experience in developing a mobile app from scratch.     Must have good communication skills.     Strong development experience including framework and programming language knowledge in one of the platforms - either in iOS or Android.     Strong experience in releasing mobile applications.     Strong practical experience in OOP, data structures, algorithm design, problem solving.     Nice to have experience in the media industry and streaming technology     Nice to have development experience in both iOS and Android platforms.  ", "Role": "Software Developer,", "Industry Type": "Media, Entertainment, Internet,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Product management", "Computer science", "Manager Quality Assurance", "Agile", "Manager Technology", "Data structures", "Scrum", "Mobile applications", "IOS", "Android"]}