{"Job Title": "Software Development Manager", "Company": "Tesco Bengaluru", "Experience": "8 - 13 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "        Job Description    Software Development Managers (SDMs) establish and sustain the environment for development and delivery operations to exist and succeed. Their primary focus is to hire retain guide and develop our Engineers (SDEsSEsSAs etc) through creating and aligning individual s objectives and development plan alongside the goals of the wider team and business. They evolve the right tailored approaches to manage and develop their Engineers including regular 1-2-1 meetings identifying mentors or mentees and providing impromptu coaching and feedback inputs getting right mentorship to grow expertise etc. SDMs help split the scope of work across one or more Engineers depending on their strengths and areas of improvement.    Technical Skills   We are looking for people who have a passion for Technology. You will demonstrate experience of different platforms and technologies. We expect to see some or all of the following:  Experience delivering complex mobile applications  8+ years of commercial software development experience in KotlinJava andor SwiftObjective C  BSMS in Computer Science or equivalent  Firm understanding of software development principles capabilities and limitations of  mobile platforms (iOS and Android)  Passion for mobile development. We would love to hear about apps you ve developed.  Understanding and exposure to integrating REST API endpoints  Strong experience and understanding of industry standard mobile accessibility  A desire to create readable maintainable modular and extendable code  Experience in full development life cycle; design coding test build QA deployment and  maintenance  Exposure to the DevOps model  Experience in Lean and Agile environments and understanding of principles behind  methodologies such as: BDD ATDD and TDD       Qualifications     Engineering Manager Native Mobile Apps Product Mobile Design Pattern Stakeholder Management            ", "Role": "Software Developer,", "Industry Type": "Education, Teaching, Training,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Business services", "SAS", "Coding", "TDD", "Agile", "delivery operations", "Mobile applications", "Stakeholder management", "Android"]}