{"Job Title": "MTS Software Development Eng .", "Company": "Advanced Micro Devices, Inc", "Experience": "8 - 12 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "      The Role:   The ideal candidate will participate in all aspects of the software development process; he or she will be encouraged to provide full ownership of specific components and drive assignments to completion          The Person:   We are searching for an individual with excellent problem-solving skills who also appreciates a team environment and learning from others. An individual who will do well in this role would be able to balance between attention to details and executing timely with excellence. A good fit for our team is a person who communicates effectively, shares their knowledge freely, and who is passionate about growth, learning and contributing to the success of the team and AMD as a whole.          Key Responsibilities:   The ideal candidate will participate in all aspects of the software development life cycle; he or she will be expected to provide full ownership of specific components and drive assignments to completion:         Design and implement Security firmware supporting features like Secure boot HDCP/ Content Protection/ Trusted Execution Environment  Create novel tools and methodologies to optimally validate hardware and software functionality  Engage in pre-silicon development activities including emulation/ simulation  Engage as a teammate, talking to multi-functional development teams  Assist in resolution of customer, quality and certification issues  Actively participate in design reviews and discussions          Preferred Experience:   8-12 years of relevant industry experience  Experience developing Bootloader / ROM code  Exposure to applied Cryptography & Security protocols such as AES, DES, RSA will be an added advantage  Accountable for on time delivery and quality of deliverables  Actively drive team technical skill improvement and innovation  Regular communication via Audio/Video conference with global teams     ", "Role": "Software Developer,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Graphics", "Simulation", "Software development life cycle", "Silicon", "high performance computing", "Firmware", "Cryptography", "MTS", "Gaming", "Video conference"]}