{"Job Title": "Software Development", "Company": "Altran Technologies India Private Limited.", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad, Chennai, Bangalore/Bengaluru", "Job Description": "Roles and Responsibilities Essential Skills :a. Experience on BSW development, verification and validation based on Autosar or SLP9 and aboveb. Good working experience on Implementation/validation of Vehicle Network management between ECUs (OSEK & AUTOSAR)c. In depth understanding & Configuration experience on Bus Communication on CAN, CANFD, J1939, Flex ray & LIN protocolsd. Good Programming skills in C and experience in CAPL is must. CASL and VB is add on.e. Good Experience in using vector hardware tools like VN8911, VN8970.f. Overall exposure to ECU software development lifecycle.Desired Key Skills:? Experience in CANoe Extended Real Time (ERT) and Creating CANoe Simulations.? Hands-on Experience in Vector tools GENy, CANoe, CANape and CANalyser and other OEM specific tools.? Good Knowledge in CAN, J1939, LIN and CAN FD Protocols.? Experience in COMstack development for ECU is added advantage.? Experience in hardware/software debugging and setting up ECU Test Bench and HIL setup is add-on.? Handling of HW I/O’s, Non-volatile data and storage conceptJob Responsibilities:? BSW Configuration &Development, verification and validation (COMstack, Network Management, OS, EEPROM, HW I/Os etc)? Creation of CANoe simulations for Network Management testing? Network conformance testing, OSEK/Autosar testing.? Test cases creation in CAPL for network Conformance testing.? Setting up the automation test bench with vector tools & hardware and debugging.", "Role": "System Analyst,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Embedded, EDA, VLSI, ASIC, Chip Design,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "Doctorate": "None", "Key Skills": ["CAN", "Software Development", "CAPL", "UDS", "Canoe", "BSW development"]}