{"Job Title": "Manager, Software Development", "Company": "Apptio INC", "Experience": "5 - 9 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "    What we want you to do:         You will ensure that Apptio discovers, designs and delivers the right core capabilities predictably and enable your team, that develops the solution, to continuously improve. You will help in building and delivering simple, powerful, scalable services, innovative SaaS architectures, software quality, and developer productivity that results in high customer value delivery.        You will be involved in the daily activities of running your engineering team including: road mapping, planning sessions, requirement reviews, coding, design reviews, and technical discussions to determine technology direction. Additionally, you will work closely with other engineering teams across the Apptio product suite, information security, product management, user experience, and other engineering leaders to define and architect innovative solutions.         Qualifications:               BA/BS in Computer Science, Engineering, or equivalent experience is required              Minimum 7 years commercial software experience, with at least 3 years of relevant engineering management experience leading teams of individual contributors              Proven track record of shipping high-quality enterprise applications on time with transparency of the engineering progress and increasing predictability of delivery              Proficient with Java and a scripting language              Current in technology trends, knowledge, and experience, such as:              Cloud technologies in AWS, Azure or GCP              Multi-dimensional analytic systems / OLAP              Database technology, both SQL and NoSQL              Data Science and Machine Learning              Strong knowledge of data structures, algorithms, enterprise systems, and asynchronous architectures              Has designed, built, and shipped complex systems involving multiple engineering teams              Excellent written and oral communication skills, collaboration across global teams and critical thinking              Has ensured a high level of code quality and contributed to engineering best practices, leading by example              Experience and enthusiasm for Agile software development in a SaaS DevOps culture              Track record of mentoring, recruiting, retaining and growing a team of engineers    ", "Role": "Team Lead/Technical Lead,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization, B.A in Other Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["data science", "Coding", "Enterprise applications", "Information security", "Machine learning", "Agile", "Data structures", "OLAP", "SDLC", "SQL"]}