{"Job Title": "Software Development Engineer", "Company": "Clearwater Analytics", "Experience": "0 - 2 years", "Salary": "Not Disclosed", "Location": "Noida", "Job Description": " New Products is tackling new initiatives to significantly grow revenue opportunities for Clearwater. One of the areas being pursued is Data as a Service (DaaS). Within DaaS there are a number of potential subset offerings that are interesting. Standalone reporting, Statements, Data aggregation and management, to name a few. We re currently working with a client to use our DaaS platform to collect and normalize their data to then automatically produce reporting through the Clearwater Statements product. There is much work to do and many opportunities to contribute in these areas. The team is uniquely positioned to work on greenfield, high-impact system design and architecture. Over the next couple weeks, we are looking to identify 2 developers in NOIDA to transfer to a new team to work on these initiatives. We ll continue to add developers to the team in subsequent quarters.   Here are a few things the team is likely to work on initially:    Automated collection / aggregation / normalization of data   Calculation engine to feed specific client reporting elements   REST APIs to allow smooth input and output of data for our client intra-system interactions   UI to provide users access to collected data and insight into data delivery, data quality, and report generation    Here is some detail around our tech stack:    100% cloud native (AWS)   Amazon Cloud Formation/CDK   API driven - all data transfer intra-system and externally is done via APIs   Languages: Python, Clojure, Java/Typescript   Storage: S3, PostgreSQL/Aurora  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Report generation", "Architecture", "Postgresql", "Cloud", "System design", "Data quality", "Management", "AWS", "client reporting", "Python"]}