{"Job Title": "Software Development Engineer - Java", "Company": "Squareroot Consulting Pvt Ltd.", "Experience": "3 - 5 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": "Hiring for well funded product startup company based out in Mumbai.  Experience : 3+ yrs   Work Location : Mumbai  What we are looking :  - Looking for strong startup or product background.  - Willing to work independently and responsible for system architecture and development current and future product.  - Starting from the scratch, prototype and deliver innovative product solutions.  - Exposure on architectural principles and design patterns will be added advantage.  - Mentoring small team or juniors on their appropriate application.  Job Description :  - 3 to 5 years of experience doing hands-on software development including server side development especially Java platform  - Good experience of OOPS and Modern Design Patterns on Linux, Apache, MySQL, NOSQL .  - Writing high level code to scale the product.  - Web Services - Experience building modern web services  - You have experience in solving scalability problems on enterprise internet products.  - You are highly effective and thrive in a dynamic environment with multiple, changing priorities.  - You take great pride in innovating new products that are used by millions of users.  - You know what's important when releasing software to end users and have been through the process from start to finish.  - Data analysis and debugging skills  Preferred Qualifications : BE/BTech in Computer Engineering or related field or equivalent from a reputed institute", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - eCommerce, Internet Technologies,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Java", "Software Development", "NoSQL", "Scalability", "Design Patterns", "OOPS", "Web Technologies", "MySQL", "Apache", "Web Services"]}