{"Job Title": "Software Development - Senior Specialist", "Company": "NTT DATA", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "   As a Software Engineer you would be contributing to large scale application development projects for our clients. As a member of the development team you will be responsible for creating technical design specifications by conferring with clients and solution architects and implementing the specifications. You will also be responsible for maintaining the DevOps pipeline by contributing to unit tests, integration test automation and CI/CD Setup.          Ideal candidate must have:       Good conceptual know how and hands-on experience on any of the core web stacks (Java Spring / Angular / NodeJS etc.)     Hands on experience of SQL and No SQL Databases (MySQL/Postgres/MongoDB)     Exposure to API / backend or front-end development (Web or Mobile).     Worked in an agile environment and contributed to the dev-ops flow including unit and integration test automation and CI/CD setup.           Key responsibilities include:       Understand and document user stories and technical design specifications     Develop and implement solution design     Develop unit test and automated integration tests     Perform peer design and code reviews     Setup the CI/CD and DevOps pipelines     Help with technical documentation like setup and configuration       Physical Requirements/ Working Conditions       Ability to physically perform general office requirements.      Must be able to perform essential responsibilities with or without reasonable accommodations.     Significant travel including overnight domestic or international trips may be required.    ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["IT services", "Business process", "Automation", "Front end", "Technical design", "MySQL", "Consulting", "Agile", "Application development", "Technical documentation"]}