{"Job Title": "Sr.Lead - Software Development/IT Architecture", "Company": "Tata Communications Ltd", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "     The Big Data Developer is responsible for designing, developing and rolling out of customer facing business critical functionalities over Big Data and NoSQL ecosystems,.         The role involves understanding requirements, conducting research and innovations to develop and implement an optimum design to support the requirements.          Document the detailed design and the rationale for choosing the various design components.           Own the delivery including low level design, code, test cases, deployment model, support model, documentation and training.            Level Descriptor        The Big Data developer drives the IT software design, development and execution of the design spanning Big Data, NoSQL, Streaming and Messaging components;           The role involves using expertise, experience, research and trials in choosing the right software technologies, components and software stacks that suit the business requirements.          Experience :5 to 10 years software development experience. Telecommunications and Mobility experience preferred.             Purpose - Broad objective of the role        Reporting to the Deputy General Manager/General Manager, Mobility   IT   Systems, the   Big Data developer   will be responsible for the design  , development, testing, release, deployment, documentation and support   of the IT Applications supporting the Mobility Business Unit.           The developer will also be responsible to do peer code reviews, load testing, performance tuning, optimization, and monitoring of highly scalable codebases.          The Mobility applications will include various application models including internally developed,   COTs   and SaaS.           Size and Scope of Role - Financial     Size and Scope of Role - No. of direct reports        Size and Scope of Role - Total team size        Size and Scope of Role - Other size parameters        Minimum qualification & experience       Bachelor of Engineering/Science or equivalent in Computer Science, Computer, IT or Telecom Engineering with 5+ years of IT software development or architecture preferably from telecom domain        Other knowledge/skills        Ability to present and communicate to Senior Executives, Customers and Partners on Strategic plans and status is a must. Ability to influence colleagues and build consensus across a diverse organization         Ability to coach team members on   Target   Architecture alignment and System Realization is a must. Excellent communications skills (verbal, writing, presenting).         Comfort working with a team across multiple time zone and geographies is required. Proven track record with successful, world class system development / architecture         Key Responsibilities       Technical Competencies      Minimum 5+ years software development experience required        Minimum 3 years experience with designing and developing using one or more of Big Data, Hadoop, Kafka, Nifi, Flink, Spark, Spark Streaming, HBase, Impala, Mongo DB, Druid, Kudu.         Minimum 3 years experience with Java, Python, Linux/Unix scripting.      Preference for candidates having experience in   Cloudera Hadoop ecosystem        Preference for candidates having experience in Big Data implementations on public cloud systems like   AWS, Azure or GCP  .         Minimum 3 years experience with CI/CD, Agile, DevOps methodologies and tools like Jira, Confluence, Jenkins, Git Lab.        Experience in implementing and scaling architectures to handle high volume, high velocity, low latency requirements.      Preferred experience with Microservices and containers    Experience in the Mobile market segment especially    Telecom Mediation Systems     Experience with Agile (Scrum) / DevOPS software development methodologies      Knowledge / Skills     Communication Skills     Architecture, Telecom, Telecommunications, Developer, Engineer, Engineering, Technology  ", "Role": "Software Developer,", "Industry Type": "Telcom, ISP,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Performance tuning", "Software design", "GIT", "Linux", "Load testing", "Test cases", "JIRA", "Monitoring", "Python"]}