{"Job Title": "Software Development Manager", "Company": "Frontdoor", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "  Position Overview    As the Mgr Software Engineering, you will be responsible for envisioning product development and providing strategic management direction. You will analyze, design, and develop software enhancements and new modules, as well as manage development project from initial design through testing and completion.    Position Responsibilities      Responsible for the coordination of and planning for the company s information technology architecture.     Consult with internal departments to identify customer needs and include into project objectives. Provide support regarding product development to internal departments.     Research product development options and provide analysis for product direction.     Manage development project from initial design through testing while providing strategic management direction. Design, develop, modify, adapt and implement short and long term solutions to IT needs through new and existing applications, systems architecture, network systems, and applications infrastructure.     Review system requirements and business processes; code, test, debug, and implement software solutions.     Prioritize, plan, and track project progress.     Involved in direct planning of long and short term infrastructure improvement projects, including design, budgeting, and implementation.     Manage teams to achieve diverse objectives in replicable, scalable ways.     Collaborate with team members to identify strengths and weaknesses of applications and improves upon them.      Position Requirements      Bachelor s degree in Computer Science, Information Systems, or related field     5+ years of software development experience and 1+ year supervisory experience     Maintains knowledge of leading edge technology   ", "Role": "Software Developer,", "Industry Type": "Consumer Electronics, Appliances, Durables,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Strategic management", "Computer vision", "Manager Information Technology", "Networking", "Appliances", "Machine learning", "Budgeting", "Management", "Information technology"]}