{"Job Title": "Manager Software Development", "Company": "SAS Research and  Developement (India) Pvt Ltd", "Experience": "3 - 7 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "   Summary:      Responsible for the management and prioritization of software development projects and resources to ensure the achievement of department, division, and corporate objectives.      Primary Responsibilities:       Get things done!     Acquire product knowledge.     Dive into code, trouble shoot issues, write SQLs to understand data, work on POCs.     Provide technical leadership as appropriate to the team with, leading by example, show and tell, coaching, mentoring, training.     Contribute to product or project discover by collaboration with Product Management, Product Owners, peers and others within IDeaS.     Manage and lead project scoping, scheduling, prioritization and delivery; track progress of individual tasks, take corrective actions and alert executive management and stakeholders of concerns meeting schedules.     Manage all aspects of the team including teamwork, performance management, feedback, professional growth.       Knowledge, Skills and Abilities       Strong knowledge in Java echo system SQL.     Strong interpersonal, verbal and written communication, organizational, and problem-solving skills     Ability to develop creative solutions to complex problems     Strong decision-making ability     Ability to lead projects and adapt to changing priorities and deadlines     Ability to lead, manage and communicate goals to employees   ", "Role": "Project Manager-IT/Software,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Project Management", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Product management", "Project development", "Performance management", "director product development", "Technical leadership", "Scheduling", "Executive management", "Management", "Troubleshooting", "SQL"]}