{"Job Title": "Software Development Engineer - Test - Automation Testing", "Company": "Talent Acceleration Corridor", "Experience": "2 - 6 years", "Salary": "Not Disclosed", "Location": "Noida", "Job Description": "Roles and ResponsibilitiesWe are scouting for Software Development Engineer in Test (SDET) - QA for one of our Software Product companies:Responsibilities :- Own the Test Strategy and Architecture of Automation Framework for the various projects (including QA sprints, environments, Test data, automation scripts, Debugging logs on the test server, Deployments of published version of code, Maintenance of CI/CD pipeline)- Provide transparency to key stakeholders of testing progress, defects and risks. - Should have the positive - Go & Get- attitude and ready to be accepting failures in a humble way.- Expert in Test Automation in Web/Mobile/API with tools such as Selenium/Appium/Rest Assured API in large scale projects. - Should have experience in script execution on IOS platforms using XCode and iPhone.- Hands-on experience in Automating applications designed in SAAS platform with AWS cloud hosting and third party services like Elastic Search, rabbitmq, redis, Kafka, Periscope, mySQL having Monolithic and Micro-Services Application.Requirements :- Should have relevant experience in Automation Testing with Selenium.- Proficient with build tools like Gradle/Maven.- Worked on Agile Methodologies with JIRA and must have acted as Scrum Master.- Technical experience of writing and maintaining testing code in Java/Rest Assured API/JAVArx Client/ GSON/ TestNG annotations using Selenium/Appium wrapper classes.- Good knowledge on providing continuous Integration with Integrating Build deployments using tools like Jenkins/CodeShip/Docker/SVN.- Good practical understanding of Hybrid Framework/Page Object Model/Excel Utilities & POI constructed using TDD or BDD Frameworks like Cucumber etc.- Proficient in making Estimates/Test Automation plans which by enlarge gives a clear visibility of timelines/schedule/cost/resourcing need. - Good in Analysis of End to End Automation scripts for proper coverage of system under testing.- Should have used Android UI Automator for locating mobile based objects. Proficient in extracting Dynamic xpath of both Web and Mobile.- Good to have working knowledge on Reporting tools like Allure/ Extent Reports/TestNG report- Possess good understanding of Logging tools like Log4j, SLF 4J and usage Listeners (TestNG and WebDriver Events).- Geeks to adapt different scripting languages such as Java Script, Python, PHP, Groovy in order to expand the Framework capabilities.- Working Knowledge of Operating System of Linux/Mac/Windows and basics of shell commands is a must have.- Excellent cross-platform analysis and troubleshooting ability.- Responsible for Functional testing and creating functional test data independently.- Good knowledge of SQL queries/APIs internal working is a must have.", "Role": "Testing Engineer,", "Industry Type": "Automobile, Auto Anciliary, Auto Components,", "Functional Area": "IT Software - QA & Testing,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Sc in Any Specialization, B.Tech/B.E. in Any Specialization, BCA in Computers", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["Java", "SDET", "Software Quality Assurance", "Mobile Testing", "Appium", "Automation Testing", "Application Testing", "Selenium", "Manual Testing", "Test Strategy", "Testing"]}