{"Job Title": "Senior Software Engineer - UI Development", "Company": "Visa Inc.", "Experience": "3 - 6 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "    Essential Functions      Design, develop and maintain scalable, distributed, multithreaded applications   Write High Quality, testable and production ready code   Showcase   excellent debugging   and   problem solving skills  .   Be a proactive player and have a   passion for delivering   zero defect   high   quality code  .   Collaborate with team members and participate in design reviews, development and code reviews   Align with the direction and information provided by the Management, Technology and Business Counterparts to drive deliver robust and usable solutions to meet functional requirements.   Create   documentation   and procedures for development, deployment and maintenance    Deliver   all assigned responsibilities in a   timely   manner and with a high level of   quality  .      Basic Qualifications      3 years of work experience with a Bachelor s Degree or an Advanced Degree (e.g. Masters, MBA, JD, MD, or PhD)      Preferred Qualifications      3-6 years of work experience and a Bachelor s Degree or   3 years of work experience with an Advanced Degree (e.g. Masters)   Solid understanding of   Object-Oriented design   and programming concepts   Strong Experience with   JavaScript  ,   HTML 5   and   CSS absolutely essential    Experience with   Angular required     Deep understanding   of browser internals, UI framework internals, JavaScript engine internals and ability to work around challenges and limitations.   Ability to work independently and develop responsive, fluid and intuitive user interfaces   Familiarity with open source software development workflows is highly desirable.   Ability to comprehend UX concepts and bring life to the designs created by our User Experience team.   Ability to work with   changing requirements   and   quick release cycles   is essential   Familiarity with backend concepts, design patterns and backend web application frameworks desirable.   Good understanding and technical expertise in Microservices, Docker and Kubernetes is a plus but not a requirement   Working knowledge of infrastructure, ensuring high-availability, scaling, service discovery, logging, monitoring and alerting.   Familiarity with monitoring and logging solutions such as Prometheus, Splunk, Cloudwatch, and/or ELK stack    Experience writing unit and integration test cases    Hands-on experience with   Linux   and Windows. Familiarity with Linux is highly desired.   Process oriented with   strong analytical and problem solving skills   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "MBA/PGDM in Marketing, Medical-MS/MD in psychology", "Doctorate": "None", "Key Skills": ["UI development", "Linux", "Debugging", "Javascript", "Agile", "Workflow", "Windows", "Test cases", "Open source", "Monitoring"]}