{"Job Title": "Lead Specialist - Software Development", "Company": "GRAVITAS", "Experience": "4 - 7 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": " Job description     Responsibilities       Work closely with the client to understand business needs, in order to develop IT strategy, and propose solution options including advice on design, implementation, tools, scalability, system performance, dependencies     Proactively highlight and resolve issues to help team deliver to planned scope and schedule     Set standards and project processes for delivery teams and mentor team members     Serve as hands-on escalation point to identify and suggest approaches to resolve project issues     Keep up with industry and technology trends, to enhance and manage knowledge on projects      Skills Required      Experience working in structured development environments including Continuous Integration & Test Driven Development     Proven experience in designing and developing applications using Microsoft Technology stack ( C#, JavaScript, SQL, SSRS, SSIS, REST API)     Expertise in designing databases and writing queries with SQL Server     Solid knowledge of modern software design principles, concepts, and practices     Experience working in an Agile environment (e.g. Scrum, Kanban) required     Familiarity with one or more of the following: Containers, Microservice Architecture, IaC, ReactJS     Requirements     THE ROLE        Over the years, our team has developed asset management service platform which serves as a backbone for daily deliverables for our front and middle office team. We are seeking a senior professionals to lead and develop the service platform components.        The person will be responsible for managing interaction with users and enhancing the platform.     Advantageous Skills      Expertise in architecting applications for Capital markets, Broker firms, Mutual Funds, Hedge Funds preferred    Experience in a consulting or client-facing role in financial services firms    Experience in designing modules        Academic Requirements      Relevant experience in software development    Experience in the asset management industry preferred     ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization, B.Tech/B.E. in Production/Industrial", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Software design", "SSRS", "Consulting", "Javascript", "Agile", "Scrum", "Asset management", "SSIS", "microsoft", "SQL"]}