{"Job Title": "Software Development EngineerI (Front End)", "Company": "InnovAccer", "Experience": "1 - 3 years", "Salary": "Not Disclosed", "Location": "Noida", "Job Description": "    Your Role        We at Innovaccer are looking for     Software Development Engineer-I (Frontend)     to build the most amazing product experience. You ll get to work with other engineers to build a delightful feature experience to understand and solve our customer s pain points.     A Day in the Life      Innovate and contribute to a Monitoring UI.      Collaborate with other development teams, quality engineering team, and documentation teams to execute product deliverables    .        What You Need      1-3 years of experience with a start-up mentality and a high willingness to learn      Strong knowledge and experience in HTML, CSS, and JavaScript      Good experience into ReactJS or one modern MVC style JS Framework      Deep understanding of the DOM and how the browser works      Experience in building large scale pluggable UIs      Good understanding of the constantly evolving world of front-end development      Experience with seamless integration of front-end to back-end functionality      Excellent understanding of UX/UI design principles      A belief in progress over perfection.         What We Offer       Industry-focused Certifications:   We want you to be a subject matter expert in what you do. So, whether it s our product or our domain, you will dive straight in and be certified by the best in the world.     Quarterly Rewards and Recognition Programs:   We foster learning and encourage people to take moonshots. When you achieve your goals, we recognize and reward your hard work.     Health Benefits:   We cover health insurance for you and your loved ones.     Sabbatical Policy:   We encourage people to take time off and rejuvenate, upskill and pursue their interests so that they can generate new ideas for innovating at Innovaccer.     Pet-friendly office   and open floor plan. No mundane cubicles.     ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - eCommerce, Internet Technologies,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["SAN", "DOM", "PDF", "Artificial Intelligence", "Javascript", "Healthcare", "HTML", "MVC", "Analytics", "Monitoring"]}