{"Job Title": "Software Development Manager", "Company": "Siemens Limited", "Experience": "10 - 15 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "  As a Software Development Manager, you will lead the team developing exciting solutions that change the way both Mentor and their clients work. Youll work in a collaborative, welcoming environment where new ideas drive technological transformation. We work in small, crossfunctional teams with big goals, so you will need to be adaptive and adept at clear communication. We strive to produce scalable solutions, and you will need to be familiar with how software development best practices and high levels of automation help drive them.     Job Description       Take part in design and development of industry leading and rapidly growing solutions for electrical distribution system wire harness.    Be part of the core team responsible for efficiently evolving large-scale enterprise product built on Java platform to run on the cloud and be sold via SaaS business model.    Solve challenging design and technology problems while setting example in quality and application of object oriented design principles.      Your Primary Responsibilities would Include        Hire and develop the best - you need to build, motivate and coach a diverse team of software development engineers. You need to recruit and retain top talent for the team     Leverage management skills to deliver against product roadmap and cross org initiatives     Develop, evolve and operate high-quality software solutions that deliver the required product features maximizing use of existing technologies from Siemens and beyond     Ensure optimal extendability, extensibility, maintainability, security, performance and scalability     Ensure solutions support multiple public cloud providers, hybrid cloud and private cloud     Participate in continuous improvement of architecture, infrastructure, processes, skills and the organization.     Participate in product definition, project planning and tracking including task investigation, work breakdown and estimation.       Job Qualifications    Essential      Bachelor or higher degree in Computer Science, Software Engineering or other technical/scientific domain     10 years of professional experience as part of a development team in software development with agile practices, quick iterations and integration of regular feedback     3 years of people management experience, especially managing software developers     Extensive hands on experience in developing software using a modern programming language (Java, C , C#, JavaScript or other)     Strong object oriented programming skills, including but not limited to SOLID principles modular design       Experience writing unit tests and applying automated testing approaches       Hands-on software troubleshooting experience     Strong problem-solving skills     Ability to work as part of a global distributed team with mixed cultures     Strong self organization including ability to work independently, take ownership, prioritize/multitask effectively and deliver valuable results     Fluency in written and spoken English, including the ability to communicate complex ideas internally      Desirable / Great additions      Professional working experience with AWS, Azure or another major cloud platform     Experience in automating and managing large-scale cloud systems via infrastructure as code (IaC) and security as code (SaC)     Experience in cloud systems architecture, automation, orchestration, deployment, implementation, operation and optimization     Experience using Docker and Kubernetes     Experience with Test Driven Development (TDD)     Experience developing multi-tier, commercial off the shelf and/or CAD software     Familiarity with electrical and harness domains    ", "Role": "Software Developer,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "Object oriented design", "Automation", "orchestration", "TDD", "Javascript", "Agile", "Project planning", "test driven development", "Embedded software"]}