{"Job Title": "Senior Full Stack Software Development Lead", "Company": "fractalzlab", "Experience": "5 - 7 years", "Salary": "Not Disclosed", "Location": "Kolkata", "Job Description": "       Fractalz Lab is looking to hire a Senior Full Stack Software Developer to lead our extremely talented Product Development team!              As one of our Senior Software Engineers, you will be part of our start-up team having opportunity to work on Social Media Platform development. You ll get to build your own team and work directly with other Developers, Software Testers, Business Analysts, Product Managers, and Directors, all of whom make up the Crew. In this highly-collaborative environment, you will have the opportunity to grow as a software engineer, and even help mentor others.              The Senior Software Developer position requires a mix of hand-on and leadership skills and needless to say requires excellent Object-Oriented programming and Design Pattern skills.              The Senior developer / engineer will be involved in the deployment of our enterprise software solution to the cloud.              The job requires you to be able to design, develop, troubleshoot, and debug complex software application at the enterprise level. We are looking for a Software Engineer who is passionate about programming, quality, and truly enjoys what they do.              The qualified candidate for the Software Engineer position is someone who has a can-do attitude and is an entrepreneur mindset and innovative thinker.              Fractalz Lab works in an agile environment where there are daily standups and code reviews, and constant communication within each self-managed cross functional team. The ability to communicate effectively with clients, product owners and QA s, as well as work closely and well with other team members are key components for success in this position.              Essential Duties and Responsibilities:              The engineer will be primarily responsible for leading the development of our flagship Social Media platform and other product offerings. Additional duties would include educating and evangelizing to the rest of the team best practices around the Java Spring framework, performance, and reliability.              Collaborate with members of the team to solve challenging engineering tasks on time and with high quality.         Engage in code reviews and training of team members.           Support continuous deployment pipeline code.     Situationally troubleshoot production issues alongside the support team.     Continually research and recommend product improvements.            Create and integrate features for our enterprise software solution using the latest Java, Java Spring, Mongo technologies            Write web services, business objects, and other middle-tier framework using Java, Java Spring, and Mongo technologies            Actively communicate with team members to clarify requirements and overcome obstacles to meet the team goals              Leverage open source and other technologies and languages outside of the Java framework should the need arise, and autonomously be able to make use of those decisions              Develop cutting edge solutions to maximize the performance, scalability, and distributed processing capabilities of the system            Provide troubleshooting and root cause analysis for production issues that are escalated to the engineering team              Work with development teams in an agile context as it relates to software development, including test driven development, automated unit testing and test fixtures, and pair programming            Actively participate in daily code reviews with talented software engineers and architects              Required Qualifications/Skills:              5 or more years experience as a key developer on enterprise projects            Software development experience including: OOP, concurrency programming, design patterns, RESTful service implementation, Service Oriented Architecture, Test-Driven Development, Acceptance Testing.             Experience creating tools to automate the deployment of an enterprise software solution to the cloud        Strong object-oriented design and development experience            Knowledge of design patterns and their implementation     Multi-tier application design and development    Multi-threaded design and development    Excellent problem solving and communication skills            Knowledge, Skills and Abilities:            Springframework (MVC, REST, security, data)    Distributed Systems and Concurrency Programming    (Experience, Education, Certification, License and Training)          SaaS software design principles. You understand engineering enterprise-scale software that is deployed using cloud technologies like OpenStack and Cloud Foundry.            RESTful APIs. You have experience designing and implementing APIs at scale.            Object-oriented Java skills. You are a rock-solid Java developer and use it regularly. You know how to apply best practices in Java. (3+ years in Java Spring preferred)              You have experience writing and implementing automated unit, system, and integration tests. Skilled at troubleshooting and performing root cause analysis for production issues escalated to the team.              Proactive problem solving. You are self-driven, love to learn and contribute not just to your primary area but across boundaries.            Multiple years of experience in web technologies utilizing SOA patterns and REST      Willingness to learn new technologies    Teamwork is a must            Preferred Qualifications               Strong use of source code repositories. Proficiency with tools including: Git, TeamCity, Concourse         Experience using automation testing tools (Selenium, SoapUI, Postman, xUnit, mocking frameworks)      Experience with Docker and Kubernetes       Education / Certification / License:       Bachelors degree in Computer Science or Engineering; equivalent experience accepted.    ", "Role": "Architect,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "Architecture, Interior Design,", "Employment Type": "Full Time, Permanent", "Role Category": "Architectural Services", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Business objects", "Software design", "Testing tools", "MySQL", "Agile", "HTML", "MVC", "Selenium", "Unit testing", "Open source"]}