{"Job Title": "Senior Software Development Manager", "Company": "Checkmark", "Experience": "10 - 15 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "   We are looking for an experienced Software Development Manager to build and managing a software engineering team that will be focused on building and delivering highly scalable cloud software.   Candidate should have an established background in agile application development and must have strong technical skills, great communication skills, and ability to motivate the team in successfully achieving results in a fast paced environment.   We are looking for an innovative, resourceful, flexible and self-directed person who can gain the respect of software engineers and software test engineers quickly and is able to understand market requirements.    The candidate must have an out of box thinking towards the product and its roadmap and must be able to understand the specification, analyze and resolve technical and application problems.    The candidate will be required to roll up his/her sleeves and get hands on when necessary.   We need someone who prioritizes well, communicates clearly and compellingly understands how to drive a high level of focus and excellence with a strong team and has a demonstrable track record of success building managing teams and delivering new features or products.     Qualification Experience:    Master s/Bachelor s degree in Computer Science or related field. Master s degree preferred.   Have 10+ years of experience on development, at least   2 years of experience as a development manager   with handling 20 members as a team  .     Must have worked with and have experience leading Agile teams   Deep hands-on technical expertise   Strong Command over Object-oriented principles.   Experience in cloud application.   Proficiency in Microsoft Stack (.Net framework, SQL, MVC, Azure, SqlAzure).   Must have worked on Database design   Proven ability to architect and operate large scale systems   Deep understanding of source control management. Must be familiar with SVN, Git, TFS and repository hosting services.   Coordination with other developers for cross functional requirements implementation and tests.   Proficiency in C++ and fair knowledge in language specifications.   Proficiency in Microsoft Stack (MFC).   Experience in desktop application. Compatible for cross platform.   Have a strong sense of ownership, urgency and drive.   Must be a strong leader and mentor.   Excellent verbal and written communication skills.   Knowledge of Angular Js with type script preferable.   Have knowledge on .Net core is added advantage.   Strong business and technical vision   Ability to handle multiple competing priorities in a fast-paced environment   In-depth understanding of software development in a team, and a track record of shipping software on time.   Who have knowledge on payroll has added advantage.   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Computer science", "C++", "Payroll", "Database design", "Agile", "Application development", "MVC", "MFC", "microsoft", "SQL"]}