{"Job Title": "Software Development Manager", "Company": "Fiddich Consulting", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "As a Development manager,  you will identify,  hire and build a world- class team of Development Engineers to define,  drive and execute on this vision. You will initiate processes that allow the team to collaborate with local as well as global teams with a high degree of efficiency. You will develop a team of highly motivated and talented individuals that can collaborate with Project Managers,  Product Managers and SDEs across the company on this high impact initiative. You will design,  build and own mobile- first features and programs that will delight our India customers. \n\n    Responsibilities  \n  Responsible for the overall development life cycle of the solution and manage complex projects with significant bottom line impact \n  Work with product managers in developing a strategy and road map to provide compelling capabilities for the seller community on amazon.in marketplace that helps them succeed in their business goals. \n  Work closely with senior engineers to develop the best technical design and approach for new product development. \n  Instill best practices for software development and documentation,  assure designs meet requirements,  and deliver high- quality work on tight schedules. \n  Project management -  prioritization ,  planning of projects and features,  Stakeholder management and tracking of external commitments \n  Translate business requirements into technical solutions,  recommend alternative technical and business approaches,  and lead engineering efforts to meet aggressive timelines with optimal solutions.BASIC QUALIFICATIONS \n  A Bachelor s degree in Computer Science or equivalent combination of technical education and work experience;\n 7 years of Software Development experience; 3 years of experience in building and leading strong engineering teams\n Deep hands- on technical expertise in mobile and web- technologies\n Solid software development background including design patterns,  data structures,  test driven development\n Software development experience in building web services and highly scalable applications\n Excellent verbal and written communication skills\n Managed a team of 10 engineers\n  PREFERRED QUALIFICATIONS \n  Master s degree in Computer Science,  Computer Engineering or related technical discipline\n Knowledge of professional software engineering practices & best practices for the full software development life cycle,  including coding standards,  code reviews,  source control management,  build processes,  testing,  and operations", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["Computer science", "Tracking", "Operational excellence", "Coding", "Project management", "Software development life cycle", "Data structures", "test driven development", "Stakeholder management", "Monitoring"]}