{"Job Title": "Hyderabad - MTS - Software - Development - Eng", "Company": "Advanced Micro Devices, Inc", "Experience": "4 - 6 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "      MTS Software Engineer (SCM Systems)         THE ROLE:            Our team writes large scale infrastructure and tools in C#, Perl and C++ for Windows and Linux. Our software is utilized during all stages of product development across multiple AMD sites and includes distributed automation and build processes, web applications and databases to track millions of records generated by thousands of systems. We are constantly adapting our software development processes (e.g. continuous integration, unit testing and TDD, code reviews) to manage the challenges we accept.           We are looking for MTS Engineer with CM Expertise. The Engineer will be responsible for SCM Systems, as well as design and deployment of the automated CI solutions. The ability to work on multiple platforms and to design reusable and scalable modules is critical.            KEY RESPONSIBILITIES:         Prototype, design, and implement CI solutions       Configure code review, build and test steps. Create fully integrated and feature - rich solutions.        Document technical and design decisions for other team members       Build tools and automation that eliminate repetitive tasks       Be involved in support of existing production environment        Expert in SCM systems such as Perforce and Git, in - depth knowledge of code collaboration tools, such as Gerrit. Administration experience is a plus         Very good knowledge of DevOps systems and processes (e.g Jenkins, TeamCity, Artifactory)         Advanced experience with scripting languages such as Perl, Python and Groovy        Extensive administrative knowledge of Windows and Linux environments        Proven track record in infrastructure development, build and release automation, continuous integration and deployment        Experience with GNU Make, CMake is a plus        Passion for building great software and strong grasp of automation tools       Excellent interpersonal, verbal and written communication skills     Excellent organizational and time management skills      Must be fluent in both written and spoken English      Computer ScienceEngineering Degree or equivalent    We noticed that you are already a member of our Talent Community. Please enter your password to continue.                           ", "Role": "Software Developer,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - System Programming,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Graphics", "Computer science", "C++", "Linux", "Perl", "Windows", "Unit testing", "SCM", "Gaming", "Python"]}