{"Job Title": "Software Development Analyst", "Company": "Varite", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "    Job description               POSITION GENERAL DUTIES AND TASKS                 In these roles, you will be responsible for       Analyzing requirements and creating script.       Provide advanced technical support for investigation and diagnosis for resolving tickets related incidents to ensure Service Level Agreements/Operational Level Agreements are compiled.       Delivering a high-quality application.       Problem solving issues that arise in day to day issues and providing timely responses and solutions as required.. . Required Skills for this role include         Technical skills         Overall IT Experience: Min 6 years, of which Min 4 years in C#, SQL.       Experience in developing C# console applications with automation technics (PDF, Outlook integration etc.)       Should have strong knowledge of Asp.Net, Windows application and Web service Concept.     Good knowledge in SQL Server.       Knowledge in SAP related automation.       Ability to both understand a business process from a workflow diagram.       Willingness and ability to blend business analysis with hands-on configuration of automated processes in the Automation Software Products.         Desired Skills         Domain Knowledge:Finance Accounting.          CLIENT BUSINESS PROBLEM TO SOLVE       Preferred candidate is expected to perform the role of Developer who is proficient in .Net, Ajax, SQL Server and also possesses an understanding of best practices to be followed during Application Development.     They should be able to develop the software and complete the task based on the given requirement.     Ideal candidates will have good experience in various technologies as mentioned in the Mandatory Skills.     Candidates should be excellent team players, yet capable of working independently or require a very little direction.   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Business process", "Automation", "SAP", "PDF", "Business analysis", "Workflow", "Application development", "Technical support", "SQL", "Ajax"]}