{"Job Title": "Principal Consultant Software Development", "Company": "Xebia IT Architects India Pvt Ltd", "Experience": "9 - 14 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": "  What we look for in you     Proficient in SQL, NoSQL, relational database design and methods for efficiently retrieving data Prior experience with Hadoop, HBase, Hive, Pig and Map/Reduce.    Experience building complex and non interactive systems batch, distributed, etc.    Be responsible for the technical design and experience in guiding/mentoring others.    Strong OOPS knowledge, including experience with design patterns    Experience with Java/JEE and open source frameworks/tools like Hibernate, Spring, Maven, Ant, Subversion, Git, any web framework    Experience with relational databases like MySQL/Oracle    Experience with enterprise application servers like Tomcat/Weblogic/Websphere.    Exposure to Web Services SOAP and RESTFUL    Exposure to Agile/Scrum, TDD, and Continuous Integration tools like Jenkins, Bamboo etc.    Excellent analytical aptitude and problem solving skills.    Excellent communication and customer interfacing skill technologies to develop responsive user experience.    9+ years of hands - on experience in application development in an enterprise setup    Experience of 4 years or more in the position of lead developer/technical architect in enterprise Java software development projects    Experience in formulating technology solutions based on the requirements of the client    Taking complete ownership of technical solution and ensure technical expectations of deliverables are met    Experience in leading teams in Agile environment and a good understanding of Agile methods    Strong experience in Java/JEE development with experience in wide variety of open source frameworks    Supporting sales and pre sales activities   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["Hibernate", "Tomcat", "Database design", "Weblogic", "MySQL", "Agile", "Application development", "Oracle", "Open source", "SQL"]}