{"Job Title": "Associate Manager - Software Development", "Company": "Duck Creek Technologies", "Experience": "2 - 6 years", "Salary": "Not Disclosed", "Location": "Chandigarh", "Job Description": " Associate Manager - SQL Development is responsible for understanding business requirements, architecting and designing database solutions for manageability, scalability and performance. The AM - SQL development will work closely with business analysts, development team , QA , other team members and the client to build and deliver database solutions. The role also entails technical mentoring of other SQL Development team members.    Responsibilities     Understand data model of the products within the insurance domain    Develop Conceptual, Logical and Physical Design of the database based on business requirements    Develop and test stored procedures, views, triggers and functions    Optimize performance stored procedures, views, triggers and functions    Develop and maintain SQL Server Integration Services (SSIS) packages for Extraction Transform and Loading (ETL) processes    Develop, maintain and enhance SSRS reports, queries and data exports    Perform detailed data analysis on data related defects    Provide extracts business users the data required for metrics and analysis    Create and maintain data models and documentation for all projects     Skills     Hands on Microsoft SQL Server Management Studio (SSMS), TSQL and Stored Procedures    Hands on SQL Server Integration Services (SSIS) and SQL Server Reporting Services (SSRS)    Experience in Data modeling principles and techniques    Experience in performance optimization    Familiarity with Modelling tools like Enterprise Architect, Idera and Toad    Experience working with end clients and business users.    Four-year degree, or equivalent work experience    6+ or more years of experience as either a Database Developer or an Architect.    Ability to manage projects and tasks simultaneously    Strong oral and written communication skills    Strong trouble shooting and problem-solving skills    Strong analytical skills    Should be a quick learner.     Desired     Experience with Insurance and/or Financial Reporting systems will be an added advantage    Experience in Data Warehousing    Team Management experience would be a plus   ", "Role": "Software Developer,", "Industry Type": "Insurance,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Data analysis", "Team management", "Financial reporting", "SSRS", "SQL Server integration services", "Toad", "Stored procedures", "SSIS", "SQL development", "Physical design"]}