{"Job Title": "Technical Leader - DSP Software Development", "Company": "Azcom Infosolutions (India) Pvt. Ltd.", "Experience": "5 - 7 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": "Job Description\n\n The Physical Layer ( PHY ) team at Azcom (India) owns the delivery of DSP software for 4G,  NB- IoT and 5G physical layer implementations for small cell,  tactical and eMTC systems. PHY is the bedrock of embedded system design,  and critically impacts end to end system performance. We meet this challenge head- on every day and deliver world- class,  high- performance DSP software.\n\n Currently,  the PHY team is looking out for passionate technical leaders who can lead extremely talented young engineers and deliver exceptional results.\n\n As a Technical Leader,  your responsibilities shall include design,  development and integration of Layer 1 functions per the 3GPP specifications. You will participate in all phases of the SDLC and be responsible for delivering high quality,  optimized software components and subsystems. You are also expected to handle technical interactions with Azcom s global customers off- site and on- site.\n\n You should have a solid grip on software architecture and best design practices,  and possess in- depth knowledge of 4G,  IoT and 5G domains and applicable technical standards.\n\n Location: Gurgaon\n\n Work Experience Required\n\n Technical Leaders should possess 5- 7 years of working experience in Physical Layer development,  preferably in 4G,  NB- IoT or 5G.\n\n Mandatory Technical Skills\n\n Strong in C/ C++,  Data Structures and Algorithms Hands on experience in realization of 4G,  NB- IoT,  and/ or 5G PHY functions with Digital Signal Processors in Fixed point implementation Significant expertise in the development of real- time software systems Exposure to continuous integration development environments with a high degree of automation Profiling and optimizations of software components. Test case development and execution for unit level tests and Module tests Proficient in MATLAB programming Project Management,  control and reporting in an agile environment Experience of working in state of art software development environment,  including IDE,  development automation tools,  version control and artefact management Additional Technical Skills\n\n Application of best practices in System Design Experience of code refactoring and familiarity with programming in resource- constrained environments (CPU,  memory) Experience in working with version control tools Mandatory Behavioural Skills\n\n Customer centricity Ownership Leadership Excellent analytical skills and problem- solving ability Excellent verbal and written communication skills Developing others", "Role": "Software Developer,", "Industry Type": "Telcom, ISP,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Analytical skills", "C++", "Version control", "PDF", "Project management", "Agile", "Data structures", "System design", "Embedded system design", "SDLC"]}