{"Job Title": "Senior Development Engineer - Cloud Software", "Company": "ExecBoardinAsia", "Experience": "11 - 15 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  Job description    They re looking for a Senior Cloud Services Developer (Backend) who ll be responsible to form a team tailored for a specific mission.   You contribute to fast realization of prototypes as well as effective product development, by applying deep engineering knowledge of the most relevant coding platforms and standards, in combination with proven Agile collaboration methods and test-driven development.    You u ll be part of the company RD Bangalore and its responsibilities are architecture, design, development and test automation, so Innovation and passion for technology must be in your DNA.    As Senior Cloud Services Developer (Backend) in the Cloud Applications group   Drive innovation in software solutions for Connected LED Lighting Systems.   Architect, design, implement, debug and solve problems in software applications used in SaaS Cloud Deployment, On Device Web   Applications, Software installed on Windows, Mac and Linux environments   Willing to learn other programming languages, cloud service providers, operating systems and new technologies.   Active participation in Code Reviews, Code Quality Analysis, Security Risk Analysis, Build Management and Documentation.   Ability to work with multiple disciplines of system including hardware, firmware, optics, cloud and mobile devices.   Active participation in Agile Software Development Process.  ", "Role": "Software Developer,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Backend", "Linux", "Coding", "Cloud Services", "Build management", "Cloud", "Agile", "test driven development", "Windows", "Firmware"]}