{"Job Title": "Manager, Software Development", "Company": "KLA Tencor Software India Pvt.Ltd", "Experience": "4 - 8 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "                         Essential Responsibilities:     As a SW manager in this group, you will build and lead a team of smart software engineers to help our wafer inspection products to achieve the next level of performance through superior technology and the latest in software practices & machine learning. You will bring your proven experience in leading a team of engineers to conceive, design and deploy robust/scalable software for high-volume production and real time applications.   With respect to the value add for the position offered, expect you to:    Drive incremental value and make technical decisions that support strategic objectives   Leverage prior experience to advise against suboptimal approaches and one-time hacks, quickly pushing the team towards generic and robust solutions   Transform customer and business requirements into scalable and complete technical solutions backed by deep analysis in understanding   Easily work with legacy frameworks, while embracing and implementing modern technologies and frameworks   Communicate effectively on technical and business topics     Acquire and demonstrate technical knowledge of LS-SWIFT product software   Meet product timelines with good quality software   Works on complex problems where analysis of situations or data requires an in-depth evaluation of various factors   Ensuring that detailed designs, code, and unit tests are consistent, robust, future-proof and scalable. Understand and make design and architectural improvements on existing software.   Providing technical expertise to the estimation process. Create project plan, update higher management regularly on the progress.   Acquire knowledge of key use cases in Patterned wafer inspection   In conjunction with the Product Manager, identify, highlight, review and mitigate technical risks   Contribute to the continued improvement of the organizations development procedures, by looking for opportunities for improvement and proposing ideas for solution   Collaborate with cross-divisional and cross-functional teams across geographical zones to develop / deliver software solutions       Essential skills:     Good technical problem-solving skills   Strong understanding of Design patterns and Programming skills using any one of high-level languages - C#, C++, Java   Strong knowledge of Architecture patterns   Good knowledge on open source software and varied technologies (web and thick client) and have a good understanding on the strengths and weaknesses of software architectures of these technologies       Preferred Qualifications:     Preferred work experiences in semiconductor processing / equipment industry or product companies    Must have excellent communication, organizational, analytical, leadership, and interpersonal skills   Must be self-driven, and a strong team player   Good understanding on High Performance computing and related technologies/aids (CPU, GPU performance comparison and related toolkits) along with Machine learning basics       ", "Role": "Team Lead/Technical Lead,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["C++", "Architecture", "Chip design", "Analytical", "Process control", "Machine learning", "Packaging", "Application development", "Open source", "Automotive"]}