{"Job Title": "Software Engineer  Full Stack Development", "Company": "Siemens Limited", "Experience": "5 - 7 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "    Job Description     The software engineer is responsible for design, implementation, and unit testing of the assigned component/system with best quality and delivering the same.    The role demands the engineer should be quick learner to understand products/domain.   Responsible for the design of module(s) which are part of a system   Develop the code for the component/module   Implement and perform unit test for the assigned component/module   Involves himself in design review and code review as a peer reviewer   Review and contribute to the overall architecture of the subsystem/system     Qualifications and Experience     Engineering degree in Computer Science, or a related discipline   5-7 years of full stack development experience   Deep expertise in object-oriented analysis and design is a must   Experience in product development using C# is a must   Experience in UI development using WPF is a must   Experience in Web frontend technology framework Angular is a must   Experience in Trifecta of web front end technologies HTML, CSS JavaScript is a must   Experience in Relational database technologies (e.g. MS SQL Server) is highly desirable   Knowledge and Experience in gRPC framework is highly desirable   Experience in Report development using Qlik sense is desirable   Experience in ASP.NET Core is desirable   Good understanding of software design principles (SOILD)     Other Attributes     Good understanding for SDLC models like Agile, V model   Strong problem solving and analytical skills   Excellent spoken written communication skills   Team player with a proactive approach    ", "Role": "Software Developer,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "MS SQL", "Software design", "Javascript", "Agile", "Healthcare", "HTML", "Unit testing", "WPF", "SDLC"]}