{"Job Title": "Associate Business Analyst- Software Development", "Company": "T & A Solutions", "Experience": "1 - 3 years", "Salary": "Not Disclosed", "Location": "Gurgaon/Gurugram", "Job Description": "    Job responsibilities:     1) Should be able to assist in the client or prospect discussions and understand their business processes with relevant probing and capture requirements.    2) Map the client s business needs into the system features being implemented.    3) .Work closely with the technical project team members to track the functional progress and escalate any deviation to the program manager or the architect.    4) .Workclosely with the client to ensure no gaps / scope creep comes in from capturing to delivering the project.    5).Be a part and own the following     Requirement capturing & documentation    Internal progress review and pre UAT testing    Documentation of hand over documents    Perform Client UAT    Client training and hand over to the client.     6.Responsible for understanding project requirements, and help in design and develop systems to meet the requirements as discussed with the clients    7.Work with developers and architects, to ensure bug free and timely delivery of allocated projects.    8.Knowledge of Agile development methodology and exposure to program management tools such as JiRA and Project planning tools would be an add      Extremely effective communication skills with an ability to hold a client discussionand manage the interactions independently.         Gender:   Male     Qualification:   BE/ BTECH/MTECH/BSC/MSC     Industry:   IT & Software industry  ", "Role": "Business Analyst,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "System Design/Implementation/ERP/CRM", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["Process Associate", "Effective Communication", "CV", "Associate Business Analyst", "Manager Program Management", "Tools", "Project planning", "MSC", "JIRA", "Business Executive"]}