{"Job Title": "Senior Software Engineer - Java Development", "Company": "e-Hireo Global Pvt Ltd", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "Experience : 3+ Years. Location: Bangalore (Manyata Tech Park)Role : Sr. Software EngineerRequired Skills :1. Good working experience in Backend Development in Core Java platform2. Should be proficient in SpringBoot framework.3. Good working knowledge in Microservices.4. Good knowledge and understanding in AWS/ Azure/ GCP.Roles and Responsibilities :- Specific experience as a lead with one or more set of applications or microservices as part of a SaaS product, participating and/or driving the product through its entire life cycle from design, development, production to support.- Working with a team of individuals and leading/directing a small team of individuals working on diverse set of product components and features.- 2+ years of hands on experience developing and running large scale distributed applications, service oriented architectures, and reliable monitoring and deployment infrastructure.- Experience with building and running containerized applications in distributed environments such as kubernetes.- Direct involvement with messaging infrastructures, Kafka / AWS SQS. Developing distributed applications that use messaging infrastructures and in-depth experience working with them is required.- Databases, primarily MongoDB: Developing applications working with a DB, especially MongoDB with appropriate drivers and abstraction layers. Developing appropriate caching layers for scale and performance of database systems- Experience with building scalable production services with strict SLAs.", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "BCA in Computers, B.Sc in Computers, B.Tech/B.E. in Computers", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "Doctorate Not Required", "Key Skills": ["Java", "Azure", "Microservices Architecture", "Google Cloud Platform", "Kafka", "Spring Boot", "MongoDB", "AWS", "Kubernetes"]}