{"Job Title": "Senior Software Engineer - Frontend Development", "Company": "Spottjobs Consultants", "Experience": "4 - 7 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "This is a home furniture rental company that helps property managers,  realtors, stagers and residents experience and access furniture,  furnishings, decor, and equipment on demand. Our full-service offering  includes a wide selection of products, affordable monthly rental plans,  3D visualizations, rent-to-own options and white-glove service in as  early as 2-3 business days. This company converts furniture into a  utility for businesses. This company  is a furniture rental company that  helps businesses experience and access furniture, fixtures, and  equipment without going through the myriad challenges that are  associated with buying office furniture. This company offers a  full-service product including white-glove storage, delivery, and  installation on-site. What you will work onYour primary  focus will be to implement a complete user interface in the form of a  responsive web app, with a focus on performance. Your main duties will  include creating modules and components and coupling them together into a  functional app. A thorough understanding of all the components of our  platform and infrastructure is required as you will be working closely  with the back-end team to decide REST contracts.-  Assess the technical  feasibility of UI/UX designs-  Develop new user-facing features-  Build reusable code and libraries for future use-  Optimize application for maximum speed and scalability-  Assure that all edge cases are handled-  Collaborate with other team members and stakeholder-  Good understanding of responsive web development-  Proficient understanding of cross-browser compatibility issues and ways to work around them-  Basic understanding of SEO Need candidates from   product based company, e-commerce work experience is required    ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers, B.Sc in Computers, BCA in Any Specialization", "PG": "MCA in Computers, MS/M.Sc(Science) in Computers, M.Tech in Computers", "Doctorate": "None", "Key Skills": ["CSS", "Front End", "Software Engineering", "Frontend Development", "Web Technologies", "Javascript", "HTML", "React.js", "Web Development", "Frontend Architecture"]}