{"Job Title": "Software Development Manager", "Company": "Tesco Bengaluru", "Experience": "2 - 5 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   Job Description      Software Development Managers (SDMs) establish and sustain the environment for development to exist and succeed.    Their primary focus is to hire, retain and develop our Software Development Engineers (SDEs) through creating and aligning individual s short- and long-term objectives and development plan alongside the goals of the wider team and business.    They evolve the right tailored approaches to manage and develop their SDEs including regular 1-2-1 meetings, identifying mentors or mentees and providing impromptu coaching inputs.    SDMs help split the scope of work across one or more SDEs depending on their strengths and areas of improvement.    They actively work to set the SDEs up for success, providing course corrections as necessary. SDMs also help SDEs get the right mentorship to ensure they grow more expertise and to address any weaknesses hindering their effectiveness.   SDMs build effective, performing teams that consistently deliver quality software whilst balancing the demands of timeframes and needs.    They put in place the ingredients for teams to succeed, including the right level of process, practices and data gathering to help the team constantly improve.    SDMs default to granting teams autonomy but recognise when stronger guidance and help from them is needed.    When the team is performing, an SDM offers a light-touch to assist in unblocking progress. When a team is struggling the SDM identifies and actions a plan to help.   They build an effective customer engagement process to ensure their teams have awareness of the importance of good customer experience and show responsiveness to customer experience during development as well as in operational issues.   They drive continuous improvement of engineering practises and efficiency of development within their team and foster innovation.    They empower their engineers to own technical decisions whilst providing guidance and enforcing best practices. They are hands-on when required but are always aware of their primary focus when doing so.   Delivery and stakeholder management   SDMs deliver the right outcomes and collaborate with the appropriate stakeholders and customers, whether directly responsible for the functional delivery of a team or working across multiple teams.    They build healthy empathetic relationships to arrive at consensus and overcome any conflicts.   Within their operating domain, they demonstrate ownership over the relevant areas of work and can also reach out to, and execute effectively with, peers and other stakeholders when needed to ensure the success of broader, more complex outcomes.   SDMs are accountable for the slices they own in a program and proactively identify risks, propose mitigations and get them reviewed with their manager, stakeholders and customers.    They also know when to ask for help or escalate. SDMs are great at spoken and written communication.   Technical strategy.   There are three outcome that are expected from SDM as part of Technical Strategy.   Understand technology landscape and its implication to retail Industry - [White paper or Blog]   Evaluate, prototype and present implementation use cases. [Demos]   Induce Tesco approved technology change to their respective domains. [Produce compliance reports]   SDM participates in various meet-ups, seminars and events to understand technology advancements in the industry and collaborates with his team to develop prototypes and solutions.    SDM interacts continuously with his end users and product managers to keep them current with new possibilities of technology applications and value it brings for our customers.    SDM drives architecture, design , implementation, adoption and re-usability of such new technology by sharing their work with peer SDMs and create culture of innovation and technical excellence within his team and at Tesco at broader level.   Indicative split of responsibilities and effort typically spent   The chart below shows an indication of how time may be spent on these responsibilities for a typical SDM. This is over the long-term and naturally will flex based on the specifics of each role.   Key people and teams I work with within and outside Tesco   Product Management, TPMs, Other SDMs and HoSDs in other teams, People and recruitment teams, Contracting agencies, other members of the engineering community People, budgets and other resources I am accountable for in my job   Software Development Engineers that report to me.   Skills Relevant for the Job   People management. Emotional Intelligence. Problem solving, analysis and computational skills, Customer focus. Written and verbal communication skills   Experience Relevant for the Job   Demonstrated prior individual contributor experience at SDE III level    ", "Role": "Software Developer,", "Industry Type": "Education, Teaching, Training,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Product management", "Business services", "Prototype", "Flex", "Agile", "Stakeholder management", "Continuous improvement", "Customer engagement", "Operations", "Recruitment"]}