{"Job Title": "software development engineering professional", "Company": "Fiserv India Pvt Ltd", "Experience": "1 - 4 years", "Salary": "Not Disclosed", "Location": "Noida", "Job Description": "Must Have Technical \n\n•Total 2 to 4 years of application development experience using Asp. Net and C# \n\n•Hands- on experience with VS2008/ 2010/ 2012 and . Net v3. 0/ v3. 5/ v4. 0/ v4. 5 \n\n•Working knowledge of object oriented design principles and patterns.  \n\n•Working knowledge of MVC and/ or MVP design patterns \n\n•Hands- on experience with multi- tier/ layer distributed applications \n\n•Hands- on experience implementing and consuming WCF and/ or Web services \n\n•Hands- on experience with general UI skills such as HTML,  JavaScript,  CSS,  XML etc \n\n•Familiar with Session State Management,  Caching,  Http handlers and Modules,  Page life cycle,  Error handling etc \n\n•Good knowledge of RDBMS design concepts and coding practices \n\n•Working experience of SQL Server (TSQL,  SPs,  functions,  triggers,  joins etc) \n\n•Good understanding of concepts such as authentication,  authorization,  Single Sign- on,  Roles and Permissions etc \n\n•Good knowledge of Unit testing (component testing,  boundary conditions,  interfaces,  positive and negative scenarios etc) \n\n•Working knowledge of at least one source control system (good to have SVN,  Perforce,  VSS,  TFS etc) \n\n•Familiar with SDLC and build processes,  Coding standards and Time/ Defect tracking tool \n\nMust Have Behavioral \n\n•Good analytical skills \n\n•Good written as well as verbal communication skills (assertiveness,  collaboration etc. ) \n\n•Flexible attitude towards type of work (development,  support etc. ) \n\n•Open to adjust work timings on need basis (under special circumstances only) \n\n•Positive mindset to perform and deliver good quality work under tight timelines \n\n•Should be stable in jobs.  At least have stayed one year on his last assignment.  \n\nGood to Have Technical \n\n•Working knowledge of Vb. Net \n\n•Familiar with AJAX,  JSON,  JQuery,  RIA services,  Entity Framework,  AppFabric,  Localization etc \n\n•Familiar with Agile concepts,  TDD approach,  Automated unit testing using NUNIT,  MS Test,  Type Mock etc,  Code coverage etc \n\n•Experience with troubleshooting issues in QA,  UAT and Production environments \n\n•Experience working with multiple browsers and different IE versions \n\n•Familiar with third party controls such as Infragistic,  DHTMLX,  Telerik UI Kendo controls \n\n•Good understanding of screen/ application design parameters such as performance,  scalability,  maintainability,  security etc \n\n•Good understanding of database development parameters such as performance,  maintainability,  security etc", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["server", "code", "technical", "analytical", "Troubleshooting", "tracking", "coding", "database", "ui", "web", "design", "Application development", "mvc", "net", "Ajax", "c#", "Application support", "rdbms", "testing", "SQL", "quality", "jQuery", "application", "tdd", "XML", "Flex", "LAN", "http", "WCF", "agile", "sdlc", "support", "applications"]}