{"Job Title": "Software Engineer - Java Development", "Company": "optymyze", "Experience": "3 - 5 years", "Salary": "Not Disclosed", "Location": "India", "Job Description": " Job Description      As a Software Engineer for Optymyze, you will report to a Senior Software Engineer and work in the Pune office with members of the Software Development groups in Optymyze global offices to design, develop, enhance, and maintain Optymyze's software products.    Using your knowledge of Java technologies, you will work with product design team and will be responsible for implementing and maintaining software components.      This is you.       Passionate   your love for coding and solving problems, by using programming languages and associated tools, is what brings you the greatest professional satisfaction.       Collaborative   you enjoy sharing ideas and work with different colleagues to create value by solving critical business challenges.       Creative   you can transform business specifications into robust technical solutions, always seeing both the bigger picture as well as being able to recognize and properly integrate the key details.       Innovative   you avoid living in the past, even if it s comfortable, and love to constantly innovate in all projects you are involved in.       Evangelist   you have practical experience of most of the core principles of software development and you inspire and guide others to follow them as well.       Smart   - You are bright, smart and earned a   degree in BE/ BTech or BCS/MCS from only Premier Institutes   .     Qualifications      This is what you ve done.       Field experience   you have been working for at least 3-5 years on enterprise software development projects using Java SE/Java EE and you also have an IT-related degree.       Web Application Development   you worked on and delivered one or more projects that can be considered web applications and hence have a good understanding of the specifics of developing, building, releasing and deploying web applications (knowledge of Gradle and Kubernetes is a plus).       Complex projects   you have successfully delivered (or was part of the team that delivered) complex projects solving complex business problems experience in working with Big Data and machine-learning related projects is a plus.       Technical experience   for most of the projects you were involved in, you worked on features in the business and data layers (front-end related experience is a plus) by using a wide range both widely used frameworks and libraries (such as Spring Frameworks, Hibernate, REST-ful web services, etc.) as well as more specific technologies based on project-specific requirements.       Technical Design   you were involved in or created yourself the technical design for one or more projects, especially for the backend (business/data layers).       Agile Software Development   you have practical experience (considered a plus) or theoretical knowledge of agile methodologies and principles and can practically apply them as required.    ", "Role": "Software Developer,", "Industry Type": "Other,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial, B.Sc in Chemistry", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Web application development", "Hibernate", "Backend", "Front end", "Web services", "Technical design", "Coding", "Machine learning", "Agile", "Product design"]}