{"Job Title": "Manager Software Development", "Company": "GLOBAL ENGLISH INDIA PRIVATE LIMITED", "Experience": "3 - 7 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "    Supervise, mentor and delegate duties to the development team     Hire and train new developers     Establish development standards for the team     Create a budget and timeline for the development project     Collaborate with other Software development managers, solution architects, security office and devops to make sure that the solution design is secure, performant and scalable     Work with stakeholders and business partners to understand requirements, and translate them into deliverables for the development team     Efficiently manage teams time and take accountability of delivery commitments and manage risks     Responsible for design, development, deployment support of the products you own     Make right technology decisions for the team     You will manage staff in the dayto-day performance of their jobs.     Work on high-volume, low-latency Internet solutions based on a microservice architecture      Management experience    Strong communication, leadership, and problem-solving skills   BS/MS degree in Computer Science, Engineering or a related subject   Proven hands-on Software Development experience   Proven working experience in Java development   Hands on experience in designing and developing applications using Java EE platforms   Object Oriented analysis and design using common design patterns.   Profound insight of Java and JEE internals (Classloading, Memory Management, Transaction management etc)   Excellent knowledge of NoSQL (mongoDB)Relational Databases, SQL and ORM technologies   Experience in the SpringBoot Framework, AWS and Microservice.   Experience in developing web applications using at least one popular web framework (JSF, Wicket, GWT, Spring MV C)   Experience with test-driven development   Experience with AWS is a big plus  ", "Role": "Software Developer,", "Industry Type": "Education, Teaching, Training,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "NoSQL", "GWT", "Memory management", "Developer", "MongoDB", "test driven development", "JSF", "AWS", "SQL"]}