{"Job Title": "Software test engineer, Product Development", "Company": "2020 IMAGING INDIA LTD.", "Experience": "3 - 5 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": "\n\nAs a software quality assurance (SQA) engineer,  you will be responsible for designing,  creating,  and executing software test plan and test cases that are leading the way in assuring high quality of 2020 Imaging products.  You will be challenged with systematic QA testing methodologies in concurrent computing software architecture environment.  The engineer will have the opportunity to work with software developers and the site support engineer on a regular basis. Job responsibilities:  \n\n Play a major role to improve quality,  functionality,  reliability and usability of software products\n\n Design,  develop and execute comprehensive test plan with systematic QA methodology\n\n Perform thorough test case execution and analysis report\n\n Analyze test results to assure quality of existing and new functionalities\n\n Work in cross-platform environment (UNIX/ Linux and Windows/ Mobile)\n\nJob requirements:  \n\n Should have understanding of operating system,  relational database,  concurrent computing,  and client/ server architecture and mobile environment\n\n Should have excellent problem solving and trouble shooting skills\n\n Should have ability to excel in cross functional team environment\n\n Should have experience in Cross-Platforms (Unix/ Windows) application testing environment\n\n Should have excellent written and verbal communication skills in English\n\n Should have attention to detail,  positive attitude under stress\n\nProfessional qualifications:  \n\n 3 5 years of relevant experience\n\n Bachelor s degree in Engineering preferred\n\n Hands-on experience in scripting languages,  databases handling,  Windows OS,  Mobile OS\n\n Familiarity with software testing processes (Agile) and testing methodologies\n\n Skillful with automated testing tools (Test Complete ,  Selenium ,  Jmeter,  etc. ) and bug tracking systems\n\n Exposure to Software programming languages to create simulation /  testing modules\n\n", "Role": "Testing Engineer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - QA & Testing,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Unix", "SQA", "Linux", "Testing tools", "Windows mobile", "Agile", "Test planning", "Selenium", "Test cases", "Software quality assurance"]}