{"Job Title": "Software Development Engineer - Test", "Company": "Cloudera, Inc.", "Experience": "4 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "   Job Description:     Cloudera SDX(DataLake) enables centralized management of security and governance for multiple workload clusters. The Quality Engineering Team is looking for exceptionally talented Senior SDETs who would validate end to end interactions of SDX with other services of the Data platform. The primary responsibility is to deliver high quality non functional features of SDX on major public clouds. Alongside, you will develop an understanding of other Hadoop components and related technologies in the Cloud.         Primary Responsibilities       Develop high level test strategies based on customer use cases of Data Platform.        Validate non functional features like High Availability, Resiliency, Upgrade and Disaster Recovery.       Build, enhance and maintain workflows that automate End2End validation.        Work closely with the cross functional team to ensure good coverage of the customer use cases.       Develop automation frameworks for End2End validation of customer use cases in Python (pytest), Shell, Java (TestNG/JUnit),Ansible.       Debug system level deployment issues, root cause analysis, and resolve failures across multiple cross functional components.       Build test hooks if required and to arrive at project schedules and resource allocation models for successful delivery.       Strong commitment to best practices in QA and software development, including modern CI using Jenkins processes. Comfortable with Agile/Scrum processes and code review.         Requirements       BE/MS in Computer Science or related field.       Strong knowledge in at least one of the following languages: Python/Java       Knowledge of Cloud providers Amazon AWS and/or Microsoft Azure and/or Google GCP       Working Knowledge of Kubernetes, Dockers is a plus       Strong knowledge of QA methodology and tools, including creation of test cases and test plans.       Strong knowledge of Automation Framework Design and good at debugging       Development experience in Linux environments.       Knowledge of workflow management products is a plus. Working knowledge in Apache AirFlow is a plus.       Knowledge of DataLake concepts is a plus.       Knowledge of industry best practices related to chaos engineering is an added advantage.       Excellent communication and collaboration skills.       Good analytical and problemsolving skills.       Ability to work effectively both independently and as part of a team.       Working knowledge of the Hadoop ecosystem and applications is an added advantage.     ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "Doctorate": "None", "Key Skills": ["Computer science", "Root cause analysis", "Linux", "GCP", "Analytical", "Disaster recovery", "Resource allocation", "Test cases", "Apache", "Python"]}