{"Job Title": "SOFTWARE DEVELOPMENT ENGINEER", "Company": "McAfee Software (India) Pvt. Ltd", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "    Role Overview:       We are looking for Software Development Engineers for our Endpoint Engineering team in McAfee India Center (Bangalore). You have experience developing/shipping highquality, scalable software on Windows platforms. Have experience on Design Development Skills in C, Develops software as the primary job responsibility; Designs, develops, debugs and tests complex software in any field e.g., systems software, software development tools, applications, drivers, numerical methods, UIs, web. May work directly with companies developing and optimizing compilers, operating systems, and other software technologies. Usually holds an academic degree in Computer Science, Computer Engineering or Computational Science.    About the Role     Experience developing/shipping high-quality, scalable software on Windows platforms   Have experience on programming, debugging experience. Knowledge of debugging using tools like windbg.   Expertise in C++, C, Win32 API ,Multithreading, IPC, System Programming, Memory management and understanding of basic CS concepts is must.   Experience writing Unit Tests.   Knowledge of Windows internals.   Good Knowledge on installers like InstallShield   Familiar with Test-driven Development concepts.   Experience working both within a team and cross-group to guide identification and resolution of issues to ship along with being able to guide features into the product.   Exposure to Scripting language like Perl / Python / Ruby would be desirable   Must be passion for and commitment to software quality         About You       Excellent programming and technical skills in following programming languages: C++, PowerShell, JavaScript, and C#   Excellent ability to break down complex software systems with application of, Experience in performance and interoperability testing of software products in a production scenario with and present results   3+ years of experience doing code review, defect analysis, writing test tools and identifying automation opportunities   Excellent experience driving quality programmes like coding guidelines, best practices within the development teams   Must be highly motivated with a passion for and commitment to software quality   Have architectural, design, programming, and debugging experience   Experience delivering high-quality, scalable software with a cohesive user experience   Have good knowledge of Continuous development methodology and experience delivering software using CD principles   Expertise on Microsoft Windows operating systems.   You have the following traits: dedicated, persistent, analytical, focused, ambitious, and attentive    ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["C++", "Automation", "Multithreading", "Coding", "Debugging", "System programming", "Javascript", "Perl", "Ruby", "Python"]}