{"Job Title": "Software Development Engineer II", "Company": "Tecwallet LLC", "Experience": "3 - 8 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  Job Description    Our Development Ecosystem     Languages & Frameworks: Java, Ruby, Ruby on Rails & Dropwizard     MySQL/PostgreSQL     Splunk/ELK     REST/JSON     Kubernetes & AWS     GitHub     JIRA     Responsibilities     Design and develop high-quality code using object-oriented coding principles, covered by unit and integration tests.     Draw and implement abstract drawing board ideas into practical working components.     Understand the big picture, conflicting views, and participate constructively to find solutions.     Work with service owners across the company to make their services cloud-ready.     Support services on different technology stacks with application containerization, deployment, and operation on Kubernetes/AWS.     Identify gaps in our tooling and innovate proper solutions to bridge them as part of improving user experience.     Collaborate with owners of common building blocks (logging, metrics, database, etc) for migration to the cloud.     Ensure platform and application readiness in terms of capacity, performance, monitoring, and stability.     Guide fellow team members when needed.     Requirements     B.Tech, BS, MS, or Ph.D in Computer Science or equivalent education with 3 years of development experience on the backend or full-stack services.     Proficient coding skills in one or more languages: Java, Ruby, C#, Python, Go or similar.     Strong understanding of web technologies and service-oriented architecture and microservices and relevant patterns.     Good knowledge of tools such as Jenkins, Maven.     Excellent written, oral and interpersonal skills.     Self-motivated, good team player who has the ability to work in a fast-paced, ever-changing agile environment.     Nice to Have:     Previous experience with cloud migrations and associated validation steps (performance testing, monitoring, capacity planning etc.).     Experience creating Docker images and running Docker containers.     Good knowledge, practical experience or strong interest in Kubernetes or a related technology like Docker Swarm.     Kubernetes based certifications like CKA/CKAD.     Good understanding or strong interest in concepts such as Design-for-performance, Design-for-failure, Cloud Native, Cloud Ready, CI-CD, Observability and their associated tools.   ", "Role": "Software Developer,", "Industry Type": "BPO, Call Centre, ITeS,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Maven", "Coding", "Postgresql", "MySQL", "Performance testing", "Agile", "JSON", "Ruby", "Monitoring", "Python"]}