{"Job Title": "Software Engineer III - Full Stack Development", "Company": "Triedge Platform Services Pvt Ltd", "Experience": "4 - 7 years", "Salary": "₹ 10,00,000 - 20,00,000 P.A. (Including Variable: 80%)", "Location": "Noida, Gurgaon/Gurugram, Delhi / NCR", "Job Description": "Minimum qualifications:- Bachelor's degree in Computer Science, related technical field, or equivalent practical experience.- 5 years of relevant work experience.- Experience working in software development with one or more of the following programming languages; Java, Soap/REST, JSON, NodeJs and Javascript- Experience in working with front end technologies and/or front end frameworks.Preferred qualifications:- Master's degree in Engineering, Computer Science or another technical related field, or equivalent practical experience.- Experience with user-interface design.- Background in computer science, with a focus on data structures, algorithms, and API design.- Demonstrated ability to share knowledge via formal mentoring, reviewing code, reviewing design documents, providing technical talks, teaching classes, or as a consultant on projects.- Prior experience in handling complex integration in the Insurance and Fintech sector would be a plus.Responsibilities:- Design, develop, test, deploy, maintain and improve the software.- Manage individual project priorities, deadlines, and deliverables.- Design and implement new user-facing features in Bimagraam's product.- Write server-side/client-side code for web-based applications, create fast, easy-to-use, high volume production applications, and develop prototypes.- Optimize web and mobile applications for speed and scale.- @ Bimagraam is solving to enable agents to sell insurance seamlessly to TIer 2 and Tier 3 city customers. Simplify insurance for the layman and create a network of trusted advisors for Bharat.- Compensation includes Salary + Esops. We are looking for people who would be interested in solving unique problems in Insurance and develop easy to use and intuitive products for these customers.- Must be a self-starter who has attention to detail and focus on customer experience.", "Role": "Technical Architect,", "Industry Type": "Insurance,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "Doctorate": "None", "Key Skills": ["Java", "Algorithms", "Software Engineering", "Data Structures", "Object Oriented Programming"]}