{"Job Title": "Software Development C#", "Company": "Siemens Limited", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": " What part will you play   Configure, create, design, implement and execute applications using C    Analyze software requirements and able to provide software effort estimation   Design and implement software requirements.   Identify potential for re-use of components and promote re-use.   Maintaining technical documents for project (Feature Specifications, Wiki, share point)   Implement automation tests and unit tests for the features and maintain existing tests.   Analyze and identify bugs if any in sources and fix or report the bugs to the concerned.   Support client in the usability concepts of the product.   Communicate and interact with stake holders for any clarification. Have good analytical and problem-solving skills.    Use your skills to move the world forward        Qualification, Experience Competences   Qualification: B.E./B.Tech/M.E./M.Tech/MCA   Experience: 5 years of experience in design and development in C on Linux.     Must Have:    5 years of experience in software development.   Strong programming knowledge in C on Linux.   Strong networking skill   Good interpersonal communication, proactive, self-motivated, result oriented, good oral and written communication.   Ability to work as an individual contributor and as a lead.   Experience in Agile development.  ", "Role": "Software Developer,", "Industry Type": "Semiconductors, Electronics,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial", "PG": "MCA in Computers, M.Tech in Electronics/Telecommunication", "Doctorate": "None", "Key Skills": ["Automation", "Linux", "Analytical", "Agile development", "Consulting", "Siemens", "Individual Contributor", "Technical documentation"]}