{"Job Title": "Software Development Engineer-II (Voice Backend)", "Company": "Exotel", "Experience": "2 - 4 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": " What you will do   Develop/improve Exotels distributed voice stack.    Build fault-tolerant, scalable and real-time distributed system - Own the design, development and deployment of code to improve product and platform functionality    Writing high performance, reliable and maintainable code - Support team with timely analysis and debugging of operational issues Emphasis on automation and scripting.    Effectively work in a collaborative and agile team environment.    Mentor juniors in the team to do the above Be on rotational on-call roster to handle operational issues    What we are looking for   Must-haves Experience 2-4 Year Bachelor or Masters degree in computer science or equivalent.    Experience working with major cloud solutions AWS (preferred), Azure, GCP    Familiarity with 3-Tier, microservices architecture and distributed systems    Experience with design development of RESTful services    Experience with developing Linux-based applications, networking and scripting    Experience with different data stores, data modeling and scaling them    Familiarity with datastores such as Aerospike, MySQL, Mongo-db etc.    Experience with one of the OOP languages: Golang (preferred) / PHP (preferred) / Ruby / Python / C++    Good understanding of data structures, multi-threading and concurrency concepts.    Experience with DevOps tools like Jenkins, Ansible, Kubernetes, Git is a plus.    Familiarity with elasticsearch queries and visualization tools like grafana, kibana    Strong networking fundamentals: Firewalls, Proxies, DNS, Loadbalancing, etc    Strong analytical and problem-solving skills    Excellent written and verbal communication skills    Team-player, flexible and able to work in a fast-paced environment    A devopsmindset.    You own what you will develop     Good-to-Haves     Experience in telecom, related protocols and product start ups would be a plus    Exposure to telephony protocols, ISDN, SIP, WebRTC Practical   Experience in managing Production scale systems    Experience working with data ETL pipelines is a plus    Experience in development of cloud telephony systems (CPaaS) is a plus   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Telecom", "C++", "Automation", "Linux", "Networking", "Data modeling", "MySQL", "PHP", "Data structures", "Python"]}