{"Job Title": "Software Development Engineer in Test ( Infra RelQA SDET)", "Company": "Cohesity", "Experience": "5 - 10 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": "  Role Overview:     Cohesity is seeing rapid adoption in enterprises and the scale of deployments is increasing every quarter. System Testing is one of the crucial components for providing a seamless user experience when running different workloads. It is the most highly visible and impactful area that has a potential for defining the future directions for Cohesity s hyperconverged appliance.     Ideal candidate is passionate about System Testing, has an intuitive understanding of the limits of every layer in the hardware/software stack, has the intellectual rigor to reason about the theoretical limits of our software architecture and own the areas with the highest impact.     Responsibilities:      Own Data Protection related product areas and lead the test effort of one or more features.     Work with the engineering team during the feature design and implementation phases to develop:      the test methodology (designing the test approach) to test the feature end-to-end.     test plans.      Collaborate with other testing members, developers, technical writers, and customer solutions engineers to ensure the company delivers high quality products to our customers.     Execute multiple iterations of the test plan by running manual and automated test cases.     Analyze failures and root cause issues, file defects, follow up with developers, documentation and other teams on the resolution.     Automate test cases.     Monitor and manage continuous integration environment.     Mentor team members.      Requirements:      Have a high bar for quality of the product.     Creative, independent, self-motivated and willing to learn new technology.     Possess good understanding of QA methodologies and processes.     Ability to take up variety of roles in a startup environment.     Excellent troubleshooting abilities spanning multiple software and hardware components (such as switches, storage systems, kernels).     Good knowledge of Linux and should be comfortable with shell.     Prior experience of programming, preferably in Go or Python.     Knowledge of one or more Hypervisors - ESXi, HyperV, KVM.     Understanding of data protection, storage, distributed file system concepts is a must.     Experience with distributed systems (databases, storage, map-reduce frameworks, etc.) is a plus.     Strong test planning ability is a big plus.      Qualification:      BS in Computer Science with 7/10 yr experience or MS in Computer Science with 5/8 yr experience     5 years experience with testing systems products (storage, networking, virtualization, etc.)   ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Computer science", "System testing", "Linux", "Networking", "Data management", "Test planning", "Test cases", "Troubleshooting", "Virtualization", "Python"]}