{"Job Title": "Associate Director, Software Development", "Company": "ExecBoardinAsia", "Experience": "11 - 15 years", "Salary": "Not Disclosed", "Location": "Bangalore/Bengaluru", "Job Description": " They are looking for an Associate Software Development Director, who is passionate about developing great people, solving new problems, and building awesome software that delights their customers. If you have a track record of predictably delivering high quality, available, innovative, userfriendly software and are looking for a new challenge, this is a fantastic opportunity to lead a highprofile team.     Responsibilities include:     Challenging and inspiring your team to deliver great software continuously following the principles of agile and DevOps development.     Enabling the team by coaching, removing roadblocks, clarifying priorities, and working with relevant stakeholders.     Collaborating with Scrum masters, Product Managers, and other stakeholders to provide estimates and prioritize backlogs.     Managing individual features through the prototyping, design, development, and delivery phases.     Managing quality - attending to defects, production incidents, orchestrating automated testing, prioritizing technical debt and architectural spikes where appropriate.     Understanding your team members strengths and providing opportunities for them to learn and develop.     Work with teams across multiple geographies and time zones.   ", "Role": "Head/VP/GM-Technology(IT)/CTO,", "Industry Type": "Recruitment, Staffing,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Senior Management", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["Automation testing", "Architecture", "devops", "Software Associate", "Agile", "Design development", "Scrum", "Development Director", "Associate Director", "Quality management"]}