{"Job Title": "Head - Software Development", "Company": "TurboHire Technologies Pvt. Ltd.   ", "Experience": "15 - 20 years", "Salary": "Not Disclosed", "Location": "Mumbai", "Job Description": " Job DescriptionLooking to hire a Head of Software Development (HoSD) for a broking company of repute. The HoSD will be accountable for the creation and delivery of the strategic, software and IT architecture vision and leadership and all aspects of the development of the software.Roles & Responsibilities Develop and deliver a strategic technological vision and direction for the company;• Lead and manage the Software Development and IT teams to deliver software, infrastructure and architecture that meets the needs of users;• Ensure delivery consistent with Agile processes across the team;• Work effectively with Product Managers and Product Owners to ensure delivery against agreed priorities;• Implement mechanisms to monitor, manage and provide progress on all software development activities;• Accountable for the on time and to quality delivery of software development projects;• Responsible for the maintenance and development of internal and external IT support systems;• Create, implement and maintain a continuous improvement plan for software development and IT infrastructure;• Working closely with the Product Managers with the aim of meeting current and future user needs;• In conjunction with the Systems Manager, define and maintain the IT technology strategy and infrastructure plan;• Research the external environment, and where appropriate identify and recommend external partners for the delivery of best in class technologies suitable for the companys applications;• Reviewing and applying said best practices to establish architecture and frameworks consistent with and supportive of the Product Strategy;• Identifying and implementing technology trends that will be able to support the future success of the business;• Articulating to colleagues, Trustees and user communities, the companys technological vision, opportunities, and challenges as agreed with the CTO;• Collaborating with the appropriate functions and users to evaluate and identify technology platforms for delivering the company’s products and internal services;• Understanding the use cases (and/or user stories) in order to oversee the design of the architecture for the products to be built;• Ensuring that technology standards and best practices are maintained across the organization;• To drive consistent standards and approaches throughout the development teams;• Responsible for his/her own work planning against objectives set in agreement with the Executive Director. Communication and information• Communicate and ensure engagement of the companys technology strategies internally and within the companys user community;• As necessary, participate in and co-ordinate the software development activities of the company in external consortia and expert groups in support of the company’s charitable aims;• Promote the company and its charitable aims within the industrial and academic communities;• Ensure effective internal communications both within the software development team and across the organisation. Financial• Accountable and responsible for effective financial management, planning and monitoring of the Software Development and IT teams;• Provide monthly information to enable the creation of financial results and forecasts for the above teams. Staffing, Management and Resources• Ensure that the skills and experience of Software Development and IT teams are consistent with its scientific, technological and business needs for providing quality in present and future services;• Encourage software and IT staff to represent the company at conferences and meetings to continuously grow the reputation of the charity;• Establish clear organisational structures and succession plans aligned with appropriate responsibilities, accountabilities and personal development for all Software Development and IT staff in line with any anticipated growth;• Provide support for all staff in keeping with the company's values, policies and procedures• Undertake additional tasks and responsibilities as may be reasonably expected of the role and as necessary in order to achieve the objectives of the Software and IT teams and the company's goals.EligibilityEducation: B. Tech / Educated to degree level or equivalentMust Haves:Ability to augment team capacity to double or triple within 15-20 days notice.Strong understanding of the Agile software development cycleFamiliar with more than one software development methodology Excellent written and oral communication skills Outstanding interpersonal skills  An understanding of databases (including relational databases)Abilities Ability to envision and deliver software solutions that meet user needs and/or solve business problems  Able to design and architect technically sophisticated solutions to meet challenging user requirements  Ability to set and manage priorities judiciously  Ability to articulate and gain engagement for ideas to both technical and non-technical audiences  Ability to motivate in a team-oriented, collaborative environment.Experience:15 Years plus of experience in Software Development 5-7 Years’ experience as Head – Software Development Demonstrable and substantial experience in leading and managing teams of software developers  Experience of successfully designing and developing sophisticated software products deployed in a variety of environments  Hands-on experience of coding using more than one recognised industry standard language (e.g. C++; .Net, C#, React, Flutter etc) , Experience is deplyoing Microservices Architecture. Open API, NoSql DB Working in an Agile environment  Leading teams in working in an Agile environment  Performance and line management of highly skilled teams  Experience of successfully delivering into the market sophisticated software product releases deployed into a variety of environments", "Role": "Technical Architect,", "Industry Type": "Banking, Financial Services, Broking,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Any Specialization", "Doctorate": "None", "Key Skills": ["Software Development", "Line Management", "Personal Development", "Relational Databases", "Finance", "User Stories", "IT Architecture", ".Net", "IT Infrastructure", "Software Solutions"]}