{"Job Title": "Software Development Engineer in Test", "Company": "InfraCloud Technologies", "Experience": "4 - 7 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": "  What will you do    Create testing artifacts such as test plans, test cases, test reports, and tests.     Review product requirement documents in close collaboration with product managers and tech leads to create and document test plans and test cases for features.     Review test plan and test case documents as needed with key stakeholders.     Work hand-in-hand with the developers and product manager as a manual tester for new features under development.     As a quality engineer, understand the technical stacks and technology powering the applications.     Perform manual and exploratory testing as a prerequisite for test automation, for time-sensitive delivery scenarios and for unscheduled hotfix releases.     Develop and execute automated UI tests for regression and feature testing.     Develop and execute manual tests for regression and feature testing.     Perform pre-release automated regression testing for scheduled feature releases.     Uplevel overall QA team maturity by contributing to cross-functional efforts such as for nightly tests, monitoring test failures, and improving the frameworks that run the tests.     Work with Jenkins to schedule tests, analyze test results and share metrics and feedback with key stakeholders.     Perform testing in both automated and manual testing forms based on team needs     What you have    Active communicator in both written and verbal forms. The financials team s preferred communication style is via video conferencing     Demonstrated ability to work as a self-starter in a collaborative, self-directed manner in a fast-paced environment.     Experience working in agile product teams (Scrum and Kanban).     Interest in software system internals, e.g. how things work .     Has a strong orientation towards delivering results incrementally.     Experience improving quality through a combination of tests, dependency testing, and monitoring.     Self-starter who can collaborate effectively with the members of the product development team (product managers, architects developers, etc.) and with cross-functional QA team members.     Required Qualifications     Experience testing financial applications     4-7 years of experience in the following areas:     functional UI automated and manual testing     agile development methodologies     Selenium     Cucumber     Programming experience in at least one of the following languages: Javascript, Java, Ruby, or Python     Jenkins     Git     Nice To Have Qualifications     Experience testing financial applications     Experience with nightwatch.js     PHP     Experience testing windows (VM) based applications     Web-based application fundamentals (CSS, Jquery, HTML)     Behavior Driven Development  ", "Role": "Software Developer,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["jQuery", "Manual testing", "Javascript", "PHP", "HTML", "Scrum", "Windows", "Selenium", "Ruby", "Python"]}