{"Job Title": "Project Manager-Software Development-Civil Software", "Company": "INTERNATIONAL DESIGN AND ENGINEERING SOLUTIONS PVT . LTD", "Experience": "2 - 5 years", "Salary": "₹ 4,00,000 - 7,00,000 P.A. ", "Location": "Pune", "Job Description": " Job briefWe are looking for Project Manager helps manage the project timeline, resources, and scope in order to meet business requirements. The one who will help to ensure the scrum team is successful. A person who will work with stakeholders and team to set direction.ResponsibilitiesGuides and coaches the team on how to use Agile practices and principles to deliver high quality services.Gets team to a high performing level by recognizing areas of strength and improvement and employing appropriate coaching and development techniques.Works with Scrum Team, as well as internal and external stakeholders, to influence and drive decision making and support organizational project teams.Works with Agile coaches and other Scrum Masters to grow within the role.Contributes to the advancement and improvement of Agile practices within the organization.Facilitates and supports all scrum events: Sprint Planning, Daily Scrum, Sprint Review, and Sprint Retrospective.Person could self- initiate and leads current team.Requirements Ability to properly gauge the requirements and provide appropriate solution.Forward-thinking and resourceful to achieve target and ensure solutions are brought to fruition and requirements are closed properly.Problem Solving ability.Outstanding communication, facilitation, negotiation, and coaching skillsKnowledge of an agile method or understanding of software development life cycle models as well as in-depth knowledge of traditional project management principles and practicesAdept at refinement, story splitting, estimation, velocity, retrospection, and other Scrum techniquesPlanning and problem solving with product management and delivery teamsCertification of SCRUM master will be added advantage.Work Experience / Educational Requirements:            Bachelors/ Masters Degree 4+ years as Project Manager  Software Development", "Role": "Project Manager-IT/Software,", "Industry Type": "Construction, Engineering, Cement, Metals,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Project Management", "UG": "B.Tech/B.E. in Any Specialization", "PG": "M.Tech in Any Specialization", "Doctorate": "None", "Key Skills": ["Team Management", "Target Achievement", "Sprint Planning", "SCOPE", "Team Coordination", "Estimation", "Construction Engineering", "Communication Skills", "Software Developer", "Software Development", "Project Management", "Structural Engineering", "Scrum Master", "Design Engineering", "Agile"]}