{"Job Title": "Software Development Engineer", "Company": "INFISWIFT TECHNOLOGIES", "Experience": "2 - 6 years", "Salary": "Not Disclosed", "Location": "Pune", "Job Description": " Infiswift Technologies is looking for strong backend engineers for the teams that are developing exciting end-to-end IoT+AI applications for some of our multi-billion-dollar customers in the Oil and Gas industry. Some of these applications are:     Optimization of complex manufacturing assembly lines by doing Big Data processing and applying machine learning algorithms to analyze the performance from hundreds of IoT sensors. The goal is to increase the rate of production by reducing bottlenecks and predicting and preventing downtime that would save hundreds of millions of dollars.    AI-based product defect classification using machine learning and image processing. The goal is to reduce time and money by avoiding installation of defective products in oil and gas wells.    Conversion of unstructured data to structured data using Machine Learning, Natural Language Processing, OCR and other such techniques. The goal is to digitize decades of historical data and use that vast knowledge to build a AI-based recommendation system that can predict the reliability of future system designs.     Qualifications    Please note we are open to candidates who have completed or are completing non-traditional education paths, with a focus on demonstrated knowledge and ability based on the qualifications below.     Minimum qualifications:      Ability to write solid code in Python with minimal supervision    Ability to design and implement algorithms for the complex applications such as the ones mentioned above.    A solid foundation of data structures.    Bachelor s Degree or relevant experience in Computer Science or Electrical Engineering, Mathematics, Statistics.      Preferred qualifications:     Master s Degree or relevant experience in Computer Science or Electrical Engineering, Mathematics, Statistics.    Five years of relevant work experience.  ", "Role": "Software Developer,", "Industry Type": "Internet, Ecommerce,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "PG": "CA in CA, Any Postgraduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Computer science", "Backend", "Image processing", "Machine learning", "Data structures", "Data processing", "Sensors", "Analytics", "SQL", "Python"]}