{"Job Title": "Full-Stack Architect For a Software Product Development Company- Hyd.", "Company": "Solix Softech Private Limited", "Experience": "14 - 20 years", "Salary": "Not Disclosed", "Location": "Hyderabad/Secunderabad", "Job Description": "We are looking for a Full-stack Architect with 14+ years of experience Strongproficiency with JavaScript including DOM manipulation and the JavaScript objectmodel, React.js and Node Js. Your primary focus will be on developing user interfacecomponents and implementing them following well-known React.js workflows (suchas Flux or Redux). You will ensure that these components and the overall applicationare robust and easy to maintain.Our project entails implementing our pre-approved UI, constructing our API,connecting the two, and setting up our server infrastructure. This includes allassociated areas such as database and architecture design.You will coordinate with the rest of the team working on different layers of theinfrastructure. Therefore, a commitment to collaborative problem solving,sophisticated design, and quality products are important.Skills Writing HTML, CSS, and JavaScript. Being up on the latest practices is a must,e.g., HTML5, CSS3, and ECMAScript 6 (minimum) Depth knowledge of object-oriented JavaScript Experience on jQuery, D3 Js, Charts Js Minimum 6 years experience in back-end programming language NodeJS Minimum 8-10 years experience on Front-end framework React Js Server management and deployment for the relevant environment Ideally, familiarity with CSS preprocessors, bundlers, and associatedlanguages/syntaxes/libraries (Sass, Less, and webpack)Familiarity with a relevant and globally supported framework both front-end and back-end (React preferred) User authentication and authorization between multiple systems, servers, andenvironments Thorough understanding of user experience and possibly even productstrategy Experience implementing testing platforms and unit tests Proficiency with Git Appreciation for clean and well-documented codeRoles and Responsibilities  If you are willing to explore a new opportunity, please send your profile to Prakash.rao@solix.com  High priority will be given to those, who can join within 2 weeks...", "Role": "Technical Architect,", "Industry Type": "IT-Software, Software Services,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "Any Graduate in Any Specialization", "Doctorate": "None", "Key Skills": ["Node.Js", "Javascript", "React.Js", "CSS", "DOM", "Redux", "HTML", "JQuery", "NodeJs", "Front End", "ReactJs", "Ecmascript", "Webpack"]}