{"Job Title": "Software Development Engineer-Test Automation/Linux/CI/CD", "Company": "ViaSat, Inc.", "Experience": "6 - 11 years", "Salary": "Not Disclosed", "Location": "Chennai", "Job Description": "  Job Description      Have a passion for Automation, Testing, Development, and the ability to quickly learn a large and sophisticated system that is being installed worldwide.   You will be responsible for working on and with a team to continuously improve and maintain our automated testing, CI/CD pipeline to facilitate the rapid development and deployment of our suite of internal applications.    Additional responsibilities will include continuous improvement of the automation in test, development, and production environments, researching and implementing new technologies, solving issues as they arise, and writing unit, functional, and automation tests. Travel up to 10%.      Required Skills     6 years software or test automation experience in a Linux development environment using one or more of these languages: Tcl, Python, Perl, Expect, C+, C    Detailed problem-solving approach, coupled with a strong sense of ownership and drive. Development of test plans and procedures Continuous Integration Deployment (CI/CD) training or experience    Experience working effectively in Agile Scrum teams    Masters/Bachelor of Engineering/Bachelor of Science or equivalent experience.    Excellent verbal and written communication abilities.      Preferred Skills     Experience with Kubernetes, Docker containers, container networking    Experience working effectively in a DevOps environment.    WiMAX, LTE or related protocol stack knowledge/experience IXIA IxLoad /IxNetwork / IxExplorer experience    Experience with TCP/IP, network security concepts      Additional Requirements and information      BA/BS or equivalent experience  ", "Role": "Software Developer,", "Industry Type": "Telcom, ISP,", "Functional Area": "IT Software - Application Programming, Maintenance,", "Employment Type": "Full Time, Permanent", "Role Category": "Programming & Design", "UG": "B.Tech/B.E. in Production/Industrial, B.Sc in Chemistry, Any Graduate in Any Specialization, B.A in Other Specialization", "PG": "Post Graduation Not Required", "Doctorate": "None", "Key Skills": ["C++", "Linux", "Networking", "IXIA", "Protocol stack", "Network security", "WiMax", "Genetics", "Perl", "Python"]}