{
    "JOB DESCRIPTION": "Roles and ResponsibilitiesIntroductionSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do. Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide. At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.Your Role and ResponsibilitiesThe IBM Cloud Networking Tribe is looking for a talented, innovative and enthusiastic Software engineering professional that will build the next generation IAAS to make our customers succeed. The IBM Cloud Networking Tribe has a global cloud presence that continues to grow and expand its reach. Our Network Services engineering team is responsible for delivering virtual network services with top-notch performance, first-rate security, fail-safe reliability and exceptional quality.An IBM Cloud Networking Software Development engineer will be the key individual responsible for end to end feature enablement across the orchestration layer. You will perform hands-on coding and mentor junior developers, working to increase the knowledge and performance of the collective team. In addition, you will interface with senior architects across several locations to ensure that the overall strategy is communicated and understood.We are a global team, so communication skills (both verbal and written) are critical as well as flexibility to work with team members in other time zones.Responsibilities:Understand product vision and business needs to define product requirements and product architectural solutions.Use tools and methodologies to create representations for functions and user interface of desired productDevelop high-level product specifications with attention to system integration and feasibilityDefine all aspects of development from appropriate technology and workflow to coding standardsCommunicate successfully all concepts and guidelines to development teamEnsure software meets all requirements of quality, security, modifiability, extensibility etc.Collaborate with other professionals to determine functional and non-functional requirements for new software or applicationsProvide support for production escalations and problem resolution for customers.Analyse requirements, design develop & maintain software products in alignment with the technology strategy of the organizationParticipate in technical reviews of requirements, specifications, designs, code and other artifacts. Ensure commitments are agreed, reviewed and met.Learn new skills and adopt new practices readily in order to develop innovative and cutting-edge software products that maintain Company's technical leadership position.Plan, develop and manage the infrastructure to enable strategic and effective use of tools.Lead the evaluation/evolution of tools/technologies/programs with input from internal teams, external developers.Proactively identifying issues and improvement opportunities.Directing resources to diagnose and resolve complex system, application software, security and related problems that impact system and availability.How we’ll help you grow:You’ll have access to all the technical and management training courses you need to become the expert you want to be.You’ll learn directly from expert developers in the field; our SME's love to mentor.You will have the opportunity to work in many different areas to figure out what really excites you.Required Technical and Professional Expertise0 - 2 years of experience on Software Industry.Knowledge of Java, J2EE or Python or C Implement REST/HTTP/RAML/SwaggerUnderstanding of Cloud Computing.Understanding of software quality assurance principlesA technical mindset with great attention to detailOutstanding communication and presentation abilitiesPreferred Technical and Professional ExpertiseMicro services architecturesNetworking Knowledge is huge Plus",
    "ROLE": "Software Developer",
    "INDUSTRY TYPE": "IT-Software, Software Services",
    "FUNCTIONAL AREA": "IT Software - Network Administration, Security",
    "EMPLOYMENT TYPE": "Full Time, Permanen",
    "ROLE CATEGORY": "Programming & Desig",
    "EDUCATION": {
        "UG": "Any Graduate in Any Specialization",
        "PG": "Any Postgraduate in Any Specialization",
        "DOCTORATE": "Doctorate Not Required"
    },
    "KEY SKILL": [
        "Java",
        "Cloud Computing",
        "Python ",
        "RAML",
        "HTTP",
        "software quality assurance",
        "Networking ",
        " J2EE "
    ]
}