{"JOB DESCRIPTION": "   Job Description     Develop high-quality software design and architecture solutions by studying information  needs; conferring with users; studying systems flow, data usage and work processes;  investigating problem areas; following the software development lifecycle  Determine operational feasibility by evaluating analysis, problem definition,  requirements, solution development and proposed solutions  Document and demonstrate solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code  Prepare and install solutions by determining and designing system specifications,  Standards and programming  Improve operations by conducting systems analysis; recommending changes in policies and procedures  Update job knowledge by studying state-of-the-art development tools, programming techniques and computing equipment; participating in educational opportunities; reading professional publications; maintaining personal networks; participating in professional organizations.  Protect operations by keeping information confidential  Provide information by collecting, analyzing and summarizing development and service issues    Accomplish engineering and organization mission by completing related results as needed Support and develop software engineers by providing advice, coaching and educational opportunities and mentor junior and mid-level engineers  Collaborate with team to brainstorm and create new products  Grow engineering teams by interviewing, recruiting and hiring  Make informed decisions quickly and taking ownership of services and applications at scaleBe a persistent, creative problem -solver  Remain cool and effective in a crisis    Stay on the leading edge of development practices  Passionate about great technologies, especially open source  Understand business needs and know how to create the tools to manage them. Key Skills:  Master's degree in in appropriate field of study  Proven experience as a Senior Software Engineer  5+ years of experience as a software engineer  Extensive experience in software development, scripting and project management  Experience coding, testing and documenting including all front end functionality and templates and modules using contributed modules and developing custom modules as needed  Experience working in an agile environment  Experience building complex web systems that have been successfully delivered to customers  Experience in communicating with users, other technical teams and management to collect requirements, identify tasks, provide estimates and meet production deadlines  Experience with mission critical, 24x7 systems  Experience implementing and consuming large scale web services  Experience with professional software engineering best practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing and operations  Eagerness and willingness to learn new technologies  Be very comfortable with SOAP (XML) and RESTful interfaces (JSON), both for creating outgoing responses and incoming consumption of data from external sources.  Computer Science degree preferred  Must have:  1.Fluent with functional, imperative and object--oriented languages; knowledge of Python  2.In-depth knowledge of relational databases (e.g., PostgreSQL, MySQL) and NoSQL  3.databases (e.g., MongoDB)  4.Having knowledge of Apache, NGINX, SOLR, Redis, shell scripting, and on a variety of  5.platforms, including Unix/Linux, in physical, virtualized and cloud (Amazon/AWS)  environments.   Experience with cloud message APIs and usage of push notifications  Experienced with deploying applications on Docker, Kubernetes.  Experienced with cloud services like AWS, Azure.  Good to have:  Knowledge about Service Oriented Architecture (SOA) patterns, automating business  process models, API enabled gateway and multi/hybrid cloud-based services, Golang  Knowledge of Big Data technologies.", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Unix", "Linux", "SOA", "XML", "Project management", "MySQL", "Shell scripting", "Apache", "Open source", "Python"]}