{"JOB DESCRIPTION": "Role: Software DeveloperJob Location: Ahmedabad/Work From home (Contract basis)Experience: 1.5 to 6 Years Note: We are providing permanent or contract basis Role if you are willing to work from home.Job Description:Expertise in software development for frontend, backend, database, mobile/web and server-side technologiesExpertise in multiple latest software technologies across software engineering, security, data interchange, data management etc.Experience as a full stack software developerSolid understanding of the software development best practices across the software development lifecycleDeep understanding of the following areas:Familiarity with common technology stacksKnowledge of multiple front-end languages and libraries (HTML/ CSS, JavaScript, XML, jQuery)Knowledge of multiple back-end languages (MVC .NET, Java, Python) and JavaScript frameworks (e.g. Angular, React, Node.js)Familiarity with databases (e.g. SQL, PostgreSQL, Cassandra), web servers (e.g. Apache), streaming services (Apache kafka)Public cloud service offerings (IaaS, PaaS, DBaaS services as well high-level product offerings such, as AWS, Azure, etc.)Infrastructure as Software (Container Orchestration, Observability, CI/CD)Modern security practicesModern API platform designModern data architectures and software development principles (e.g. event driven architectures, data democratization, platform approaches to support ML/AI at scale, stream processing, and integrating real time analytics into customer applications)ResponsibilitiesDeveloping software productsWorking with other development members/teams and product managers to ideate software solutionsBuild the front-end of applicationsDevelop and manage well-functioning databases and server-side applicationsWrite effective APIsTest software to ensure responsiveness and efficiencyTroubleshoot, debug and upgrade softwareCreate security and data protection settingsBuild features and applications with a mobile responsive designWrite technical documentationWork with data scientists and analysts to improve softwareImmediate Joiners are most preferable.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["CSS", "Front End", "Web Technologies", "Postgresql", "MVC", "Responsive Design", "Angular", "Javascript Frameworks"]}