{"JOB DESCRIPTION": "About the role• Demonstrated ability to simplify a  complex solution into discrete components to parallelize development  efforts reducing the overall time to market• Partner  with Product Managers, Solution Architects and your Engineering peers to  define, analyze, estimate levels of effort to deliver at-scale  solutions to meet customer requirements.• You can  skillfully write high-quality, well-tested clean code and you are  comfortable with Object Oriented programming and SOLID design principles  • Proficient in Test Driven Development and Behavior Driven Development• Proficient in building Micro Services with Java 1.8 or higher, J2EE, Spring, Spring Boot• Exposure to Apigee, Ping Federate, OAuth and OpenID Connect• Experience in using containerization technologies and cloud, Azure and Pivotal Cloud Foundry preferred• Prior  experience working with Continuous Integration and Deployment in a  DevOps oriented product development environment and familiarity with  modern MML technologies like Splunk, New Relic and Pager Duty• Guide and advocate with technical expertise in the areas of architecture, design, implementation, and testing• Working experience on asynchronous messaging patterns like IBM MQ, Rabbit MQ, Kafka • Proficient with No SQL and Relational Databases• Working knowledge of Agile development methodology like Scrum, XP and kanbanWho you are6 + years of experience with Java in software industry • Engineering in Computer Science or MCA. • Knowledge of OOPs concepts  • Collections, String handling, Multi-threading, Exception handling, Generics and Synchronization • Frameworks like Struts or Spring (MVC, Core, Integration, JPA),Spring Boot and Micro Services. • Web Services (SOAP / REST) •  Junit / Mockito OR TDD • SQL and Joins. • Jenkins and Sonar • Working knowledge of Agile development methodology like Scrum •  Exposure to CI/CD tools like Jenkins, JIRA • Integration tools like  RabbitMQ/ActiveMQ/IBMMQ", "ROLE": "Software Developer", "INDUSTRY TYPE": "BPO, Call Centre, ITeS", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "MCA in Computers", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Java", "Spring Mvc", "Cloud Foundry", "Mockito", "Struts", "J2Ee", "JPA", "Spring Boot", "Web Services"]}