{"JOB DESCRIPTION": "•\tParticipate in, practice and help evolve the Agile Methodology.\n•\tDrive innovation within the product portfolio.\n•\tWork on frameworks and architectures to make product scalable.\n•\tLead a team of highly talented and dedicated developers who would be eager to learn from you.\n•\tDeliver design, code for the product.\n•\tApply principles of Agile in day to day work\n•\tParticipate in daily scrums and technical initiatives for the organisation.\n•\tDrive innovation within the product portfolio.\n•\tHelp in achieving a high customer satisfaction through technical deliverables.\nRequired Technical and Professional Expertise\n•\tAt least 2 year of experience in developing applications using Angular and ASP.Net MVC\n•\tExperience in all aspects of software lifecycle – Agile and Waterfall\n•\tExperience with building API's using Restful Services and JSON\n•\tKnowledge of Entity Framework, Dependency Injections and other Middleware technologies\n•\tStrong in Object Oriented development with practical implementations of Design Patterns\n•\tAbility to debug complex issues\n•\tContribution to software product documentation\nDesired Skill\n•\tA can-do attitude with great analytical skills.\n•\tShould have strong fundamentals and experience in Angular, .NET Framework, ASP.Net, MVC, C# and SQL Server.\n•\tShould be able to independently research and analyse new generation technologies and utilise it for future projects.\n•\tShould be a good team player\n•\tStrong and effective Communication skills\n•\tShould be a self-starter and able to understand the current implementations.\n•\tShould be able to understand and analyse the requirements, design and architect solutions and implement them.\n•\tShould be able to provide solutions to complex requirements.\nTechnology\nASP.NET MVC 5.0, C#, Angular 8, WebAPI 2.0, MS SQL 2016, Entity Framework, LINQ, LINQ, Repository Framework, Faade design pattern, JavaScript, Angular 5+, Bootstrap, Material Design(Plus point), Site deployment - IIS Hosting, GitHub, BitBucket, TFS and SVN, JSON, HTML5, CSS3, jQuery", "ROLE": "Software Developer", "INDUSTRY TYPE": "BPO, Call Centre, ITeS", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["MS SQL", "IIS", "github", "jQuery", "LINQ", "Javascript", "Entity framework", "JSON", "ASP.Net MVC", "CSS3"]}