{"JOB DESCRIPTION": " Job Description Enpass Technologies Pvt. Ltd. (Gurugram) is seeking for an experienced Windows C++ GUI software developer. We have a product for securely managing the credentials across platforms through a native productivity app, GUI of which is written in Qt toolkit and we are looking for a talented, enthusiastic developer for the same. We have a user-base of million customers, worldwide and serving them across platforms through beautiful and quality oriented apps is really exciting and challenging.We assure you that it will be a great learning experience through-out with exposure to all latest technologies.JOB RESPONSIBILITIES: Design, build, and maintain efficient, reusable, and reliable Windows Qt/QML/C++ code. Implement performance and quality modules. Identify bottlenecks and bugs, and devise solutions to these problems. Help maintain code quality, organization, and automatization. Collaborate with cross- functional teams to define, design, and ship new features.MUST HAVE SKILLS (Please do not apply if you do not fulfill this criteria): Desktop Applications using QT/Qml in Windows Environment Minimum 1 Year experience in Windows UWP development4-6 yrs experience in C++11 or C++14 standerd. Very good knowlege of STL. Experience of Multithreading in ANSI C++ Practical experience in Win32 apis. Basics of socket programming and inter process communication. Good understanding of REST apis and internet protocols in general. Must be able to write unit test.GOOD TO HAVE SKILLS Experience with development of Qt Quick Controls 2 based applications Experience in software development for mobile or tablet devices Familiarity with Cryptography basic concepts. Familiarity with agile processes and development / SW quality practices such as code reviews. Expertise on methods and tools for CI and test automatization. Build distributable packages (msi or wix).", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers"}, "KEY SKILL": ["Win32", "Qml", "Software Development", "C++14", "C++", "QT", "Multithreading", "STL", "windows developer"]}