{"JOB DESCRIPTION": "We are looking for an experienced Senior Developer with over 5+ yrs of experience to be responsible for overseeing junior developers on projects and supporting various development duties. The responsibilities of Senior Developers include writing code, analyzing data, and contributing to the design and implementation of software. Developer should have extensive experience in software development, be able to keep up-to-date with deadlines, and have strong analytical skills.Integrates applications by designing database architecture and server scripting; studying and establishing connectivity with network systems, search engines, and information servers. Server Management and Completes applications development by coordinating requirements, schedules, and activities; contributing to team meetings; troubleshooting development and production problems across multiple environments and operating platforms. Supports users by developing documentation and assistance tools. Creating new internet/intranet technologies Software/ Applications.Job Description -  Senior Developer Responsibilities:Performing coding assignments.Reviewing code work for accuracy and functionality.Creating and implementing design plans.Analyzing code segments regularly.Delegating tasks to team members.Keeping up-to-date with industry trends and technology developments.Senior Developer Requirements:Degree in Information Technology, Computer Science, or related.Extensive knowledge of software development and its technologies.Strong knowledge of JavaScript, C++, PHP, and SQL.Solid experience in coding.Strong knowledge of user interfaces.Strong knowledge of HTML and web frameworksWeb User Interface Design, Web Programming Skills, Software Requirements, Software Architecture, Software Development Fundamentals, Object-Oriented Design (OOD), Multimedia Content Development, Software Debugging, Server Management , Written CommunicationThanks & RegardsNisha SinghHR -Manager Tradologie.comD-160 ,Sector - 63 Sector - Noida Hr@tradologie.com", "ROLE": "Software Developer", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Software Development", "C++", "HTML and web frameworks", "OOD", "Web Technologies", "Javascript", "Programming", "PHP", "HTML", "User Interface Designing", "SQL"]}