{"JOB DESCRIPTION": " C#/WPF Software DeveloperMission:As part of a highly dynamic team, the candidate will be responsible for the design, development, testing & support for different applications to meet the identified business needs. Candidate in this role should have hands-on knowledge in C# / WPF / MS SQL / XAMLResponsibilities:Build software that follows industry-standard design      patterns, development methodologies, and deployment modelsCollaborate with other programmers and developers      throughout the development processEnhancing and troubleshooting the existing applicationsAbility to work closely with software developers,      product engineers, and documentation writers to build quality software in      a constantly evolving agile environmentEducation/Training B.Sc. in Computer Engineering, Communication, or Electronics.B.Sc. in Computer ScienceB.E./B.TechBCA/MCAProfessional experience4  5 Years of professional experienceLanguages Good grip on English language is a must.Technical SpecificationsExperience of building commercial software using C#,      WPF and XAMLExperience in asynchronous      programming using the Task Parallel LibraryExperience with asynchronous GUI utilizing C#Knowledge of MVVM application design patternKnowledge of DBMS, MS SQL serverExperience with integration of web servicesExperience with Agile software development using ScrumAbility to work on WCF, REST APIs and Web ServicesRoles and Responsibilities Desired Candidate Profile Perks and Benefits ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Gems, Jewellery", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Sc in Any Specialization, B.Tech/B.E. in Any Specialization, BCA in Any Specialization", "PG": "MCA in Any Specialization"}, "KEY SKILL": ["C#", "XAML", "Software Development", "MVVM", "Design Patterns", "Web Technologies", "MS SQL Server", "WCF", "WPF", "Web Services"]}