{"JOB DESCRIPTION": "     Job Description    You will design, develop, modify, debug and/or maintain software code according to functional, non-functional and technical design specifications.  You will follow Amdocs software engineering standards, applicable software development methodology and release processes, to ensure code is maintainable, scalable , supportable and demo the software products to stakeholders  You will investigate issues by reviewing/debugging code, provides fixes and workarounds, and reviews changes for operability to maintain existing software solutions.  You will work within a team, collaborate and add value through participation in peer code reviews, provide comments and suggestions, work with cross functional teams to achieve goals.  You will assume technical accountability for your specific work products within an application and provide technical support during solution design for new requirements.  You will be encourage to actively look for innovation and continuous improvement, efficiency in all assigned tasks.      Bachelors degree in Science/IT/Computing or equivalent  2-4 years of experience in writing software code in at least one programming language  2-3 years of knowledge in C,Unix/Linux, Database  Good knowledge in Object Oriented Design and development  Strong communication skills  Prior experience in Amdocs Ensemble will be an added advantage        Why you will love this job:     You will be challenged to design and develop new software applications.  You will have the opportunity to work in a growing organization, with ever growing opportunities for personal growth.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Telcom, ISP", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Unix", "Object oriented design", "Linux", "microsoft", "Continuous improvement", "Application software", "Amdocs", "Software solutions", "Technical support"]}