{"JOB DESCRIPTION": " We are on the lookout for a senior developer with a keenness to develop advanced unique technological solutions. Thinking outside the box and going the extra mile are qualities we highly value.     Qualifications:      B.EB.Tech in CSITECE or M.C.A from a reputed college.    2-5 years of software development experience.       Roles and Responsibilities      Combine excellent abstract reasoning ability to document, architect, develop and test software with the commitment to excellencedefect free before being deployed.    Write and implement low latency applications software solutions that integrate different systems.    Work closely with mentors, team members, team leads, program managers and stakeholders to investigate, fix, optimize, test and deploy high quality solutions.    Drive the technical design, implementation and maintenance of larger tech initiatives geared toward improving and scaling of products.    Accurately schedule and track progress of self team members. Create end to end WBS estimates for modules being implemented.    Participate in planning recognizing inconsistencies (e.g., scope, resources, feasibility, usability, customer value, etc.) in product requirements and alert the Project Mentor. Handle independently or assist the Mentor in building, testing, and documenting product releases.    Support the team in deploying product functionality assist the TLs in troubleshooting in production environment.    Rapidly incorporate new technologies as required deliver successfully by self.    Proactively promote Tech Culture by writing blogs, making presentations which will help you learn grow.    Effectively communicate one-on-one with on-shore off-shore product teams developers; gather and clarify requirements from technical folks product managers business teams.    Proactively assist and serve as a role model for the team members to follow the team software development process; consistently innovate the team processes to improve team productivity and quality.    Strong Analytical, Problem Solving Skills and participates in all activities with urgency, a results orientation, and a strong work ethic.    Must have technical knowledge of PHP. Magento 2.0 would be an added advantage.    Strong experience with relational (PostgreSQL, MySQL) databases.    Strong experience with unit testing and test-driven development.    Experience working with LinuxUnix Operating system comfortable with command line.    Experience with modern software engineering workflows and tools (e.g. Agile, JIRA, Git, CICD, Amazon Web Services, ELK, APM).    Knowledge of Web technologies HTMLCSSJS would be an added advantage.    Experience in all areas of SDLC, including architecture and design, development, and testing.    Demonstrate proficiency in at least one product technology of strategic importance to the organisation; incorporates new technologies as required.    Extremely passionate about code reviews, engineering best practices and mentoringcoaching the developers to make them successful.    Excellent understanding of feature estimation and ability to communicate issues and risks that may impact timelines, budget, or resources.    Experience with Agile development lifecycle.    Can gather and clarify requirements from technical folks product managers business teams.    Lead by example act as a role model for the team.      How will you grow here:      Work in multiple projects teams spread across different domains and technologies.   Work interact directly with senior directors in an open and flat hierarchical structure.   You can own all aspects of managing software products and projects.   You get to work with top-notch engineers and leaders with decades of experience in building and delivering great software.   Work with CXOs Senior Directors of various emergent companies in US India.   Get involved with the newest products, latest technologies and different methodologies.   Opportunity to Mentor the Best and Get Mentored by the Best.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Other", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Production/Industrial", "PG": "MCA in Computers"}, "KEY SKILL": ["Linux", "Postgresql", "MySQL", "PHP", "HTML", "Unit testing", "Troubleshooting", "JIRA", "Gaming", "SDLC"]}