{"JOB DESCRIPTION": " Join their diverse team and award-winning culture and be part of our clients digital transformation journey by working to define the best methods and making sure they are supported by the right technology and an enabled workforce. This journey will lead to improve project outcomes, being able to leverage the digital twin, systems integration and interoperability, support for decision-making, autonomous execution, and integrated operations and performance centers.    As the successful candidate, you will:     Work in Application maintenance and support team to provide technical solution of client problems   Work on prioritized defects and enhancements to and deliver it in within pre-defined SLAs   Be involved with all technical activities within the team such as estimating, sprint planning, software development life cycle activities, code reviews, testing, research, deployments and documentation creation   Emphasize the collaboration and communication of both the development teams and IT to automate the process of software delivery   Advise on risk and order of feature development with the overall goal of delivering valuable, working software to production in a continuous release product lifecycle   Remain abreast of technology developments within fields relevant to current and future initiatives and development work   Communicate open items and issues to key stakeholders, including management and architecture teams   Continuously discover, evaluate and implement new technologies to maximize development efficiencies   Works well in a team environment with shared code; disciplined use of source control and process documentation.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - System Programming", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Architecture", "Process documentation", "Software development life cycle", "Manager Technology", "product life cycle", "Management", "Research", "digital transformation", "Testing"]}