{"JOB DESCRIPTION": "  Your Responsibilities:     Application development / change requests of SOPIC Tax engine.   - Application development / change requests and support of SPM, DC Systems.   - Enhancement & support of document management system (Invoice, Credit/Debit notes, Purchase Orders etc)   - Take ownership and timely follow up on incidents and requests as assignee   - Register, categorize and classify incidents and requests   - Prioritize incidents and requests according to given Priority matrix to drive and focus day-to day support   - Analyze application issues and provide workaround or permanent resolution and communicate in timely manner in line with the agreed service scope and service levels   - Perform Problem Management for root cause identification and permanent resolution   - Perform technical analysis for root cause analysis and create technical specification for software defect resolutions   - Perform technical analysis and create technical specification for pro-active error prevention of business-critical application processes   - Escalate process related issues to Business Process Owners   - Identify and communicate application or process related improvements to relevant stakeholders for further investigation and consideration of error prevention   - Provide replication steps for application malfunction to support Problem Management in root cause identification   - Perform data recovery tasks for the sake of data integrity and data consistency as per instruction and following support principles and procedures   - Perform mass data updates requested by the customer as per instruction and following support principles and procedures   - Apply appropriate user account management procedures   - Maintain documentary evidence in support of compliance with all auditable processes   - Assist in maintenance and creation of support documents (content) and any other necessary resources to facilitate re-use and enhance competency and efficiency of the SOPIC/SPM Competence Center function.   - Assist in identifying and recommend and apply changes in support practices, maintenance and standards, and cross-training required to better share application support competency and responsibilities across the SOPIC/SPM Competence Center function and with connected functions and stakeholders.   - Developing user manuals wherever necessary & user training in SOPIC/SPM as & when needed.   - Perform quality assurance (Operations acceptance) testing for any emergency and minor changes.   Participate in service operational reviews, ensuring SLA, KPI and other data / information is provided to assist with such reviews   - Assure high level of accuracy and completeness related to incidents and requests, and where possible resolve or provide workarounds, suggestions and improvements to mitigate future incidents.   - Participate in the process of transition new solutions and applications and projects into SOPIC/SPM Competence Center Operations environment, assist in ensuring all service acceptance and operational deliverables have been successfully developed and agreed and required knowledge has been received prior to handover.   - Identify and specify opportunities for service improvements   - Ensure adherence to company policies, designed procedures, internal controls and security principles   - Communicates urgent incident statuses to levels of Management as appropriate   - Alert the manager of IT Business Systems & Support of any shortages and performance issues within the support chain.   - Provides level 3 and 4 application and application process support    Your Profile:     Bachelors degree in IT or MCA or MSc Computer Science with minimum 5 years professional experience in application development and support of any ERP system in i-series in a similar role. ITIL Service Management certification is desirable.     - Minimum 5 years professional experience in managing support calls, incidents, root cause analysis and providing workarounds and permanent solutions.     - Minimum 5 years professional experience working in international and common framework.     - Strong knowledge of Order to Delivery, Supply Chain and Production concepts and India Taxation.     - Basic understanding of Finance process - General Ledger, Taxation, reconciliation of AR & GL & AP & GL etc     - Strong experience in formal change and release management processes     - Strong experience in escalation procedures     - Excellent ability in delegating and allocating tasks/work within the team     - Excellent analytical skills     - Excellent time management skills and the ability to prioritize workload     - Administrative procedures such as quality assurance     - Excellent AS/400 knowledge     - Excellent Query/400 and SQL knowledge     - Sound knowledge in ILE-RPG / Freeform RPG programming language     - Sound knowledge in Embedded SQL (desirable)     Structured way of working     High sense of responsibility     Ability to work in international, multicultural and decentral teams     Good written and spoken communication skills in English.     Able to travel internationally     Capable of performing during irregular work hours  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Industrial Products, Heavy Machinery", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Supply chain", "Application support", "Change management", "iSERIES", "RPG", "Problem management", "Application development", "Troubleshooting", "Release management", "SQL"]}