{"JOB DESCRIPTION": "There will be a great need in the blocks for Azure knowledge & support during and after the migration. The main focus will be on infusing the DevOps blocks with Azure knowledge. You will play a central role in the design, development, and delivery of the organizations products and services, maintaining all development and production systems while operating and maintaining security, software, and related cloud infrastructure.The Senior Developer is able to support and coach the other developers in their work and help them with knowledge of and practical experience of Azure. He /she can assist the developers in transferring and embedding the Azure skills in the blocks.  Knowledge & Experience- You have Microsoft Azure PAAS Services skills in for example the following areas: NoSQL - Cosmos DB or Mongo DB or Logic Apps- You have Design Skills, e.g. Cloud Design Patterns - CQRS, Event Sourcing, Valet Key, etc. - You practical experience with the following Technologies: Azure Devops, Specflow, Gherkin, Git Version Control Process & Test Frameworks, at least one Standard programming language, Docker- Deep knowledge of Microsoft Azure, certification in the area is required- Experience in DevOps: understanding deployment scenarios, work with full-scale pipelines- Practising generic development principles such as SOLID, Clean Code, Patterns- Practising at least one programming language at the current state of technology- Knowledge of modern architecture patterns like Service Meshes- Knowledge of DDD, BDD & TDD - Use Cloud design best practices and patterns such as CQRS, Event Sourcing, Valet Key to build highly scalable, fault tolerant and resilient solutions - Leverage Azure storage and messaging services such as Service Bus Topics, Event Hubs, Azure Blob and Table Storage, Azure SQL and Cosmos DB- Integrate Identity management and modern authentication and authorization protocols such as OIDC, OAuth 2.0 using Azure Active Directory, Azure AD B2C- Use Azure API Management as an API Gateway- Knowledge of using Docker & how apps can be containerized - Knowledge of Azure Kubernetes Service and how it orchestrates containers- Minimum of 5+ years relevant experience & Minimum 1-2 years of practical azure experience ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["Azure", "PAAS", "Devops", "Azure Active Directory", "Architecture", "Version Control", "Azure Devops", "Kubernetes", "SQL"]}