{"JOB DESCRIPTION": " Software Engineer  Backend Developer About Us: Aptify is now part of Community Brands. Community Brands is a software company that helps organizations achieve social good. Through our technology, we help more than 100,000 associations, nonprofits, schools, faith-based organizations, and partners grow stronger and achieve their missions. Like our clients, our nearly 2,000 employees strive to improve the world in which they live, and we believe that technology plays an important role in that. We are techies and volunteers who dream big and are motivated by more than just a cool job (though thats a great perk we offer too). The Community Brands culture is one where employees can pursue this passion as part of their profession, and were looking for great employees to join us! A day in the life: As a Java Engineer, you will have the opportunity to work with a powerful web application using some of the latest technologies with a brilliant, talented bunch of developers. You will work with other development team members to design, develop, test, and launch new functionality for our platform. This position will be located in our Pune Office. About product: Crowd Wisdom enables you to provide a personalized, social and engaging learning experience which is learner centric. The Crowd Wisdom™ learning management system (LMS) suggests relevant content to each learner based on our advanced recommendation engine. It also allows learners to connect with peers to share knowledge and guidance. Crowd Wisdom features:Branded, Customized InterfaceCentralized Learning HubAssessment & TestingTracking & CertificationsVideo Playback Engine & AssessmentPersonalized Learning PathsSocial Learning CommunityContent AuthoringMulti-Device Support  Responsibilities: Work with the Product Managers and Development team to understand and define requirements.Create design documents to ensure that software fits into the overall architecture and addresses requirementsPrototype features when applicableDevelop the application using best practices / designCommunicate status and issues orally and in writing in a timely manner. We'd love to chat if you have... 3 - 7 Years of Experience Java / J2EE, Spring Framework, Spring Boot, MySql, JQuery.Proficient with Object Oriented Analysis and Design and data structure.Demonstrable experience with implementing scalable systems in Cloud - preferred AWS Cloud Platform.Experience in SVN/GIT and Linux environment is required.Master’s degree in Computer Science or relevant Engineering degree.Willing to work in 1 PM to 10 PM shift. Experience in the following would be a plus: Experience with Hibernate, JPA, or other ORM library.Experience in React/Typescript, Jquery, or any JS framework, API/Web service.Experience with Eclipse IDEExperience with MavenExperience in Agile work environment.Developing Applications utilizing Graph QL, Elastic Search, AWS Cloud and EBeans.DevOps Understanding.Working knowledge of Docker and building automated integrations and deployments using configuration management tools.Understands Micro-services Architecture.Experience with Component Based Web Frameworks (Wicket, Tapestry, GWT). Good People, Doing Good Things: Employees at Community Brands are techies and volunteers who strive to make the Company a great place to work. We dream big and are motivated to help our customers use the technology we create to improve the world around us. And, we look forward to you being part of our story!  Planned Paid Time OffPurpose Driven CultureWork-life balance Passionate about Community InvolvementCompany Paid Parental Leave Remote Flexibility", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "BCA in Any Specialization, B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["Java", "Hibernate", "Wicket", "GWT", "Javascript", "Spring Framework", "Tapestry", "Spring Boot", "JPA", "J2Ee"]}