{"JOB DESCRIPTION": "Hi,  we have an urgent opening for Software Developer for our client who is among the Youngest Indian IP Law Firms to have been Ranked and Recommended by Legal 500,  Managing IP,  Asia IP and is Representing Numerous Indian and Global Corporates,  SME's,  Universities,  and Individual Inventors,  from Across Technology and Business Verticals.  The Company is having Strong Associate Base in United States,  European Union,  Singapore,  Israel,  Japan,  China,  Korea,  ARIPO,  and Australia. Job position:  -  Software DeveloperQualification:  -  bachelors degrees in computer science or software engineering.  Experience:  -  .  4- 5 years in ASP. NET and other web development platforms. Salary:  -  upto 6 Lakhs per annumJob Description: - 1.  Candidate should have a substantive,  hands- on,  and focused experience of at least 4- 5 years in ASP. NET and other web development platforms. 2.  Candidate should be willing to work independently to help develop one or more softwares for an Intellectual Property (IP)  Law Firm including modifications,  customizations,  and incorporating client feedback. 3.  Should be an individual contributor,  positive thinker,  and willing to take challenges to develop and manage multiple softwares that the Law Firm intends to develop. 4.  Should be willing to settle in Noida/ Gr.  Noida region for face to face and time- sensitive software development. 5.  Should also assist in helping the firm strengthening its IT practices,  incorporating stronger network security policies,  implement IT procedures,  manuals for efficient and secure work management.  Should therefore have well- rounded back of hardware as well as software knowledge across industries,  platforms,  and technologies. Work Days & timing:  -  9am- 6. 30pm,  Mon- Sat (1st & 3rd Sat- off) Gender:  -  Male/ Female (preferred from Greater Noida) Location:  -  Kasna Road,  Greater Noida", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["JAVA", "Business Analysts", "development", "Architects", "XML", "design", "SQL. Android", "ios development", "PL", "Lead Developers", "SQL"]}