{"JOB DESCRIPTION": "Career Opportunities at virtualinfocom Virtual Information and Communications (with an excellent creative team,  who are into games,  android application,  iphone application,  windows mobile,  java cell phone application,  social plugins,  facebook applications,  Ad- commercials,  short films, corporate films,  animation movies,  music videos,  stereoscopy,  print advertising,  Microprocessor) in Saltlake Kolkata- 64 comes as a breath of fresh air to all the aspiring animators,  Software Developers and graphic artists. Currently we are dealing with three Animated Movies in Classical way. We mainly focus on our Customer’s needs and adapt a work pattern that suits their requirements. We have earned lot of Kudos and appreciation through our commitment towards excellence by offering proactive services. We introduce ourselves as one of the leading organizations offerings services for Animation,  Game Development,  CMS,  Animation ,  Comics Design. We offer excellent growth opportunities and an attractive remuneration package,  commensurate with capabilities,  qualifications,  and experience.\n\nVirtual Informationand Communications (with an excellent creative team,  who are into games,  android application,  iphone application,  windows mobile,  java cell phone application,  social plugins,  facebook applications,  Ad- commercials,  short films, corporate films,  Software Developersand Animated Moviesin Classicalway. We mainly focus on our Customer’s needs and adapt a work pattern that suits their requirements. We have earned lot of Kudos and appreciation through our commitment towards excellence by offering proactive services. We introduce ourselves as one of the leading organizations offerings services for Animation,  ComicsDesign. We offer excellent growth opportunities and an attractive remuneration package,  commensurate with capabilities,  qualifications,  and experience. \n\n", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["Printing", "software", "Corporate", "android", "CMS", "windows", "iphone", "game development", "android application", "java", "Focus", "Windows mobile", "Animation", "Advertising"]}