{"JOB DESCRIPTION": "Aciron Consulting is seeking motivated and skilled Microsoft .NET Developers who are passionate about developing new technologies, have fresh, innovative ideas, and are excited about the latest technological trends. You will design and develop innovative, high- quality custom web applications that meet our clients unique business and technology needs. Working closely with project management, consulting, and technical teams, you will participate in the full lifecycle of software development and use the latest tools and technologies to deliver superior applications on time and as per scoped client expectations. What will I be doing • Developing and customizing high- quality, custom web applications and solutions that meet and exceed industry standards for clients and internal projects • Interacting daily with Project Managers in our corporate office to provide updates on projects' progress and to ensure that projects are on track and meet client's requirements throughout the entire development lifecycle • Working closely with our Business Analysts to analyze client project requirements and specifications and develop applications to meet client's unique business and technical requirements• A Masters or Bachelors of Science in Computer Science, Information Technology, Engineering or equivalent \n• 2 - 4 years hands on development experience with Microsoft .NET technologies \n• Experience in backend databases using SQL Server \n• Ability to translate business requirements into system functionality \n• Mobile application development experience, either web or native device is preferred \n• Excellent communication and interpersonal skills \n• Ability to effectively prioritize and execute tasks in a fast, high- pressure and client- oriented environment \n• Strong teamwork skills and the ability to communicate across all levels of the organization \n• Strong analytical, problem solving, and organizational skills \n• Ability to work independently with minimal supervision \n• Experience in Microsoft SharePoint is a plus, but not required", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - DBA, Datawarehousing", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["", "Mobile application development", "development", "technical", "software", "Project management", "developing", "microsoft", "tools", "SQL", "quality", "Information technologyTools", "Microsoft Sharepoint", "management", "web", "Analytical", "Consulting", "design", ".net", "applications"]}