{"JOB DESCRIPTION": "      Job Description:    This position is responsible for the analysis, design, coding and implementation of several software modules which provide remote and centralized management of the Iron Systems hardware products.. This position will work as part of a team of Technical Support Engineers and Software Engineers to review and develop technical specifications analyze system requirements. This person will code, test, debug, document and maintain these software solutions. This position will interact with a larger team of IT Support professionals, QA engineers, Network Security professionals, product management and other hardware and software engineering team members. The ideal candidate will have a strong background in Linux software development and some Web Services technologies. A strong background in Bash scripting, source management and general Linux management technologies would be very beneficial.   The ideal candidate will be able to work with management and engineers in the US to analyze technical requirements and translate these requirements into a complete solution. This position offers a unique opportunity to work with leading edge technologies and to grow your skills with technologies that power millions of Linux based systems. This pays off in deep knowledge of mainstream technologies, profound business experience and a fast track to a resume and career which will be valuable on the job market for many years.    Job Qualification:     4+ Years software development experience   Hands-on experience with Linux C++ and C System Library Development   Experience with Linux Scripting and Linux system management   Experience with working with custom Linux implementations and creating Linux installations on several environments including bootable DVDs, USB sticks and other boot environments   Development of native Linux GUI software systems   Interface code projects with underlying Windows Resources such as scheduling systems, disk and network interfaces, process management and other management infrastructures   Able to develop REST protocol technologies   Proficient with Apache, PHP and other WEB technologies   Good background in creating GUI user interfaces.   Work well in Team environment   Performs other duties as assigned.     Personal Background:     Organization Skills: Career oriented, self starter, highly motivated, team player with focus on delivery and customer service, ability to think strategically, and maintain a high standard of conduct and professionalism   Business Skills: Experience developing and managing to budgets.   Communication Skills: Excellent English written communication skills. Clear, understandable English phone skills and a service-oriented attitude; ability to deal with both business and technical users.   Schedule Flexibility: Willingness to work a flexible schedule including occasional after hours on-call, weekend duty, multitask and resilient.     Education Background:    Undergraduate degree in computer science field from a leading institute a must   Would you like to apply to this job ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Hardware & Networking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["SAN", "C++", "Linux", "Coding", "USB", "Network security", "PHP", "Windows", "Apache", "Technical support"]}