{"JOB DESCRIPTION": "JOB DESCRIPTION  TECHNICAL LEADFunction: INFORMATION TECHNOLOGYJOB DEFINITIONWe are searching for an innovative Technical Lead to join our company. As the Technical Lead, you willoversee the companys technical team and all projects they undertake, analyze briefs, write progress reports,identify risks, and develop work schedules. You should be able to work with your team and inspire them toreach their goals. To be successful as a Technical Lead, you should always be expanding your industryknowledge and be able to quickly identify problems. Outstanding Technical Leads are accountable,trustworthy, and able to build lasting relationships with their teams.OVERVIEW Determining project requirements and developing work schedules for the team. Delegating tasks and achieving daily, weekly, and monthly goals Reporting & AnalyticsKEY JOB RESPONSIBILITIES Determining project requirements and developing work schedules for the team. Delegating tasks and achieving daily, weekly, and monthly goals. Liaising with team members, and management to ensure projects are completed to standard. Identifying risks and forming contingency plans. Analyzing existing operations and scheduling training sessions and meetings to discussimprovements. Writing progress reports and delivering presentations to the relevant stakeholders. Building scalable, high-performance backend system. Analyze, debug, and fix complex issues, continuously drive innovations by working with cross-functional teams. Working experience on *Rest API* In-depth knowledge of Request & response flow. Experience with high performance and scalable systems Familiarity with Cloud technologies like *Amazon Web Services, OpenStack, and Azure* Expertise in performance tuning and code optimizations. Experience with high performance and scalable systems. ACADEMIC QUALIFICATION Academic: Graduate/Master - Information Technology, MBA-IT, PGDM-ITCOMPETENCIES Strong development and fundamental knowledge of React Native, Node.js, Angular, Unity. Good hands on experience of Android and iOS Application development. Should be well verse with Mobile Application Architecture. Understanding and experience of different *DB like Mongo, MYSQL* Strong debugging and profiling skills Strong knowledge of software development processes and methodologies in a software companywith short release cycles Knowledge of *No-SQL* database technologies Team player, can-do attitude and takes initiative Ability to work independently as well as in a team (in the start-up environment) Good communication skills to work with cross-functional groups Strong skills in large-scale software design and development Excellent verbal and written communication skills", "ROLE": "Technical Architect", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["Application Development", "Software Development", "Web Technologies", "MySQL", "Node.Js", "Rest Api", "React Native", "Software Design", "Angular", "Web Services"]}