{"JOB DESCRIPTION": "ASP.NET MVC,  C#,  Entity Framework,  WCF/ RESTful API,  SQL Server/ SQL/ Stored Procedures/ Design table,  Multi- tier systems/ High throughput/ Low latency,  Unit testing and TDD,  Ecommerce,  Agile/ SCRUM,  Webforms. \n\nExperience Minimum 2 years or above. \n\nEducation Engineering or Masters Degree in computer science or equivalent experience.\n\nJob Portfolio An opportunity to be part of our Core development team,  your responsibilities will include developing and scaling up one of the most innovative SAAS Based platforms in the Marketing Automation space.\n\nWe are developing a cutting edge back- end that seamlessly integrates with our JavaScript/ React front- end. The person we are looking for,  in the capacity of Sr. Software Developer should bring a fresh and innovative perspective to Back- end development. If you are a smart learner with an eagle eye on utilizing Next Gen technologies or tools,  you would be the ideal fit to be part of our team.\n\nAs a part of the development team,  you need to collaborate with the technical team members to ensure time bound delivery of the project. If you are passionate & consider yourself as one who can deliver beyond the expectations,  bring innovation and novel ideas,  you will be the best fit to be part of our young vibrant team of developers.\n\nIn love with Hard core back- end product development and want to work with the best and brightest in the industry  You are in the right company ,  Join our wagon!", "ROLE": "Software Developer", "INDUSTRY TYPE": "Advertising, PR, MR, Event Management", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Front end", "Application programming", "Javascript", "Entity framework", "WCF", "Stored procedures", "Unit testing", "Software services", "SQL"]}