{"JOB DESCRIPTION": "    Job Description     Fulfil the UI Development needs based on project needs & customer requirements.   Communicate and collaborate effectively with the Development Team, Business Analysts and Product Owners to resolve requirements gaps and conflicts.   Support and maintain the software within agreed service level targets and quality objectives   Work effectively in a dynamic Agile software development environment   Provide technical support, guidance and inspiration to other members of the team, both onshore and offshore   Promptly escalate issues which cause personal or team development to fall outside of agreed quality or timescale tolerances and to actively contribute to their resolution.   Pro-actively suggest and implement agreed process improvements that enhance the performance, productivity and morale of the team.    Actively contribute to the continuous improvement of development processes that enhance the performance and quality of personal and team deliverables.     Technical Skills     React JS/ Angular JS, Typescript, CSS, HTML 5   Understanding of object oriented programming and understanding of .net/.Net core framework or similar framework   Azure experience   DataBase: SQL/ NoSQL   Testing Framework: Unit testing frameworks - Jest, Enzyme, etc.    Personal Attributes     Ability to communicate and collaborate effectively with distributed team members   Debuggins skills.   Demonstrate an enthusiastic and pro-active approach to software development   Demonstrate the desire to produce high quality software products within agreed budget and timescale constraints   The ability to pro-actively suggest and implement process improvements that enhance the performance, productivity and morale of the team   The ability to work flexibly and imaginatively in a changing and evolving project environment.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["UI development", "Engineering services", "System architecture", "NoSQL", "Agile", "Application development", "Unit testing", "Continuous improvement", "Technical support", "Software services"]}