{"JOB DESCRIPTION": "Responsibilities •   Develop and support custom web applications built on PHP /  Django platform•  Individual should be a self starter,   work independently or as a team member,   and have strong communication skills in interfacing with various stakeholders.•  Ability and desire to work in a fast-  paced dynamic environment,   to meet deadlines and complete tasks in timely manner as assigned•  Provide key hands-  on development skills to projects.•  Follow specifications,   plans and designs in order to analyze complex and business critical software solutions.•  Utilize appropriate software engineering best practices.•  Participates in project team activities and contributes to documentation requirements consistent with methodology•  Able to work collaboratively with other developers.•  Able to work in Agile software development methodology. Essential Skills •   Track record of success in previous developer role.•  At least one year web application development experience with a MySql Server or other DB experience.•  Ability to understand database and xml schemas. •  Understanding of OOPS patterns and best practices.•  Should be proficient in developing web applications.•  Experienced across the full systems development lifecycle. Preferred Skills •  Nice to have HTML /  CSS /  Javascript skills.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Web application development", "server", "development", "css", "developing", "HTML", "database", "Web technologies", "django", "application", "web", "XML", "oops", "Javascript", "Agile", "PHP", "mysql", "Software", "developer", "Software solutions", "support", "applications"]}