{"JOB DESCRIPTION": "  Bachelor s Degree in Computer Science, Software Engineering, or Electrical Engineering.     Individual should come from a structured development environment with knowledge of SDLC Practices.     Need to have expertise in Hybrid Mobile app development using Ionic Framework, Angular, HTML, CSS, Bootstrap, Rest JSON     Hands-on experience in Node.js, Angular with MySQL and MongoDB. and with Redis/MemCache as external storage.     Proficiency with front-end development (HTML5, Bootstrap, JavaScript/JQuery).     Familiarity with one Java-script Framework i.e. React.js, Angular.js, Express.js etc.     Experience running remote apps in the cloud.     Programming proficiencies: Windows, Linux, jQuery, Angular, Node.js, MongoDB.     DevOps activity including software releases to production, monitoring, and reacting to (investigating/resolving) issues.     Strong experience developing complex, scalable enterprise software applications.     Knowledge of common architectural patterns (DI, MVC, MVVM, OOP, SOA).     Knowledge of common open standards (REST, JSON, AMQP, HTML5, CSS3     A Bachelor s degree in computer science or related degree is required.     Knowledge of the software development life-cycle.     Ability to develop unit testing of code components or complete applications.     Must be a full-stack developer and understand concepts of software engineering.     Experience working on a variety of software development projects.      Deep programming language knowledge.     Freedom to voice your opinion and influence product direction     Collective Leadership and Ownership      IITians and MBA s from Ivy league schools     Refreshments, Snacks, Quizzing, and fun unlimited   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Animation, Gaming", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "MBA/PGDM in Marketing"}, "KEY SKILL": ["jQuery", "Linux", "SOA", "MySQL", "Javascript", "HTML", "JSON", "Windows", "MVC", "SDLC"]}