{"JOB DESCRIPTION": "Roles and Responsibilities  Experience       of 10+ years in data preparation, data gateway, data migration and data       warehousing projects. Experience       of 5+ years and familiarity with Azure Data factory, Azure Data Bricks,       Azure SQL Database. Knowledge       with Azure Data components such as Azure SQL Warehouse, Azure Synapse       etc..,       Experience with building CI/CD pipelines in Data environments    Excellent  troubleshooting and debugging skills on SQL Server Stored Procedures and Functions.  Assist with       defining, implementing, and continuously improving Data Governance       processes and procedures. Facilitate       knowledge sharing within the team.       Participate in a collaborative structure to capture process       improvement ideas and communicate to other groups. Extensive       knowledge of development in Microsoft SQL Server Excellent       T-SQL coding experience with an understanding how to write highly       performing, scalable TSQL code (Stored Procedures, Functions with complex       joins)  Extensive       experience in designing, implementing and documenting Conceptual, Logical       and Physical data models Good       knowledge in Normalizing and De-normalizing the tables and maintaining       Referential Integrity by using Triggers and Primary and Foreign Keys Develop,       adhere to, and be a proponent for Data Warehouse development standards,       including ETL standards, methodologies, and best practices In       depth SQL Server Database Development experience with knowledge of       distributed architecture and design ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["T-SQL", "Azure Data Factory", "Software Development", "Data Migration", "Stored Procedures", "MS SQL Server", "SQL Database", "Data Warehousing", "ETL", "Database Development"]}