{"JOB DESCRIPTION": "Designation : Senior Software DeveloperCompany: MNCLocation : BangaloreQualification: B.E./B.Tech/M.E./M.Tech/MCAExperience:  5+ years of experience in design and development  Must Have:• Strong Knowledge of Angular, Node ( Type script)• Strong Knowledge of one of the cloud platforms (CloudFoundry/AWS/Azure).• Testing frameworks like Cypress, Jasmine, Karma, Protractor• Strong knowledge in Object Oriented programming and Design principles & patterns.• Conversant with typical software development processes / methodologies and exposure in working with multi-site global teams.• Good knowledge on Unit Testing, TDD etc.  Job Profile • Responsible for design and implement software based on defined architecture.• Capable of developing cloud and edge computing based solutions for industrial automation domain.• Preferable to have a fair knowledge of industrial automation domain and also Industrial Internet of Things (IIOTs). Knowledge of various network of interconnected devices that are connected via wired and wireless mesh networks.• Ability to quickly understand and learn new and emerging technologies.• Able to conceive ideas and prepare quick pre-development prototypes for internal review and to assess the technical feasibility of the use cases.• Team player having exposure to working with global cross culture teams and should good have presentation skills. Strong Analytical and Problem Solving Skills. Desired Candidate Profile • Domain: Industrial Automation, HMI & SCADA productsTraits Must Have• Analytical and Good Problem Solving Skills• Conceptual & Self-directed• Communicative & Socially confident• Influencing• Ambitious to learn and integrate new technologies If you are interested, send your updated resume mentioning the following details to kshireesha@Lobostaffing.comTotal Experience;Present CTC:Expected CTC:Notice Period;", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Com in Any Specialization, B.Tech/B.E. in Any Specialization, BCA in Any Specialization, B.Sc in Any Specialization"}, "KEY SKILL": ["development", "Cloud Foundry", "hmi", "Node", "scada", "anjular6", "Jasmine", "Cypress", "Object oriented", "full stack", "Protractor", "anjular", "AWS", "Karma", "azure"]}