{"JOB DESCRIPTION": "  ICL Systems     Software Developer    Gurgaon, IND 110015    ICL Systems is the leading provider of systems solutions designed for the demands and challenges of the finished vehicle supply chain.   Only ICL Systems offers seamless integration and total visibility in all segments of the finished vehicle pre - delivery and transportation process.   ICL Systems has approximately 50% market share in the United States in this niche industry.     ICL is growing our team in India and we offer:           Great company culture, collaborative team, and casual work environment.           Incredible benefit package, paid vacation, paid holidays, paid personal/sick days.           Stocked kitchen with food and beverages.           Weekly company provided lunch.     Job Requirements           Ability to create support documentation for all new applications            Proven knowledge of the most current web development programming languages        3 - 5+    years Java development required           Experience developing web applications using Java EE as the core framework required           Strong experience with Spring, Hibernate/JPA required           Strong knowledge of web UI technologies including HTML, CSS and JavaScript required           Experience with Java Server Faces (JSF) required           Experience using PrimeFaces JSF component libraries desired           Experience in developing and consuming web services using REST protocol a plus           Jasper Reports a plus           Experience with Single Sign On (SSO) a plus           A solid understanding of how web applications work including security, session management, and best development practices            Adequate knowledge of relational database systems, Object Oriented Programming and web application development           Aggressive problem diagnosis and creative problem solving skills           Strong organizational skills to juggle multiple tasks within the constraints of   timelines and budgets with business acumen           Ability to work and thrive in a fast - paced environment, learn rapidly and master diverse web technologies and techniques.           7+ years work experience in application development           Bachelor s degree in a technical field, such as Computer Science, Computer Engineering, Computer Science & Informatics, Information Management, Software Engineering, Information Technology, Engineering or Information Systems         Key Responsibilities            The role is responsible for designing, coding and modifying webpages, from layout to function and according to a client's specifications.            Create applications that address the phases of SDLC (software development life cycle)            Assist in updating application development policies to ensure that all future applications meet the latest technical requirements           Write well designed, testable, efficient code by using best software development practices           Create webpage layout/user interface by using standard HTML/CSS practices           Integrate data from various back - end services and databases           Stay plugged into emerging technologies/industry trends and apply them into operations and activities           Cooperate with web designers to match visual design intent           Perform code reviews.           Develop POC to support new concepts    Equal Opportunity Employer, including disabled and veterans. ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["Supply chain", "Hibernate", "Coding", "Web development", "Javascript", "HTML", "Application development", "JSF", "Information technology", "SDLC"]}