{"JOB DESCRIPTION": "Software Developer /  Sr. Software Developer We are looking for a software developer who can be a part of ourdevelopment team and give his/  her contribution in our softwaredevelopment using latest technologies (MVC5,  AngularJS,  JQuery, MSSQL- 2016,  MongoDB,  and Asp.Net Core). You will work on pure frontend as well as backend development in other words you will be a fullstack developer. \n\nIn this role,  you should be able to write functional code with a sharpeye for spotting defects. You should be a good team player andexcellent communicator. Your goal is to work with a 40+ member teamto design,  develop and prove yourself as a good team player \n\nSkillsRequired: MVC5, C#.Net,  HTML,  CSS,  MSSQL SERVER 2012,  Jquery,  LINQ/  Entity Framework Responsibilities: Front end and backend development throughout software development life cycle (SDLC). Write secure,  robust,  maintainable and reusable code under the guidance of senior person. Test and deploy applications and systems. Revise,  update,  refactor and debug code. Work as a vital part of your team and be an important person of the organization. Requirements Proven experience as a .NET MVC Developer. Familiarity with the MSSQL SERVER 2012,  LINQ/  Enity Framework,  JQuery,  (Knowledge of AngularJS and MongoDB is plus point) and HTML5/ CSS3 \n\nKnowledge of Design Pattern,  SDLC and Solid Principle. Excellent troubleshooting and logical thinking. Learn as much as you can because we are working on latest technologies e.g. MVC5,  SQL SERVER 2016,  AngularJS,  MongoDB,  Design Pattern,  and Solid Principle. \n\nGet a chance to work on corporate level projects with pure development no maintenance work. Working with a team of 40+ persons having 14+ years of experience. Supportive team person always ready to help to improve your skills Healthy work environment,  no slogging and your talent will be rewarded time to time in form of appraisal + appreciation. 24 paid leaves in a calendar year and 2 Lac health insurance (spouse and children also covered)", "ROLE": "Software Developer", "INDUSTRY TYPE": "Aviation, Aerospace, Aeronautical", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["Technical product configuration", "c++", "C", "design", "MySQL", "JavaScript", "integration PHP", "HTML"]}