{"JOB DESCRIPTION": "Cultuzz Digital Media GmbH was founded in Berlin in the year 2000. The company is specialized in online sales anddistribution for the hospitality industry. We provide channel management services and are the global market leader in selling hotel vouchers on eBay. Our clients are mainly international hotel chains and private managed hotelsHeadquartered in Berlin, Germany, we are selling our products globally. Our software products and systems are completely developed in -house by strong teams located in Visakhapatnam, India. Further we do testing, quality assurance and all services in VizagFor our office in Visakhapatnam, we are currently looking for aSoftware DeveloperThe Challenge Your ProfileWhat we OfferIf you are interested in this position, please send your significant application, if possibleas pdf -file, to job2015w@cultuzz.com•\t Analyze business requirements to design, develop and implement highly efficient, highly scalable system solutions that meets defined standards•\t Producing detailed specifications and writing the program codes•\t Adaptability to learn different technologies•\t Ability to upgrade technical skills based on requirement•\t Testing the product in controlled, real situations before going live•\t Maintaining the systems once they are up and running•\t Ensure the consistency of the overall User Interface•\t On the whole making the business efficient and helping to provide a better IT service•\t An excellent work atmosphere with 5 day work week•\t Competitive pay•\t A young, dynamic and friendly team•\t Flat hierarchies and open communication•\t Empowerment and delegation of responsibility•\t Strong experience in designing and developing complex applications using Java /PHP technologies.•\t Strong on OOPS and must have worked in depth with PHP /J2EE, Design patterns, Multithreading, Web Services, Spring, Hibernate•\t Should have strong knowledge on HTML 5, CSS3, Java Script, Ajax•\t Experience on App servers like Tomcat, JBoss, Web Logic etc•\t Should have 2 to 4 years of experience in PHP /J2ee technologies•\t Good oral and written communication skills•\t Demonstrate exceptional problem solving skills and analytical abilities•\t Experience in e -commerce, travel and hospitality industry is a plus•\t Holder of a Masters degree, BE or B.Techcultuzz.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Sc in Computers, BCA in Computers, B.Tech/B.E. in Computers", "PG": "MCA in Computers, M.Tech in Computers"}, "KEY SKILL": ["Hibernate", "Tomcat", "technical", "analytical", "JBoss", "testing", "Service", "developing", "J2Ee", "it", "quality", "Multithreading", "Manager Quality Assurance", "java", "pdf", "web", "design", "oops", "PHP", "Software", "html", "Ajax", "applications"]}