{"JOB DESCRIPTION": "Responsibilities:  Requirement Analysis, Design, Development and Enhancement of IP and Security Protocols, Services and associated subsystems in a feature rich networking device/VNF.  Should be able to innovate and work passionately in developing high quality software / solutions. Should work closely with all of R&D and Product Management to jointly deliver high quality products and solutions Evaluation of different architectural and implementation approaches.   Required Expertise/Skills:  Prior experience in requirement analysis, design and implementation of IPv4 and IPv6 Services like AAA, RADIUS, TACACS, Syslog, Telnet, SSH, FTP, DHCP, DNS, NTP/SNTP and other networking device infrastructure control plane IP based modules.  Should have experience in the design and development of applications for multi-core architectures. Prior experience in design and implementation of complex and scalable TCP/IP based applications  Strong skills in design and development of a scalable complex networking product and experience in both RTOS/VxWorks and FreeBSD/Linux or similar platforms  Strong expertise in C programming, Data Structures, TCP/IP stack, Socket programming, Multi-threading, IPC and debugging. Should have experience in using tools (static analyzer, code review, unit testing) for robust software development. Prior experience in commercial and /or open source networking stacks or in virtual environments building VCPE or VNFs is a strong plus.   Experience and Educational Qualifications:  A BE/B.Tech/ ME /M.Tech or equivalent in (Computer Science/ECE/EEE/Information Science) from prestigious institutes/universities with at least 5  10  years of relevant experience.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Telecom Software", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization, Any Graduate in Any Specialization", "PG": "MCA in Computers, M.Tech in Any Specialization"}, "KEY SKILL": ["c", "Layer 3", "dhcp", "tcp", "aaa", "UDP", "Radius", "software development", "dns", "tacacs", "linux", "data structures", "multithreading", "Socket Programming", "Layer 2", "ipc", "Protocol Development", "tcp / ip"]}