{"JOB DESCRIPTION": "Roles and ResponsibilitiesPosition Title: Software Developer II (C#,.Net, WPF, SQL)The Location: Hyderabad The Team: Do you love to collaborate & provide solutions? This team comes together across eight different locations every single day to craft enterprise grade applications that serve a large customer base with growing demand and usage. You will use a wide range of technologies and cultivate a collaborative environment with other internal teams.The Role: As a Software Developer with the Content Systems Development team, you will be responsible for developing & providing backend support across a variety of products within the Market Intelligence platform. Together, you will build scalable and robust solutions using AGILE development methodologies with a focus on high availability to end users.The Impact:We focus primarily developing, enhancing and delivering required pieces of information & functionality to internal & external clients in all client-facing applications. You will have a highly visible role where even small changes have very wide impact.What’s in it for you?Opportunities for innovation and learning new state of the art technologiesTo work in pure agile & scrum methodologyResponsibilities:Ability to understand complex architecture & designDeliver solutions within a multi-functional Agile teamDevelop expertise in our proprietary enterprise software productsSet and maintain a level of excitement in using various technologies to develop, support, and iteratively deploy real enterprise level softwareAchieve an understanding of customer environments and their use of the productsAdhere & apply software engineering practices and implement automation across all elements of solution deliveryTechnical Leads will be expected to build solutions, architecture, algorithms, and designs which scale to the customers enterprise/global requirementsWhat we’re looking for:Basic Qualifications:Bachelors degree in Computer Science or EquivalentProven experience of application development experience with deep understanding of Design Patterns & Object-oriented programming.Strong problem solving, analytical and communication skills.Ability to analyze and resolve performance issues through various techniques including testing, debugging and profiling.Strong OOAD & Service Oriented Architecture (SOA) knowledge.Hands on development experience using C#, .Net 4.0/4.5, WPF, Asp.Net, SQL server.Strong understanding of Cloud enabled applications (Containers, Dockers etc.)Exposure to Data Engineering & Big Data technologies like Hadoop, Spark/Scala, Nifi & ETL.Familiarity with enabling DevOps on enterprise application suite, will be a plus.Possess a true “roll up the sleeves and get it done” working approach; demonstrated success as a problem solver, operating as a client-focused self-starter.", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers, BCA in Computers, B.Sc in Computers", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["C#", "Software Development", "Design Patterns", "OOAD", "C#.Net", "ASP.Net", ".Net", "SQL Server", "WPF", "Agile Development"]}