{"JOB DESCRIPTION": "Mid- Level Software Developer Techathalon Mid- Level Software Developer Keyskills PHP 5,  PHP,  LAMP,  Drupal,  WordPress,  jQuery,  MySQL,  JavaScript,  Web applications,  Advanced JavaScript,  Object Oriented,  Joomla. Requirements: 2 to 5 years of experience developing highly scalable Object Oriented platforms At least 2 years of PHP 5+ experience. Experience on web service integration (SOAP,  REST,  JSON,  XML). Experience working in a high performance LAMP environment Expert in JavaScript; experience with the jQuery toolkit GIT,  Subversion version (SVN) control software Ability to create and style standards- compliant XHTML and CSS Thorough understanding of all phases of software development and meticulous about coding practices,  unit testing and clean documentation. Should be a self starter and work effectively with very little assistance Must have excellent communication skills. Demonstrated success working in a rapidly changing,  collaborative,  and iterative product development environment. Characteristics of Success in the Role: A focus on effective execution Strategic thinking both technically and business- wise Self motivated /  self starter Personal drive to achieve world class software development Desire to work in a fast- paced,  evolving,  growing,  dynamic environment Love of technical challenges and a sense of pride in solving them Ability to work well in a cross functional environment Responsibilities Understanding the project requirements and accurately estimating the efforts Coding on all tiers of the application Solutions development considering the Big picture Strictly follow coding guidelines and programming best practices and processes Interaction with the clients Performing Unit testing,  peer code review,  technical documentation Collaborating with the global project team.", "ROLE": "Software Developer", "INDUSTRY TYPE": "Media, Entertainment, Internet", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["assembly language", "Six Sigma", "PMP", "C", "JavaScript", "Real Time Operating Systems", ".NET", "HTML", "Oracle", "Python", "SQL"]}