{"JOB DESCRIPTION": "Positions open:Compiler Developer(Software Developer)/Interpreter Expert - Please read the details below for more information on this.Software Test EngineerJob Description : Compiler Developer(Software Developer) : Compiler Developer should have a good understanding of The architecture of Evaluator.Evaluator performance optimization.Garbage Collector(without freeze).Parser (Flex/Bison) - a good understanding of the parsing/syntax tree.Performance Optimization.Language Service - completion, goto, rename, etc.Internal Implementation of Python(optional).Experience in the same field would be acknowledged.Software Engineer:In-depth knowledge in Data Structure and OOPs conceptsUnderstand the requirement and programming according to the request made.Experience with Visual Studio C++ and QT creator.Software Test Engineer : Tester should have a good understanding of Unit test with MVC pattern.Experience in an Integration test.Experience in using Squish Tool for testing QT applications would be acknowledged.Project Information:Developing an IDE similar to Visual Studio Developing a python-like language for the same.  Key Areas of Responsibility: Develop a software product according to the software design description. Responsible for analyzing and understanding the project requirements. Suggest an improvement in software design.Testing the software using Tool and coding a bit, for the Test Engineer. Role Competency: Experience in software development for a minimum of 1 year of experience with a leading IT/Software company. In-depth knowledge of C++ (Visual C++ with QT Creator). Excellent object-oriented development skills. Excellent Data Structure knowledge. Personal Characteristics: Excellent communication and documentation skills. Ability to stay focused on the target in an ambiguous situation. Interested in projects and passionate to collaborate with the organization. Proactive and self-driven possess a due sense of urgency. Shall be very good technically; possess knowledge of software development and good problem-solving abilities. Location: Remote work/Freelancer: You need not come to the office, but you should respond to our requests during the working hours. Working hours: 9am to 6pmImportant Notes:We will contact you via Naukri message/email, please check it frequently.You are also free to email me with your desired Role and CV attached along with it to the email id: ankita.taunk@strato-it.co.krPerks and Benefits Salary is negotiable.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "MS/M.Sc(Science) in Computers", "DOCTORATE": "Ph.D in Any Specialization"}, "KEY SKILL": ["Software Development", "C++", "Problem Solving", "Communication"]}