{"JOB DESCRIPTION": "Key Skills:c# , Html , Javascript , Postgresql , Mvc ,  Asp.net  experience: 1 - 6 Years  role: Software Developer/ Programmer  specialization: Application Programming  job Function: It Software : Software Products & Services  industry: It-software  qualification:post Graduation > Not Required    looking for 1 to 4 Years Experienced Developer with Skills of Dot Net Core (c#), Mvc, Javascript, Postgresql and Ability to Plan, Design, Code, Test, Deploy and Manage Various Web Applications.   the Ideal Candidate Will Be Familiar with the Full Software Design Life Cycle. They Should have Experience in Designing, Coding, Testing and Consistently Managing Applications They Should Be Comfortable Coding in a Asp.net Core (c#), Mvc, Javascript, Postgresql and have An Ability to Test Code in Order to Maintain High-quality Coding Standards.   responsibilities:   plan, Design, Code, Test, Deploy and Manage Various Applications  collaborate with Engineering Team and Product Team to Establish Best Products  follow Outlined Standards of Quality Related to Code and Systems  develop Automated Tests and Conduct Performance Tuning  qualifications:   bachelor\\'s Degree (b.tech in Engineering) and Master s Degree in Computer Science or Bca / Mca or Similar  1 Years of Experience Working with .net or Relevant Experiences  experience Developing Web-based Applications in C#, Html, Javascript,   experience Working with Postgresql  experience Working in Agile Development Environment  experience: 1 to 5 Years  gender: Male / Female (any)  no of Positions: 5   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Performance tuning", "HTML;Javascript", "Software design", "Coding", "Postgresql", "Application programming", "Agile development", "ASP.Net", "MVC"]}