{"JOB DESCRIPTION": "We are seeking a passionate and talented Sr Software developer to join our team. We want someone who strives to solve difficult problems with creative solutions. In addition to Software Design and Development experience, you must have knowledge of the entire Software Development life-cycle, Unit Testing, Functional Testing. We are looking for candidate with following skill set.Qualifications:BE/ B.Tech./ M.Tech./ MCA with 2-4 years of Industry experience with web development and Infrastructure.Requirements:Excellent skills in designing and developing Web Applications and related technologies.2+ years PHP/ Python/ Ruby web application development2+ years of experience developing with MVC framework such as CakePHP, Zend, Symfony (Zend is most preferred)1+ years developing on Linux or UNIXDeep understanding and solid experience in Web Application development including PHP, HTML, CSS, Javascript, XML, JSONExperience with AJAX development preferredSkilled in Object Oriented programming with supporting work experience.Experienced using Design Patterns preferred.Skilled programmer in at least one of Php, Python, Java, C++, Ruby.Knowledgeable and experienced developing secure web applicationsMysql or other relational database design and development required.Excellent written and oral communication, interpersonal, and organizational skills.Rigorous attention to detail and keen problem-solving skills.Able to work with multiple projects simultaneously, with competing and conflicting deadlines.Impeccable level of discretion and professionalism in dealing with confidential information.Remuneration commensurate with qualifications, experience, competence and proficiency. Additional performance bonus/ incentive offered for deserving candidates.", "ROLE": "Training Manager", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "HR, Recruitment, Administration, IR", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "HR/ Recruitment / I", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "MCA in Computers"}, "KEY SKILL": ["Unix", "C++", "Linux", "SR. SOFTWARE DEVELOPER ", "XML", "MySQL", "Javascript", "PHP", "HTML", "PythonSR. SOFTWARE DEVELOPER", "Ajax"]}