{"JOB DESCRIPTION": "Roles and Responsibilities Job Description:Greetings!We are hiring for  Senior Software Developer  Working: 6 daysQualification: BE, M-Tech, MCA, MSC (IT)Location -Belapur, Navi Mumbai POSITION SUMMARYThis role is responsible for the quality software development and deployment. Involved in performing test cases and writing code, analyzing data and contributing to the design and implementation of Software. Developer should have extensive experience in software development, be able to keep up-to-date with deadlines, and have strong analytical skills and report observations to the design team. You may also interact with clients in order to understand the requirements of the product. KEY RESPONSIBILITIESReviewing of software      requirements from clients Designing/ Modifications of      screens Campaign design and Screen      designsResolution on Bug fix, VAPT,      audit observations and all others issues flagged by customerPreparing      reports on all aspects related to the software testing carried out and      reporting to the application owner team. Interacting      with clients to understand product environment Participating      in design reviews and providing input on requirements, product design and      potential problems. User      account maintenance and security reviews. Working with Operational Team      and Application data owner's regularly reviewing roles and adjusting      permissions and privileges with regard to changes.Documentation      of changes to be maintained and all changes need a change approval with      the change committee, Application server configuration, and connected      third party application configurations.Carry out stress testing, PET      performance testing, functional testing and scalability testing. Write and      Execute test scripts (automated). Test in different environment,      SIT UAT Production which includes web and mobile appWork towards departmental and      Project deadlines. Implement and administer      security best practices while testing solutions, configuring/running      scripts and fulfilling audit requests.Create, maintain and update      strong technical documentation and procedures following the IS department      standardsPartner with Business Process,      Infrastructure, and Application Development teams to use technology to      solve business problemsManage      and work around issues or roadblocks in any phases of the projectsResponsible for 365x24x7      Production Support Education:BE, M-Tech, MCA, Master in Computer      ScienceJAVA CertificateExperience5+      years of experience on the programming field which includes Oracle JDK,      HTML5(VueJS + Bootsrap + jQuery), Spring , MyBatis, Java, Android Developer C++Working knowledge of Linux and      Windows operating systemsWorking knowledge of HTML5, Working knowledge of DBMSKnowledge on MiddleWare (jBoss      , WebLogic, WebSphere)  OtherStrong communication and      organizational skillsAbility to build relationships      within the companyExcellent problem solving and      conceptual thinking skillsSelf-motivated and      self-initiatedThoroughnessStrong interpersonal skills and      teamwork focusedAdaptable and customer service      orientedDemonstrated competency in      accurately identifying the scope of work and preparing thorough, accurate      and detailed schedule estimatesPerks and Benefits ", "ROLE": "Other", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "Other", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Othe", "EDUCATION": {"UG": "B.Sc in Any Specialization, BCA in Any Specialization, B.Tech/B.E. in Any Specialization", "PG": "MCA in Any Specialization, M.Tech in Any Specialization"}, "KEY SKILL": ["Java", "Software Engineering", "software developer"]}