{"JOB DESCRIPTION": "One of the leading IT Company is hiring for Angular Developer for Mumbai/Kolkata location.Company : Learningmate Solutions.Overview: LearningMate is a reputed IT company (Product + Service) and has been at the forefront of the e-learning movement in the world of education. Solutions built by us have been implemented for some of the largest publishers and academic institutions in the world and millions of learners worldwide have in some way interacted with the content and technology solutions we have put together for our clients who serve these students. Today it is amongst the largest teams focused completely on creating technology based education solutions in e-learning in the world. We have presence in Mumbai, Kolkata, US, UK, and Canada.Roles and Responsibilities:Team WorkAngular DevelopmentTroubleshootingKnowledge Sharing Ensure Delivery within Time maintaining QualityCoding following best practices & guidelines, DocumentationTo ensure compliance with Learningmate information security policies. Dedication & Hard workDesired Candidate Profile Key Accountable: Code qualityQuick turn-around time in development & troubleshootingAdherence to coding guidelines and best practices.Knowledge/Qualifications/ Competency: Any Graduate - Any Specialization with 1+yr of Angular 4+ development, 2+ yrs of relevant strong object-oriented JavaScript & MVC experience, 2 years experience in responsive single page web app for desktop, tablets & smart phones with analytical/logical thinking & problem solving skillsWould be considered a plus:Bootstrap, Raphael, Backbone, Underscore, WebGL, Three.js, JSXGraph, MathJax, Game Development, Accessibility, SCORM, LTI, Cordova, D3, Jasmine, Karma, Sonar, ES6, Typescript, NodePerks and Benefits State of the art 7 star eco-friendly facility + Best Salary + Onsite opportunity + PF + medical allowance + Good work environment + various employee engagement programs + employee friendly HR policy + birthday celebrations + annual party + team building activities + trainings + best managers & leaders in the industry + ample opportunities to learn & grow", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["CSS", "GIT", "Software Engineering", "Angular7", "Angular8", "Eclipse", "Bootstrap"]}