{"JOB DESCRIPTION": "    Primarily responsible for the development and delivery of parts of software component(s) in projects based on the software design.   Responsible for Design of software solutions based on requirements and within the constraints of architectural /design guidelines.   Derive software requirements and software functional specification, validate software requirements, provide software feasibility analysis and software effort estimation.   Identify potential harmony and for re-use of components / technology.   Accurate translation of software architecture into design and code.   Guide Scrum team members on all design topics implementation consistency against the design/architecture   Involved in coding of features and/or bug-fixing and delivering solutions adhering to coding and quality guidelines, for self-owned components   Guide the team in test automation design and towards implementation of the same   Implementation of features and/or bug-fixing and delivering solutions in accordance with coding guidelines and on-time with high quality.   You will be responsible for Performing code review and creation / support for relevant documentation (requirement/design/test specification), ensuring integration and submission of solution into software configuration management system, within committed delivery timelines.   Performing regular technical coordination / review with stake holders and ensuring timely reporting and escalations if any.      What You Need To Make Real What Matters!      We need a B.E. / B. Tech / MCA/ M. Tech (Computer Science/Electronics Communication/Electrical) graduate with 3 to 5 years of experience in design and development   Experience in Full stack web development using Typescript, Angular4 , HTML5 and CSS3, Spring boot, Spring Cloud, Java and AWS   Exposure to CI/CD tools, Code Analysis, and Test automation is preferred   Deep understanding and hands on experience on handling NFRs   Sound knowledge of software engineering process.   You must have experience in working in AGILE team.   Hands on experience of OOAD and Design Patterns   Ability to work as an individual contributor.   You must have Customer focus and collaboration skills   Good analytical, debugging and tracing skills. Should be well-versed with clean code principles (SOLID, DRY, KISS). Exposure to secure coding is beneficial.    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization, B.Tech/B.E. in Production/Industrial", "PG": "MCA in Computers"}, "KEY SKILL": ["Computer science", "Software design", "Coding", "OOAD", "Software configuration management", "Web development", "Debugging", "Agile", "Scrum", "CSS3"]}