{"JOB DESCRIPTION": "Greetings!   We are hiring for Fullstack Software Developer for our inhouse IT Team.Location-Navi MumbaiDesired Candidate Skills:Should have worked front end and back end (UI & UX) written codes and testedC#, .net, mvc, angular, SQL-Angular mvc, database connectivity Should have worked in multiple applications     Job Description:   Responsibilities:  Full-stack developer at core, knowing at least two of the leading technologies such as IOT, Analytics and AI/ML. Proficient in WebApp and Mobile App, at least one RDBMS such as MS SQL or MySQL and at least one NO SQL DB such as Mongo DB Work with interesting cutting edge technologies such as React Native, Angular JS, Node JS, .Net Core, Python, JS, R, etc. Self-motivated, eager to learn new things and technologies such as Video Analytics Analyze technical requirements and translate them into working steps. Write efficient code that works! Continuous improvement orientation Familiarity with agile development methodology will be a definite plus Knowledge of ER diagram, Process diagrams, flowcharts, UML, Design patterns etc. Design and architecture understanding experience will be good to have Ability to work in team Experience & Background:  A Bachelors or equivalent degree in B.E Computer / B.E. IT / MCA, BSc IT Min experience of 5 years + hands-on coding with various technologies Effective communication skills Excellent conceptual understanding of how software works including APIs, various architectures, security aspects, etc. Overall urge to learn new technologies and keep yourself updated  Personal Attributed:  Creativity and attention to detail Strong interest in industry trends, technology innovation, and best practices Positive attitude and team player Diligent, Sincere, Honest with high integrity Strong team player - ability to work with a variety of Stakeholders  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization, Post Graduation Not Required", "DOCTORATE": "Any Doctorate in Any Specialization, Doctorate Not Required"}, "KEY SKILL": ["Angularjs", "Software Development", "Full Stack Developer", "UX", "UI", "OOPS", "ASP.NET Developer", "Python Developer", "Javascript", "HTML5 Developer", "Mvc Developer", "Node.Js"]}