{"JOB DESCRIPTION": " Experience 2+ years (Software Developer) and 5+ years (Senior Software Developer)   Reporting to Project Manager, the job holder will be responsible for the development of innovative market leading products and solutions as well as supporting existing applications vital to our on-going business.   Candidate should possess the ability to craft quality code. He/She should be able to present examples of previous development work on request.    Software Development Responsibilities    Gather business requirements   Participate actively in effort estimation   Write well designed, efficient, and readable code following coding standards   Perform in depth unit testing   Comply with delivery plans   Release and deploy the application in different environments   Support and maintain existing applications adhering to SLAs   Produce required documentation   Serve as a subject matter expert   Follow agile practices.    Organisational Responsibilities    Seek and participate in development opportunities above and beyond required training   Actively participate in the skill development of your colleagues (workshops, presentations)   Suggest areas for improvement in internal processes along with possible solutions   Actively contribute to corporate knowledge base    Desired Skills    HTML, CSS, JavaScript, jQuery, JSON   .Net Framework, C#, ASP.Net MVC, Entity Framework, Web APIs, Bootstrap   SQL   Version control system (Git/TFS/SVN etc.)   Object orientated analysis, design, and programming.    Optional Skills    .Net Core up to version 2.2   Azure DevOps, VSTS, Azure services   XML   Win Forms, Linq, Lambda   T-SQL   Design patterns   AWS   Jira    Professional Qualities    A Team player with positive attitude   Excellent interpersonal and communication skills   Able to grasp and comprehend ideas   Open-minded, adapt quickly to new environments and a quick learner   Getting things done independently and willing to go into high-value areas even though may not have enough knowledge   Ability to adapt quickly to existing, complex environments   Ability to quickly learn new concepts and software as necessary   Challenges others to develop while serving as a role model   Facilitates effective team interactio ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["jQuery", "LINQ", "Coding", "XML", "Javascript", "Agile", "HTML", "JSON", "Subject Matter Expert", "Unit testing"]}