{"JOB DESCRIPTION": "•  Development of online softwares,  e- Commerce portals,  intranet- extranet,  mobi- sites,  responsive sites and mobile app development\n•  Work closely with Management,  Customers,  QA,  Design,  and Product Management to maintain and enhance existing product as well as to develop new products.\n•  Create specifications,  technical design documentation,  and approach for product development.\n•  Develop and execute unit testing strategy and processes.\n•  Integration of CMS and open- source tools\n•  Software implementation\n•  Desired cadidate\n\nCandidate must be experienced or proficient in the following: \n\n•  Web Services related technologies in the area of Linux,  Apache,  Mysql,  Php.\n•  Joomla,  Wordpress,  Opencart CMS technologies\n•  AJAX,  JQuery,  Java Script,  CSS 3.0 and html 5 \n•  Experience in development of distributed /  scalable systems and high- volume transaction applications\n•  Integration with web APIs such as Payment Gateway,  Email- SMTP- POP,  Facebook,  Twitter etc\n•  Database technologies,  normalization,  stored procedures and views \n•  OOPs concept\n•  Any MVC framework \n•  Mobile App Development  (Phone- gap,  Appcelerator Titanium) \n•  Note:  The job requirement is specifically for Linux,  Apache,  Mysql,  PHP.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["assembly language", "css", "C", "technical", "software", "cms", "HTML", "ajax", "jquery", "database", "java", "web", "xml", "linux", "design", "oops", ".NET", "html", "mvc", "Oracle", "Python", "Senior Software Developer", "website", "testing", "mobile", "javascript", "SQL", "xhtml", "Six Sigma", "PMP"]}