{"JOB DESCRIPTION": "Experience Level desired: 3-6 YearsCompensation: Salary commensurate w/ experience.Reports to: Tech/Team LeadThe Software Developer should be able to handle the entire Software Development Life Cycle, end to end. He/ She should be able to self-manage the projects. Designing, coding and testing should all be a part of his/her daily work. He/ She should be able to understand and use design patterns. This person can anticipate the performance bottlenecks, but knows not to pre-optimize.Minimum 3 years of working experience in .NET based applicationMust have at least 1 year of hands-on experience of working on NET Core 2.0 or higher, Web API & C#Good understanding of modern front-end web development techniques including HTML5, CSS3, JavaScript, knockout, angular, React JS, and JQuery librariesDebugging and troubleshooting of websites and web applicationsExperience of working in Agile Development Methodologies like SCRUMGood to have knowledge of Azure and DevOps process and worked with 'Source control' (SVN/TFS/GIT/VSTS)Willingness to learn and improveShould possess strong problem-solving skillsGood Communication skillsShould be able to multitask and assist others by maintaining strong communication with colleagues and clientsSKILLSAbility to complete all phases of software development life cycle including analysis, design,functionality, testing and supportAbility to develop large scale web/database applicationsAbility to work on multiple projects with multiple deadlinesAbility to communicate clearly with business users and project managerAbility to innovate and provide functional applications with intuitive interfacesAbility to construct user guides and documentationE-commerce integration skillsExcellent knowledge of SQLQUALIFICATIONSProven experience with Microsoft .NET technologies including, .NET Core, ASP.NET (Framework 4.5 minimum) and MVCTechnical Skill Set- ASP.NET MVC, C#, SQL/T-SQL, JavaScript, HTML, Experience in backend software design in SQL Server, Stored proceduresSome experience with front end UI design preferred3 - 6 years of actual experience in the workplaceCollege or University degree preferred", "ROLE": "Software Developer", "INDUSTRY TYPE": "Architecture, Interior Design", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers"}, "KEY SKILL": [".Net Core", "Software Development", "jQuery", "C#.Net", "Javascript", ".Net", "ASP.Net", "MVC", "SQL"]}