{"JOB DESCRIPTION": "  Required Skills:       Demonstrated experience creating one or more production-quality Android apps using Android Studio: Send us your Google Play links if you have em!        Strong fluency of the Java programming language, Kotlin, the Android SDK (versions 5.0 and up), Dalvik VM, ART, memory management, strong command of object oriented principles, data structure optimizations, security, IPC, App Modularization, third party service integration (e.g. Google Play Services, Retrofit, Room, etc ) and the Android Studio.        Experience as a member of a development team that uses Agile development techniques.        Thorough understanding of REST-ful API design: You can design and document a client-server protocol, and you can implement the client side of a documented protocol.       Required Experience:       Bachelor's Degree in Computer Science or a related field        5+ years related experience in Android development        Strong coding abilities and experience with Java and Android SDK (version 5.0 and up)        Strong coding abilities and experience with Kotlin        Strong experience with Object Oriented (OO) software design        Experience understanding large and complex code bases        Memory Management (as it relates to Android devices)        Multi-Threading        Performance Monitoring Debugging        Jetpack        Architecture Components        Caching Mechanisms        Integration with Google Play Services        Strong knowledge of Android SDK, different versions of Android, and how to deal with different screen sizes        Familiarity with continuous integration        Proficient understanding of code versioning tools, such as Git        Strong knowledge of Android UI design principles, patterns, and best practices        Android Testing Frameworks ( Espresso, Robolectric, JUnit )        Strong computer science fundamentals including object oriented programming, unit testing, data structures, and multi threaded development.        A crafty problem solver in a fast paced environment who works to find win-win solutions. You knock down barriers.        Knowledge of best practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and deployment.        Demonstrated history of living the values important to Priceline: Customer, Innovation, Team, Accountability and Trust. Unquestionable integrity and ethics.    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Other", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Software design", "Mobile technology", "Coding", "Debugging", "Data structures", "JSON", "Unit testing", "Analytics", "Testing"]}