{"JOB DESCRIPTION": "Roles and ResponsibilitiesS&P Global Market IntelligencePosition Title: Senior Software DeveloperGrade: 10AThe Location: HyderabadThe Team:Do you love to collaborate & provide solutions? This team comes together across eight different locations every single day to craft enterprise grade applications that serve a large customer base with growing demand and usage. You will use a wide range of technologies and cultivate a collaborative environment with other internal teams.The Impact:We focus primarily developing, enhancing and delivering required pieces of information & functionality to internal & external clients in all client-facing applications. You will have a highly visible role where even small changes have very wide impact.What’s in it for you?Opportunities for innovation and learning new state of the art technologiesTo work in pure agile & scrum methodologyResponsibilities:Design, and implement software-related projects.Perform analyses and articulate solutions.Design underlying engineering for use in multiple product offerings supporting a large volume of end-users.Develop project plans with task breakdowns and estimates.Manage and improve existing solutions.Solve a variety of complex problems and figure out possible solutions, weighing the costs and benefits.What we’re Looking For:Basic Qualifications:Bachelors degree in Computer Science or Equivalent6+ years’ related experiencePassionate, smart, and articulate developerStrong C#, WPF and SQL skillsExperience implementing: Web Services (with WCF, RESTful JSON, SOAP, TCP), Windows Services, and Unit TestsDependency InjectionAble to demonstrate strong OOP skillsAble to work well individually and with a teamStrong problem-solving skillsGood work ethic, self-starter, and results-orientedInterest and experience in Environmental and Sustainability content is a plusAgile/Scrum experience a plusExposure to Data Engineering & Big Data technologies like Hadoop, Spark/Scala, Nifi & ETL is a plusPreferred Qualifications:Experience on Docker is a plusExperience working in cloud computing environments such as AWS, Azure or GCPExperience with large scale messaging systems such as Kafka or RabbitMQ or commercial systems.", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Sc in Computers, BCA in Computers, B.Tech/B.E. in Computers", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["C#", "Software Development", "Azure", "Windows Services", "Hadoop", "WCF", "Spark", "WPF", "Web Services", "SQL"]}