{"JOB DESCRIPTION": "Nablasol is looking for a JavaScript developer to work on progressive web applications using ReactJS/ AngularJS and NodeJS. The responsibilities will include full lifecycle development of web applications for global clients. Experience Level 1 4 Years Software Developer (JavaScript) | Nablasol Twitter Widget Iframe Job Description Nablasol is looking for a JavaScript developer to work on progressive web applications using ReactJS/ AngularJS and NodeJS. The responsibilities will include full lifecycle development of web applications for global clients.\n\nResponsibilities: \n\nAnalyze requirements and propose software solutions to solve problems. \n\nDevelop layouts and prototypes to ensure the solution meets requirements. \n\nWrite well-structured and testable code following the set guidelines. \n\nMaintain systems by monitoring and correcting software bugs. \n\nIntegrate multiple systems from different vendors with seamless data flow. \n\nInvestigate new technologies and continue to update your technical skills. Skills: \n\nMust be proficient in any of the JavScript frameworks like React JS,  Angular JS,  Node JS. \n\nWorking knowledge of PHP,  MySQL,  HTML,  CSS,  jQuery. \n\nKnowledge of Backbone JS,  UnderScore JS and Handlebars will be preferred. \n\nExperience with server-less technologies on AWS or Google Cloud will be preferred. \n\nHands-on experience with CRM systems like SugarCRM will be preferred. \n\nThe ability to work both in a team and alone and to manage your own workload. \n\nAn ability to learn new skills and technologies quickly. \n\nAn awareness of current issues affecting the industry and its technologies. Education & Experience: \n\n1-4 years experience in software development or programming. \n\nPrior experience in handling large production environments will be preferred.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["SugarCRM", "backbone.js", "jQuery", "MySQL", "Javascript", "PHP", "HTML", "Software solutions", "Monitoring", "CRM"]}