{"JOB DESCRIPTION": "Software Developer/Backend Engineers If you want to create something which play by millions of User then this is right job for you.You will take a lead to creating and maintaining backend for our multiplayer game.Job Description: Designing and developing code using Object Oriented JavaScript.Should have good working experience in OOPs Skill, nix flavors (Linux/Ubuntu).Should have basic knowledge of Cloud based infrastructure, preferred AWS/Openshift..Proficiency in client/server side development.Ability to write high-performance, reusable code for componentsDebugging skills is mandatory.Knowledge of UML diagrams.Must have awareness of NoSql DBs (Mongo/Redis/Cassandra)Knowledge of Software Configuration Management Tool as SVN/Github would be preferred.Experience of web services.Experience on AngularJS/Node.js would be preferred.Highly interactive thick client experience on modern browser.Software development in a team oriented, agile development.1+ years of experience developing applications with Javascript.Must have worked on Web Sockets.A firm grasp of distribured server architecture (Load balancer, Master/slave architecture, etc.).Experience developing and maintaining production sites.Strong data structures concepts.Strong understanding API driven design (Service oriented architectures).Exposure to Mobile application development is an added advantage.Qualifications: B.Tech/MCA/B.Sc./M.Sc Salary : Sky is the limit for talent.We are looking for a highly motivated Software Developer that works well in a team oriented environment. If you want to be part of an exciting Mobile gaming/application company, share your  Should have good working experience in OOPs Skill, nix flavors (Linux/Ubuntu). Should have basic knowledge of Cloud based infrastructure, preferred AWS/Openshift.. Knowledge of Software Configuration Management Tool as SVN/Github would be preferred. A firm grasp of distribured server architecture (Load balancer, Master/slave architecture, etc.).", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["Ubuntu", "Backend", "NoSQL", "Linux", "UML", "cassandra", "Software configuration management", "Debugging", "Data structures", "Gaming"]}