{"JOB DESCRIPTION": "Roles and ResponsibilitiesS&P Global PlattsTheRole:Software Developer IIThe Location:HyderabadThe Team: The resource would be a part of the Central Entailment system team. He/She would be a part of the existing team supporting CES Team. Working very closely with the Product owner, this team is responsible to make major and minor enhancementsThe Impact: This position directly interacts with the business team to understand their requirements and the added value to the business customers. The role provides exposure to the business and functional model of the company. The applications being worked on are highly business centric and revenue generating.What’s in it for you:Candidate would gain a lot of experience in designing and implementing solutions on latest technical environment with open source tools.Collaborated with multiple IT/Business teams to plan and design end-to-end data flow according to industry standardsResponsibilities: Analyzed client requirements and formulated requirements document.Co-ordinate with Database support team, QA and BA.Enhanced various complex jobs for performance tuning.Able to debug and identify issue in AWS cloud environment.Help team to move story from UAT to business accepted status.What we’re looking for: Basic Qualifications:3+ years of experience in designing, developing and implementing with React JS and Dot net core knowledgeExcellent communicator and good listener.Highly motivated, dependable troubleshooter and problem-solver.Good people skills for building relationships with colleagues at all levels.Must have: Worked on .net CoreMust have: Proficient on React JSMust have: Strong in C#Must have: Multithreading and async programmingMust have: worked on design patternMust have: AWS knowledgeMust have: .Net Core experienceMust have: strong in communicationMust have: strong in debugging skillPreferred Qualifications:Have a exposure of TDDHave a working knowledge of RDBMD e.g. Oracle and Function, Store Procedure, TriggerGood to have: Agile/scrum knowledgeHave a exposure of XSLT", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["C#", ".Net Core", "Software Development", "Multithreading", "TDD", "C#.Net", "Javascript", "XSLT", "Net", "Oracle"]}