{"JOB DESCRIPTION": "Senior Software Developer, JaipurWould you like to work in a global company with interesting and challenging software development tasks? We are looking for a Senior Software Developer to join our office in Jaipur. As a  part of our global product development team you will work in close cooperation with your colleagues especially in the Netherlands, Russia and Finland. Youll collaborate with your global team to define requirements and complete integration development in the Valamis learning experience platform.  Your responsibility is to design, implement and test different types of integrations to transfer e.g. user data, learning content and learning records  between our platform and other systems with high stability and security. What are we looking for in our new colleague?From the technical side:3-5  years of hands-on experience in software development Experience of developing in JVM ecosystem and experience with multiple APIs, multiple file formats (e.g. JSON) and ETLExperience with microservice architectureAbility to participate in technical planning discussions with internal and external partiesWorking experience from an Agile development environment. Ability to document requirements in JIRA and Confluence etc. and to develop automated tests.Familiarity with DevOps approach is considered a benefit. Also Kafka, Kubernetes and Scala skills are beneficial in this role.Also:You believe in teamwork and are able to work in a team efficiently.You have good social skills - good verbal and written communication is required.You are self-motivated, able to work independently and you have a proactive approach to work.You have good time management skills and you are good at prioritizing tasks.You are efficient in making decisions based on your knowledge and experience.You are able to help and coach your colleagues and you enjoy sharing your knowledge with them.You enjoy learning and developing your skills and knowledge.You are able to delegate tasks to others if the situation requires.We support you in your development in many ways. For example, we have our own mentoring program and our own digital learning environment. We also support you in your career path. Leadership as a Service (LaaS) -model is actively in use at Valamis, which enables employees to book services related to development, everyday work, and wellbeing whenever needed. For us, it is highly important that it feels good to work at Valamis. We are known from our Scandinavian work culture where we value, trust and care for each other. We also do trips and have different events together. Check out our (https://www.instagram.com/valamis) or (www.valamis.com) to get to know more about working at Valamis. And if you want to know a little bit about your future colleagues, take a look at Mattis story (https://www.valamis.com/careers/stories/matti-lupari).The application period will end on February 10th but please dont hesitate to send us your application right away, as we will make decisions as soon as we will find the right person for the job. Please add your salary expectations to the application. For more information contact Aditi Mehta, aditi.mehta@valamis.com. Valamis Group is an internationally growing IT company specialized in the digitalization of learning. In addition, we also have strong knowledge in proactive analytics, professional IT-services, and IT solutions. We have over 200 employees worldwide, who are driven by our values: responsibility, sense of community, development and customer focus. As your possible future employer, we hope you find these values important to you also. ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["Java", "Software Development", "Web Technologies", "Javascript", "J2Ee", "Web Development"]}