{"JOB DESCRIPTION": "We are looking for a software developer to join our development team as it grows. Candidates should have hands on experience in C#/VB.NET, SQL server and SSRS reports. In addition, they should have 3+ years of prior industry experience in Windows forms, ASP.NET, MVC, JavaScript and  jQuery. Applicants are expected to have knowledge of best practices of the full software development life cycle, including coding standards, code reviews, source control management, and testing. The candidate should be a team player possessing strong analytical as well as technical skills, and should be an effective communicator.Education: Graduates or post graduates in Computer Science/Computer Engineering or related technical disciplines. Graduates from other fields with technical certifications will also be considered.Experience: 3 - 7 YearsPreferred Skills: Experience in the following technologiesLanguages: C#, VB.NET, Proficiency in object-oriented design skillsTechnologies: ASP.NET, MVC, Windows Forms, SSRS, JavaScript, jQuery, XMLDatabases: MS SQL Server, MS AccessDevelopment Tools: Visual Studio .Net, .Net Framework, IISVersion Control Systems: TFS, DevOps, Git Roles and Responsibilities Working with an agile team to design, develop, test, and maintain desktop and web-based business applications built on Microsoft technologiesWork with mentors to grow skillset and client knowledgeAssisting in the collection and documentation of users requirements and estimatesDesign, develop, and unit test applications in accordance with established standardsAnalyzing information to recommend and plan the installation of new systems or apply modifications to an existing systemInvestigate bugs, modify systems to correct errors, adapt them to new hardware, improve its performance, or upgrade interfacesCommunicates and works to mitigate roadblocks through collaboration with internal and client teamsDeveloping and implementing quality assurance proceduresPreparing reports on programming project specifications, activities, or statusEnsures assumptions are vetted before beginning coding Desired Candidate Profile The ability to learn new languages and technologies quicklyProvide raw energy and potentialAn analytical mindGood communication skills both written and verbalResourcefulness and troubleshooting aptitudeAttention to detail", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["C#", "TFS", "VB.NET", "SSRS", "SQL Server", "JQuery", "Microsoft Technologies", "Software Development", "GIT", "Windows Forms", "XML", "Javascript", ".Net", "ASP.Net", "MVC"]}