{"JOB DESCRIPTION": "  We are currently looking for a Senior Software Developer to join our team.    Determine and identify high-level functional and technical requirements on the basis of interactions with the user community and knowledge of enterprise architecture. Design architectures, including the software, hardware and communications, to support the total requirements, as well as to provide for present and future cross-functional requirements and interfaces.   Interact with project management to plan project schedules and technical direction. Provide quality assurance review and the evaluation of existing and new software products. Develop high-level system design diagrams for program design, coding, testing, debugging and documentation. Develop and implement moderate to complex web applications on one or more platforms.        Responsibilities and Duties    Develop software solutions by studying information needs; conferring with users; studying systems flow, data usage and work processes; investigating problem areas; following the software development lifecycle.   Works independently under limited supervision and applies knowledge of subject matter in Applications Development & Automation   Determine operational feasibility by evaluating analysis, problem definition, requirements, solution development and proposed solutions.   Document and demonstrate solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code.   Prepare and install solutions by determining and designing system specifications, standards and programming.   Improve operations by conducting systems analysis; recommending changes in policies and procedures.   Update job knowledge by studying state-of-the-art development tools, programming techniques and computing equipment; participating in educational opportunities; reading professional publications; maintaining personal networks; participating in professional organizations.   Protect operations by keeping information confidential.   Accomplish engineering and organization mission by completing related results as needed.   Mentor junior-level developers.   Collaborate with the team to brainstorm and create new products.   Grow engineering teams by interviewing, recruiting and hiring.   Understand business needs and know how to create the tools to manage them.   Comply with the project plan and stay on the leading edge of development practices.   The ability to explain technical jargon to peers and the ability to build a website from start to finish to the highest standard     Experience and Skills     Domain knowledge, Job site is highly preferred.   Should have experience in PHP and Laravel   Strong knowledge in MVC architecture   Should have experience in Javascript, Jquery, Bootstrap, HTML, CSS, and ReactJs   Should have good experience in database MySql(Preferred), MongoDb, or any NoSql database.   Working knowledge in ElasticSearch.   Should have experience in CMS like Drupal, Wordpress, Joomla,etc..   Should have experience in version control tools(Git)   Should have experience in Unit Testing   Knowledge in Amazon Web service is an added advantage   Experience in E-commerce like Magento, Opencart is an added advantage   Experience in handling third-party API.   Min.5 years Experience PHP Frameworks Laravel and Domain knowledge is most preferred.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Drupal", "Automation", "jQuery", "Project management", "MySQL", "Wordpress", "Javascript", "PHP", "HTML", "Joomla"]}