{"JOB DESCRIPTION": "Looking for PHP Developers with 1- 3 yrs work- exp on E- commerce!\n\nBrowsewire Looking for PHP Developers with 1- 3 yrs work- exp on E- commerce! E- 51- First Floor, \n\nPhase VIII,  Industrial Area, \n\nSAS Nagar,  Mohali, \n\nPunjab- 160059 \n\nGet In Touch This box is for spam protection -  please leave it blank: Looking for PHP Developers with 1- 3 yrs work- exp on E- commerce! Creation & Implementation of web based products using PHP,  SQL,  III Party tools \n\nWork done mostly on E- Commerce,  Live streaming,  Social- networking \n\nDocumentation,  Allotting time,  Direct Interaction with clients \n\nHandle project independently Summary Software Developer /  Jr. Software Developer 1- 3 yrs. CTC 2- 3lpa B.Tech (Any specialization),  MCA,  M.Sc(IT),  M.Tech (Atleast a Graduate) Role : Software Developer (PHP) Functional Area : 1. E- Commerce-  Magento,  OS Commerce,  X- Cart ,  Opencart ,  Prestashop,  Bigcommerce ,  Shopify or\n\n2. Frameworks-  Cake PHP/  Yii/  Codeignitor/  Zend/  Symphony,  Laravel or\n\n3. CMS- Wordpress,  Concrete5 or\n\n4. Php4/ Php5 &\n\n5. Working Knowledge of LAMP 06/ 06/ 2015 Desired Candidate Profile : \n\nHaving good coding skills \n\nHaving good interpersonal,  analytical & logical skills \n\nGood Communication skills \n\nIndependent & self driven \n\nHaving the ability to work under tight deadlines \n\nSelf- Motivated and confident communicator \n\nPersuasive,  influential and professional \n\nLooking for a long term relationship with organization \n\nPhase VIII,  Industrial Area, \n\nSAS Nagar,  Mohali,  \n\n\"They were pleasure to work with. Their quality of work was excellent and clearly a Magneto expert. In addition I found them a very pleasant and accommodating to work with. They will be my first choice for ecommerce projects in the future.\" - - - - Oliver Hayns \n\n\"I am amazed every single time at how they can take my explanation of my need and convert it to the end product. These guys have been spot on and get it done very quickly. I have been use to waiting two weeks for anything to get done and some more difficult things took even longer than that with my local web guy,  but these guys turn around what I ... \n\n\" In a project where requirements were altered a number of times,  team did these well and met all the challenges. Communication was pretty good and we only had relatively minor misunderstandings. I would use them again for further projects. \" - - - - David Harrison \n\n\"I have used many developers on Odesk before,  some have been good and others have been poor. Browsewire team was excellent! I will definitely be using them again in the future. Thanks again for your hard work. \" - - Julia Reed \n\n\" Satyam is responsible and hard- working developer. She is good in understanding,  communication. She could do what I asked her. I recommend her for any further employers.\" Zaur \n\nCertain websites require more of usual designing approach. So when it comes to design an e- Commerce website it requires more innovative and artistic flare. When Cigars- Now came to us,  we were confident to design an entirely new online website based on PHP and OsCommerce. Our focus was on creating full ranging shopping cart for all products and a... \n\nMassively Undervalued: - Status reports - Contact notes - Emails asking for decisions. - Walking around the office Massively Overvalued. - Slack - IM Chat - Conference calls - Texting colleagues - Video calls", "ROLE": "Software Developer", "INDUSTRY TYPE": "BPO, Call Centre, ITeS", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["OSCommerce", "SAS", "Coding", "Analytical", "Wordpress", "Machine learning", "Social networking", "CMS", "Zend", "SQL"]}