{"JOB DESCRIPTION": "Description: \nWe are looking for a smart and experienced technologist to be one of the pillars of our tech team in our Goa office. We want to hire someone who can self-learn fast, innovate and accelerate our product development.\n You must have: \n3 to 7 years of web development experience with a great deal of passion for it (not necessarily a degree in computer science)\nA knack to write code for humans. Always code as if the person who will maintain your code is a maniac serial killer that knows where you live \nVision to setup coding practices which help us accelerate\nGreat understanding of server-side engineering (databases, MVC, JS MVC and more)\nAbility to think creatively. Finding the simple right answer, in an extensible way\nA penchant for making things simple for the user\nA smile on your face, and a tinkle in your eyes\nGood to haves: Expertise in CakePHP and open source contributions \n On a typical day, you would: \nCome up with architectural solutions for stuff we want to do\nAssign development tasks to the younger developers under you\nSolve their problems, but not spoonfeed them\nThink, research and deploy newer coding practices in the team. We want to move towards cleaner code, faster deployments and stronger tests\nReview the code of your juniors and make sure they improve over time\nGet your hands dirty with code on larger, more complex parts\nBrainstorm with the founding team about the direction of the product\nWrite for the company blog (learnings, experiences, interesting hacks)\nEnjoy a pollution-free, traffic-free life in\n  We are currently working with the following stack  \nApache as the webserver\nCakePHP for the backend\nMySQL as the database\nSphinx for the search\nHTML5 and CSS3 for the front end\njQuery and Backbone.js for the interaction\nRedis for queues\nAmazon SES for the mailing", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - eCommerce, Internet Technologies", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "BCA in Computers, B.Sc in Computers, B.Tech/B.E. in Computers", "PG": "M.Tech in Computers, MCA in Computers"}, "KEY SKILL": ["server", "front end", "development", "Senior Software Developer", "cakephp", "code", "it", "research", "coding", "open source", "computer science", "web", "product development", "backend", "web development", "mysql", "mvc", "css3"]}