{"JOB DESCRIPTION": "  Position Overview:    As a Full Stack Developer, you will work on developing scalable, maintainable and testable systems and services that power our investment management cloud product suite. You will be utilizing the latest front-end and back-end technologies within a highly automated continuous integration/continuous delivery environment.   Responsibilities   Provide technical leadership and mentor/coach other engineers within a scrum team   Work closely with peers, project and product managers to deliver scalable REST & GraphQL services in Node & front end using Angular.js   Design and implement underlying data models for applications and services to be scalable and maintainable (Relational and Document Based Databases)   Identify improvements and participate on innovating our tools and services that are at the foundation of our product   Actively practice TDD & BDD while developing new features and refactoring existing code   Provide operational support by fixing production issues   Demo features each week in fun and relaxed team gatherings    Qualifications   Bachelor s degree in Computer Science or related field   Experience providing technical leadership, providing design advice and mentoring other engineers   Experience building front-ends in HTML5, CSS and JavaScript (LESS or SASS are a plus)   Experience with the MEAN Stack - MongoDB/MySQL, Express.js, AngularJS, and Node.js   Experience building REST API s   Professional experience with at least one object-oriented programming language such as C# or Java   Experience with Agile methodologies   Familiarity with a Devops environment   Familiarity with design patterns and microservices architecture   Active interest in new technology and emerging engineering practices   Strong communication skills.   Benefits:   Compensation includes a competitive base salary & excellent benefits.   About the Eze Software Group:   Eze Software Group is a premier provider of global investment technology to support the front, middle and back office. The Eze Software Investment Suite addresses the core business needs of the asset management community, including Order Management, Trade Execution & Analytics, Portfolio Analytics & Modeling, Compliance & Regulatory Reporting, Commission Management, Data Management and Portfolio Accounting.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Order management", "SAN", "Software design", "Data management", "MySQL", "Agile", "Workflow", "Scrum", "Customer service", "Analytics"]}