{"JOB DESCRIPTION": "  We are looking for Software Geeks Technology Leaders to build and implement awesome stuff.    You will work with other Geeks and Product Revolutionaries throughout the software development life cycle.    In this role, you need to be a Kamikaze, who gets code done and product shipped.    Along the way you will solve tough problems, write great code, create intelligent algorithms and in general do cool stuff that works.    If you know Agile frameworks and popular coding languages, may help. But we expect more. So if you love code and dream of building the great global product which will make a difference, read on.     Responsibilities and Duties:     Be awesome. Know your stuff and be a guru of at least one thing like Python, R, Databases, Web Development. If you are into Machine Learning, talk to us!    Design algorithms and flowcharts.    Design software with great UX.    Produce clean, efficient code that works and do it quickly.    Integrate software components and third-party programs.    Troubleshoot, debug and upgrade existing software with your genius.    Gather and evaluate user feedback as they love your software.    Recommend and execute improvements, so they love it even more!    Create technical documentation for reference and reporting, so your peers can use the amazing product you created.     Requirements:     Proven experience of 5+ years as a technologist who has also worked on multiple handson product development cycles. Think big, work smart and be able to change the world.    Familiarity with Agile development methodologies, emerging technologies, cloud/Azure and more.    Basic knowledge of statistical analysis so your software becomes even smarter.    Be able to learn new languages and technologies fast.    Excellent communication skills, just in case you need to speak to your peers or customers.    Resourcefulness and troubleshooting aptitude, Attention to detail.    Proven credentials of delivering projects on time   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Courier, Transportation, Freight , Warehousing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Software design", "Statistical analysis", "Coding", "Agile development", "Web development", "Machine learning", "Software development life cycle", "Troubleshooting", "Python", "Technical documentation"]}