{"JOB DESCRIPTION": "Software Developer PHP\n\nWe are looking for candidates for a full- time position as PHP developer. The selected candidate will be part of a strong development team,  and will be responsible for translating complex business requirements into functional web based applications throughout all stages of the SDLC. The ideal candidate has extensive experience working with distributed,  service oriented architecture (SOA) systems,  writing clean object- oriented code,  worked with RESTful APIs and has worked in cloud based environments like AWS and/ or Azure.\n\nDepartment:\n\nIT\n\nResponsibilities\n\n Troubleshoot,  test and maintain the core product software and databases to ensure strong optimization and functionality\n\n Contribute in all phases of the product development lifecycle\n\n Follow industry best practices\n\n Develop and deploy new features to facilitate related procedures and tools if necessary\n\nSkills\n\n Framework- oriented PHP MVC experience. Confident working with modern MVC frameworks. MVC s such as Codeigniter,  Zend,  CakePHP or Yii and desire to learn new frameworks\n\n CSS,  CSS preprocessor experience (LESS or SASS)\n\n Experience with API integrations (both back- end and front- end)\n\n Advanced skills in LAMP (PHP),  PHP5,  MySQL and HTML/ CSS/ AJAX/ JavaScript/ AngularJS.\n\n Experience with unit testing.\n\n Experience with Industry standard PHP templating engines\n\n Strong MySQL & SQL Server database skills\n\n Experience in cloud based environments like AWS and/ or Azure.\n\n Knowledge of web application security considerations and best practices\n\n Experience developing & architecting for large- scale Social Web products with a large user base.\n\n Fast learner of off the shelf systems,  uses good development practices (source code in Git and release management).\n\n A flair for UI/ UX design. Comfortable implementing designs with pixel perfect accuracy.\n\nCadvil Solutions is one of the leading software solution providing companies specializing in custom business app development,  product development,  mobile app development and software testing. We re recognized for our clear understanding of business needs and delivering solutions that surpass our client s expectations with innovative approaches and commitment. We grow with our clients.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["server", "css", "code", "software", "developing", "HTML", "tools", "cloud", "database", "web", "optimization", "MySQL", "Javascript", "PHP", "CakePHP", "api", "Ajax", "architecture", "development", "ux", "SOA", "mobile", "SDLC", "SQL", "application", "service", "developer", "MVC", "aws", "applications"]}