{"JOB DESCRIPTION": "We are looking for Software Developer and the requirements are as below:\n\nExperience  07 years nbsp;of which 3 year in Software  /  Firmware Development. C# ,  .NET and Micro controller programming experience is must. Previous exposure to Vibration Route and analysis software preferred. All India exposure in previous assignments will be preferred. nbsp; Job Application Form Covering Letter Attach your Resume Software Developer We are looking for Software Developer and the requirements are as below: BTech Electronics  /  Comp Science. Experience  07 years of which 3 year in Software  /  Firmware Development. C# ,  .NET and Micro controller programming experience is must. Previous exposure to Vibration Route and analysis software preferred. All India exposure in previous assignments will be preferred. Product Range New Items Machine Testing Camera Sound Noise Analysers Acoustic Camera Vibration Meter Vibration Analyzer Human Vibration Meters Laser Vibration Meter Vibration Monitoring System Seismograph Ground Vibration Analyser Vibration Visual Analyzer Vibration Sensors Bearing Condition Monitoring Systems Laser Alignment Tool Machine Condition Monitoring Software Diesel Engine Analyzer Automotive Diagnostic Tool Ultrasonic Instruments Ultrasonic Flow Meter Cable Fault Locator Cable Pipe Detector Security Surveillance Thermal Imagers Medical Thermal Imaging System Corona Cameras Eye Movement Recorder Human Body Scanner Calibration System Thermal Camera Stroboscope Tachometers Services Showcase Gallery\n\n", "ROLE": "Software Developer", "INDUSTRY TYPE": "Advertising, PR, MR, Event Management", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["Condition monitoring", "Software testing", "C", "Firmware development", "thermal", "Programming", "Electronics", "Sensors", "Automotive", "Testing"]}