{"JOB DESCRIPTION": "   We are growing our IT team to develop new products and improve current platform, which is the critical part of our business. We are looking for multiple front-endback-end full-stack software developers to join in our team in Hyderabad. You will be part of a software development team, working in a scrum team to develop and improve business critical solutions.    Responsibilities     Design, develop and improve (existing and new) in-house developed software products   Use company software design standard and strategies during development   Work in scrum teams together with visual designer, QA, and IT infra members   Work with test driven development approach and implement unit testing   Provide input to product owners from technical perspective and work with them for developing and improving products   Troubleshoot, identify, and fix application bugs as and when reported   Collaborate with various local and remote teams      Requirements     Has Bachelor s or Master s degree in computer science, computer engineering or in a similar field   A minimum of 1-2 years of work experience in front-end or back-end development   Back-endfull-stack developers: experience in technologies C#.NET, .NET core, Ms SQL Server   Front-endfull-stack developers: Experience in front-end technologies: JavaScript, JSON, Angular 2.0, HTML5, CSS. Hands-on experience in Angular 2 is must have   Experience in working agilescrum teams or DevOps   Having experience in unit testing, continuous integration and deployment is a plus   Having knowledgeexperience in market research industry is a plus   Fluent in English, for both written and verbal communication   Proactive learner, enjoys following technological developments and industry trends   Deep analytical skills, enjoy challenges for solving difficult problems    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Advertising, PR, MR, Event Management", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Computer science", "MS SQL", "Software design", "Front end", "Product innovation", "Javascript", "Market research", "JSON", "test driven development", "Unit testing"]}