{"JOB DESCRIPTION": "  As a   Software Developer   at ISS MI, you will be responsible for development and maintenance of company web-based business intelligence products and their integration with 3rd party platforms including QlikView, QlikSense and Salesforce. Working closely with our Product Managers, other developers and DBAs, you are expected to show a significant amount of independence analysing requirements, planning and implementing development, and preparing releases to our production environments. You will also be asked to help support our BAU processing as the need arises.         Most of ISS MI client faced product websites as well as integration solutions are based on .Net/JavaScript stack. Demonstrable experience with Qlik systems will be a definitive bonus during the interview.        Responsibilities       Web development: create, upgrade and maintain company web sites. JS/HTML/CSS stack is the main requirement for the successful candidate; .Net/Core full stack is a bonus     Study current systems, understand underlying architecture, flow and processes and help redesign and refactor them     Plan and implement changes according to agreed timescales and software development cycle     Provide technical support to the Product and Data Operation teams     Collaborate with other teams: e.g. Quality Assurance, DBAs     Willingness to learn and work on different technologies and tools     Willingness to learn and adopt industry concepts and technology         Qualifications       Bachelor's degree or higher in Computing/Information Technology or related subject (e.g. Maths or Electrical Engineering)     In-depth knowledge of JavaScript language. TypeScript and C# will be a strong bonus     Hands-on knowledge of web technologies, experience with responsive web design, familiarity with OWASP practices     Understanding of general software principles, readiness to discuss them during an interview     Experience of using of version control tools (git/svn)     Ability to accurately estimate and scope development and maintenance work          Good to have:      Basic understanding of data of fund management and/or mortgage industry     Basic understanding of RDBMS and related toolset     Experience with BI technologies and tools     Experience with Salesforce API/Apex         ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Manager Quality Assurance", "Web development", "HTML", "Web designing", "Asset management", "Business intelligence", "Information technology", "Technical support", "Analytics", "Salesforce"]}