{"JOB DESCRIPTION": "Experience Level desired: 7-10 years  Reports to: Tech/Team Lead Job Description: 7 to 10 years of experience in BizTalk Server (2013, 2016). Well versed in using Orchestrations, Pipelines, Mappings, BAM, AS2 protocol, BRE, custom      pipeline components and custom Adapter. In-depth understanding of  BizTalk architecture schemas, maps, pipelines Should have experience of  working in EDI Ability to analyses, implement, perform tests and deploy BizTalk requirements Hands-on in creating orchestrations -sending and receiving messages, creating correlation sets,      constructing messages, running maps, executing scripts etc. Hands-on in with creating custom Pipeline components. Experience with C#, XML,      XSLT, XSD, Web Services, WCF etc. Good knowledge of BizTalk best practices and BizTalk design patterns Strong skills in performance tuning capabilities of BizTalk will be an added advantage Should be able to interact with multiple stakeholders with strong communication skills Should be comfortable   working in BizTalk modules independently with minimal supervision. Experience in Salesforce  integration will be an added advantageSkills  Ability to complete all phases of software development life cycle including analysis,      design,  functionality, testing and support  Ability to develop large  scale applications  Ability to work on  multiple projects with multiple deadlines  Ability to communicate  clearly with business users and project manager  Ability to innovate and  provide functional applications with intuitive interfaces  Ability to construct user guides and documentationQualificationsProven experience with Microsoft .NET technologies including 3-5 years of experience in BizTalk7-10 years of actual experience in      the workplace  College or University      degree preferred ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["C#", "Biztalk Server", "salesforce", "Software Development", "Design Patterns", "XML", "Web Technologies", ".Net", "XSLT", "WCF", "EDI", "Web Services"]}