{"JOB DESCRIPTION": "Software Developer in Testing 3tel Key responsibilities include As a Software Development Engineer in Test (SDET),  you will work with the development team and QA team in an Agile setup and develop automated tests in a Continuous Integration/ Continuous Delivery environment.  The ideal candidate should have extensive knowledge in Java,  BDD concepts,  Javascript to develop and support the automation efforts.  You will design,  develop,  execute and maintain automation test frameworks,  tools and test cases that can validate overall quality & scalability of our software products and ensure a high quality release to customers.  As an SDET we expect you to have: Minimum of 2+ years of experience as SDET or an Exceptional developer with 5+ years experience in Java.  Strong understanding of quality engineering fundamentals and following tools Experience in JBehave or Cucumber Experience in Selenium WebDriver 3. 0 and/ or Protractor Experience with Appium or Espresso or UI Automator Experience with Jenkins Experience in ReSTful/ SOAP Webservices.  Tools like Postman,  SOAP UI.  Experience in Junit testing Experience with builds tools Maven/ Gradle Experience in Xpath , CSS Experience with Databases Experience with tools like Apache Jmeter 3. 0,  Dynatrace 5. 6 /  6. 1 Experience in Mocking / Stubbing of code Experience in working in Agile environment Hands on experience on functional testing & white box testing with a strong understanding of/ experience with SQA methodologies,  techniques and approaches Experience to create automation frameworks and follow through to create and execute automated test scripts Experience of automating distributed (multi- tiered) systems & mobile app on Android/ iOS.  Experience with a variety of types of testing,  including whitebox,  performance and security.  Excellent problem solving and analytical skills & track record of building and maintaining excellent working relationships with peers Strong desire to deliver an excellent customer experience.  Number of positions :", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["Maven", "Automation", "SQA", "development", "css", "code", "analytical", "software", "mobile", "Apache", "tools", "Android", "quality", "Web services", "ui", "Javascript", "Agile", "developer", "Selenium", "support", "soap", "Testing"]}