{"JOB DESCRIPTION": "InvestWell: Software Developer Android Software Developer Android(Gurgaon) Investments is a complex ecosystem involving Asset Management companies,  Financial Advisors,  SEBI regulations,  online and offline Investors. There is no way to align all these stars without radical engineering innovation. We value strong engineers who are agile enough to jump into most projects and believe that small,  empowered,  self-motivated teams can do big things. Please find the details mentioned below. IPlease find the details mentioned below.  \nBachelors in Engineering or equivalent work experience of 2+ Years \nSolid understanding of the full mobile development life cycle \nProven working experience in Android app development \nWorking knowledge of the general mobile landscape,  architectures,  trends,  and emerging technologies \nExperience with third-party libraries and APIs  \nExperience working with a team in a startup or corporate work environment for at least a year \nCollaborating closely with our Product team to continually improve our products \nMaintaining and establishing good software design and architecture best practices \nWork with UI/ UX designers to innovate new user experiences.  Your key Responsibilities:  \n Design and build advanced applications for the Android platform \nCollaborate with cross-functional teams to define,  design,  and ship new features \nWork with outside data sources and APIs \nUnit-test code for robustness,  including edge cases,  usability,  and general reliability \nWork on bug fixing and improving application performance \nBuild and publish applications in app stores \nContinuously discover,  evaluate,  and implement new technologies to maximize development efficiency   2000-2018 Excel Net Solutions Pvt. Ltd.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["development", "code", "ux", "software", "Finance", "mobile", "Asset management", "Unit testing", "Android", "Software design", "Mobile development", "Excel", "UI", "application", "design", "Agile", "developer", "net", "SEBI", "architecture", "applications"]}