{"JOB DESCRIPTION": " Dear Applicants,AIRA Matrix provides artificial intelligence based solutions for Life Sciences applications. Our products and services improve efficiency, diagnostic accuracy and turnaround in pathology and microbiology workflows, in research, pharmaceutical and clinical laboratories.Offerings from the companys deep learning platform AIRAVAT include:• Pre-trained applications for feature identification and quantification.• Workflow efficiency solutions for triaging, grading, predicting and inferencing.• Ready deep learning networks for easy DIY development of analysis workflows.The platform is vendor-neutral, supports collaboration across teams and can be easily integrated with other digital laboratory solutions.  Job Description: Responsible for end to end testing cycle. Ability to reproduce issues reported by client and assign it to the pertinent members of the development team He/she is responsible to reporting, tracking till closure of all issues reported by client and testing team Take ownership of a defect and drive it to closure Ability to modify software configuration and propose work around to achieve functionality in the case of issues Ability to communicate with customer and development / testing team to address issues Creation and execution of test plans, cases and scripts to uncover, identify and document software bugs and their causes.   Functional testing, regression testing, integration, performance and compatibility testing on Mobile based apps and website. Coordinate with stakeholders as and when needed to understand requirements. Independent motivated worker and should mentor junior members of the team.Candidate Profile: Academic background: B.E/ B.Tech /M.C.A.Experience:Minimum  9+ years of experienceMust have experience in Agile,Maven,Git,SQL.Specialization / Domain knowledge: Experience System Tester (Test case preparation, bug reporting, bug tracking) with several years of experience in software products organization Exposure to Java technologies such as Core Java, SPRING, Hibernate, JAXB, Apache Camel, CXF, JMS Exposure to UI technologies (Angular 10, HTML5) and MySQL database are added advantage Experience in automation testing and test scripting and performance testing are desirable Good understanding of testing methodologies, SDLC and STLC", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["JMS", "Maven", "Core Java", "Hibernate", "JAXB", "GIT", "MySQL", "Apache Camel", "Spring", "SQL"]}