{"JOB DESCRIPTION": "Hiring for Sr. Software Developer for Mumbai location in Staffing and Software Solutions Industry \n\nPosted on - March 7,  2019 \n\nHiring for Sr. Software Developer for Mumbai location in Staffing and Software Solutions Industry\n\nProfile-  Sr. Software Developer\n\nLocation-  Mumbai\n\nQualification-  Technical degree or post graduate in computer science /  information technology.\n\nSalary-  3.5lakh- 4.5lakh PA\n\nExperience-  3 Years\n\nObjective-  Good Programmer,  and has to understand business requirements. Logic should be strong\t\t\t\t\t\t\n\nKey Responsibilities\n\nProvide regular update to reporting manager.\n\nGuide development efforts towards successful project delivery.\n\nEnsure proper coding standard should be followed by developers\n\nMaintain high standards of software quality within the team by establishing good practices and habits.\n\nIdentify and encourage areas for growth and improvement within the team.\n\nCollaborate with other software developers,  business analysts and software architects to plan,  design,  develop,  test,  and maintain web-  and business applications.\n\nAssist in the collection and documentation of user s requirements,  development of user stories,  estimates and work plans.\n\nPrepare reports,  manuals and other documentation on the status,  operation,  and maintenance of software.\n\nAnalyze and resolve technical and application problems.\n\nDesired Experience & Expertise\t\t\t\n\n3 years experience as a Web Application Developement using LAMP stack (Linux,  Apache,  MySql and PHP/ Python/ Perl).\n\nGrip on backend technology fundamentals\n\nIn depth knowledge of MVC frameworks like Laravel, Django, Flask, Pyramid, Bootstrap\n\nExperience in database development including MySQL, PostgreSql,  MongoDB, Cassandra, Oracle.\n\nStrong knowledge of AngularJs, JavaScript, nodeJs, Jquery,  AJAX,  HTML5,  CSS3,  OOPS, python, php\n\nStrong knowledge of Restful API\t\t\t\n\nDesired Personal characteristics /  Soft skills\t\t\n\nPrior experience in a Development,  Debugger.\n\nStrong communication skills (verbal & written both)\n\nAccountability in terms of providing regular and on need basis update to management.\n\nKEY RESULT AREAS of the Position\t\t\t\t\t\t\n\nEnd to end executing projects with team.\n\nUnderstand the Business Requirements and regular meet with customers.\n\nSuccessful Development of new product which is stable,  scalable and configurable.\n\nDeliver the requirements given deadlines to customer. Support is require any time.\n\nUser and functional manual for products developed.\n\nImplementing process and project management tools for betterment of the development. Provide reports from tool.\t\t\t\n\nInterested candidates kindly forward your updated CV on hr5@tasolutions.in with your current and expected CTC or call on 9023404909 if not interested. We will really appreciate if you forward this position to your colleagues or Friends", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["development", "technical", "software", "Project management", "Perl", "Apache", "tools", "quality", "coding", "database", "jQuery", "Linux", "application", "web", "MySQL", "Javascript", "PHP", "developer", "backend", "mvc", "Oracle", "support", "Ajax"]}