{"JOB DESCRIPTION": "SOFTWARE DEVELOPER -  PHP Position: Software Developer -  PHP -  Full Time Job Description: The development unit is the core of eCare and we are expanding our team with talented,  challenge driven developers.  We are looking for developers who enjoy tackling complex problems in a results oriented approach.  Generalists who are proficient in a certain technology (which is PHP in this case) or platform but who also understand that the choice of technology is coupled with the problem at hand.  Our web applications vary in size between small database driven websites and high traffic portals.  We need you to be ready to work in small teams with our team leads to implement identified business requirements using the recommended frameworks,  coding standards,  patterns and best practices.  Required Skills: Proficiency with advanced PHP and MySQL.  Strong evident knowledge of the MVC pattern.  Proficiency in several front- end development scripting languageslibraries and Markups: HTML,  CSS,  Javascript,  JQuery andor Mootools.  Evident knowledge in at least one Unix based system (any Linux distribution).  Proficiency with in- depth data mining,  data analytics,  data manipulation and reporting.  Familiarity with XML,  JSON.  Familiarity with Web services interaction models: RPC,  SOA,  REST.  Desired Skills: Be highly proficient in JavaScript (jQuery),  AJAX.  Be proficient with at least one PHP framework andor Content management system: CodeIgniter,  Yii,  CakePHP,  Drupal,  Joomla.  Be proficient in database architecture,  optimization and scalability standards.  Have Social Media,  SEO experience.  Have SCRUM or Agile methodology knowledge.  Familiar with PayPal,  Facebook and Twitter integration.  Have an interest in digital marketing.  Have working knowledge of SVN.  Apply Now", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["Unix", "development", "software", "HTML", "coding", "scripting", "database", "jQuery", "Linux", "web", "optimization", "XML", "MySQL", "Javascript", "PHP", "scrum", "developer", "agile", "mvc", "SEO", "Ajax", "applications"]}