{"JOB DESCRIPTION": "  About the Team    Fanatics is first and foremost a technology company. We are powered by cutting-edge tech created by our small agile teams using the latest tools and technologies under our highly analytical, forward thinking, and open-minded leadership. As the global leader in licensed sports merchandise, we challenge ourselves by improving our new fully responsive NodeJS cloud commerce platform, Elasticsearch engine, and deep data science capabilities while building the best-in-class retail manufacturing and supply chain technologies. Our tech teams work together to revolutionize data science and engineering initiatives, provide highly scalable real-time and streaming platforms, and create secure e-commerce and in-stadium fan experience products. Our own e-commerce platform transacts in over 190 countries, 17 languages, and 14 currencies. Our motto is #GSD get stuff done and we do just that. If you want to be at the nexus of sports, commerce, and technology, come be a part of our industry-leading team here at Fanatics Tech.   Job Responsibilities   Design and implement new user-facing features in Fanatics products.   Deliver functional prototypes that match specs.   Act as a mission-critical member in the development of cutting-edge applications and services, as well as collaborating with other business units.   Share technical knowledge with existing team.   Participate in a small, experienced, energetic team on a rapid, agile development schedule.   Job Requirements   5+ years of experience with JavaScript (React, Node or Angular preferred)   1+ years' experience with Git or a similar distributed version control system   1+ years' experience in cloud-based applications/technologies   Experience in Service Oriented Architecture system or Microservice architecture   Experience with Agile development processes   Ability to work in a challenging, fast-paced agile environment   Desire and ability to work as part of a team   & ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Supply chain", "Version control", "GIT", "cassandra", "Analytical", "Control system", "Agile development", "Javascript", "Agile", "E-commerce"]}