{"JOB DESCRIPTION": "Job Descripiton \n\nKeyskills - PHP 5, PHP, LAMP, Drupal, WordPress, jQuery, MySQL, JavaScript, Web applications, Advanced JavaScript, Object Oriented, Joomla. \n\nRequirements: \n\n2 to 5 years of experience developing highly scalable Object Oriented platforms \nAt least 2 years of PHP 5 experience. \nExperience on web service integration (SOAP, REST, JSON, XML) . \nExperience working in a high performance LAMP environment \nExpert in JavaScript; experience with the jQuery toolkit \nGIT, Subversion version (SVN) control software \nAbility to create and style standards- compliant XHTML and CSS \nThorough understanding of all phases of software development and meticulous about coding practices, unit testing and clean documentation. \nShould be a self starter and work effectively with very little assistance \nMust have excellent communication skills. \nDemonstrated success working in a rapidly changing, collaborative, and iterative product development environment. \n\nCharacteristics of Success in the Role: \n\nA focus on effective execution \nStrategic thinking both technically and business- wise \nSelf motivated / self starter \nPersonal drive to achieve world class software development \nDesire to work in a fast- paced, evolving, growing, dynamic environment \nLove of technical challenges and a sense of pride in solving them \nAbility to work well in a cross functional environment \n\nResponsibilities \n\nUnderstanding the project requirements and accurately estimating the efforts \nCoding on all tiers of the application \nSolutions development considering the lsquoBig picturersquo \nStrictly follow coding guidelines and programming best practices and processes \nInteraction with the clientrsquos \nPerforming Unit testing, peer code review, technical documentation \nCollaborating with the global project team.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["development", "css", "software development", "code", "technical", "software", "wordpress", "testing", "developing", "javascript", "jquery", "xhtml", "coding", "git", "strategic thinking", "application", "drupal", "web", "xml", "service", "product development", "php", "mysql", "programming"]}