{"JOB DESCRIPTION": "2 to 5 years of experience developing highly scalable Object Oriented platforms\nAt least 2 years of PHP 5 experience. \nExperience on web service integration (SOAP,  REST,  JSON,  XML). \nExperience working in a high performance LAMP environment\nExpert in JavaScript; experience with the jQuery toolkit\nGIT,  Subversion version (SVN) control software\nAbility to create and style standards- compliant XHTML and CSS\nThorough understanding of all phases of software development and meticulous about coding practices,  unit testing and clean documentation.\nShould be a self starter and work effectively with very little assistance\nMust have excellent communication skills.\nDemonstrated success working in a rapidly changing,  collaborative,  and iterative product development environment. \n\nResponsibilities \n\nUnderstanding the project requirements and accurately estimating the efforts Coding on all tiers of the application Solutions development considering the Big picture Strictly follow coding guidelines and programming best practices and processes Interaction with the client s Performing Unit testing,  peer code review,  technical documentation Collaborating with the global project team. \n\nCharacteristics of Success in the Role: \n\nA focus on effective execution Strategic thinking both technically and business- wise Self motivated / self starter Personal drive to achieve world class software development Desire to work in a fast- paced,  evolving,  growing,  dynamic environment Love of technical challenges and a sense of pride in solving them Ability to work well in a cross functional environment", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["development", "code", "technical", "software", "testing", "developing", "JSON", "Drupal", "jQuery", "application", "Coding", "web", "XML", "service", "MySQL", "Wordpress", "Javascript", "PHP", "XHTML", "programming"]}