{"JOB DESCRIPTION": "         Job Summary:                 Our Data Analytics Practice creates accelerators, solutions, products that cover the entire lifecycle of information utilization, from ideation through implementation. At the outset, we offer consulting and development services to help our clients define their strategy and solution architecture. Then our teams deliver and manage data warehousing, business analytics and reporting applications that provide tangible business benefits. We have also incubated a cyber security analytics product - Elysium Analytics.               Were looking for someone that can help us to solve the data challenges that we know we have, as well as help to identify new opportunities to leverage data and design to explore exciting and meaningful problems.                Prospective candidates will have a very strong understanding of software development process, specifically in the coding in languages such as Python, SQL, Javascript and Java. We seek candidates who are willing to take responsibilities and help us develop the next generation of our product.                 Responsibilities:                Involve in the design of software components, systems and features.             Code custom applications in the companys development ecosystem.             Work with other System Engineers and Software Developers to perform Data Engineering/Data Science activities.             From results, propose and approve analytics to enhance knowledge and capture value of data.             Actively mindful of applicable software development technologies trends, and able to integrate them to our products.                Qualifications:                 Bachelors Degree in Computer Science or related field             Experience in SQL or Python or Javascript (2 or more programming languages).             Experience with open source and enterprise data science, collection, database, and dissemination systems like Kibana and Python in a data analytic environment is a plus.             Thoughtful, team-oriented, and willing to challenge status quo             Ability to work creatively and analytically in a problem-solving environment.        ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Computer science", "Solution architecture", "data science", "Business analytics", "Consulting", "Javascript", "Data analytics", "Analytics", "SQL", "Python"]}