{"JOB DESCRIPTION": " Job description   We are looking for Full Stack Developer who will work within our development team and possess general skills across a number of technologies. This role will cover most aspects of the software development cycle, including requirements capture, development and testing. Working within a small team of skillful developers, the developer will contribute to further development, support and maintenance of our eGain Analytics software.   Responsibilities    Contribution to most levels of our extensive system architecture, predominantly mid-tier like the Application Server     You will build and deliver high-quality, high-volume, high-availability and high-performance solutions to our enterprise grade global customer base as well as our cloud based SaaS offering     Actively assist QA with acceptance criteria     Assist Technical Support in supporting customer-escalated product issue and queries     Provide support for the team s continuous integration practice, but extending/ maintaining CI scripts, etc., when required     You will analyze code quality and continually assess risk to ensure that high quality solutions are delivered     You will be responsible for on-time delivery and ensuring your work meets the technical standards of the department    Requirements    Demonstrable experience of application level .NET development using C# and ASP.NET     Experience of integrating Web Services     Working knowledge of Microsoft SQL Server and experience of development using Entity Mapping Frameworks     Ability to write well structured, testable, easy to understand code     Self-motivated, professional, enthusiastic, reliable     Ability to work well in a team, and problem-solve collaboratively     Quick learner, capable of learning new technologies in a short period of time     Up to 4 years of relevant experience     Engineering degree preferred    Desirable skills    Experience working with the SQL Server BI stack (SSIS, SSRS, SSAS)     Experience of development using Entity Mapping Frameworks     Working knowledge of common web technologies, e.g., JavaScript, HTML5, CSS, AngularJS  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["System architecture", "MS SQL", "Web technologies", "SSRS", "Javascript", "SSIS", "Customer engagement", "Technical support", "Analytics", "SQL"]}