{"JOB DESCRIPTION": " Experience and expertise with C (including modern C syntax, MISRA C)   Experience in Firmware and Device Driver development in Micro-controllers Micro-processors.   Experience in Microprocessor fundamentals - Interrupt processing, registers, assembly code, etc.   Experience in Micro-controller fundamentals - ADC, DAC, Timers, PWM, DMA, watchdog, etc   Experience in working on different micro-controller (like 8051, PIC, NXP LPC1114, AVR, ARM-Cortex, etc.) and microprocessors.   Experience in some circuit designing software like Proteus, eagle, Allegro, OrCAD, etc.   Knowledge of symmetric design Protocols: I2C, SPI, CAN, UART.   Knowledge of Advanced Protocols like SATA, PCIe, USB, CAN, MOST.   Experience in Wireless communication systems like Zigbee, BLE, Wi-Fi, Bluetooth, RF, GPS, GSM, etc.   Knowledge of ARM ProcessorEmbedded Linux will be a plus point.   Understanding of networking and network protocols will be treated as a plus point.   Understanding the different operating systems like WindowsLinux.   Experience in Linux fundamentals, driver writing, shell scripting.   Knowledge of electronics like schematics reading, using an oscilloscope, Multi-meter, soldering iron.   Knowledge of FPGAASIC design, DSP.   Knowledge of build Environments like makefile, CMake.   Knowledge of Software engineering like SDLC, CMMI, agile methods e.g. SCRUM, version control (ClearCase, GIT, SVN), bug tracking (JIRA), static code checking, Lint, unit testing, continuous integration.   Experience with Agile software development processes.   Experience with Test-Driven Development (TDD) and software test automation   Experience with UDP, TCPIP, CAN networking communication protocols   Experience with Internet of Things (IoT) and telematics technology     ", "ROLE": "Team Lead/Technical Lead", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Embedded, EDA, VLSI, ASIC, Chip Design", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["GSM", "software development", "c", "USB", "unit testing", "testing", "networking", "Windows", "SDLC", "git", "linux", "Shell scripting", "CMMI", "software engineering", "Scrum", "agile", "Firmware"]}