{"JOB DESCRIPTION": " The Senior Software Engineer/Developer is responsible for developing solution component architectures to support business processes. He/she must have a strong understanding of application design and development, as well as proven ability and a strong desire to work in teams. The Senior Software Engineer/Developer's core activities include designing and implementing systems based on the Microsoft suite of products and architectures. He/she will be responsible for designing and building component-based enterprise solutions using the most advanced Microsoft technologies. The Senior Software Engineer/Developer's background must be in Technical Consulting and/or Software Engineering using methodology-based system development.     Qualifications Experience      Bachelor's Degree in Computer Science, IT, Engineering, or similar field.    Microsoft Certified Solutions Developer (MCSD) certification.    Minimum of five years methodology-based system development experience.    Experience developing, customizing, and implementing software solutions according to specific customer requirements.    Application development experience (Visual Basic, Visual C++, Visual J++, Visual InterDev).    Internet development experience (HTML, Active Server Pages, IIS, Commerce Server).    Experience with messaging technology (Microsoft Message Queue).    Experience with transaction processing technology (Microsoft Transaction Server).    Experience with data access technology (ActiveX Data Objects, SQL Server).    Experience with host integration technology (network, Babylon, COM Transaction Integrator).    Experience with B2B enablers (XML, BizTalk).    Demonstrated ability to quickly learn new products and technologies.    Ability to handle pressure situations.    Excellent organizational and problem-solving skills.    Attention to customer service.    Ability to interface effectively and decisively with other units, departments, and customers.    Ability to set and achieve goals.      Skills      Experience in operating system services (Windows 2000 Professional, Server, Advanced Server, Datacenter Server, Windows NT, Windows 95/98, Windows CE).    Experience in directory services (Active Directory).    Experience in security services (Active Directory, Kerberos, PKI, Proxy Server).    Experience with network protocols/services (TCP/IP, Netware, netbeui, Ethernet, Fast Ethernet, Token Ring, FDDI, ATM, gigabit Ethernet, frame relay, T1/E1).    Experience with network infrastructures (LAN, WAN, routers, switches, hubs, premise wiring).    Experience in operations management (Systems Management Server, helpdesk, SNMP).    Experience in back-office services (Exchange).   ", "ROLE": "Design Engineer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "Engineering Design, R&D", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Engineering Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Engineering"]}