{"JOB DESCRIPTION": "Golang Developers Striving for excellence is in our DNA. Since 1999, we have been innovating the way the world communicates, continuously raising the bar through enhanced speed, ease and simplicity of Cloud Communication solutions, adopting cutting-edge technologies to meet the discerning needs of a diverse clientele, from enterprises to carriers across geographies.  Tanla is looking for GoLang Developers with 2-6 years of experience with excellent programming skills to join our team. As a Golang Developer youll have a significant influence on the company's technical platform and will get to work on the cutting-edge products.   Who we are looking for  Minimum of 2 years of professional experience Minimum of 1 year of hands-on knowledge & experience in Golang and implemented key aspects of an end-to-end solution in a production environment is a must  Experience with programming and scripting languages is preferred like: Python, Ruby or similar languages. Good Understanding of SQL/NoSQL databases Good understanding of version control systems (git/svn) is a must Good to have understanding of message queues (RabbitMQ, Kafka etc) Familiarity to MVC, SOA, RESTful web services Familiarity with best practices of TDD Good to have knowledge of JavaScript (AngularJS/ReactJS)/HTML/CSS/JQuery front-end code Experience with microservices based architecture is a plus  Your Qualifications Bachelor’s Degree or higher in Engineering, Computer Science or another relevant field At least 2-6 years’ experience in product development environments. ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["Angularjs", "CSS", "Software Development", "Front End", "Web Technologies", "Javascript", "HTML", "MVC", "JQuery", "Web Services"]}