{"JOB DESCRIPTION": "  Job Description     We are looking for a PHP Developer responsible for managing back-end services and the interchange of data between the server and the users.   Working as part of our lively and expert development team, as Lead Web Applications Developer, you will have a key role in developing, managing and delivering high quality web applications with additional responsibility for the technical quality of production and delivery of development on-time.    You will also communicate to the management team and your   colleagues on each project?s status whilst ensuring the highest level of quality in our work through code reviews, appraising technical aspects of work and monitoring efficiency against budget.    Your primary focus will be the development of all server-side logic, definition and maintenance of the central database, and ensuring high performance and responsiveness to requests from the front-end.    You will also be responsible for integrating the front-end elements built by your co-workers into the application. Therefore, a basic understanding of front-end technologies is necessary as well.      Responsibilities       Integration of user-facing elements developed by front-end developers.        Build efficient, testable, and reusable PHP modules        Solve complex performance problems and architectural challenges.        Integration of data storage solutions         Skills and Qualifications      Strong knowledge of PHP web frameworks {{such as Laravel, Codeingater, etc depending on your    technology stack}}        Understanding the fully synchronous behavior of PHP        Understanding of MVC design patterns        Basic understanding of front-end technologies, such as JavaScript, HTML5, and CSS3        Knowledge of object oriented PHP programming.        Understanding accessibility and security compliance {{Depending on the specific project}}        Strong knowledge of the common PHP or web server exploits and their solutions       Understanding fundamental design principles behind a scalable application.    User authentication and authorization between multiple systems, servers, and environments.    Integration of multiple data sources and databases into one system.    Familiarity with limitations of PHP as a platform and its workarounds.    Creating database schemas that represent and support business processes    Familiarity with SQL/NoSQL databases and their declarative query languages.    Proficient understanding of code versioning tools, such as Git    Candidates must have a minimum of 1 + years proven experience in a similar role.      The successful candidate should:     Have proven experience in developing and building web applications using PHP    Demonstrate exceptional knowledge of software development.    Demonstrate an understanding of deployment architecture, security and performance.    Have excellent communication skills, both written and verbal.    Experience of integrating third party Travel API / XML.    Programming with PHP.    Object Oriented Design    XHTML, HTML, CSS    Javascript, Jquery, SQL.    AJAX, JSON, XML XLST.    LAMP development experience.    Experience on web service integration.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Software Developer"]}