{"JOB DESCRIPTION": "       Job Description             Nokia Software is the Nokia division that develops products and software-only solutions. Our customers are Telecom operators and various sectors of companies increasingly looking to our \"Software as a Service\" offers.            Big Data Analytics, the Internet of Things, Cyber Security and Cloud are the main topics at the heart of our portfolio and enable us to create the ultra-connected world in which we will live tomorrow at the heart of smart cities, using autonomous cars and health services and public safety connected.            Come and join our team to ensure that this connected world will be safe, secure and respectful of our privacy.            You will benefit from Nokia s 15 years of experience in this area, giving you the opportunity to further increase your skills.            Finally, as a Nokia employee, the world will be your workplace. You will have to interact with colleagues, partners and customers from many other countries and cultures.             Job Responsibilities & Competencies               The main responsibilities will be to develop and test front end UI and browser plugins.               Required Minimum Qualifications: (Education, Technical Skills/Knowledge)               Bachelor s degree or equivalent experience required, Candidates with degree in a technical field (CS, EE, etc.) will be more relevant                At least 0-3 years of experience in the software development industry               Technical Skills:               knowledge of Java, REST APIs, Javascript                Knowledge scripting languages (e.g., Bash/Shell scripting, Perl, Python, etc.)                Knowledge of technologies like (ReactJS, Redux)                Knowledge of tests automation tools (Junit, Jenkins, Robot Framework)               Following competencies will be of value:               Knowledge of security domains like (PKI, AAA, Cipher, etc)                Basic knowledge of Telecom (e.g. 3GPP, TCP/IP, OSS, etc)               Non-Technical Skills:               Desire to learn new skills and new technologies                Willingness and ability to work in a fast-paced environment to deliver quality solutions                Creative, problem-solving mind-set and innovative thinking                Excellent interpersonal/team skills                Works independently with minimal supervision                Able to communicate and work within a multi-national matrix organization                Fluent in oral and written English.        ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Telcom, ISP", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Telecom", "Front end", "Business transformation", "cyber security", "Social media", "Network operations", "Shell scripting", "Javascript", "Perl", "Python"]}