{"JOB DESCRIPTION": "The Role: Senior Lead Software DeveloperThe Location: HyderabadGrade: 12AThe Team: Platts Platform team which is responsible for providing data in a single platform for all commodities.The Impact:We are looking for a qualified team leader to lead our team and provide effective guidance. You will be responsible for supervising, managing and motivating team members daily.As a team leader, you will be the contact point for all team members, so your communication skills should be excellent. You should also be able to act proactively to ensure smooth team operations and effective collaboration.Ultimately, you should lead by setting a good example and engage the team to achieve their goals following the Agile methodology in a Scrum environment.What’s in it for you:Responsibilities:Create an inspiring team environment with an open communication cultureDelegate tasks and set deadlinesOversee day-to-day operationMonitor team performance and report on metricsMotivate team membersDiscover training needs and provide coachingListen to team members’ feedback and resolve any issues or conflictsRecognize high performance and reward accomplishmentsEncourage creativity and risk-takingSuggest and organize team building activitiesCollaborate with product and business teams to define our product, balancing features with time to marketCollaborate effectively with technical and non-technical stakeholders Setup?a strategy to implement the stories. Build or Enhance features in respect to the stories with defensible coding strategies. Delivery with best quality. Work independently to delivery software on timeFollow Agile best practices and attend all Scrum ceremonies Analyze and recommend solution design (Design Guidance) Make sure that code review tasks on all user stories are added and timely completed Participate in product design, offer new ideas and understand that not every idea will be adoptedWhat we’re looking for:Basic Qualifications:Proven work experience as a team leader or supervisorIn-depth knowledge of performance metricsExcellent communication and leadership skillsA minimum of 10+ years of strong experience in application development. 2+ years of building web applications using ReactProficient with software development lifecycle (SDLC) methodologies like Agile, Test- driven development. Strong command in JavaScript-frameworks like ReactJS, HTML 5, CSS, XML/XSLT and JQueryExperience consuming APIs to interact with other applications using REST or GraphQLExperience in working in an agile environment to quickly iterate and deliver features to usersKnowledge of object-oriented design, Cross-browser Compatibility, Responsive UI Good understanding of Design Principles & excellent communication skills Bachelor’s or master’s degree (or higher) in a relevant discipline, or equivalent work experienceKnowledge of system architecture, designpatterns & ability to work in layered architecture: Presentation, Service, Business & Data. Nice to have – .NET, Knockout JS, requireJS, VSTest/ MSTest/ nUnit", "ROLE": "Team Lead/Technical Lead", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["CSS", "Html5", "Web Technologies", "XML", "Graphql", "Mstest", "Javascript", "Requirejs", "HTML", "JQuery"]}