{"JOB DESCRIPTION": "We are looking for engineers to design and develop from the scratch. She/he is responsible for design, develop, quality of the deliverables. Engineers get to significantly amplify their impact with the scale.Responsibilities :- Design/development the product from the scratch- High levels of ownership of systems in your team- Collaborate with internal teams to identify system requirements- Write clean, well designed code- Contribute in all phases of the product development life-cycleWhat experience we'd like you to have :- Extensive and expert programming experience in any one programming language (strong OO skills preferred)- 3 to 6 Years of experience in Core Java- Very Strong on Spring Boot or Microservices- A solid foundation in computer science, with strong competencies in data structures, algorithms, and software design.- Have a penchant for solving complex and interesting problems- Worked in start-up like environment with high levels of ownership and commitment- BE/B.Tech, ME/M.Tech, or PhD in Computer Science or related technical discipline (or equivalent).- Excellent coding skills - should be able to convert design into code fluently Good skills to write unit & integration tests with reasonable coverage of code & interfaces - TDD is a plus- Experience in building highly scalable web applications", "ROLE": "Software Developer", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - eCommerce, Internet Technologies", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "MS/M.Sc(Science) in Computers, M.Tech in Computers, MCA in Computers", "DOCTORATE": "Doctorate Not Required, Any Doctorate in Any Specialization"}, "KEY SKILL": ["fault tolerance", "high volume", "Data Structures", "tenancy", "Spring Boot", "Microservices", "distributed Systems", "high availability", "Core Java", "Algorithms", "Scratch", "low latency", "Coding", "Concurrency", "Dynamic Programming", "startup", "Software Design", "Parallel Programming"]}