{"JOB DESCRIPTION": "Job Requirements : - The .NETC# Software Developer develops strategic solutions for new services and functionality. This role designs software and participates in programming, testing and documentation through the entire Software Development Life Cycle (SDLC). Timely and effective communications to the team, organization and outside vendors are regularly disseminated as part of this job function. - Experience with the following: progressively diverse analysis, development, and testing experience - Web development using ASP.NET framework, C#, MVC, Kendo, and Telerik - Visual Studio environment (2010 and 2013) - Object OrientationClass design - SVN - XMLXSLT - Build and optimize SQLQueries and Stored procedures - HTML5, CSS, Javascript, JQuery, experience with Atalasoft andor Selenium highly desirable AJAX Html - Web Services - WCF, REST - ASP.NET web applications, jQuery, AJAX - .NET MVC and .NET Web Forms: MVC4 andor Web Forms - Relational Database Experience such as Oracle (preferred), SQL Server - Database Skills: PLSQL, Packages, Stored Procedures, Triggers etc - XML, XSD, WSDL, SOAP, WCF - Multi-threaded software solutions (desirable) - Must be able to switch among tasks on a frequent basis and remain productive - Should have superior debugging skills - Good interpersonal skills in order to interact with the clients and other technical staff - Strong written and oral communication skills are essential Education, Certifications, or Special Licenses : - Formulate and define system scope and objectives for assigned projects - Extensive experience with the most current software engineering standards, practices, methods, tools and trends - Serve as technical expert on development, coding, testing and debugging stages of application and system integration - Knowledge of JavaScript is a plus. - Knowledge of NODE JS is a plus.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Electrical, Computers, BCA in Computers, B.Sc in Computers", "PG": "MCA in Computers, M.Tech in Computers, MS/M.Sc(Science) in Computers", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["C#", "Multithreading", "OOAD", "Javascript", ".Net", "MVC", "Webservices", "WCF", "SDLC", "ASP"]}