{"JOB DESCRIPTION": "Roles and ResponsibilitiesJob Profile - .Net Developer (3 vacancies)Job Location : Thane ( WEST) Overall Purpose of the job Develop solutions based on customer requirements. Carry out the system analysis and the detailed design process, and ensure that the end product is delivered on time and within budget.Main duties and responsibilities Carry out solution development which will involve the following:1. Detailed Design based on user stories and prototyping.2. Prototype POC and Mock up. 3. Prepare and execute Unit Test Cases4. Develop features which will involve developing new forms, customizing existing forms using Visual Studio IDE, and other tools like DevExpress, Telerik, Infragistics, Javascripts, JQuery, Crystal Reports and SSRS.5. Develop custom reports using Crystal Reports or SSRS.6. Provide post deployment support to the implementation team until the product is live and transition to support phase.7. Software Configuration Management and source code control.8. Produce various statistics and periodic reports as per the company requirements.- Principal qualifications required for job Must possess a Bachelors Degree in Computer Science with major in Software Engineering, or equivalent.- Must have minimum of 3 years of experience in bespoke software development using Microsoft product stack.- Key competences Must have development experience in Visual Studio.NET platform and in Microsoft SQL Server 2012 or higher. Should have a development experience using Object Oriented and Service Oriented Architecture.- Must have demonstrable knowledge and experience in programming languages C# and Linq.- Must have demonstrable knowledge and experience in developing solutions using MVC architecture and SOA.- Must have demonstrable knowledge of web applications using Microsoft .Net platform.- Candidates with working knowledge in Xamarin toolset have an added preference.- Must have expert knowledge of UML.- Microsoft Developer Certification is desired upon joining; however the candidate will only be confirmed from probation after completing the required certification. - Must have working knowledge of following Software Requirements Specification standards like ISO 29148:2011.- Must have developed reports using reporting tools like SSRS or Crystal Reports. - Must be able to independently create and perform unit test cases. - Be able to effectively use test case management and defects management software.- Must be able to deliver on time and support meeting overall company deadlines.- Must have excellent interpersonal and communication skills.- Must have previously worked in an environment where standard Software Development Methodology like Agile was being followed and has demonstrable knowledge of tools like TFS, version control system and be able to follow set processes within the organization.- Ability to travel abroad for a period of one to three months at a stretch.- Candidates who are not working on Microsoft products stack may not apply.Name Current Company Designation Applied For Total Ex. Relevant Ex. Current CTC & In Hand CTC Expected salary Notice period & whether it is negotiable Current Precise location Reason For Change Any other remarks considered", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "BCA in Computers, B.Sc in Any Specialization, B.Tech/B.E. in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["C#", "TFS", "LINQ", "SSRS", ".Net", "Crystal Reports", "SQL Server", "Visual Studio", "ASP"]}