{"JOB DESCRIPTION": "Roles and Responsibilities Job  Responsibility 1. Work with development teams and product managers to ideate software  solutions 2. Design client-side and server-side architecture 3. Build the front-end of applications through appealing visual design 4. Develop and manage well-functioning databases and applications 5. Write effective APIs 6. Test software to ensure responsiveness and efficiency 7. Troubleshoot, debug and upgrade software 8. Create security and data protection settings 9. Build features and applications with a mobile responsive design 10. Write technical documentation 11. Work with data scientists and analysts to improve software  Skills Required Primary Skills :-  React.js, Node js and MS Sql server.  Secondary Skills : - .Net C# ,Vb.net , Angular ,Asp.net  Web api  must       have implementation experience. Required       Experience – 3 to 4 Years.    Proven experience as a Full  Stack Developer or similar role   Experience developing desktop  and mobile applications   Familiarity with common stacks   Knowledge of multiple front-end  languages and libraries (e.g. HTML/ CSS, JavaScript, XML, jQuery)   Knowledge of multiple back-end  languages & frameworks (e.g. MVC, C#, ASP.NET, Vb.net) and JavaScript  frameworks (e.g. Angular, React, Node.js)   Familiarity with databases  (e.g. MS-SQL), web servers (e.g. IIS) and UI/UX design   Excellent communication and  teamwork skills   Great attention to detail   Organizational skills   An analytical mindWFH position , Visit to  Kundli (Sonipat) as and when required ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Freelance/Homebase", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Node", "MS SQL Server", "React.Js", "C#", "CSS", "Front End", "Javascript", "Asp.Net Web Api", "HTML", "JQuery", "Angular"]}