{"JOB DESCRIPTION": "Roles and Responsibilities RequirementsThe candidate will need to have a complete understanding of the core LAMP Platform. To be successful in this role, the candidate must be a quick learner, able to adapt and understand various businesses, have stellar software development, and great communication skills. In this role the candidate will be working as a full-stack engineer developing front end and server side components of the product with a strong emphasis on reliable, maintainable, and scalable software that runs in a high volume, high availability environment.The Software Engineer will be responsible for providing input to product release plans that cover project inception through delivery and on-going operational maintenance. They will be expected to analyse and solve complex application related problems; review work of other developers for correctness, adherence to the product design concept and user standards.Essential SkillsOther essentials: Good Spoken and Written English skills. Self-Motivated and exceptional real time problem solving & team Leadership skills. Desired Candidate Profile 1. Strong knowledge of Software Development Life cycle and Agile Methodologies. 2. Bachelor's degree (BE/B-Tech) in Computer Science or related field3. Ability to analyze complex requirements and design documents to create excellent deliverables. 4. Ability to design, develop, test, integrate, deploy, and support/maintain scalable Open Source web applications utilizing PHP and MySQL on Apache. 5. In addition to PHP, experience with HTML 5, CSS 3, JavaScript, jQuery, bootstrap, MySQL database design, and query optimization is crucial. 6. Should have knowledge of working with PHP Frameworks 7. Experience with cloud-based deployments, integration experience using RESTful API and web services is a plus. 8. Excellent oral and written communication skills. 9. Ability to work productively in a dynamic, priority shifting, deadline-driven environment. 10. Excellent organizational, presentation and business analysis skills. Perks and Benefits ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Temporary/Contractua", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "MS/M.Sc(Science) in Any Specialization, M.Tech in Computers"}, "KEY SKILL": ["CSS", "Front End", "Html5", "Php Frameworks", "MySQL", "Javascript", "Bootstrap", "HTML", "LAMP", "JQuery", "Laravel", "Codeigniter"]}