{"JOB DESCRIPTION": " Senior Software Engineer position responsible for design, implementation, and support of Python based applications to help fulfill their Research & Consulting Delivery strategy.    Designing, implementing, unit, integration testing and supporting applications.   Establish methodologies for quickly rolling out new data analysis capabilities for standalone data-driven products and service to support their associates.   Have end-to-end responsibility for leading projects focused on extracting, merging, analyzing and managing large sets of data across multiple, disparate databases   Be able to transform unstructured raw data in to formats suitable for modeling   Demonstrate a deep knowledge of and ability to operationalize, leading data technologies and best practices   Lead the review and analysis of business requirements to create technical specifications   Lead and participate in code reviews, peer inspections and technical design\\/specifications   Prepare and provide adequate (quality and quantity) documentation for work products.   Work with cross-functional teams to resolve business process issues and identify business process improvement opportunities   Responsibility for resolving all issues assigned in a timely manner   Ownership for development of application architecture and delivery of technical solutions that meet business requirements   Ensure that all applications conform to system and programming standards and are appropriately documented   Perform support and maintenance tasks to address production issues reported by clients   Manage formal and informal project communication amongst team and with other project participants using methods appropriate to audience and type of communication   Evaluate developers following project completion identifying strengths and areas for development via a formal, written performance appraisal.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Data analysis", "Business process improvement", "Technical design", "Consulting", "Integration testing", "Programming", "Performance appraisal", "application architecture", "Management", "Python"]}