{"JOB DESCRIPTION": " Works independently under limited supervision and applies knowledge of subject matter in Applications Development. Possess sufficient knowledge and skills to effectively deal with issues, challenges within field of specialization to develop simple applications solutions. Second level professional with direct impact on results and outcome.    Your future duties and responsibilities:     Should be able to work on development activities related to Python Web development(Django and Flask).   Knowledge of RDBMS and SQLPL-SQL, writing queries, stored procedures and scripts Familiarity with Linux commands is required.   Knowledge of Perl is optional. Python Python Core Django Flask Python Libraries File operations in Python MVC Framework Version Control Linux command Command Line Argument   Good experience of working in fast paced environment for project end to end implementation Build or Enhance features in respect to the stories with defensible coding strategies. Delivery with best quality.   Collaborate effectively with technical and non-technical stakeholders   Excellent Analytical and communication skills are essential, with strong verbal and writing proficiencies.   Ability to lead test efforts, motivate and mentor staff. Work in the Agile environment and adhere to all best practices.   Follows Agile best practices and adheres to the Scrum framework Active co-operationcollaboration with the teams at various geographic locations   Analyze stories that have been written by Product Owner and perform an estimation of the complexity Focuses on continuous improvement   Communicates risks to upper management and peers    Required qualifications to be successful in this role:     Primary Skill: Python Developer   Secondary Skill: SQL, DW   Experience: 4-6 Years    Skills:     Jenkins   GIT   GIT   Python   Pytest   OpenShift  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Linux", "RDBMS", "Coding", "Web development", "Agile", "Perl", "Scrum", "Stored procedures", "SQL", "Python"]}