{"JOB DESCRIPTION": " Responsibilities and Duties    Create back-end code and reusable objects in PHP.    Solve complex performance challenges.    Produce detailed specifications.    Be part of the entire development life cycle.    Support front-end developers and integrate their work with the app    Inexhaustible drive to quickly learn, adapt and experiment with new technologies    Full stack web development for internal products and solutions.Required Experience, Skills and QualificationsExperience 2+ years in building technology products on open source technology.Well-versed with OOPS concepts and must have developed custom modules, plugins, templates, etc.Keen understanding of MVC frameworks.Keen understanding of analyzing MySQL queries for performance and writing queries that will scale well.Worked on scalable web-based products, e-commerce sites, etc. Magento added advantage.Keen understanding of website development and user experience.Worked in troubleshooting PHP and MySQL to ensure performance and scalability issues can be solved.Strong knowledge of PHP web frameworks Understanding the fully synchronous behavior of PHPBasic understanding of front-end technologies, such as JavaScript, HTML5, and CSS3Creating database schemas that represent and support business processesFamiliarity with mysql database and their declarative query languages.Required Experience :  2 years & above Interested candidates can apply / revert with their updated resume.Regards,HR Team Craftsvilla", "ROLE": "Software Developer", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Sc in Computers, B.Tech/B.E. in Computers, BCA in Computers", "PG": "MCA in Computers, MS/M.Sc(Science) in Computers, M.Tech in Computers"}, "KEY SKILL": ["MySQL", "PHP", "MVC", "Software Development", "CSS", "Symphony", "Html5", "Magento", "Web Development", "Laravel"]}