{"JOB DESCRIPTION": "Job DescriptionSenior Software Engineer (UI Developer) JDCompany \n\nSkillsoft is the global leader in eLearning we train more professionals than any other company in the World,  over 400 million learners and currently supporting more than 6000 customers including half the Fortune 500!\n\nPosition\n\nTo succeed in this challenging journey we have setup multiple co- located team across the globe (Hyderabad,  US,  Europe),  embracing the scaled agile framework,  a Micro Services approach combined with the DevOps model. We have passionate engineers working full time on this new platform in Hyderabad and it s only the beginning. You will have the chance to work with brilliant people and some of the best development and design firms in addition of working with cutting edge technologies as React,  Elixir,  Node.js,  Ruby,  Docker,  Kubernetes.\n\n\n\nWe are looking for exceptional UI full stack developers to join our team and also learn new technology as Node.js which some of our teams already use. You will work jointly with existing engineering team,  Architect and DevOps to form a fully autonomous development squad and be in charge of one part of the product.\n\nDesired Experience ( = required)\n\nMinimum 6+ years of software engineering development experience background working with developing cloud based enterprise solutions. \n\nExperience in any programming languages (Java,  Ruby,  Elixir,  JavaScript/ jQuery,  HTML5,  CSS)\n\nExperience in Javascript frameworks (Node.js,  React,  Redux,  AngularJS,  Express.js,  Bootstrap)\n\nExperience in UI Test frameworks (CasperJS,  PhantomJS,  Mocha,  Jasmine,  Enzyme, JEST,  Selenium,  etc.)\n\nAdvanced design,  debugging and coding skills\n\nProficient building responsive cross browser UI s\n\nExperience with code versioning tools,  preferably Git (Github) and the feature branch workflow\n\nGood knowledge in working with REST API,  Web services, GraphQL and SAML integrations\n\nGood knowledge on Browser Developer Tools,  Responsive design \n\nExperience working with databases preferably Postgres.\n\nExperience with DevOps (Docker,  Kubernetes,  Ansible,  AWS)(Good to have)\n\nExperience with automation tools like Maven,  Gradle,  NPM,  WebPack,  Grunt\n\nMust know how to code applications on Unix/ Linux based systems.\n\nExperience in working with Agile/ Scrum environment.Release/ PI Planning\n\nPrepare for Release Planning,  including:\n\nSupport Product Management in program backlog refinement,  and estimating features and epics.\n\nActively participate in Release Planning:\n\nEstablish own capacity/ velocity for each increment.\n\nSupport story refinement,  help identify risks and dependencies.\n\nSupport the Agile Team in establishing achievable PI objectives.\n\nHelp to identify dependencies and foster cross team co- ordination.\n\nCommit to the mutually agreed plan.Iteration Planning\n\nPrepare for Iteration Planning,  including:\n\nActively participate in backlog refinement sessions in collaboration with other Agile team members.\n\nIdentify and capture backlog items local to the team,  such as defects and refactors.\n\nActively participate in team planning and contributing to team goals.\n\nVolunteer for and commit to delivering stories and tasks within the iteration.Education and Certifications:\n\nBE or MCA or equivalent preferred", "ROLE": "Software Developer", "INDUSTRY TYPE": "Education, Teaching, Training", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Unix", "Maven", "jQuery", "Linux", "Coding", "Debugging", "Agile", "Workflow", "Selenium", "Ruby"]}