{"JOB DESCRIPTION": " Description    The successful candidate will be part of the Product Engineering department which is responsible for a wide range of SaaS products. They will develop new features and products as part of a sprint team. They will also be part of a front line team responsible for handling tickets coming from other departments and customers.     Skill Set       Strong skills in at least one modern Object-Oriented programming language. (Python or PHP an advantage)      Understand Relational databases and be able to use their CRUD functionality.      Comfortable using HTML 5, CSS and Javascript to create web pages.      Capable of using a RESTFul API and understanding its basic operations.      Experience using Linux OS and comfortable using its command line.       Technology Stack we use:       Python 3.x      Python Flask      PHP and CakePHP 3.x.      HTML 5, CSS and Javascript      MySQL/MariaDB      Amazon AWS: EC2, ECS, S3, SQS, SNS, RDS, IAM and Lambda.      Linux OS      Docker       Software Services you will be working on:       Web portal for customers to manage/schedule/report tests (Check spearline.com for exactly what we test).      Internal web tools for Testing Support and Customer Engagement team.      Bespoke reports for customers.      Auditing tools that test customers' web pages for correct information.      Monitoring/alerts software.      Scheduling software for tests.      And lots more.       Role Responsibilities:       Develop software using Python 3.x, Flask, PHP, Javascript, HTML 5 and CSS.      Be part of a Sprint team, partaking in stand-ups, planning poker and reviews.      Deal with requests as part of a Front Line team. Responding to tickets, fixing issues, or escalating as appropriate.      Finish development tasks assigned to you, in a timely manner and to a high professional standard.    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Telcom, ISP", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Product engineering", "Linux", "MySQL", "Javascript", "PHP", "CakePHP", "Scheduling", "Monitoring", "Software services", "Python"]}