{"JOB DESCRIPTION": " About Optimum:Optimum Solutions is a Singapore based full spectrum Software Solutions and Managed Services Company. Software services from Optimum are designed to deliver Enterprise Client-Server/ Multi-tier and Web based solutions across the entire value chain, spanning on-site consulting services to turnkey software projects. We started our operations in March 1997. Since then, we have grown to 2000 plus consultants working with us and have developed into a rapidly growing, highly competitive and responsive organization with professional management, strong technical and financial resources and commitment to fully serve its clients in Singapore, China, USA, Malaysia, Philippines & India.We have multiple job opportunity for Software Developer (NodeJS and ExpressJS) position for one of our prestigious clients in Singapore.Job Location: India and SingaporeJob DescriptionSkills: •     At least 4-5 years of relevant experience Work in a cross-functional team consisting of software engineers, DevOps, and other specialists Experience with modern tech stacks, such as NodeJS, ReactJS, VueJS, ExpressJS and associated ecosystems. Familiarity with Cloud platforms e.g. AWS, Azure, Google Cloud, Automated Testing Tools, Docker and/or other related container technologies/tools, CI/CD pipeline tools.If you are interested in this job opportunity, please send the following details to subramaniyan.narayanan@theoptimum.net to discuss:1. Updated word format CV2. Current / Last salary3. Expected salary4. Notice period5. Reason for leaving present/last job6. Years of experience in NodeJS and ExpressJSBest Regards,Subramaniyan NarayananManager - Talent AcquisitionOptimum Solutions (S) Pte Ltd1 Changi Business Park Crescent,#03-09, Plaza8@CBP, Podium B, Singapore 486025Mobile: +65 97124077, Office: +65 62360736Email: subramaniyan.narayanan@theoptimum.netWebsite: www.theoptimum.net", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["Express", "Node.Js", "React.Js", "CSS", "Software Development", "Front End", "Software Services", "Web Technologies", "Bootstrap", "Client Server", "Managed Services", "HTML"]}