{"JOB DESCRIPTION": "     The full time position is open for an experienced Full Stack Developer that will support several of our clients systems.    Client satisfaction is our primary objective; all available positions are customer facing requiring EXCELLENT communication and people skills.    A positive attitude, rigorous work habits and professionalism in the work place are must. Fluency in English, both written and verbal are required.   The successful candidate should be a self-starter, who will proactively find and address issues. The individual must be comfortable working in a very fast-paced, busy environment in the rapidly growing services industry.     Job Responsibilities:    Should be able to develop and maintain large enterprise application   Will be responsible for maintaining end to end application   Will be developing and maintaining JAVA Springboot and ReactJS based application   Maintain cloud based web application    Job Requirements:    4-6 years of experience in design development of software using JavaScript, React.js and Java (8 or latest version)    Experience in Front end technologies like Java script, React JS, HTML and CSS   Experience in Spring, Spring boot, Microservices and Docker   Experience in developing web services in REST, SOAP and JSON-RPC.   Experience in scripting language: JavaScript, ES6.   Experience in RDBMS (MySQL/MariaDB), No-SQL databases (Redis/MongoDB)    Experience in working on AWS is plus    Good to have basic knowledge on tools like New relic and Basic network usage.   Good to have experience in New Relic  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Client satisfaction", "Front end", "RDBMS", "MySQL", "Design development", "HTML", "JSON", "MongoDB", "SQL"]}