{"JOB DESCRIPTION": "       Responsibilities:          Understand the client business domain, requirements and map them to technical solutions.      Writing reusable, testable, and efficient Server side code.      Design and implementation of scalable, low-latency, high-availability, and performant application/architecture.      Maintain high standards of software quality within the team by establishing good development practices.      Ensure the team meets overall development goals in accordance with the Sprint plans, client requirements and project milestones are met.      Take ownership of product features from conception to implementation, testing, deployment and support.       Requirements      A minimum of 3 years of hands-on experience with core back-end engineering.        An understanding of how Python works and its impact on the overall performance of server side applications.        A demonstrable track record in developing and delivering high quality, efficient and optimised software solutions to tight deadlines.        Able to accurately estimate development and testing efforts.      Strong ability to design APIs and Database schemas based on customer requriements      Experience with contanarization, load balancers, proxies and cloud technologies (AWS) is required      Must have managed teams of 3-4 junior developers      Good understanding of various design and architecture patterns      Strong experience in Django and Django Rest Framework      Experiance in building RESTfull web Services      Experiance with SQL, Non SQL and Redis database.      Knowledge of user authentication and authorization between multiple systems and servers      Experience working with Elasticsearch, GraphQL and CI/CD tools      Basic understanding of front-end technologies, such as JavaScript, HTML, and CSS     ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Front end", "Enterprise applications", "Django", "Javascript", "Developer", "HTML", "software quality", "application architecture", "SQL", "Python"]}