{"JOB DESCRIPTION": "  Job description:        7 to 10 years of experience with developing end to end solutions using Microsoft Stack of Technologies.     Strong working knowledge on server side development (backend - Asp.net MVC Web API, Entity Framework)     Good working knowledge of MSSQL SQL, T-SQL etc.     Strong working knowledge of application development using .NET Core, C#     Strong experience in designing and working with n-tier architectures     Hands-on experience in unit testing (NUNIT or VS Unit Test)     Working knowledge of TypeScript, Angular JS, Angular 8 , HTML5 and CSS3 technologies     Should have worked on at least one SOA (Service Oriented Architecture) project     Good understanding of   UML  , object-oriented programming (OOP) and Object Oriented Design principles     Strong knowledge of software implementation best practices     Should have worked in an AGILE practice methodology (preferably SCRUM)     Able to provide technical recommendations and solve technical problems     Must be a quick learner     Experience:     7 to 10 years of experience with developing end to end solutions using Microsoft Stack of Technologies.     Strong working knowledge on server side development (backend - Asp.net MVC Web API, Entity Framework)     Good working knowledge of MSSQL SQL, T-SQL etc.     Strong working knowledge of application development using .NET Core, C#, WCF     Strong experience in designing and working with n-tier architectures     Hands-on experience in unit testing (NUNIT or VS Unit Test)     Working knowledge of TypeScript, Angular JS, Angular 8 or above, HTML5 and CSS3 technologies     Should have worked on at least one SOA (Service Oriented Architecture) project     Good understanding of UML, object-oriented programming (OOP) and Object Oriented Design principles     Strong knowledge of software implementation best practices     Should have worked in an AGILE practice methodology (preferably SCRUM)     Able to provide technical recommendations and solve technical problems     Must be a quick learner     Technology skills:     Strong and proven background in Information Technology     Strong design skills, Solid principles, Design patterns, documentation of design using UML     Strong working knowledge of .NET Core, C#, MVC, Web services, WCF Rest and WebAPI      Unit testing :   NUNIT or VS Unit Test     TypeScript, JQuery, Angular JS, Angular 8 , HTML5 and CSS3 technologies     Entity framework, SQL Server, MS SQL, Powershell     Technology Nice to have:     Experience in AWS cloud platform     Methodology skills     AGILE Development (Scrum)     Personal Skills:     Excellent analytical and problem solving skills     Excellent verbal/written communication skills. Fluent in English and the working country language     Should be a self-motivated, independent, detail oriented, responsible team-player and exhibit exceptional relationship management skills     Ability to work in a complex international environment     Experience in Agile (Scrum) methodologies would be a plus.     Ability to adapt quickly to an existing, complex environment.     Ability to quickly learn new concepts and software is necessary       PREFERED CANDIDATES:      The successful candidate will have a self-motivated, get-it-done attitude; the ability to think critically; enjoy working with teams spread globally and across cultures; a desire to learn in new areas; and the discipline to pay attention to deadlines, details and quality.     Good communication and interpersonal skills to interact with team in Europe     TRAVEL:   Ready to travel to Europe (5 - 10%)   Qualifications     BE Computer Science/MCA or any other Bachelor s degree with the right experience     ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "MCA in Computers, Any Postgraduate in Any Specialization"}, "KEY SKILL": ["jQuery", "SOA", "UML", "Application development", "WCF", "MVC", "Unit testing", "microsoft", "Information technology", "CSS3"]}