{"JOB DESCRIPTION": " Primary responsibility would be conceptualizing, designing, developing, testing & deploying web applications based upon MERN stack.     Main Job Duties    Determines feasibility by evaluating analysis, requirements and proposed solutions.   Documents and demonstrates solutions by developing documentation, flowcharts, layouts, diagrams, code comments and clear code.   Develops software solutions by studying information needs; conferring with architect; studying systems flow, data usage, and work processes; investigating problem areas; following the software development life-cycle.   Updates job knowledge by studying state-of-the-art development tools, programming techniques, and computing equipment; participating in educational opportunities; reading professional publications; maintaining personal networks.   Protects operations by keeping information confidential.   Provides information by collecting, analyzing & summarizing development issues.   Accomplishes engineering & organization mission by completing identified results as needed.     Job Requirements    MCA/MCS/B.E./B.Techfrom an accredited university with good academics   Strong analytical & problem solving skills   Relevant experience level ~2-5 years, with demonstrable portfolio of live websites   Expert in NodeJSprogrammingand frameworks with demonstrable portfolio   Proficient in data bases (MongoDB/MySQL), creating database schemas supporting business processes   Expert in MVC Patterns   Good experience in front end technologies like ReactJS, BootStrap   Exposure to cloud hosting of backend such as on AWS or Azure   Good experience in GIT processes and way of working   Excellent verbal & written communication skills and excellent Team Player.              ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "MCA in Computers"}, "KEY SKILL": ["Backend", "Front end", "GIT", "Analytical", "MySQL", "Software development life cycle", "MongoDB", "MVC", "Software solutions"]}