{"JOB DESCRIPTION": "Database ,  SQL Language, Power BI,  Tableau , ETL, SSIS, SSRS, SSAS,  T- SQL \n\nOpen IT Positions Bangalore,  Mumbai,  Pune,  Chennai,  India -  BLOOM Consulting Services JD1200 -  Senior Software Engineer MSBI Developer \n\nSenior Software Engineer -  MSBI \n\nExperience: 3 -  5 years \n\nLocation: Bangalore \n\nJob Description: \n\nThe Business Intelligence (BI) lead developer is responsible for building,  implementing and\n\nsupporting Microsoft BI solutions.\n\nThe right individual will possess experience in all stages of BI Project work (requirements and logical design,  physical design,  implementation,  testing and deployment). The BI lead developer should have a firm grasp of BI implementation methodologies and will have had in- depth experience with the Microsoft BI Stack (SSIS,  SSRS and SSAS).\n\nTo qualify for the position,  the candidate should possess the following:\n\nAnalysis and Communication Skills \n\nData gathering,  research and analytical abilities so as to develop insightful conclusions and generate solutions to address user needs \n\nCreate written communication materials that effectively summarize findings and support recommendations \n\nDirect quality assurance and user acceptance testing by writing test plans and managing the execution of testing (Unit and UAT) \n\nBasic knowledge in Master Data Services (MDS).\n\nExcellent skills in writing SQL queries,  Procedures,  Functions etc.\n\nGood to have knowledge in Tableau and Power- BI\n\nTechnical Skills \n\nThe BI Developer should understand and have expertise in the various technologies needed to implement Microsoft BI solutions. The developer must have experience with the Microsoft BI stack and exposure to other technologies is a plus (Power BI,  Tableau etc.).\n\nSpecific technical skills desired include: \n\nStrong in Relational Database and SQL Language\n\nExtraction,  Transformation and Loading (ETL) (Microsoft SSIS)\n\nData Warehouse /  Solution Design\n\nDimensional Modeling (Kimball Methodology)\n\nAnalytics /  OLAP Cube Development (Microsoft SSAS and MDX)\n\nReport Development (Microsoft SSRS)\n\nMandatory Skills : \n\nSSIS, SSRS, SSAS,  T- SQL\n\nWhat You Need for this Position You should have knowledge of:", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Analytical", "SSRS", "Consulting", "OLAP", "SSIS", "Business intelligence", "microsoft", "User acceptance testing", "Analytics", "Physical design"]}