{"JOB DESCRIPTION": "A Senior Software Engineer will join the engineering organization to design, develop, test, and maintain the suite of Conga products.Conga is transitioning to simple, secure, universal, high quality microservices and looking for someone who can bring their skills to help us grow our cloud-based solutions for Digital Document Transformation.To succeed here at Conga, writing high quality code is a given.  We also expect you to be able to work collaboratively with the team and mentor your peers, explaining your designs, code, and testing with clarity that elevates everyone in our organization.Operating at the Staff Engineer level you will be making an impact across the entire department by driving meaningful change across teams.Profile Description:Ideally 5-8 yrs of experience in the technologies like .NET Core, MySQL, Postgres, and noSQL running in AWSWe are into cloud-first architecture and are using Spinnaker, Kubernetes, and containers to make our services faster and more reliable for our customers. You should plan to arrive with the desire to learn because we are a fast moving development organization that is exploring new solutions and technologies all the time.At Conga, youll be a well-rounded engineer working on all aspects of the products life cycle including: automated testing, code quality, infrastructure, version control, release management, Continuous Integration and Deployment, and security among others.Should have good written and verbal communication skills.Should be able to attend calls with US partners in late evening.Conga is proud to be an Equal Opportunity Employer and provides equal employment opportunities to all employees and applicants.Conga is proud to be an Equal Opportunity Employer and provides equal employment opportunities to all employees and applicants regardless of race, color, religion, gender, gender identity, age, national origin, disability, parental or pregnancy status, marriage and civil partnership, sexual orientation, veteran status, or any other characteristic protected by law.  Reasonable accommodations will be made to meet the requirements of the Americans with Disabilities Act and will be provided as requested by candidates taking part in all aspects of the selection process. All your information will be kept confidential according to EEO guidelines. ", "ROLE": "Technical Architect", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["Software Engineering", "Cloud", ".Net"]}