{"JOB DESCRIPTION": "Dear Candidate,We are looking for a Software developer for a vehicle telematics manufacturing org in ChennaiPOSITION - Software DeveloperYrs. of exp  2 to 3 years Qualification – BE: Computer Science Engineering (CSE) , BE: Information Technology (IT) , Bsc/Msc Computer Science.Location – Chennai  (Palavakkam)Software Developer Responsibilities include:Producing clean, efficient code based on specificationsCoding Skills in Java Enterprise , JS , NodeJS , Python .System Administrator Experience : Linux (Ubuntu/RedHat) , Windows CE-Embedded.Should have Basic Wireframe Design & UI/UX Design Experience.Should have Depth in software Architecture Design especially for Stand-Alone Software As Product. Should have Basic Experience/knowledge in SBC/SOC based Software Architecture Design. Testing and deploying programs and systemsFixing and improving existing softwareRequirementsProven experience as a Software Developer, Software Engineer or similar roleFamiliarity with Agile development methodologiesExperience with software design and development in a test-driven environmentKnowledge of coding languages (e.g. Java, JavaScript) and frameworks/systems (e.g. AngularJS, Git)Experience with databases and Object-Relational Mapping (ORM) frameworks (e.g. Hibernate)Ability to learn new languages and technologiesExcellent communication skillsResourcefulness and troubleshooting aptitudeAttention to detailInterested candidates kindly mail your updated resume on chitra@impsmanagement.com or call on the below mentioned number  Best Regards,Chitra GuravResource Executive - HRImpact HR Services Pvt Ltd.303, 3rd Floor, Saba Palace (Virani Manzil), Near Khar Rly. Stn., 4th Road, Khar (W),Mumbai - 400052 , IndiaTel No: +91 22 42239207, Mob: 9082217128Email :chitra@impsmanagement.comWebsite : www.impsmanagement.com", "ROLE": "Software Developer", "INDUSTRY TYPE": "Automobile, Auto Anciliary, Auto Components", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Sc in Other Specialization, B.Tech/B.E. in Any Specialization", "PG": "MS/M.Sc(Science) in Any Specialization"}, "KEY SKILL": ["Ubuntu", "Java", "Redhat", "Hibernate", "UX", "JS", "J2Ee", "Node.Js", "ORM", "Linux", "Agile", "ui ux developer", "software developer", "ui/ux", "Python"]}