{"JOB DESCRIPTION": "Functional  Core:• Expertise in various technology domains will be counted on to set strategic direction and solve complex and mission critical problems, internally and externally.• Supporting existing application infrastructure, writing code, model development.• Deep knowledge of OOPS, OOAD, SOA architecture principles and application programming.• Proficiency in – System programming C++, Win32 API, QT, Boost, Open CV, OpenGL with hardware interfaces. • Proficiency in - Web development and interfacing with low level application and AI engine using open source web technology platforms PHP, Ruby on Rails, MySQL, SQLite, Java Script.• Fair knowledge on AI, modelling (ML/DL) and communication. • Experience in image processing experience will add value. • Apply new technologies that can be used to make existing software better, secure user friendly.• Enhance and correct coding flaws in existing code base.• Support existing maintenance project in case of critical issues if required.Key Skills• 8+ years of experience in multithreaded system application development using C, C++, Win32 API, QT, Boost, Socket, OpenGL and OpenCV.• Proficient in OOPS, OOAD and Data structure.• Experience in Web application development using any client/server and SOA based development with open source web application development framework - Ruby on Rails/ PHP, NodeJS, XML,JSON, Shell scripting, HTML5, CSS3, REST and SOAP communication . (Angular, React will add value)• Experience using analytical tools and languages, (e.g., Python, R, etc.).• Fair knowledge of AI (deep learning and python). • Well verse with Agile methodology and good understanding of SDLC practices, estimation, technical designing (UML/Design patterns) and documentation. • Proficient in communication skills to promote cross-team collaboration• Good understanding on SDLC.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "Post Graduation Not Required, Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required, Any Doctorate in Any Specialization"}, "KEY SKILL": ["Application Programming", "Java", "C", "Web Technologies", "JSON", "SOAP", "NodeJS", "CSS3", "Software Development", "REST", "Opencv", "XML", "MySQL", "HTML5", "Shell scripting", "Javascript", "PHP", "Web Development"]}