{"JOB DESCRIPTION": "   Develop and design documents based on functional specifications.   Ensure defined development processes, procedures, and tools are used and adhered to both offshore and onshore.   Develop software programs based on design documents and adhering to industry standards.   Develop medium to large scale applications using C#, ASP.NET, SQL Server, Database design and analysis.   Communicate with supervisor on a regular basis on the status of tasks, issues, and risks.   Stay abreast of changes in technology and learn new technologies as needed.   Develop complex software components.   Advise developers on software development and code creation.   Analyze legacy applications, calculate technical debts and suggest improvements using tools like NDepend.   Demonstrate strong knowledge proficiency in the development methodologies including Object-Oriented Development, Component-based Development, Test-Driven Development, Behavior-Driven Development, Design Patterns and Design for Reuse.   Work closely with stakeholders to obtain requirements, break them down to tasks, and manage a team of several developers.   Design and develop front-end user interface using JavaScript frameworks such as jQuery, AngularJS, Angular, etc. Participate in peer code review, both onshore and offshore resources.   Define Continuous Integration Continuous delivery using tools such as VSTS.   Perform unit testing and integration testing of Windows and web applications with the test automation tools. Analyze and resolve performance issues in web applications.   Work with NET Framework, ASP.Net MVC, Dotnet Core, Web API and Web Services, AngularJS and Angular, C#, SQL Server Design and Development, 16.Application Lifecycle Management, QA Testing Procedures and Cloud (Azure and AWS).     Qualification Experience Required:     Requires a Bachelors degree or equivalent degree in Computer Science, Information Technology or Software Engineering   Overall 3-4 Years of Experience out of which Minimum two (2) years of work experience of developing medium to large scale applications using C#, ASP.NET, SQL Server, Database design and analysis; and working with NET Framework, ASP.Net MVC, Web API and Web Services, C#, SQL Server Design and Development, Application Lifecycle Management, and QA Testing Procedures.   Must have courseworkor project related experience in Cloud (Azure and AWS), AngularJS and Angular.     Skill Required:      Source candidates for specific job positions from Job Portal, Referrals or any other method.    Reviewing resumes and applications, conducting first round of telephonic interview, shortlisting of candidates and scheduling interviews    Providing the necessary inputs during the hiring process.    Preparing letters such as offer letter, Appointment Letter, confirmation letter etc.    Communicating and explaining the organizations HR policies to the employees.    Maintaining HR records, such as those related to compensation, leaves, attendance records. Employee punctuality etc.    Follow up of confirmation records statutory obligations PF, ESIC, taxes, gratuity, LTA, bonus etc.    Ensuring statutory compliances for PF withdrawal, annual returns, shop and establishment license, labour law and record information on a timely basis.    Preparation of salary statement and processing timely distribution of salary, bonus, increment salary slip, leave encashment and full and final settlements.    Maintaining and regularly updating master database (personal file, personal database, etc.) of each employee.    Implementing and administering performance management processes as per the PMS policy and timelines.    Engaging with employees on a regular basis to understand the motivation levels of people in the organization.    Handling the full and final settlement of the employee.    Conducting exit interviews for employees and recording them accordingly    Qualification Experience Required:     Bachelors Degree in human resources, business administration, finance, or related field.   2-3 Years of Experience in Managing Recruitment Employee Life Cycle Management Process.   Must have worked at least for 1 Year in an IT Service Software development Company.   Good analytical and problem-solving skills.   Honest, ethical, and dependable.   Positive, go-getter attitude.   Computer literate in Microsoft Suite (especially Excel) and various HR software programs.     ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["IT services", "jQuery", "Database design", "Javascript", "Windows", "Unit testing", "microsoft", "Information technology", "SQL", "Ajax"]}