{"JOB DESCRIPTION": " Job Description       As the Senior Software Engineer - React Native Developer, you will be responsible for developing complex applications and assessing the usability of product designs to enhance the user experience of Optymyze products.     This is you.       Accountable -   You take control of your responsibilities to meet deliverables and focus on the quality of your work.     Analytical -   You are excellent at problem-solving, detail orientation, and diagnostic abilities.     Communicative -   You have superior oral and written communication skills and work successfully with global teams.     Passionate -   You are strongly invested in your work and you re confident when sharing the results of your efforts.     Independent -   You need little direction to feel motivated to accomplish something, and you are resourceful when faced with unfamiliar tasks.     Smart   - You are bright, smart and earned a   degree in BE/ BTech or BCS/MCS.      Qualifications        This is what you've done.       Native App Development   - You have translated UI/UX designs or wire-frames into actual code and built native mobile applications. You have a rich experience of building native applications for Android and iOS using the cutting edge platforms like react-native. You have consumed third-party native services and managed them with react-native-cli and optionally with expo. You are familiar with build, deploy and publish process for Android and iOS.     UI Development -   You have translated UI/UX designs or wireframes into actual code to produce visual elements of the application. You have developed multiple browsers at once and can build reusable code libraries for future use. You have knowledge on Node Package Manager and Webpack module bundler.     Cross-Functional Collaboration -   You have collaborated across development functions including UX designers, product managers, back-end developers and other stakeholders and understand the technical requirements to ensure the delivery of new features throughout implementations.     Individual Contributor -   You have ability to work independently and assisting front-end developers with coding and troubleshooting.     Best Practices -   You work with development teams to provide implementation estimates while following the industry s best practices.     Software Application   - you have 5 - 7 years of experience building mobile and web-based software applications using Javascript, HTML and CSS. You have good expertise in ReactJS and React Native. Also, you have knowledge on Node Package Manager and Webpack module bundler.    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization, B.Sc in Chemistry", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["UI development", "Front end", "Diagnostics", "Coding", "Analytical", "Javascript", "HTML", "Troubleshooting", "Application software", "Android"]}