{"JOB DESCRIPTION": " Software Engineer / Senior Software Engineer - MarkLogic DeveloperWorli, Mumbai, Maharashtra, IndiaFull-timeCompany DescriptionRave Technologies ? A Northgate Public Services Company, is a software services company that works with small and medium sized organisations. We are a part of Northgate Public Services Company which is based in the UK.Based in Mumbai, Rave Technologies? end to end product/application engineering services help address challenges in the product or application development life cycle. These services include Requirement Analysis, Software Architecture, Design, Development, Testing and Maintenance with specialized services in Cloud/SaaS Migration, Usability Engineering, System Architecture and Design, and Independent Testing solutions.   Job DescriptionEssential skills:MarkLogic 9 experience (search, index, Xquery, CTS, etc)   Knowledge on XSLT, Rest APIAgile SCRUM experience with appropriate tooling. Personal Attributes Ability to communicate and collaborate effectively with distributed team membersDemonstrate an enthusiastic and pro-active approach to software developmentDemonstrate the desire to produce high quality software products within agreed budget and timescale constraintsThe ability to pro-actively suggest and implement process improvements that enhance the performance, productivity and morale of the teamThe ability to work flexibly and imaginatively in a changing and evolving project environment.Additional InformationExperience: 3 to 6 yearsI'm interestedPrivacy Policy ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Engineering services", "System architecture", "software architecture", "Application engineering", "development testing", "Architectural design", "XSLT", "Application development", "Software services", "Software engineering"]}