{"JOB DESCRIPTION": "    What will you do after joining us    Working with our web based online benchmark platform named Probench.   Understanding the changes asked by clients or new features added as part of product development.   Think, yes think on solving the problems with clean technical design and applying better practices (Primary role).   Writing code in direction of product improvement or keeping it running as expected (Primary role).   Be an active team member and communicate all news bad or good quickly.   Reading and understanding source code's syntax and semantics of Probench.   Testing the code you write and what is already written (sometimes) and how it integrates with Probench preferably automated.   Content writing for users to guide them how to use the software change, you or a team member made.   To make sure you commit your changes frequently not to loose your changes (By the way, we use   Git  ).    Refactor   source code, script, document, email and every thing you type. Keep it clean.   Working with better attitude during occasional tight time schedule to delight our clients.   Collaborating using standard processes of Confiable Solutions.      How your skills will help us     Should be able write and read code in   C#   with good quality.   Understanding Microsoft SQL Database and writing   TSQL  .       Able to write and understand basics of JavaScript, CSS and HTML.       A Full Stack Developer in Microsoft .Net Web development space.       Any one with 0-2 years of IT experience who wants to work in   Agile world  .         ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Career development", "GIT", "Web development", "Javascript", "Agile", "HTML", "Content writing", "XSLT", "MVC", "microsoft"]}