{"JOB DESCRIPTION": "Job Description  Develop single or multiplayer game in Casino game industry.  Building and releasing games in a live environment with up-to-date features including IAPs (In-App Purchases)  , social integration  , and cross-platform (web and mobile) capabilities.  Design  , Create  , Implement  , Debugg  , and Refine gameplay features.  Work with other departments such as art and game design to improve workflow  , game features  , and artistic output.  Proficient in doing strong emphasis on quality  , individual ownership and value engineers who take pride in developing games.  Proficient in providing complexity challenge (art integration  , complex game mathematics  , compliance requirements etc.) and different varieties (cabinets  , markets and languages).  HTML5  , createjs and Javascript expertise for Desktop/Mobile games   Skills Required  1 to 3 years of experience in developing game.  Expert in developing games on Unity 3d for mobile platform. Should have worked on 2D/3D Unity3D game for Web/Android/iOS with proficiency in JavaScript/C#.  Expert knowledge of Unity3D including Unity GUI  , asset bundles  , materials/shaders  , and iPhone deployment. Object Oriented Design principles  , asset bundles  , and script writing in C#.  Building reliable and efficient code for game projects.  Must have shipped 2 to 3 game to the App Store.   Roles Responsibilities  Strong and complete knowledge of SDLC in casino games and software engineering principles.  Analyse game requirements with product owner  , technical leads and art team.  Design game s framework and functional flow.  Rapid prototype and iterate quickly.  Should have knowledge of server and cloud.  Experience in SDK integration and version controlling.  The development process involves coding  , code reviews  , unit testing and memory profiling.  Good skills in Object oriented design  , algorithms and data structures  Preferences  Gaming Experience  Certification in Software Engineering  Maintenance of large code base in C#  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Production/Industrial", "PG": "M.Tech in Electronics/Telecommunication, MCA in Computers"}, "KEY SKILL": ["Object oriented design", "Coding", "Javascript", "Data structures", "Workflow", "SDK", "Unit testing", "Gaming", "SDLC", "Android"]}