{"JOB DESCRIPTION": "Roles and Responsibilities To get transparent and quick status update, apply on : https://rb.gy/qp4vabWork with a leading SaaS product and services company, learn about the global processes and client requirements.Our client is a cloud integration and automation products provider. Their customised applications allow their clients' platform to connect to any cloud thus enhancing the user experience and allowing a seamless integration of data. Their streamlined operations focus on strategic issues like secure infrastructure and an in-house UX that is 5 times faster and at a fraction of the cost.The founder is a Berkeley alumnus, with a background in Technology and Business and has packed in many years with IT and Fintech companies. Based out of California with an office in Mumbai, the 4 year old company is a niche player growing at arate of 23% in an industry that is in a booming and blooming stage. Their products being used in industries like Retail, Ecomm, Manufacturing, F&B, Pharma, Education among others.As a Software Developer-Backend, you will architect complex scalable systems with a keen eye towards performance, security and availability while also taking on a super hands-on role towards implementation (i.e. you must be very much in touch with backend coding and want to do it everyday)What you will do:Spearheading all inbound and outbound API integrations to build the most robust and scalable integration platform in the B2B Cloud space.Being responsible for architecture, design and implementation of the entire system to support thousands of customers globally.Ensuring rapid scaling of the services while ensuring supreme code quality and full automation coverage.Mentoring should come naturally to you, as well as finding the right balance towards process and documentation.Working on interesting technical challenges in a product centric and open-source driven environment.Helping set a very high bar on code quality.Taking ownership of product features from conception to implementation, testing deployment and support.Using open source as much as possible, and blog about cool things that you learnt and built.Helping define who we become as a company.Desired Candidate Profile What  you need to have:BTech or MTech requiredOur stack is primarily built around NodeJS, PHP, MongoDB and MySQL. Deep familiarity with Git and basic working knowledge of DevOps (Server and DB config, Docker, Kubernetes etc) is strongly preferred.We are running entirely on micro servicesThe role requires a good knowledge of Algorithmic Design and Architecture, Data structures, OOPS Concepts, serverless architectures and complex problem solving skills.A lot of freedom on when and where you work from - just get stuff done.We have a strict no-divas rule. There are a lot of smart people on the team but no one with an attitude / superiority complex. Everyone here is focused on rapid learning and sharing.If you think writing tests for your code, writing docs, doing customer support etc are not your cup of tea, this isn't the right role for you.Similarly if you're viewing this just as a 20-40% increment opportunity over your current compensation, this isn't the right role or company for youYou will get stock options in line with silicon valley standards.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "M.Tech in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Node.js", "DevOps", "PHP", "Code writing", "Architecture", "OOPS", "Information Security", "Deployment", "Algorithm", "Implementation", "SQL", "Software Development", "serverless architecture", "Git", "Docker", "API integrations", "MongoDB", "B2B cloud", "Kubernetes", "Testing"]}