{"JOB DESCRIPTION": "  At Acquia, quality engineering drives the quality tool chain and process in an open and collaborative environment.      To ensure that we have a repeatable process and systems to thoroughly test and uncover defects, quality engineering uses best of breed tools for automation and testing frameworks in conjunction with in-house tooling, infrastructure and services.      Quality engineers are embedded in each agile development team to facilitate and lead the testing strategy, and test automation requirements for every iteration and release.      The quality engineering team also regularly meets to review and improve overall testing processes, automation, innovations and best practices.      Each quality engineer works both independently and as part of a product group, where developers write tests and the quality engineering team supports the testing infrastructure and automation.      In addition, they provide guidance for best practices and develop testing systems for smoke testing, behavioral testing, stress testing, performance testing, as well as supporting quality metrics.      The Senior Software Engineer is a strong voice for quality that actively pursues quality improvements, writing code, developing new infrastructure and tests to support our fast paced, highly diversified development organization.     Responsibilities:      Develop software that helps evaluate quality and best practices of Drupal modules and themes        Work together with product managers, agile product owners, architects, tech leads and engineers to ensure the quality of our products       Participate in technical discussions for products and test infrastructure       Promote quality assurance programs, policies, processes and procedures to ensure that performance and quality of products conform to established standards       Promote and execute Quality best practices, tools, and methodologies       Participate in planning/design phases of testing projects and recommend improvements       Identify areas for improved testing efficiencies, test automation and implementation of automated test solutions       Participate in team strategy and roadmap definition to expand test coverage by building appropriate tools, utilities, and automation that assist in functional testing       Constantly evaluate the test automation strategy and approach to identify areas of improvement (i.e. test automation frameworks, coding standards, etc.)      Qualifications:      4-7 years experience in quality engineering including functional, system, integration and regression testing       2-4 years experience developing Drupal modules or themes       Familiarity with Composer and troubleshooting failures that arise with it       Strong analytical and troubleshooting skills in a modern web stack       3 years programming experience in PHP and JS       Excellent project management skills       3-5 Years experience in development of automated tests       Experience with continuous integration and build tools (i.e. Jenkins, Travis)       Demonstrate knowledge of accepted QA methodologies, encompassing all facets of Quality Assurance.       Excellent written and verbal communication skills.        LAMP (Linux Apache MySQL PHP) stack experience   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - QA & Testing", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Drupal", "Manager Quality Assurance", "Linux", "Project management", "MySQL", "Performance testing", "Agile", "PHP", "Apache", "Troubleshooting"]}