{"JOB DESCRIPTION": " Key Skill, Knowledge       Requires a minimum of 8-12 years of experience in Optimization.     In depth knowledge of at least one area of Operations Research (for example, MILP, Nonlinear programming, Stochastic Modeling).     Familiarity with several areas of OR (specialist in Deterministic area must have a broad knowledge of the stochastic area and vice versa)     Efficient programming skills needed to develop the product. Specifically, SAS, R, Python.     Works on complex issues where analysis of situations or data requires an in-depth evaluation of variable factors. Exercises judgment in selecting methods, techniques and evaluation criteria for obtaining results. Networks with key contacts outside own area of expertise.     Experience working independently with testing and technical support.     Ability to maintain and enhance OR software     Ability to develop OR algorithms specific to solution needs     Preferably exposed to Retail domain analytics like:     Pricing     Inventory Optimization     Assortment     Allocation     Route Optimization         Primary Responsibility       Develops and maintains software in one or more specialized OR areas.     Forms relationships with key customers and external OR experts.     Operates independently on routine tasks and with management guidance on key decisions; consults with peers.     Sets and meets reasonable deadlines.     Promotes software via papers and presentations with management input.     Interacts closely with testers to define testing strategies and coverage.     Works with technical support.     Builds knowledge of competitive software.     Serves as an optimization expert for internal solutions and other products.         Education   : Ph.D./M.Sc in Operations Research or a related field  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "MS/M.Sc(Science) in Chemistry"}, "KEY SKILL": ["Retail", "Operations research", "Inventory optimization", "SAS R", "Programming", "Management", "Technical support", "Analytics", "Python", "Testing"]}