{"JOB DESCRIPTION": "    The ALM group is responsible toprovide professional application services to our users of Siemens Mobilityworldwide. We support our business units by hosting and managing differentapplications for the software builds for severalMobility products and projects.    Continuous monitoring of processes,target-oriented and fast intervention and a high awareness of all currentissues are key elements of successful operation and high user satisfaction.    Your New Role - Challenging and Future-Oriented     You will manage and perform development and design tasks with emphasis on programming, customizing, testing and maintenance of applications   You will develop and deploy Polarion extensions and scripts for customization and integration with other ALM applications, e.g. Redmine/Subversion, Jenkins, IBM DOORS   You will be responsible for migrating user and project data from other systems to Polarion   You will be responsible for operating and supporting the ALM applications in use (Polarion)   You will be in close contact with our Polarion team and our partners/suppliers   You will support users with questions, implementation and further developments and systematically process tickets from end users   You will implement change requests or small projects based on specifications from our customers   You will monitor the applications and proactively prevent performance or security issues   You will be responsible to create and maintain the service documentation and regularly update the knowledge base   You will plan and execute the rollout of new versions, products/solutions and services, as well as the infrastructure required (cloud-based)   You will operate future applications in conjunction with our internal and external business partners     Your Qualifications - Well-Founded and Adequate     You have successfully finished studies in computer science or electrical engineering or a comparable qualification with corresponding additional skills.   You possess the ability to perform codeful and codeless customization of Polarion ALM according to business demands   You have 2 years of experience in administrating Polarion, developing and deploying Polarion extensions   You have experience with data migration and integration technologies   You have 5 years of experience with Java as a full stack developer in software development   You have 3 years of experience with JavaScript, HTML, CSS, Groovy, Velocity Macros   You have 3 years of experience with AWS or Azure Cloud for developing and operating software and systems   You have extensive experience with source code management (Git and Subversion)   Ideally, you have experience with Polarion ALM implementation for requirements management   Ideally, you have already concrete experience with integrating Polarion with other ALM applications, e.g. Redmine/Subversion, Jenkins, IBM DOORS etc.   Ideally, you have experience with defining Polarion project templates according to business demands   Optionally, you have knowledge about Kubernetes and Docker technologies and operation of systems in the Cloud with Kubernetes or Docker   You are good team player with good communication skills and the ability to work closely with others.   You are willing to travel several weeks to Europe   If you also have fluent knowledge of Business English (Level C1), are highly self-motivated and able to think in a customer-oriented way, then you are qualified to join us in our team!     ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Automation", "Data migration", "GIT", "Subversion", "Javascript", "HTML", "Information technology", "Macros", "Monitoring"]}