{"JOB DESCRIPTION": "Experience :7-10 years in Product developmentQualification:Bachelor / Masters degree in Computer Science or Computer Engineering5+ years of professional experience in software development Our team is highly motivated and is looking for a senior engineer who can steer the team technically in our vision. Strong belief in software craftsmanship and practicing it in day-to-day work, expert in Microsoft .NET technology stack is a must.A good team player with expertise working as part of Agile teams. Hands-on experience in practicing Scrum, XP and Kanban.Strong hands-on experience in web development using ASP.NET MVC and C#.Usage of SQL and no SQL databasesHands on experience in test-driven development and DevOps practicesStrong design capabilities, following SOLID principles using C#Well-versed with pair-programmingWorking on solutions hosted in cloud environments (AWS or Azure)Implementation of Continuous Delivery processesUsage of GitGood understanding of Behaviour-driven development and domain-driven design The following would be beneficial:Working in the travel and hospitality domain including:.Net core 2.0, Web APIScripting Languages like Typescript or JavaScriptFrontend: Angular7Automating business processesIntegration with 3rd party systemsCustomer management, including CRM solutionsContent managementSEOBooking and post sales flows, web and mobile solutionsAre you interested in working from home office? Comprehensive experience working with remote teams Excellent communicatorSelf-managedOpen to travel to Pune office occasionally  Responsibilities:Contribution to the product roadmap in one-week sprint modelHelping your team to deliver at high velocityPractice and promote Agile practicesContinuously learn and deliver incremental business valueUse Continuous Delivery Practices Select the best tools to solve the problems at handMentor junior team membersEffective collaboration and removal of silosBuild high availability solutions. Development of asynchronous and/or multi-tiered scalable applications Job Location PuneAre you a software craftsman and passionate coder with a proven track record of successful deliveries? Are you interested in a high growth career opportunity and enjoy building software that brings smiles to our customers?Then you are someone who will enjoy this incredibly challenging role with us.  Get in touch with us: hr@ash-software.com  https://www.ash-software.com/ ", "ROLE": "Team Lead/Technical Lead", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Other", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": [".Net Core", "Angular", "Agile", "C#", "Web Api", "Azure", "ASP.Net MVC", "Test Driven Development", "Solid Principles", "Typescript", "TDD", "Javascript", "CI/CD", "full stack", "Web Development", "fullstack", "AWS"]}