{"JOB DESCRIPTION": "Leading US Based IT Set up requires Sr Angular/ React JS Developer GURGAON(Sector- 34)(Joining has to happen in maximum 20-30 days)One of our client a Mobile Technology set up, which uses the mobile device to create the largest ecosystem of performance advertising, last mile data capture and data analytics in both digital and offline world. Millions of consumers today use its platforms to be connected with their favorite brands, their dealers, agents, managers and constantly get just the right offers / information anytime, anywhere. Today more than 100 brands / companies use its platforms to have one-one connect with their consumers based on actual real time data coming from their Point of Sales (POS).We are looking for Sr Anjular JS/ React JS Developer for Gurgaon- sector- 34 locationThe JOB DISCRIPTION is as follows . -1) CLIENT - IT MNC2) POSITION - Sr Angular/ React JS Developer (MVC)3) JOB LOCATION- SECTOR- 344) 5 Days week(corporate day shift)5) Experience- 3- 6 years on Angluar JS/ React JS Platform6) Compensation- Competitive7) Qualification - BE/ Btech/ MCA/ BCA/ IT graduateTHE JD IS AS FOLLOWS-Job Role VisionPOSITION - Sr. Software EngineerTechnology: .Net + Angular and/or React.jsJOB LOCATION- Gurgaon SECTOR- 344) 5 Days week(corporate day shift).We are looking for a technically strong candidate who is willing to take on a challenging role and wants to meet their career ambitions. The ideal candidate has been with good academics, has a strong career track record, and most importantly a logical ability to convert business requirements into solutions. They should be able to work independently and within a teamSKILLS REQUIRED:- Excellent programming skills and in-depth knowledge of .NET MVC, Multi-Threading, .NET CORE, SQL Queries, Web API & Windows Services.- Must have worked on at least one of the following database servers: SQL Server 2014 or Above, Mongo DB, Oracle.- Must have a great sense of software development lifecycle. This includes a solid understanding of OOPs, OOAD & SOLID Principles, Design Patterns, Dependency Injection.- Familiarity with at least two of the following web development technology: HTML5, CSS3, Microservices, JavaScript, NodeJs, AngularJs, Bootstrap, JQuery, REST APIs.- Hands-on experience with Remote Debugging and other debugging tools and techniques.- Aggressive problem diagnosis and creative problem-solving skills.- Strong organizational skills to manage multiple tasks within the constraints of the timeline, with minimum supervision & full ownership.- Ability to work and succeed in a fast-paced development environment and learn rapidly.EXPERIENCE REQUIRED:Candidate should have 3- 6 Years of experience in .NET Backend development. Should have experience with international projects with at least two projects developed on Angular or React.- Excellent logical and analytical skills.- Capability to work with deadline.- Good knowledge of identifying and solving problems and enjoy working in teams.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization, BCA in Computers", "PG": "MCA in Computers", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["AngularJS", "REST API", ".Net Core", "OOPS", "HTML5", ".Net", "Bootstrap", "SQL Server", "MVC", "React.js", "CSS3"]}