{"JOB DESCRIPTION": "Roles and ResponsibilitiesJob SummaryWe are seeking a senior developer to join a newly forming Agile Scrum development team. This team will be responsible for all development and QA tasks for a new solution on the Tax Technology team. The work will primarily be focused on new feature development. There is a legacy solution that is a component of this new solution, which will require some technical maintenance and bug fixes while the new is being developed.The senior developer will be responsible for coaching junior team members, code reviews and will focus on the more complex development items such as developing front end website architecture, designing/developing APIs, and backend server/database components.Qualifications• experience designing, developing, and implementing technology solutions.• .NET software development experience, with preferably C#.• Microsoft SQL Server experience.• experience with modern client frameworks, preferably Angular 7+ using Typescript.• experience working within an agile software development framework/methodology, preferably Scrum. • experience with cloud based technologies, preferably Azure.• Familiarity with specific Azure services (Service Bus, SQL, Cosmos, Redis, and API Management), not required but strongly preferred.• Familiarity Azure Kubernetes Services (AKS), not required but strongly preferred.• Familiarity with Docker for container-based solutions, not required but strongly preferred.• Familiarity with Linux/Windows operating systems, not required but strongly preferred.• Familiarity with TDD including unit, integration, API, and UI testing.• Understanding of DevOps concepts such CI and CD, and using specifically Azure DevOps / Git.• Demonstrated ability to consistently produce high-quality deliverables• Strong verbal and written communication skills.• Strong organization skills.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": [" C#", " SQL", " Cosmos", ".NET software development", "Service Bus", " Redis", " Azure", "UI testing", ".Net", " Angular 7+", " Microsoft SQL "]}