{"JOB DESCRIPTION": "Roles and Responsibilities- We are looking for an experienced (2+ years ) Web Developer with Magento (PHP) e-Commerce experience to join our expanding team to build our product. Experience with front-back end web development experience with Magento e-commerce.- The incumbent is required to work on the full development lifecycle, will use their experience of front and back end to build highly responsive websites. He/She will have all the tools needed along with a fantastic working environment, which is driven by a highly motivated and enthusiastic team of developers.- 2+ years experience with Magento 2.x- Solid understanding of PHP best practices- Experience building custom Magento extensions- Experience with custom theming of Magento stores- Experience creating Modules Webservices (REST SOAP)Themes- Solid understanding of the Web UI layer: HTML, CSS, JS- Experience integrating Magento with other third-party systems.- A passion for delivering solid, secure, stable, and performant solutionsResponsibilities :- Develop on new and existing client projects built using the Magento platform- Architect and write custom extensions according to best practices- Build efficient, testable, and reusable code- Perform a mix of front-end and back-end development on new and existing Magento sites- Develop new integrations and custom extensions- Deploy code across development, staging and production environments- Troubleshoot and resolve bugs found in existing Magento installations- Integrate Magento with other third-party systems- Communicate and collaborate with developers on the team- Develop solutions in given time frames- Communicate with managers about any issues or concerns.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "BCA in Computers, B.Tech/B.E. in Any Specialization, B.Sc in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["CSS", "Software Development", "Front End", "Web Technologies", "Magento", "Javascript", "PHP", "HTML", "Web Development", "Web Services"]}