{"JOB DESCRIPTION": "     Project   Description       The role is with our core Development team which is supporting Run The Bank. The role is part of the integration which acts as a processing layer for trade booking and processing applications such as Murex, STP and Static Data applications.      Responsibilities     4-6 years experience in SQL Server 2008   Good knowledge in Views, Store Procedures and fine tuning.   Review and refactor code   Deploy fully functional applications   Upgrade existing programs   Mentor the junior developers in the team.     Duties and Responsibilities Include:     Work experience as SQL Server 2008 Developer   Good knowledge in Views, Store Procedures and fine tuning.   Strong knowledge and experience with at least 5yrs experience in MS SQL and Business Intelligence Suite (Mainly SSIS)   Strong knowledge and experience in scripting, database queries, application and server troubleshooting, log file analysis   Familiarity with agile environments   Responsible for adhering to coding standards and the approved technologies   Unit tests all changes on development, and then works with the appropriate Business and/or Technology Owner(s) to ensure that the developed solution meets the business requirements   Takes ownership of work items assigned, communicates and daily progress as part of the SDLC process, and actively works to resolve issues blocking progress   Assists in the QA process   Develops and maintains open and fluid communication with Management   Develops and maintains a positive relationship with other team members      Skills    Must Have    SQL Server 2008     Nice to Have    Murex/Calypso Knowledge   Knowledge on financial markets.      Languages      English: B2 Upper Intermediate   English: C1 Advanced   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["MS SQL", "Coding", "MySQL", "Agile", "SSIS", "Teradata", "Business intelligence", "Troubleshooting", "SDLC", "STP"]}