{"JOB DESCRIPTION": "   Role: Software Engineer      We re Advanced    Join a business that embraces innovation, gives you the scope to seize every opportunity and will help get you where you want to go. Life at Advanced begins in an unprecedented environment with a role that matters, taking you on a fast-paced journey of discovery, however big that might be.   We are one of the UK s largest and fastest growing software companies. True partnership is the defining thing that makes us different from the competition. We pride ourselves on delivering focused software solutions for public sector, enterprise commercial and health & care organisations that simplify complex business challenges and deliver immediate value.    A proven full stack Developer with 4-6 plus years of strong technical experience in development of windows based application in .Net Domain. He/ She is required to work for a product in Healthcare Domain.    Responsibilities include     Manage small-scale development projects to delivery schedule.     Learn our applications and become knowledgeable and proficient in their development     Translate software requirements into concise and robust program code.     Work closely with the Product Owner to refine requirements, estimate development effort and gain their acceptance of the solution.     Working closely with the Test Analyst, use effective automated and manual testing techniques at various levels to ensure the software is correct, performant and robust.     Identify improvements to existing application code and designs, increasing flexibility and reducing future effort.     Provide support, investigating technical issues and advising internal support technicians.     Investigate and resolve software defects with the minimum impact and risk.    Our people deliver excellence in everything they do. They act with pace, are fearless and always do the right thing. We work together and act as a team, so you will    Working as part of a high performing SCRUM team     Identify problems and act and be responsible in resolving them     Aim for self-improvement and continuous learning     Ask for help and help others     Clearly explain and discuss technical points with both technical and non-technical people     Say what you will do by when and work to do it in time     Appreciate challenge and feedback from colleagues     Key Skills     Modern software language capabilities such as object-orientation, generics, etc.     C#/.NET and Visual Studio     SQL databases, preferably Microsoft SQL Server     Source Control with TFS or Git/GitHub or any similar version management tools     Software development principles, patterns and practices, SonarQube     Resourcefulness and troubleshooting aptitude     Working with Windows Applications     WCF, Web Services or Web API     Best practice such as SOLID and TDD    The following would be beneficial:    CI/CD development infrastructure such as Jenkins, Team City     Packaging systems such as Nuget.     Healthcare software development including standards such as HL7, FHIR and SNOMED\\     Front end: HTML 5, CSS, Advanced JavaScript, Ajax, Angular JS, jQuery, Bootstrap     Desirable Skills    Agile, Jira, Pair programming   Good communication skills   Analytical and efficient Development skills     ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["jQuery", "Front end", "Agile", "Packaging", "Scrum", "Windows", "WCF", "Visual Studio", "Troubleshooting", "Ajax"]}