{"JOB DESCRIPTION": "    Project   Description     The role is with our core Development team which is supporting Run The Bank.    The role is part of the integration which acts as a processing layer for trade booking and processing applications such as Murex, STP and Static Data applications.     Responsibilities     4-6 years in manual automation testing.   To develop test automation scripts to facilitate faster turnaround time on regression testing for the departments suite of applications.   To gather and understand applications test automation requirements   To design automation flow and scripts conforming to teams automation framework   To execute automated test cases for applications teams during SIT and regression test cycles.   To generate test summary report with statistics on the SIT and regression runs.   To work with application team to analyse and adapt failed test cases due to applications new changes.   Develop and conduct functional test scripts to validate system and business requirements (release notes)   Design, implement, and execute automated tests using Open source tools such as Selenium.   Document and maintain test procedures based on corresponding test plans and system documentation.   Document and maintain any issues discovered during testing and follow-up on status of issues and actions plans on test results   Responsible for facilitating all integration testing and regression tests when test scripts are used    Duties and Responsibilities Include:    Work experience as manual automation test engineer.   Strong knowledge in selenium automation tool.   Familiarity with agile environments and regression testing.   Responsible for adhering to coding standards and the approved technologies   Unit tests all changes on development, and then works with the appropriate Business and/or Technology Owner(s) to ensure that the developed solution meets the business requirements   Takes ownership of work items assigned, communicates and daily progress as part of the SDLC process, and actively works to resolve issues blocking progress   Assists in the QA SIT process   Develops and maintains open and fluid communication with Management   Develops and maintains a positive relationship with other team members      Skills    Must Have    Proven experience in designing and building automation test frameworks for testing single page applications   Proven experience in designing and building API driven test frameworks   Experience with WebdriverIO, Puppeteer, Selenium or similar UI testing tool and ability to learn new tools   Experience with Java and JavaScript/TypeScript and willingness to use either of the languages   Experience in Behavior Driven Development using Cucumber preferred   Hands on experience in creating and maintaining an automated test suite   Strong experience is defining test scenarios from acceptance criteria   Knowledge of Selenium Grid or other methods to drive parallel execution is highly desirable   Strong knowledge of continuous integration and testing with Jenkins, Bamboo or equivalent   Strong understanding of web development technologies such as TypeScript, JavaScript, jQuery and React   Thorough knowledge and demonstrable experience with agile development practices, JIRA and Confluence, and Git/Bitbucket or similar distributed source-control systems   Preferable experience utilising Docker and containers   Experience with OpenShift/AWS and Kubernetes   Experience with Performance and Volume testing would be considered as beneficial (JMeter, Artillery or LoadRunner)   Strong troubleshooting skills and ability to contribute to continuous improvement process   Ability to liaise with business users to understand the requirements thoroughly     Nice to Have    REST, XML, Selenium WebDriver, HTML, WebdriverIO, Interface  Murex/Calypso Knowledge   Knowledge on financial markets.      Languages      English: C1 Advanced   Romanian: B2 Upper Intermediate   ", "ROLE": "Testing Engineer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - QA & Testing", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["jQuery", "Coding", "XML", "Web development", "Javascript", "HTML", "Selenium", "Troubleshooting", "Open source", "SDLC"]}