{"JOB DESCRIPTION": "Roles and ResponsibilitiesWhat we are looking for? We are looking for an Android Developer responsible for the design, development and maintenance of applications aimed at a vast number of diverse Android devices. You will be working along-side other engineers and developers working on different layers of the infrastructure. Therefore, commitment to collaborative problem solving, sophisticated design, and creating quality products is essential. We do not evaluate based on your experience, we evaluate based on your potential. Responsibilities:Single handedly convert product requirements documentation into a complete feature & verify it for release on Play StoreDesign, build, and maintain high performance, reusable, and reliable codeBuild new features & align them with product-requirementsBuild new features & gamification experience throughout the applicationEnsure the best possible performance, quality, and responsiveness of the applicationIdentify and correct bottlenecks and fix bugsHelp maintain code quality, organization, and automatizationRequirements:Strong knowledge of Android SDK, different versions of Android & advanced conceptsStrong knowledge of Android UI design principles, patterns, and best practicesExperience working on Databases & Network layer; should be able to implement offline-first experience for users with low-internet-connectivityFamiliarity with RESTful APIs to connect Android applications to back-end servicesExperience with offline storage, threading, and performance tuningExperience with the following Object-Oriented Languages: Java and/or KotlinPreferred:Experience in writing automated test cases will be desiredExperience with RxJava, Dagger, Kotlin, MVVM & Live DataBachelors Degree", "ROLE": "Software Developer", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - Mobile", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": [" SQL", "Android UI design", " Dagger", " Java", " Kotlin", "  MVVM ", "Android Development", " App Development", " RxJava", "Android SDK", "Android Developer "]}