{"JOB DESCRIPTION": "                    As a driven and experienced Engine Developer, you will contribute to the development of our innovative and market-leading clinical development product suite that helps our customers to design, model, and simulate complex innovative clinical trials with the potential to create significant value for sponsors and patients by increasing their probability of success and accelerating time to market.      You will be responsible for developing sophisticated and advanced statistical mathematical algorithms in C++ for our cloud-hosted and on-premise software products.       Summary of Job Responsibilities:          Implement statistical mathematical algorithms in C++ ensuring code quality, numerical accuracy of results and high performance of computations.      Implement complex algorithms requiring use of advanced data structures, memory management and high performance computing      Receive statistical algorithmic inputs from expert biostatisticians and convert them into code.      Design, code, unit-test and debug necessary C++ code units and modules following all good coding practices and applicable processes.      Combine the C++ engines with user interfaces and graphics coded in languages like C#.NET, JavaScript, etc.      Participate in peer code reviews with other developers and review each other s code.      Perform code refactoring and keep technical debt low.      Estimate and plan own work and deliver as per the plan.      Prepare all necessary code and design documentation.             Qualifications, Skills and Experience:          3+ years of experience in algorithmic scientific computing using CC++      Bachelor s Master s degree in Computer Science Engineering (CSE) from reputed engineering institutes from India or abroad      Strong knowledge of Applied Mathematics (numerical methods, calculus, linear algebra, mathematical modeling, statistical methods, optimization, etc.)      Quick learner with strong numerical verbal aptitude, logical reasoning and analytical ability      Strong knowledge of data structures and algorithms and theoretical computer science concepts      Strong knowledge of CC++ (knowledge of STL and newer standards like C++ 14 17 preferred)      Knowledge of practices like automated unit testing, code reviews and following C++ coding guidelines       Strong verbal and written English communication skills      Self-driven with ability to think creatively and solve complex problems      Strong initiative and work ethic             Optional Skills and Experience (preferred but not mandatory):          Knowledge of Statistics and scientific graphics      Knowledge of programming languages such as R, Python, Julia      Experience of developing microservices and REST APIs      Knowledge of tools used for code profiling, unit testing, detecting memory leaks and overruns      Knowledge of parallel computing and distributed computing      Knowledge of both Windows and LINUX environments      Knowledge of source control versioning tools like BitBucket, Git, SVN, etc.      Familiarity with project management collaboration tools like Jira, Confluence, MS Teams, etc.      Experience working with Agile frameworks like Scrum                        ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Strategy, Management Consulting Firms", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Graphics", "C++", "Linux", "Coding", "Project management", "Javascript", "Agile", "Data structures", "Windows", "Python"]}