{"JOB DESCRIPTION": "Your Role and ResponsibilitiesAs a member of the development group, you will become part of a team that develops and maintains one of Coupas software products developed using .NET, C#, VB.NET and built as a multi-tenant SaaS solution on all Cloud Platforms like AWS, Windows Azure & GCP.As a senior .Net developer, you will share with your team a leading responsibility for:  Software development, including for the creative development of new features and functionality;  Ensure that our cloud solution is fully scalable and configurable to meet different customer requirements;  Making high quality, user-friendly user interfaces  As we follow the Agile/SCRUM approach, you will also be actively involved in sprint planning and project management together with the team;  Analyzing requirements and creating the simplest and most effective cloud-based SaaS solution.Our ExpectationsWe expect that you are a strong developer with solid technical experience. You have a well-founded analytical approach to finding good solutions, a strong sense of responsibility, and that you have good skills in communication and planning. You are pro-active in your approach and a strong team player. Further, we expect that you have experience with Azure cloud development and deployment.Your Skills & CompetenciesYour experience and qualifications include most of the skills and competencies listed below:Technical skills  A minimum of 5 years of Microsoft technologies experience.  Proven experience with the .NET Framework, C#, and VB.NET  A minimum of three year’s hands-on experience with any Cloud Service development  MS SQL development and optimization experience  Experience with software/systems architecture/infrastructure  Knowledge of R/Python and AI/ML will be a plus  JS front-end experience will also be a plusCompetencies  You are able to find simple solutions to complex issues  You are always focused on updating your own and your team’s knowledge with the latest and greatest technologies and tools  You are experienced in handling flexible software architecture and changing requirements  You take an active part in the development team for developing and delivering high-end software solutions to the customers  You are familiar with working according to the SCRUM methodology or similar Agile processes  You have good planning and organizational skills  You have good spoken and written English  You hold an M.Sc. or equivalent degree in Computer Science, IT or similar.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Sc in Computers, B.Tech/B.E. in Computers, BCA in Computers"}, "KEY SKILL": ["Software Engineering", "C+", ".Net", "VB.NET"]}