{"JOB DESCRIPTION": "Experienced professional with well developed, proficient knowledge and skills in Applications Development. Operational in focus, may instruct or coach other professionals. Develops applications solutions from established programming languages and source code. Recommends improvement to existing applications using engineering releases and utilities.       Job Duties and Responsibilities    Consult with project sponsors regarding information flow and content including the facilitation of information gathering sessions   Work with a Business Analyst and/or users to understand requirements   Knowledge of database and development methodology, principles, and procedures is expected   Utilization of software and techniques in the analysis and interpretation of complex data sets is expected   Design and produce comprehensive computerized data queries and reports   Consistently honors promise and commitments and takes responsibility for own actions, words, and work   Able to work with diverse individuals/teams/customers. Able to interact and work with others as part of a team.   Takes the lead to get complex issues resolved. May require assistance for more difficult issues   Ability to work within a changing environment   Good organizational and written/verbal communication skills   Good presentation skills   Positive attitude and team focus are required      Required qualifications to be successful in this role:    Senior Mainframe Developer   EXP :: 4-7yrs   Understanding the requirement and build the technical design document. Good Working knowledge on COBOL, PL1, DB2, VSAM, JCL and IMS. Experience on various tools and utilities such as File-Aid and SPUFI. Experience on inter-system communication such as MQ Series, FTP will be advantage. Excellent problem analysis and trouble shooting skills. Experience on CAGEN tools will add the value. Worked in Agile methodology. Good to have Insurance domain expertise. Should be able to lead the small team. Commitment to Quality and code/design review. Clear understanding of the Software Development Life Cycle, estimation and defect management.      Skills:     COBOL    JCL    DB2 for z/OS    VSAM    CA Gen    IMS    PL1    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Mainframe", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "Post Graduation Not Required", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["VSAM", "JCL", "FTP", "CGI", "Db2", "Design review", "Cobol", "Agile methodology", "SPUFI", "IMS"]}