{"JOB DESCRIPTION": "Company DescriptionHCL Software is a division of HCL Technologies (HCL) that operates its primary software business. It develops, markets, sells, and supports over 20 product families in the areas of DevOps, Security, Automation, Digital Solutions, Data Management, Marketing and Commerce, and Mainframes. Its mission is to drive ultimate customer success with their IT investments through relentless innovation of its products.Job DescriptionIf you thrive in a dynamic and close-knit team, possess a strong passion for Senior Developer role, possess proven strong Design, Debug, Development & collaboration skills, self-starter and learner, we want to talk to you.We are looking for an enthusiastic Developer/Senior Developer to join an exciting product development team tasked to develop AppScan Source to be the best SAST solution in the application security market. In this role, you will develop features, maintain features, demonstrate features  and modernize AppScan product; provide mentoring to junior members, generate new business opportunities with Enhancing the product to its new future in close collaboration with internal stakeholders.EducationFormal 12+4 years of education preferably Bachelors in Computer Science or other equivalentResponsibilitiesUnderstand the current      architecture and design/develop new featuresHands-on programming in      Java/C++End to end development      including develop/design features, bug fixing, solving customer      issues/escalations, test, etc.Provide technical      guidance to junior team members through transparent and clear communicationsPrimary Skills>3      years of Development experienceAt      least 2 years experience in Java/C++ developmentExperience      in debugging, diagnosing, and trouble-shooting complex softwareExperience      in developing on Windows and Linux/Mac platformsStrong      knowledge of data structures and algorithmsGood      analytic, problem solving skills along with good aptitude and attitudeExposure      to software development in a global Agile environmentAbility      and desire to contribute in cross functional activities (development,      testing, etc)Persistent      and able to adapt well to changesAbility      to work independently and collaboratively in an efficient mannerGood to have/ Secondary Skills:Experience      in Eclipse RCP/Visual Studio/UI developmentExposure      to DevOps and DevSecOps processesKnowledge      of Application securityBackground      in programming languages/compilersKnowledge      of tools used for static analysis If interested please share your resume to monica_sharma@hcl.com", "ROLE": "IT/Technical Content Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Othe", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["Java", "C++", "Software Development", "Algorithms", "Data Structures", "Debugging", "Programming", "Visual Studio", "Eclipse Rcp", "Compilers"]}