{"JOB DESCRIPTION": "Job Description:\n\nFull Stack Developer belongs to Self- Organizing and Cross- Functional development team and is able to convert sprint backlog items to the shippable product. You will collectively own end to end development responsibility for a given Agile Team/  POD. You will\n\ndesign,  code and test\n\nthe user stories committed for a sprint. Work independently under limited supervision. Possess skills to effectively deal with issues,  challenges within the field of specialization to develop application solutions.\n\nResponsibilities:\n\n Lead an agile team within a Release Team/ Value Stream or IT Support Team.\n\n Accountable for team delivery.\n\n Develop and automate business solutions by creating new and modifying existing software applications.\n\n Develop innovation,  strategies,  processes,  and best practices.\n\n Technically hands- on and excellent in Design,  Coding,  and Testing.\n\n Collectively responsible for end to end product quality.\n\n Creation of high/  low- level application design.\n\n Participates and contributes in Sprint Ceremonies.\n\n Promote and develop the culture of collaboration,  accountability & quality.\n\n Provides technical support to the team. Helps the team in resolving technical issues.\n\n Closely working Business Teams,  Onshore partners,  deployment and infrastructure teams.\n\nRequired Qualification:\n\n 8 -  10 Years of experience -  working on multiple layers of technology.\n\n Excellent verbal,  written and interpersonal communication skills.\n\n Demonstrate capability to create high/ low- level designs.\n\n Engineering Practices.\n\n Working experience of 2+ year in Agile team .\n\n Understanding of various agile methodologies such as Scrum,  Kanban.\n\n Working experience of Test Driven Development.\n\n ITIL/ ITSM: Good understanding of IT Support /  Production Support.\n\n in Data Structure,  Algorithms and Design Patterns.\n\n Demonstrates excellent problem- solving skills.\n\n Design thinking and approach to solving a business problem by applying suitable technologies (cost efficient,  high performance,  resilient and scalable).\n\nInformation Security\n\nWorking knowledge on the below - \n\n Common security vulnerabilities,  their causes,  and implementations to fix the same.\n\n Security scanning methodologies and tools (e.g. HP Fortify,  Whitehat,  Webinspect).\n\nCommon Technical Skills:\n\n Database: 2+ year working experience of the database (SQL or PL/ SQL),  Good knowledge of. Exposure to Big Data,  NoSQL/ Flat Database.\n\n Web Services : 1+ year working experience in Web Services /  API,  REST Architecture,  etc.\n\n DevOps: Working experience in setting up or maintenance of CI/ CD pipeline (test,  build,  deployment and monitoring automation); 2+ years working experience of software configuration management and packaging; Experience in using automated deployment and release management tools such as XL Deploy,  XL Release,  Jenkins; 2+ years working knowledge of build tools such as Maven/ Gradle.\n\n Cloud: Working experience or good knowledge of cloud platforms (e.g OpenShift,  Azure,  AWS). Capable of demonstrating how to develop a sample cloud based application /  micro- services architecture.\n\n Open Source: Demonstrate a hands- on knowledge of OpenSource adoption and use cases; Real implementation experience of one or more open source technology (MySQL,  JBoss Platform,  Apache Camel).\n\n Good to have -  Contributing to one or more technical forums related to an open source technology.\n\nProduct /  Project /  Program Related Tech Stack :\n\n Front End\n\n Testing\n\nCertifications:\n\n Development Methodology /  Engineering Practices Agile (SCRUM /  KANBAN /  SAFe).\n\n ITIL /  ITSM knowledge or certification.\n\nPreferred Qualification:\n\n Excellent verbal,  written and interpersonal communication skills.\n\n Ability to work collaboratively in a global team with a positive team spirit.\n\n Knowledge of US Healthcare domain.\n\n Knowledge or certification SAFe.\n\n Knowledge of certification ITIL.\n\n Work experience in product engineering.", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Maven", "Automation", "Production support", "JBoss", "Coding", "Information security", "MySQL", "Healthcare", "Middleware", "Technical support"]}