{"JOB DESCRIPTION": "Roles and Responsibilities Hi,Hope you are doing fine!!Opening for Software Full Stack Developer with US based MNC- Bangalore(Basavangudi)Know about the Company-Company is a leader in providing display merchandisers, refrigeration systems, installation and services to food retailers around the worldQUALIFICATIONS AND EDUCATION REQUIREMENTS-•\tBachelor’s Degree in Computer Science or a related field or Web Development Certification or comparable work experience•\t3~5 years’ experience with degreeWork location- BangaloreROLE AND RESPONSIBILITIES\t-•\tSummary – This position is primarily responsible for Full stack development and responsible for the  development, validations and release of software products and supporting applications on Company's electronic controllers and new technology developments. The role will be engaged in cross functional activities for new product development and existing product improvements. •\tPrimary focus is front-end development. Writing reusable, testable, and efficient code. Design and implementation of low-latency, high-availability, and performant applications.•\tIntegration with Electronic controller’s Webserver. Integration with existing data storage solutions and data access APIs.Help to develop tests to verify integrated solution.•\tMust have 3+ years of work experience with JavaScript development, React.JS, jQuery and it’s implementation .Must have 3+ years of work experience with HTML and CSS development and implementation .Familiarity with back-end development.•\tKnowledge and experience in developing full stack web applications using Node JS, python,  angular or similar technologies is a plus.Experience with networking protocols – Ethernet, IP, UDP etc. and controls communications protocols - CAN, BACnet, Modbus is a plus. .Experience in source code management tools (Git, TFS, etc.), defect tracking tools (YouTrack, Test Track etc.) and other deployment tools.•\tKnowledge and hands on experience with controls development in refrigeration or HVAC or other related industry is a plus.Familiarity with Agile/DevOps project planning, bug tracking systems.Familiarity with handling Excel based database.•\tComfortable developing and integrating code into an existing code baseExperience with Linux and Mac development environments is a plu.Experience in developing software using QT is a plus.Experience with gRPC is a plus.Ability to work in a fast-paced environment.Ability to take initiative and effect change Documentation skillsKindly send your updated resume if interested  to gayatri. patil@futuresandcareers.com", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Graduation Not Required"}, "KEY SKILL": ["CSS", "Software Development", "Front End", "Web Technologies", "Javascript", "HTML", "JQuery", "React.Js", "Web Development", "Angular"]}