{"JOB DESCRIPTION": "Hello,Greetings from Rishabh Software...!!!We have an opportunity for the role of Sr./Jr. Magento Developer with us here in Vadodara- Gujarat. Your profile on job portal seems matching to the requirement, hence please find below a brief about our Company and the job requirements for your better understanding:About Rishabh:Rishabh Software (CMMi Level 3), an India based IT service provider, focuses on cost-effective, qualitative and timely delivered Offshore Software Development, Business Process Outsourcing (BPO/RPO) and Engineering Services. Our Core competency lies in developing customized software solutions using web-based and client/server technology. With over 15 years of Software Development Experience working together with various domestic and international companies, we, at Rishabh Software, provide specific solutions as per the client requirements that help industries of different domains to change business problems into strategic advantages. Over 15 years of experience in software developmentCMMi Level 3, ISO9001:2008 and ISO27001 certifiedSuccessfully executed over 450+ projects globally across 200+ clientsBest in class infrastructure.Latest technologies to work on.One of the most preferred IT employer.Based out of Baroda, Bangalore, US, UK locationsGlobal Development Partnerships Microsoft, Oracle, Design and Solution Partner BigCommerceOver 400+ team members and growingJob Description • Excellent communication• Strong Analytical capabilities• Magento Version 1.X & 2.X• Expert in Magento Plugin, Theme Development and Magento Customization • Magento certification • Strong OOPs concepts• Working knowledge of design patterns• Willing to learn new technology• Excellent in JavaScript & JQuery• Good working knowledge in Database concepts and working knowledge in MySQL Server• Good to have MVC Framework [Laravel] and CMS [Wordpress, Drupal] knowledge", "ROLE": "Technical Support Engineer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - eCommerce, Internet Technologies", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Admin/Maintenance/Security/Datawarehousin", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Any Doctorate in Any Specialization"}, "KEY SKILL": ["Drupal", "Software Development", "MySQL", "Wordpress", "MVC Framework", "Magento", "Javascript", "JQuery", "Theme Development", "Laravel"]}