{"JOB DESCRIPTION": "Hi,We have currently opening for Moodle for one of our client in Gurgaon.Key Skills: Moodle PHP DeveloperExperience : 6 to 12 yearsLocation: Gurgaon(Work from home)Notice Period: 20 days and Immediate joinersNote: Candidates can apply anywhere from India Candidate must have the following experience and attributes:  Minimum 7 years experience in a professional Moodle (PHP) development environment; Extensive knowledge of PHP 5, MySQL 5, Apache 2 and Linux, Ubuntu experience preferred; Programming Skills : PHP/ AJAX/MySQL, Javascript/ HTML and XML technologies;  Strong hands-on working experience in Moodle Configuration and Administration; Strong hands-on working experience in Web technologies, System development, implementation & support activities;  A passion for open source approaches to software creation;  Experience working on scripting language such as Perl; Code & SQL query creation and optimization; Experience in XML data structures and Web services (i.e. SOA). To design and develop strategic, high traffic, highly secured Moodle based platforms on wordclass cloud infrastructure. This position involves partnering with global teams across geographies in arriving with optimal solutions and delivery;  Develop structured application. Document the applications and enable other team members to be able to maintain them;  Primary responsibilities will be the development and enhancement of Moodle features and the support of subsystems in order to satisfy business requirements;  Design database schemes to support programming efforts;  Work with usability experts and user feedback to provide efficient and effective GUIs for users;  Work in small, high-performance teams developing enterprise-level web applications;  Capable of designing and developing code, configuring environments, and deploying technical solutions;  Assist in technical support to clients;  Support quick-turnaround software development in a dynamic and highly visible environment;  Proactive in introducing process improvements or changes that can help in improving the overall effectiveness of the team; ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization, BCA in Any Specialization", "PG": "MCA in Any Specialization"}, "KEY SKILL": ["Moodle"]}