{"JOB DESCRIPTION": "   The Person We Need Has:     A love of, and alignment with, the 75F mission, virtues values.    An Extremely High Technical Aptitude we are an extremely high- tech company!   A love of technical architecting and technology platform solutioning.    Integrity. At all times and in all situations. No compromise here.    Enthusiasm Passion   Insanely superb written and verbal good communication skills and a high level of professionalism along with the ability to effectively collaborate with cross functional teams.    Strong time management skills   A fast learner, comfortable teaching yourself with new skills and can thrive in a complex and fast-paced environment.   A love for analytics and various User experience aspects.   Detail-oriented and highly motivated approach   Quality-first approach for development implementation and team processes   Desire for continuous learning and improvement   Desire to work outside comfort zone     Required Education     Bachelor s Degree or higher in Computer Science, Software Engineering, or closely related technical discipline     And the following Skills:     6+ years of experience in quality assured timeboxed delivery of modern frontend frameworks with application development and database data integration into front end.    5+ years in technology : hands on Development and testing of modern UI and web application frameworks (e.g., Angular 5+), Mobile application development (e.g., Android, Apache Cordova, etc.), NodeJS implementation   3+ years in application data Visualizations expertise and related graphing tools (e.g., D3, Graphana etc.)   3+ years in application persistence layers and related design choices (e.g., SQL, NoSQL, etc.)   4+ years of working knowledge in unit testing, integration testing, and UI testing frameworks and methodologies (e.g., JUnit, Spock, Jasmine, Selenium, etc.) as part of software testing automation   Experience working with 3D images and libraries on Angular   Experience working in a Docker containerized environment   Knowledge of Schema development and exposure to latest BMS protocols and schema - Haystack   Must have strong web-based user-interface development skills and Customizations   Candidates with full stack development experience including Mongo DB, JavaScript, Backbone, JQuery, HTML, CSS will have a distinct advantage    Experience with designing databases, programming on Azure function apps is an added plus     And the preferred experience:     Previous work exposure in IoT industry / embedded / M2M industry (i.e. home automation, business automation, health, asset tracking, smart utilities, etc.)   Experience with distributed teams are highly desired   Ability to technically drive solutions across various features. Must be able to seek input when required, prioritize and drive results.    Knowledge of implementing maintainable and well-tested software and relevant support technologies (e.g. NodeJS, Angular, JUnit, Spock, Git, SQL/NoSQL databases, build pipeline automation, etc.)   Ability to develop resilient and high-scalability applications    Ability to learn quickly and adapt to change in a fast-moving environment   Ability to translate complex business requirements into simple, elegant technical solutions for the development engineers   Highly collaborative approach to technical delivery from the standpoint of business domain and requirements   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Other", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Automation", "jQuery", "Javascript", "HTML", "Selenium", "Unit testing", "Analytics", "SQL", "Android"]}