{"JOB DESCRIPTION": "Note: Do not apply if you don't have any idea or experience of computer security software like antivirus, Total security. Alliance Antivirus is experiencing tremendous growth and looking to hire a professional with deep expertise around conceptualizing security content from established security benchmarks and reference frameworks. This successful candidate must have a minimum 8 years of experience in Architecture and Design of Enterprise solutions and IT Audit, Security Risk Assessment and Regulatory Compliance fields. This position will be located out of our Oakland , CA(US) or Gurgaon, HR(India) office.General Requirements:Good knowledge of Open Vulnerability and Assessment Language (OVAL), repository and Security Content Automation Protocol specification (SCAP).Knowledge of designing and building content for IT Security systemsWorking knowledge of IT Security Best practices and infrastructure standardsThe propensity towards research, innovation, and creativityA fascination for cloud computing, virtualization, software-defined networkingWorking Knowledge Of:OS patching scanning and reportingDatabase scanning methodologiesAntivirus management and forensicsEncryption technologiesEmerging virtualization technologiesSecurity Must Haves:Information security core competencies such as standards, guidelines, and procedures to ensure ongoing maintenance of information securityKnowledge and understanding of Networking, Windows, MAC, Unix, Middleware, Firewalls and Security SystemsKnowledge of computer systems, computer network systems, and all associated hardware, software and associated protocolsStrong knowledge of various industry standards including PCI, SOX, ISO and HIPAA and auditing information system operationsExperience with one or more cloud providers - AWS, Azure or GCPStrong logical security skills, with experience of cryptography and enterprise securityProgramming skills in any one of Python / Java / Node / GoCertifications (in one or more):CISSP (Certified Information Systems Security Professional)CISA CertificationSSCP (Systems Security Certified Practitioner)CEH (Certified Ethical Hacker)GIAC (Global Information Assurance Certification)", "ROLE": "Project Manager-IT/Software", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Network Administration, Security", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Project Managemen", "EDUCATION": {"UG": "B.Sc in Any Specialization, B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["Application Programming", "Software Development", "Web Application Security", ".Net"]}