{"JOB DESCRIPTION": "Roles and Responsibilities                      Greetings from Excelacom Technologies!!! Your profile is suitable for the position, \"Java Developer\" at Excelacom. If you are interested kindly mail me your resume at \"megtha.v@excelacom.in\" with the below details: Total years of experience: Current CTC: Expected CTC: Notice Period:  Available for face to face discussion on 25th January (Saturday) (yes/No): Job Description: 1. Should be strong in Java, J2EE,Spring, Struts, hibernate etc., 2. Responsible for development, coding and testing using Java, J2EE.  3. Involved in documentation work like preparing Low Level Design Document, updated requirement specification document and Unit Test cases. 4. Creating tables, writing procedures and SQL, PL/SQL queries would be an added advantage Experience : 2 to 5 yrs Salary - Best in Industry Job Location - Chennai Who are we as a Company:- Excelacom Technologies is an independent software vendor, offering BSS/OSS solutions and services to Tier 1 to Tier 3 NGN communications players across multiple geographies. Leveraging the bouquet of our offerings, we focus on empowering the communications service providers to meet the challenges in today\"s converging telecom market. Excelacom also provides system integration, application development, testing and full-scale outsourcing facilities, tailored to the needs of the telecommunication industry. Our mission is to re-activate the businesses of our clients through innovations in the business process architecture and the IT infrastructure. Our global operations are supported by our experienced consultants, analysts and technology specialists in US, Europe and Southeast Asia. Regards, Megtha - TAG Team", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["spring", "Core Java", "java", "sql queries", "Spring Mvc", "jsp", "j2ee", "servlets", "hibernate mvc", "plsql", "application development"]}