{"JOB DESCRIPTION": "Roles and ResponsibilitiesJob brief :- We are looking for a .Net developer to build software using languages and technologies of the .NET framework. You will create applications from scratch, configure existing systems and provide user support.In this role, you should be able to write functional code with a sharp eye for spotting defects. You should be a team player and excellent communicator. If you are also passionate about the .NET framework and software design/architecture, we'd like to meet you.Your goal will be to work with internal teams to design, develop and maintain software..NET Developer Responsibilities include :-1. Producing code using .NET languages (C#, VB .NET).2. Upgrading, configuring and debugging existing systems.3. Providing technical support for web, desktop or mobile applications.Responsibilities :- 1. Participate in requirements analysis2. Collaborate with internal teams to produce software design and architecture3. Write clean, scalable code using .NET programming languages4. Test and deploy applications and systems5. Revise, update, refactor and debug code6. Improve existing software7. Develop documentation throughout the software development life cycle (SDLC)8. Serve as an expert on applications and provide technical supportQualifications :- Any Under Graduate (B.Tech/BE/BCA/MCA preferred)Experience :- 4 to 7 YearsHere are the interview details :Time : - 11:00 AM to 4:00 PMAddress : - Export Genius, 2nd Floor, C-7/224-225, Sector-7, Near East Metro Station, Rohini, Sector 7, Rohini, New Delhi, Delhi 110085", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization, BCA in Computers", "PG": "MCA in Computers", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["C#", "MySQL", "Technical Support", "Develop Documentation", ".Net", "VB", "SDLC"]}