{"JOB DESCRIPTION": " We are looking for hardworking Test Developer Engineer to join the Automotive QA group.     This position will be part of a dynamic crew that test and maintains the quality of sophisticated heterogeneous computing systems that power state of the art automotive products used in self-driving cars. As a Test Developer Engineer, you will be responsible to develop and execute exploratory and automated tests to ensure self-driving car SW/HW stack meet high standards of quality.     We need our engineers to be multifaceted, display leadership skills and enthusiastic towards solving problems and taking technology forward. This role will also require to frequently get along with module leads & release managers.      What you'll be doing:      Design and execute tests on autonomous systems and components.     Create detailed, comprehensive, and well-structured test plans and test cases.     Identify, record, document, and regress internal and external filed bugs.     Participate in review and provide feedback on product feature requirements, specifications, and technical design documents.     Working closely with various team including project management, hardware, and software developers, provide technical analysis of the Top Bugs filed and periodically publish statistical data reports to all stake-holders.     Application development, test tools and automation of tests on embedded platform using Nvidia Test framework.        What we need to see:      B.Tech. or Equivalent degree in CS/CE/IT/ECE/EEE.     At least 3+ year s hands on testing experience in complete embedded software stack.     Experience with Linux is required. Other embedded OS (QNX) experience is helpful.     Good Knowledge of Python scripting language is mandatory - able to write logical scripts/code from scratch.     Good debugging skills. Able to understand different logs and root cause the issue.     Experience to use Configuration Management tools (Git, Perforce) and Agile scrum tools (JIRA, JAMA).     Ability to self-manage, good analytical skills, and communicate well.     Should be an excellent teammate, with passion towards new technology/trends.        Ways to stand out from the crowd:      Any certification course on Machine learning / Self-driving car.     Hands-on experience in HIL/SIL setup and Testing.     Knowledge of autonomous driving simulator (IPG Car Maker, Tass Prescan, etc...).     C++ coding experience. Understand the large C++ project code and derive functional/unit test.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Broadcasting", "FUNCTIONAL AREA": "IT Software - QA & Testing", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["C++", "Automation", "Linux", "Coding", "Project management", "Configuration management", "Debugging", "Application development", "Python", "Embedded software"]}