{"JOB DESCRIPTION": "  We are looking for QA Test Developer Engineer to join the Embedded QA group of Intelligent Video Analytics (IVA) and multi-sensor processing.         This position will be part of dynamic engineers that test and maintains the quality of complex DeepStream SDK which delivers a complete streaming analytics toolkit for situational awareness through computer vision, intelligent video analytics, and multi-sensor processing. We are looking for QA Test Developer to develop and execute exploratory and automated tests to ensure intelligent video analytics SW/HW stack meet high standards of quality.       As a member of this core team, you will be working with highly hardworking and motivated engineers. This role will also require to frequently get along with workstream leads & release managers.          What you will be doing:        Design, author, code and maintain scenario of DeepStream SDK components and validate.       Design and setup analytics and sensor processing configuration and perform deployment of the complete stack.       Create test strategy, detailed, and well-structured test plans and test cases based on high-level customer requirements.       Participate in the review and provide feedback on product feature requirements, specifications, and technical design documents.        Working closely with various teams including project management, hardware, and software developers, provide technical analysis of the Top Bugs filed and periodically publish statistical data reports to all partners.              What we need to see:        Bachelor Technical degree or equivalent experience in CS/CE/IT/ECE/EEE.       At least 2+ years of professional experience in Embedded Software Validation preferably in the field of Intelligent Video Analytics and Multi-Sensor processing on AI-powered platforms.       Excellent programming skills in python should be able to design and code from scratch.       Good experience in Multimedia, viz. how video decode and encode works from Camera side as well as device side, the impact of the Frame structure, encoding parameter like bitrate, frame rate, Frame intervals, Video compression techniques, VMS systems, and GStreamer framework.       Good debugging skills. Able to understand different logs and the root cause of the issue.       Experience with Linux Ubuntu/RHEL is required.       Experience to use Configuration Management tools (Git, Perforce) and Agile scrum tools (JIRA, JAMA).       Ability to self-manage, show leadership, good analytical skill and communicate well.       Should be an excellent teammate, with passion for new technology/trends.              Ways to stand out from the crowd:        Knowledge of message brokers like Kafka, Azure, AMQP.       Knowledge of Kafka Tools, Spark, Elasticsearch, Logstash, and Kibana.       Experience in GFX viz. different rendering techniques, Display parameters, graphic processing techniques, shaders, and clusters.       Experience in dockers, containers, and Kubernetes.    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Broadcasting", "FUNCTIONAL AREA": "IT Software - QA & Testing", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Linux", "Project management", "Configuration management", "Debugging", "Test cases", "SDK", "JIRA", "Analytics", "Python", "Embedded software"]}