{"JOB DESCRIPTION": " We have an urgent opening for Software Developer profile for Thane (Mumbai) location.   (Opening for Fulltime)  *Candidates near by Thane location will be preferred * Interested candidates send your CV at vivekpatil@unihrsolutions.com    Job description :  Opportunity to work with global clients   As an ASP.Net Web Software Developer, your primary responsibility will be the software design and development of Web based applications, Web services, middleware and windows services layers using Microsoft.NET technology. Areas of knowledge and experience include fluency in Object Oriented Programming concept and development in C# .NET and experience with Microsoft web based development technologies such ASP.NET, AJAX, XML, .NET Framework API, Graphic Designer, JavaScript, CSS, ADO.NET. Experience with using SQL and interfacing to relational database systems is required.   Responsibilities   Design, programs, tests, and debugs ASP .Net and C# web services based on software design specifications. Resolves assigned issues identified from testing\\production.  Follows established Software Development Lifecycle and coding standards to create maintainable, production ready code. Prepares progress reports and keeps management informed of status.    Required Skills :   0-2 Years experience in .NET, ASP.NET, C#, Web Services, WCF, Entity Framework, Strong understanding of Microsoft .Net coding standards, patterns, and practices  Web UI development skills (ASP.NET web forms,CSS, JavaScript, JQuery, cross-browser support, Bootstrap etc.)   SQL Server database development and performance tuning, Microsoft ADO.NET       Desired Skills :   Web/mobile, Bootstrap, JSONP/oData based services, Telerik UI ASP.NET AJAX, Native Script . Required Candidate profileRequired Candidate profile :1-2 Years experience in .NET, ASP.NET, C#, Web Services, WCF, Entity Framework,Strong understanding of Microsoft .Net coding standards, patterns, and practices.Web UI development skills (ASP.NET web forms, CSS, JavaScript, JQuery, cross-browser support, Bootstrap etc.)SQL Server database development and performance tuning, Microsoft ADO.NE", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Sc in Computers, BCA in Computers", "PG": "MCA in Computers", "DOCTORATE": "Doctorate Not Required, Any Doctorate in Any Specialization"}, "KEY SKILL": ["c#", "css", "entity framework", "bootstrap", "ajax", "javascript", "jquery", "sql server"]}