{"JOB DESCRIPTION": "  3 - 6 years of experience in software development with a B-Degree in Computer Science, Electronics, Software Engineering or related field in Computer Science from a premier institute.    3 years of software engineering experience Strong practical development experience with BPEL.    Experience in work flows, BO maps, XSLT transformations, XPATH and BPM technologies.    Experience in BPEL flows, Mediation and Assembly modules.   Strong practical integration experience of business service orchestration, using BPEL, including strong integration domain knowledge.    Solid experience on integration protocols (e.g. Web Services (SOAP/XML) REST and the related SOA-security requirements.    Experienced on Rule Sets and Rule Groups.    Understanding of Short-running and long-running processes Understanding of security pattern implementation    Ability to write elegant, readable, and well-documented code.    Passion for quality, an obsession for performance, entrepreneurial spirit and an attitude to disrupt and innovate.    Focus on Material Design principles and pixel-perfect implementation of design into code Own the delivery of an entire piece of a system or application.    Develop unit test cases for his/her project module.    Familiarity with continuous integration    You will work in an Agile Development environment, co-locate and collaborate with team members, and will support the SCRUM Master and help the team deliver their sprint goals, tasks, and retrospectives.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Computer science", "continuous integration", "orchestration", "SOA", "XML", "Agile development", "XSLT", "Scrum", "Bpel", "Test cases"]}