{"JOB DESCRIPTION": "       Job Description              A developer who has minimum experience of 6 months in Unix Shell scripting and SQL.                 Must have hands-on experience with Unix, Shell Scripting and SQL                Strong analytical & problem-solving skills               Good understanding of Databases, DWH               Sound knowledge of at least one Job scheduler tool.               Should have good communication skills and client handling skills               To do attitude and willing to lean new technologies                Should be able to understand the client s IT state and business. Ability to work with team members towards quality delivery and focused upskilling.               Writes code that can be easily maintained/reused, by following the coding standards               Produce good, detailed code documentation               Works with QA personnel to develop and carry out test plans to ensure the solutions delivered are as per the business requirements               Works with database personnel to design logical/physical database models to support the requirements related to ETL.               Develops database triggers and SQL queries needed inside the ETL.               Participates in the ongoing support and problem resolution of developed ETL Solutions.               Responds appropriately to urgent technical support situations and procedures with quick and effective solutions to business problems.               Participates in design and code reviews with peers, team members, and architects.        ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["QA", "Client handling", "SQL queries", "Coding", "Analytical", "Database", "Technical support", "Unix shell scripting", "Testing"]}