{"JOB DESCRIPTION": "  Responsibilities :    Should be able to provide technical direction and be hands-on with implementation skills for build new age application workloads with proper design considerations and align with overall architecture goals.   The implementation should meet both functional and non-functional requirements.   Able to lead team and multitask across different role expectations seamlessly developer, Tech Lead, Designer.   Create and review design and implement solution artefacts   Proactively provide guidance on engineering methodologies, standards and leading practices for the development team.   Able to design and implement e2e testing while adopting TDD and setting up required tooling infrastructure for automation.   To help technical team with any code difficulties and manage task distribution and delivery for assigned team members   Assist in qualifying team members addition by conducting technical interveiew   Experience :   4+ years of experience in application development and deployment,   Good technical design skills, implementing complex solutions on cloud.   Have application specific configurations and troubleshooting experience.   Design and implementation experience in asynchronous applications event based.   Application implementation with REST APIs and message integration workflows.   Ability to implement and analyze application diagnostics and telemetry both from application and from platform.   Team Collaboration must have :   Customer-oriented, diligent, proactive, focused on achieving customer s business objectives as top priority.   Able to work successfully both individually and as a team member.   Easy-going, friendly, communicative, positive in relations with colleagues.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Hibernate", "Automation", "TDD", "MySQL", "HTML", "Application development", "JPA", "Oracle", "Troubleshooting", "Analytics"]}