{"JOB DESCRIPTION": "  Key Responsibilities:    As a Software Developer in Technology Consulting, you will be expected to:     You will be responsible for both software development and technical consultancy, gathering and reviewing specifications, and participating in on-site workshops   Deliver high quality custom development solutions in line with defined customer requirements and Stibo standards   Resolve complex technical tasks writing secure, reliable, scalable and maintainable code.   You will ensure quality of deliverables remains in line with agreed standards within scope and budget   Implement and execute relevant Unit & Integration tests; debug and resolve technical problems that arise.   Support in project estimation, planning and risk management activities.     Skills/Experience/Competencies:     Hands on development experience (minimum 2-4 years) using Java technology stack with strong focus on architecture and design.   Solid experience in   Java,   exposure to   Java-Swings & GWT   will be a plus  .    Advanced knowledge in web development using   XML, XSLT, JSON,   ReactJS, JavaScript ES5/6, HTML5 and CSS  .   Experience working with Service Oriented and Event Driven Architectures (SOA / EDA),   JMS messaging, SOAP, REST-full services and GraphQL  .   Analytical mindset and good problem-solving skills.   Experience working with IntelliJ IDEA, Gradle, SVN, Jira, Git    Experience with   Stibo STEP MDM   (including Certifications) is a definite advantage   You are customer focused and always driven by adding value to the stakeholder experience.   You are able to focus and drive results both as a team player as well as an individual.   You have a positive attitude and pro-active approach focused on options and opportunities.   You are flexible, able and willing to go the extra mile to achieve results and obtain stakeholder satisfaction   You have strong communication skills, both verbally and written. English business language proficiency is a must         Stibo Systems offers     A challenging, internal position in an international company with solid growth and a stable economy as well as ambitions and visions for the future. You are offered an academically motivating environment with excellent opportunity for individual advancement and room for initiative and new ideas.    The working culture is informal, and our aesthetically designed Bengaluru office is in a state-of-the-art workspace in South Bengaluru with many great amenities. Apart from a competitive salary, we also offer the following benefits:    Annual bonus based on business performance.   Health Insurance for you, your spouse, children and parents.   25 Days of paid leaves and 12 declared holidays. We truly encourage time-offs, off-grid.   Dedicated pantry with beverages and snacks.   Attend courses and earn industry reputed certification on STEP and MDM solutions.   International travel opportunities for training and collaboration.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["JMS", "CSS", "SOA", "GWT", "XML", "Web development", "Javascript", "XSLT", "JSON", "Risk management"]}