{"JOB DESCRIPTION": "  Job Department: Uptime Analytics      Job Description          Design, develop and deploy microservices with focus on high availability, low latency and scalability     Deliver maintainable, robust and testable code with focus on automated testing     Collaborate with both technical and business team members to understand requirements and develop solutions using an agile development process.      Collaborate with test engineers to define and write automated and manual tests to deliver a fully tested, high-quality services.      Build and operate infrastructure, toolset and deployment pipelines     Continuously improve our product by innovating     Drive a high standard of excellence for service scalability, and performance     Work in an environment that supports your individual and organizational growth       Requirements       6 - 8 years of development experience with 4 years of developing using Python with exposure to front end technologies - Angular, React, Vue.      Very Strong experience in object-oriented design and analysis, design patterns and best practices      Experience working with Relational Databases, NoSQL Databases (experience with Timeseries Stores will be an added advantage)     Experience in building and maintaining cloud-hosted services preferably AWS     Experience in using of AWS cloud services such as S3, Lambda, DynamoDB, ECS, SQS, SNS, API Gateway     Experience building multi-tenant systems, techniques and approaches     Strong communication skills - both written and verbal      You know and care about sound engineering practices like continuous integration, automated testing and continuous delivery     Understanding of Software containerization platform to create, deploy, and run applications by using containers preferably Docker.     Knowledge of writing infrastructure as code using Cloud Formation or Terraform       Good to have Experience/Knowledge:       Experience with Java, Go, JavaScript/Typescript and related tooling     Exposed to design and development in a secure Distributed Microservices oriented architecture which utilizes the auto-scaling, robustness and resiliency of IaaS platforms such as AWS     Experience working on Machine Learning and Machine Learning Platforms     Exposure to cloud monitoring and costing     Experience working with users and data scientists to analyse data     Experience working with IoT, IIoT, telematics or time series data     Experience working as a data engineer - design data analytics infrastructure, databases and data warehouses/lakes/marts      ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Object oriented design", "Costing", "Front end", "NoSQL", "Machine learning", "Javascript", "Telematics", "Monitoring", "Python", "Service operations"]}