{"JOB DESCRIPTION": "   We currently have an opening for a Software Developer at our development office in Bangalore, India. As an integral member of the Development team, the Software Developer works with the technical team to design and implement CAD-based software for the engineering and architectural design communities.    ESSENTIAL RESPONSIBILITIES:     Invent new software solutions to solve engineering and architectural design problems.   Develop, Maintain, improve and re-invent existing company products.   Work closely with product management to gather software requirements.   Work with project team to plan, analyze and estimate project timelines.   Assist customer support, sales and marketing departments.   Contribute to continuous improvements within the agile software development process.   Collaborate with other stakeholders and be accountable to each other to achieve the project s vision.   You have the experience, drive and creativity in developing innovative and quality software product for a broad base of users. You understand the principles of agile software development and can plan, design and implement features efficiently in a fast-paced work environment. You have a practical knowledge of object-oriented design and implementation. You have programmed CC++ with AutoCAD, MicroStation, or other graphical platforms. You want to work with a group of dedicated software professionals and get on board with a fast growing, leading edge and competitive software company.     SKILLS, KNOWLEDGE AND ABILITIES:      Full-stack developer comfortable working with users to develop innovative new tools to solve engineering problems. (Including requirements analysis, software design and implementation, algorithm development and user interface).    Work well in a deadline-driven agile software development environment.    Working knowledge of UML, UI design, database schema and software life cycle tools.    Exceptional analytical and problem-solving skills.    Communicate well with product management team members and other stakeholders with diverse background.    Self-motivated and driven to be successful.     QUALIFICATIONS AND EXPERIENCE:     A Bachelor s degree in Computer Science, engineering or related fields.    5 years of experience with C++. 3 or more years of experience in SQL, MFC, .NET and WPF.    3 or more years of experience with web development tools such as HTML, CSS, JavaScript, Node.JS, or ASP.Net    Experience developing software in 2D and 3D graphics environments and have worked with graphics APIs in the past.    Experience or with Civil Engineering tools such as Civil 3D, Geopak or Inroads is an asset.    Experience with GUI frameworks and UI design is an asset.     ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Graphics", "C++", "UML", "Web development", "Agile", "HTML", "MFC", "Customer service", "WPF", "SQL"]}