{"JOB DESCRIPTION": "  JOB SUMMARY: Polaris Industries Inc. is   looking for a Sr. Microsoft ERP Developer to work in an exciting, very   fast-paced environment. As a Microsoft ERP developer on the Polaris team, you   will have the ability to maintain multiple instances that serve multiple   countries, languages and time zones. You will also have an opportunity to be   involved in the team that will design and upgrade an instance to a newer   version. Strongest candidates will be excited about power sports as well as   technology. Additional duties will include helping to push industry   best-practices toward maturity including continuous integration builds,   automated deployments, and leading-edge best trends. ESSENTIAL DUTIES & RESPONSIBILITIES: Architect,   design, code, test and debug applicationsVisualize   changes necessary for given problems and understand the impact to articulate the   necessary customizations that adhere to industry standardsParticipate in   development of project plans, specification documents and test plansAssist in the   preparation of system requirements and design specificationsWork with users   and co-workers to develop, test and implementation plansAttend and   participate in project and administrative meetingsAct as mentor   to junior resources, capable of answering technical questions and guiding   design concepts and technical understandingAbility to articulate technical concepts to both   technical and non-technical peopleSKILLS & KNOWLEDGE Minimum Qualifications:5 - 10 years development experience Bachelors degree in Computer Science or strong work   equivalent 8+ years technical experience in Dynamics AX 2009/ AX   2012/D365FO2+ years of development experience in D365FOExperience in using Lifecycle Services (LCS) Tools.knowledge Azure technologies is preferred.Experience leading and mentoring other developersPreferred Qualifications:Experience with creating and managing Data Entities.Experience with creating and managing Integrations using OData   Knowledge in SQL.Experience in Azure Tools such as Logic App, Azure   Functions, Storage Accounts and Virtual machines(VM).Experience integrating AX/D365FO with Dynamics CRM/D365CE   or other .NET custom web applications Design, architect and configure new Dynamics AX/D365FO   instancesExperience in Supply Chain and Trade & Logistics   modules such as Accounts Receivable, Accounts Payable, Inventory Management.", "ROLE": "Software Developer", "INDUSTRY TYPE": "Automobile, Auto Anciliary, Auto Components", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Sc in Computers, B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["D365FO", "Microsoft Dynamics AX"]}