{"JOB DESCRIPTION": "      This is your role. What part will you play?     You will be Responsible for the development and delivery of parts of a product, in accordance to the customers requirements and organizational quality norms. Activities to be performed include:   Build Develop robust interactive GUI components for desktop or client/server application.   Improving user experience, scalability and performance.   Requirement analysis and design of software solutions based on requirements and design guidelines.   Build Implementation of features and/or bug-fixing and delivering solutions in accordance with coding guidelines and timely with high quality.   Identification and implementation of unit and integration tests to ensure solution addresses customer requirements, and quality, security requirements of product are met.   Good at presenting within the team as well as with all the partners   Strong customer focus and good learner.   Highly proactive and excellent teammate     We don t need superheroes, just super minds    You must have BE / B.Tech / MCA / ME / M.Tech qualification with 4 years of confirmed ability?   Confirmed skills in C# with WinForms, WPF and MVVM   Knowledge in Linq and Rest Services   Expertise in programming and usage of any unit testing framework.   Expertise in integration testing and continuous integration.   Knowledge of Software Engineering processes. Experience with Agile/Lean practices is helpful   Knowledge of design patterns, source code management tools like git   Knowledge for JIRA and Confluence will be a plus   Good to have knowledge of Multi-threaded programming  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Production/Industrial", "PG": "M.Tech in Electronics/Telecommunication, MCA in Computers"}, "KEY SKILL": ["DTS", "LINQ", "Development Manager", "Coding", "Consulting", "Agile", "Winforms", "Unit testing", "WPF"]}