{"JOB DESCRIPTION": " Responsibilities     Android native Framework and Native development and customizations, In-vehicle/automotive Infotainment Platforms  Must have worked on Android framework customization extensively in websockets,AM/FM  Android experience and Voice recognition & Text to speech engine knowledge is highly preferred.  In-Vehicle Infotainment, Vehicle networking & On-board diagnostics (OBD)  Android experience in Integration of Navigation engines such as Telnav,Tomtom etc sdk's highly preferred.  experience Binder framework and networking framework  Excellent in C++, design patterns, Android SDK, Android NDK, Java is added advantage  Experience on Android HIDL interfaces implementation and customizations  Android CTS and VTS debugging and issue fixing  Interface with Various Domains within Android Product Line to achieve Stability metrics.    What you need:    3-5 years of experience on embedded systems, with focus on Android Framework and Native development  Strong C++ programming skills  Understanding of Android Boot Sequence and various Framework module architecture.  Proficient in Android System concepts.  Should have experience on Android development and debugging robust systems  Proficient in multi threaded programming and middleware solution development on Android environment. Strong in fundamentals of IPC and OS concepts.  Good experience in Android internals (Android O and P expertise preferred)  System level debugging ", "ROLE": "Associate/Senior Associate -(Technical)", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "ITES, BPO, KPO, LPO, Customer Service, Operations", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Back Office/Web/Transaction Processin", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Automation", "Due diligence", "Claims", "Networking", "Staffing", "Debugging", "Agile", "Information technology", "Technical support", "Android"]}