{"JOB DESCRIPTION": "BTech -  CSE/ ECE from IIT /  BITS /  NIT only Must be good in C /  Java,  data structures,  algorithm and other CS concepts Knowledge of networking protocols and devices desirable Passion for our domain and desire to extend NetSim's capability Prior work on NetSim a plus Mention your JEE/  AIEEE rank in subject line Job Profile\n\nDevelopment of C libraries for protocols in NetSim framework Protocol development in Mobile,  Cellular,  Sensor,  Mobile Ad hoc and Delay Tolerant networks Enhancement of the protocol stack,  simulation kernel and post processing engine Implementation of IEEE proceedings in NetSim Simulation trace data mining methods No phone calls please. Mail your resumes to applyfor(at)tetcos(dot)com\n\nNOTICE ABOUT FAKE JOB OFFERS \n\nWe have observed some misleading communication at various job fairs,  portals,  emails etc about employment at TETCOS.\n\nPlease note that\n\nTETCOS does not ask you to deposit any money for giving job offers to Experienced Professionals or Fresh Graduate Trainees. TETCOS does not appoint any agent/ agency/ company to advertise about TETCOS Off campus hiring or conduct any employment interviews or make offers of employment/ benefits on its behalf. TETCOS conducts all final interviews at its Jayanagar,  Bangalore office. Appointment orders are issued only in person and only in our office. Please note that any offers/ benefits/ content/ instructions presented in such misleading communication impersonating TETCOS,  do not represent those of the company and are contrary to our company policy. If any such entity fraudulently representing TETCOS approaches you,  refrain from responding to them. TETCOS will not accept any liability for the actions of candidates on spoofed mails /  communication.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - System Programming", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["development", "Networking protocols", "c", "btech", "methods", "Protocol stack", "Protocol developmentAdvertising", "mobile", "Data structures", "networking", "JEE", "Data mining", "Simulation", "IEEE"]}