{"JOB DESCRIPTION": "Exp: 4 to 8 years We are passionate about building user friendly,  engaging websites and highly scalable distributed systems for our customers as well as internal business users. Basic Qualifications: 3+ years of experience in Java in a Unix/ Linux environment Preferred Qualifications:- Passion for creating efficient,  scalable web interfaces Degree preferably in computer science or a similar technical discipline Genuinely excited about technology,  have a strong interest in learning about and playing with the latest technologies and building compelling web applications and UI Must be a self-starter and motivated If you are interested,  please click on apply button. The team is investing heavily in building a highly scalable global platform that can handle millions of transactions every month worth crores of indian currency while maintaining buyers and sellers trust on the platform. The team aspires to provide sellers with state-of-the-art tools for managing their inventory and orders and financial reporting.  Preferred Qualifications   Strong knowledge of data structures,  algorithms and designing for performance and scale. Knowledge in SQL,  XML and web technologies such as AJAX,  JavaScript,  CSS,  HTML5 etc. Experience in User Interface design/ development is highly desired. Knowledge of professional software engineering practices Experienced in C++ or core java for web development Ready to take challenging job and help us to make complete different software with completely different technology.  If you are interested,  please click on apply button. This is to find your interest with The Optima Kart Bangalore where we are looking for Software Development Engineers II. Looking for members with following skill set  Bachelors Degree in Computer Science or related field 5+ years professional experience in software development Computer Science fundamentals in object-oriented design Computer Science fundamentals in data structures Computer Science fundamentals in algorithm design,  problem solving,  and complexity analysis Proficiency in,  at least,  one modern programming language such as C,  C++,  C#,  Java Experience taking a leading role in building complex software systems that have been successfully delivered to customers Knowledge of professional software engineering practices best practices for the full software development life cycle,  including coding standards,  code reviews,  source control management,  build processes,  testing,  and operations Experience with distributed computing and enterprise-wide systems Experience in communicating with users,  other technical teams,  and senior management to collect requirements,  describe software product features,  technical designs,  and product strategy Experience mentoring junior software engineers to improve their skills,  and make them more effective,  product software engineers Experience influencing software engineers best practices within your team Hands-on expertise in many disparate technologies,  typically ranging from front-end user interfaces through to back-end systems and all points in between Experience with SQL is a plus  If your profile matches above requirement,  please click on apply button HR Director The Optima Kart Skills:  Manages a team of HR Business Partners supporting our Bangalore sites and providing Organizational Development,  Performance Management,  Employee Relations,  and other HR services and support based on client needs. Partners with clients in leading and driving programs to meet client and corporate HR objectives. Coaches and advises managers on company policies and procedures. Aligns with and provide inputs to improve HR business processes to meet company strategic goals. Resolves employee relations issues through a systematic approach. Develops and drives a company-wide programs and initiatives(e.g.,  salary review,  workforce planning,  and organizational change). The position requires 15 years of broad Human Resources experience in Employee Relations,  Organizational Development,  Performance Management,  Compensation and Benefits.   Bachelors degree with minimum of 15 years HR experience with 5 years HR Management experience. Must thrive in a fast-paced environment and adapt to strategic changes in the business. Strong leadership,  interpersonal communication,  and analytical skills. Exceptional skills in client relations and problem solving. Knowledge and proficiency in PC applications including Excel,  Word,  and PowerPoint (experience in PeopleSoft a plus). Detailed knowledge of employment law. Candidate must be self-motivated and able to implement strategic initiatives supporting client groups and corporate HR objectives.  Business Development Team The Optima Kart   Job Description:    Drive Marketing and Business Development for the assigned territory. Should be a go getter. Developing New Customers,  Servicing existing Customers,  Co-ordinating with Production dept for execution of order. Fluency in English is necessary.Should be a go getter,  developing New Customers,  Servicing existing Customers acquired through online sales channel. Co-ordinating Online Marketing dept and support team for execution of orders. Fluency in English is necessary.  Keyskills:   Optima Kart is looking for young and energetic boys /  girls with MBA and should have good communication skills written and spoken and good interpersonal skills.   If your profile matches the above requirement,  please click on  apply  button. Director Product Development The Optima Kart Responsibilities:  Provide overall management for the software development teams including setting priorities and making key hands- on technical contributions.   Improve business processes and support critical business strategies by directing the development,  implementation and maintenance of software products.   Responsible for strategic and tactical direction to the team handling requirement,  design,  development and delivery of modules on time as per specified quality standards.   Develop Strategic Business Plans that stem from organizations strength and builds on its competitive advantages.   Manage multiple development projects with aggressive schedules in a fast-paced work environment.   Foster a motivating and challenging environment to facilitate creativity and productivity within the team.   Mentor,  coach,  and develop staff members as necessary Hire and develop best in class management team   Ability to work with multiple levels in the organization,  and in a global setting   Ensuring that key milestones are met and that solutions delivered are of the highest quality possible   Delivery on project timelines,  internal and external SLAs with emphasis on turn times and error free work product  Maintain highest level of internal /  external customer satisfaction  Ensure migration of existing legacy application to the .Net,  PHP,  Perl,  Servlets,  J2EE platform ensuring a stable production environment.   Ensure controlled releases to production,  with amongst other measures,  stringent code reviews from standards and performance perspectives. Use metrics demonstrate success.  Ensure fit of personnel to tasks. Deal decisively with under-performing personnel.  Understand all REAL products with their interrelationships and collective relevance to business and ensure appropriate availability and stability to the Business.  Qualifications:- Bachelors degree in Computer Science /  Engineering required. MBA preferred.  11+ years of software development experience,  with 8+ years experience in a managerial capacity.  Knowledge of Process Management.  Professional experience with the one or more of the following interactive languages and technologies is required JAVA,  J2EE,  .Net,  PHP,  Servelets,  Perl.  Working knowledge of the residential mortgage industry is preferred.  If your profile match with the requirement. Please click on apply button. Senior Program Manager The Optima Kart  Responsibilities  You will be responsible for formulating the programs vision and strategy,  defining the program value proposition,  launching and monitoring the program.    This will include coordinating and managing cross-functional teams including marketing,  finance,  legal and PR to create buy-in for the program.   Developing strategic positioning for the program based on market assessment,  quantitative analysis and understanding of The Optima Kart Seller ecosystem.   Training and supporting the business development teams to roll out the program to key external partners.Setting metrics,  tracking results,  and sharing key learnings with internal stakeholders.    Evolving the program based on market feedback.   Responsibilities may also include business development and contributing to the seller acquisition efforts for India.    Prior Experience and skills:    More than 4+ years of experience in business development/ product marketing management   Past experience in launching and managing new products and programs is highly desirable along with the ability to contribute at both strategic and operational levels   Should be a flexible cross-functional manager comfortable with a fast-paced,  often ambiguous,  start-up environment   Outstanding communicator with a keen ability to translate complexity into creative,  intuitive campaigns   Strong manager with excellent organization and people skills and the ability to set priorities,  problem-solve,  multi-task and work well in a dynamic,  rapidly changing environment   Experience in a highly analytical,  results-oriented environment with external customer interaction.   Experience with e-commerce,  retail,  advertising,  or media would be an advantage   Possess relentless passion and ownership for continually moving the needle with customer experience.   Entrepreneurial drive and demonstrated ability to achieve stretch goals in an innovative and fast-paced environment.  Personal attributes and competencies:    Demonstrated intense customer focus.   Demonstrated highest level of integrity,  intellectual honesty,  and strong work ethic.   Sharp,  analytical,  and thoughtful. Has sound judgment and ability to be right a lot.    Thoroughly thinks through problems to come up with solutions. Applies fair and consistent criteria. Gathers the right input/ data. Uses intuition. Is decisive. Makes good decisions when analysis of data is not sufficient to reach a conclusion.   Proven ability to successfully thrive in an ambiguous environment and changing market conditions.   Simplifier but at the same time things big,  takes smart risks,  is innovative and can think out of the box. Develops original ideas,  approaches,  and solutions to typical,  unusual,  or difficult situations or problems.   Takes initiative. Doesnt wait to be asked. Plans efficiently while avoiding analysis paralysis.   Consistent effort,  intense commitment,  and willingness to go above and beyond when needed.   Strong team player,  acts like an owner,  and ultimately focused on delivering results with high standards.   Role Category: Senior Management  Role: Sr. Program Manager Qualifications (UG B.Tech/ B.E. Any Specialization) AND (PG Any Postgraduate Any Specialization.    Fill in your details below or click an icon to log in: (Address never made public) Notify me of new comments via email. Notify me of new posts via email. Enter your email address to follow this blog and receive notifications of new posts by email. Join 1, 985 other followers Follow The Optima Kart - World's Largest Cheapest Online Mega Store Get every new post delivered to your Inbox. Join 1, 985 other followers Send to Email Address  Post was not sent - check your email addresses!   Email check failed,  please try again   Sorry,  your blog cannot share posts by email. ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["online marketing", "pr", "product marketing", "operations", "online sales", "product development", "business development", "mba", "tools", "direct sales"]}