{"JOB DESCRIPTION": " UG: B.Tech/B.E. - Any Specialization PG: Any Postgraduate - Any Specialization. Experience in handling PHP frameworks such as Magento, Laravel, WordPress and Symphony.  Key Responsibilities:    Review and understand business requirements by working with cross-functional teams   Develop and enhance product offerings in accordance with design and consistent with business objectives   Ensure that development tasks are completed within timeline provided and that issues are fully tested with minimal defects   Under guidance of technical lead, ensure that solutions being developed are effective and take into consideration performance implications for a production environment   Mentor junior members in their work and frequently take up training sessions to sharpen junior team members' skills   Assist in optimizing website for increased opt-ins, better search rankings, and user engagement and retention   Undertake frequent refactoring and sanity maintenance of developed code   Following best coding practices is a compulsory.   Complete ownership of task assigned and a timely, quality delivery   Curiosity on current industry trends, technologies, tools and frameworks   Appetite to implement bleeding edge technology and adapt to frequent changes.   Excellent verbal and written communication skills.   Excellent analytical and problem solving skills.   Ability to work in a team and individually.   Ability to work under pressure.   Should be able to collaborate with other team members.   Desired skill set    Java, Scala, PHP, Python, WordPress, Magento, HTML5, XHTML, AJAX, Javascript, MySQL, JQuery, CSS, Apache, Web Development   Expertise in HTML, CSS and in any of Bootstrap, LESS, jQuery, Backbone JS or Angular JS. Sound knowledge of OOP MVC.   Sound knowledge of at least couple of databases such as MySQL, MariaDB, MongoDB, and Cassandra and should be able to develop and structure databases.   Expert understanding of Git-based source control.   Exposure to Elastic Search, Solr, Redis, APC, and Memcached would be additional skills.   Exposure to Apache or Nginx configurations is a plus   Exposure to AWS, Google Cloud, Microsoft Azure or Soft Layer.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Production/Industrial", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["jQuery", "MySQL", "Wordpress", "Javascript", "PHP", "XHTML", "HTML", "Apache", "Ajax", "Python"]}