{"JOB DESCRIPTION": " UG: B. Tech/B.E. - Any Specialization PG: Any Postgraduate  Key Responsibilities:    At least 5 years of Product Development and Management experience.   At least 5 years of solution designing and implementation   At least 3 years of PHP, Java, Python development experience   Experience with modern PHP frameworks such as Magento, Laravel, Wordpress, Joomla, Drupal, and / or Symphony   Expertise in HTML, CSS and in any of Bootstrap, LESS, jQuery, Backbone JS or AngularJS   Expertise in responsive websites and multi device delivery.   Sound knowledge of OOP MVC, Xamarin or Phonegap   Sound knowledge of atleast couple of databases such as MySQL, MariaDB, MongoDB, Cassandra and should be able to develop and structure databases   Expert understanding of Git-based source control   Exposure to Elastic Search, Solr, Redis, APC, Memcached is a plus   Exposure to Apache, Nginx configurations is a plus   Exposure to AWS, GoogleCloud, MicrosoftAzure or SoftLayer   Exposure to SEO (Search Engine Optimization), SMO(Social Media Optimization)   Exposure to OpenGL and 3D graphics is a huge plus   Desired skill set    Review and understand business requirements working with cross-functional teams   Develop and enhance product offerings in accordance with design and consistent with business objectives   Ensure that development tasks are completed within timeline provided and that issues are fully tested with minimal defects   Under guidance of technical lead, ensure that solutions being developed are effective and take into consideration performance implications for a production environment   Mentor junior members in their work and frequently take up training sessions to sharpen junior team members' skills   Assist in optimizing website for increased opt-ins, better search rankings, and user engagement and retention   Undertake frequent refactoring and sanity maintenance of developed code   Following best coding practices is a must   Complete ownership of task given and a timely, quality delivery   Curiosity on current industry trends, technologies, tools and frameworks   Appetite to implement bleeding edge technology and adapt to frequent changes   Excellent verbal and written communication skills  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Production/Industrial", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Drupal", "jQuery", "MySQL", "Wordpress", "PHP", "HTML", "SEO", "Apache", "Joomla", "Python"]}