{"JOB DESCRIPTION": "Roles and Responsibilities  Nature of Job: Contract BasisActivities to be performed Responsible for Design of software solutions based on requirements and within the constraints of architectural /design guidelines Functional analysis of existing software Derive software requirements and software functional specification, validate software requirements, provide software feasibility analysis and software effort estimation Identify potential harmony and for re-use of components / technology Responsible for the accurate translation of software architecture into design and code Guide Scrum team members on all design topics & implementation consistency against the design/architecture Coding of features and/or bug-fixing and delivering solutions adhering to coding and quality guidelines, for self-owned components Guide the team in test automation design and also towards implementation of the same Collaborating with multi-functional and globally located teams Driving creative solutions within platform constraints and technical limitations. Prepares prototypes for internal review and brainstorming.Desired Qualification and Experience An engineering graduate with 6 - 10 years of experience in design and development (explicitly code/test-code development within software project using the relevant programming languages and tools as well as relevant technology) Should have at least 3 years of experience in a process-oriented software organization. Programming language skills - Expert knowledge in C# .NET development.  Advanced experience in Windows Desktop applications, WinForms, WPF. Software design and development - Competence in Object Oriented Analysis and Design (OOAD) Standard platforms - expertise in software development on and for the Windows platforms. Good analytical and problem-solving skills. Debugging skills - ability to find the root cause for defects, fix defects and provide impact on fixes done Hands-on experience in development and testing. Experienced in Agile\\Scrum development process is preferred. Self-motivated, quick learner, with good verbal and written communication skills.Skills and Skill LevelsC# Skills (6-8 yrs. Exp.) Technology - Expected level Programming Skills C# - ExpertOOPS - AdvancedDesign Skills - ExpertTesting - AdvancedDebugging Skills - AdvancedWindows Desktop applications, WinForms, WPF - Expert", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Temporary/Contractua", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["C#", "Software Development", "OOAD", "Software Architecture", "C#.Net", "Winforms", ".Net", "Software Project", "WPF", "Software Design"]}