{"JOB DESCRIPTION": "  Overview    The Rackspace Solutions and Services (RSS) engineering group are looking for committed, multi skilled developers to work on exciting, disruptive and diverse software products and projects. These include:    Advanced control planes that we build and run, accelerating the value of public clouds like AWS, GCP and Azure to customers    Security platforms that automatically protect thousands of customers across their multi-cloud environments   Data services that run across thousands of nodes and process petabytes of data daily   As a developer in our team, you will be responsible for building cutting-edge applications that deliver innovative outcomes to our customers. You will leverage the best of modern cloud native components, building solutions that are operationally robust and impressively scalable.     A Good Fit    We're looking for developers who work well with others and push our team to be better. Collaborating closely with your teammates across the globe, you will apply strong creative and problem-solving skills to build world-class software that creates meaningful business value.    We continuously evaluate new technologies to assess their fit within our solutions, so a strong desire to learn is a must. Experience with the technologies we work with today is a plus but not essential. We are committed to delivering excellence and every team member has to be comfortable taking ownership of the quality of their applications through testing to production.    Responsibilities include    Architecting, building and operating scalable systems, services, and products   Writing clean, high-quality, scalable and maintainable code   Implementing proofs of concept, prototypes and production-grade software   Instrumenting code and systems with automated monitoring and alerting, including notifications sent to both PagerDuty and Slack   Supporting what you build: DevOps to us means we are primary support for the systems we build, design, test and deploy   Collaborating well, both within your immediate team and across the broader organization    Requirements    Ideal candidates will have minimum 5+ years professional experience with:   At least one of the following languages Python, Golang. Bonus points for polyglots   Designing and implementing service-oriented applications   Building cloud native solutions on platforms like AWS/ Azure/ GCP/ Kubernetes   Managing infrastructure as code with Terraform   Source code management using Git   Continuous delivery and deployment, shipping code to production many times per day   Writing automated tests that demonstrate the quality of your application ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["data services", "GIT", "RSS", "GCP", "Cloud", "Manager Technology", "rackspace", "AWS", "Monitoring", "Python"]}