{"JOB DESCRIPTION": "   Description   : We are looking for dynamic professionals to augment our development Team in Bengaluru location. The role demands strong technical hands-on skills in designing and developing web applications       Experience   : 3-6 Years        Roles and responsibilities:     Assisting in the collection and documentation of user's requirements, development of user stories   Design, develop, troubleshoot, debug and unit test applications in accordance with established standards.   Duties and tasks are varied and complex needing independent judgment.   Understand standard systems development lifecycle process and apply our methodology effectively on client engagements.   Preparing reports, manuals and other documentation on the status, operation and maintenance of software.   Adheres to coding standards defined by technical management.   Quality of the solution developed is pivotal.   Package and support deployment of releases.        Core competencies (Must Have):     Strong Object-Oriented Design & Programming, Data Structure and Design Principles.   3+ years of Core Java Experience.   2+ years of J2EE and responsive UI experience.   Hands on experience in Spring framework, Hibernate and REST services.   Good Database and SQL expertise.   Exhibits proficiency in HTML, JavaScript, CSS, Bootstrap\\React JS\\Angular JS.   Possesses basic knowledge of XML/JSON.   Python and VB Script knowledge is a plus        Other competencies:     Displays a positive work attitude and a strong team player.   Possess strong communication and interpersonal skills.   Accurately prepares written business correspondence that is coherent, grammatically correct, effective and professional.   Comply with all policies and procedures.        Qualification   :    Graduate or post-graduate.   Fulltime graduate in BE/B. Tech, MCA, etc   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization, MCA in Computers"}, "KEY SKILL": ["Object oriented design", "Hibernate", "Core Java", "Technical management", "Coding", "XML", "J2Ee", "JSON", "SQL", "Python"]}