{"JOB DESCRIPTION": " We are looking for a React Native developer interested in building performant mobile apps on both the iOS and Android platforms, responsible for architecting and building these applications, as well as coordinating with the teams responsible for other layers of the product infrastructure.   Required Skills:   In depth knowledge of mapping tools like Map box, Google etc.   Excellent technical knowledge of HTML5, JavaScript, CSS etc.   Exposure to integrations using middleware technologies and web services - SOAP, REST, JSON and XML   Working experience on push notifications, Geo fence etc.   Prior exposure to mobile app submission on iTunes and Android store   Strong interpersonal skills and ability to work in a dynamic team environment.   High level of comfort with communicating at every level of the organization and a proactive attitude.   Desirable Skills     Proficiency in Node.js, React JS. Java, SQL and MongoDB.    Knowledge of information architecture, UX/UI usability design principles, requirements scoping and testing/QA.   Experience in using data analytics and user testing (A/B Test) to take informed design decisions.   Full stack development experience while working with agile methodologies   Good knowledge of software architecture for cloud hosted web and mobile applications     Responsibilities    Collaborate with product owner and designers to translate product requirements and designs into reality   Deliver across the entire application life cycle in the stages of concept, design, build, deployment, test, release to app stores and support.   Continuously optimize and improve the application performance   Build prototypes at tech scoping stage of projects   Standardize the platform and in a few cases, the application, to deliver across multiple brands/platforms with minimal duplication of effort   Coordinate with the web developers to create vendor apt file to be used both in web and mobile application   Proactively acquire knowledge of the latest industry trends and best practices in mobile technologies to implement them and educate the teams to increase effectiveness of technology solutions.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Advertising, PR, MR, Event Management", "FUNCTIONAL AREA": "IT Software - Embedded, EDA, VLSI, ASIC, Chip Design", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Concept design", "XML", "Javascript", "Agile", "JSON", "MongoDB", "Middleware", "SQL", "Android"]}