{"JOB DESCRIPTION": "Roles & Responsibilities \n:\nDeliver across the entire app life cycle requirement gathering,  concept,  design,  build,  deploy,  test,  release to app stores and support.  Self- starter with a fierce desire to learn and an ability to think outside the box.  Embrace learning new technologies and undertaking tasks in unfamiliar areas.  Ability to work under continual deadline pressure Translate business requirements into detailed technical requirement for Android app.  Go Getter,  true coder and passion to learn new technologies.                                                    Primary Skills \n:\nHands- on programming knowledge (Android/ Java etc. ).  Hands- On knowledge of SQL/ SQLite/ MySQL and able to implement Database and data validations for end to end product.  Proficient using location based services,  REST API integration,  Push Notification etc.  Third Party library integration and battery optimization techniques.  Create compelling device specific user interfaces and experiences.  Experience on Application integration with following;  Facebook,  LinkedIn,  Twitter etc.  Usage of Bluetooth,  GPS,  Wi- Fi,  Camera etc.  of the Mobile device using Android SDK.  Strong team player,  interpersonal,  writing,  speaking,  listening,  analytical,  trouble- shooting and development skills.  Git,  VNC viewer,  Apache,  Tomcat,  Nginx,  Redis etc.  Good to Have Programming experience of iOS and Hybrid mobile application development.  Experience in Phone Gap,  Java Script,  jQuery,  CSS,  HTML5,  jQuery Mobile,  jMobi etc.  Experience in developing auto- responsive web sites.  Experience in developing PHP/ Java based RESTFul web services.  Designation varies depending upon the experience and technical expertise. ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Bluetooth", "GIT", "Analytical", "MySQL", "SQLite", "PHP", "Android SDK", "Information technology", "SQL"]}