{"JOB DESCRIPTION": "Software Developer (C# .net) -  Manesar Location\n\nAbout Company :\n\nmnc\n\nLocation : Gurgaon\n\nExperience : 4 6 Years\n\nFunction : Technology -  IT & Systems\n\nVacancy : 1\n\nJob Description :\n\nOrganization Brief: \n\nAmerican public research,  development and manufacturing company established in 1999 as a spin- off from Hewlett- Packard. \n\nThe company provides analytical instruments,  software,  services and consumables for the entire laboratory workflow. It focuses its products and services on six markets: food,  environmental and forensics,  pharmaceutical,  diagnostics,  chemical and energy\n\nBusiness Unit Brief: This BU focused on providing automated Converged Reporting solutions & execute projects based on technology that meet their internal customer s present and future business needs. \n\nMandatory Technical skills sets: C#,  .net & SQL server\n\nKey Responsibilities:\n\n-  Increase customer satisfaction -  Effective,  efficient Customer consulting by identifying and recommending the innovation/ improvement ideas for solutions \n\n-  Understanding business reporting needs and identify IT solutions to automate,  standardize the reporting portfolio\n\n-  Responsible for managing overall design and development of solution and converting business requirement into technical specifications.\n\nB.E/  B.Tech / MCA in Information Technology & Computer Science. Having finance background is an added benefit. \n\n-  minimum 4 years of post- qualification experience in financial process engineering and improvement initiatives desirable. \n\n-  Strong knowledge and application of IT skills to support Finance functions\n\n-  Strong Solution Engineering Skills -  Ability to define complex business problems,  convert into solutions and fit into the overall finance system architecture\n\n-  Must be system oriented & have an interest /  aptitude for developing skills in new applications.\n\n-  Demonstrate customer orientation and sense of urgency to all deliverables.\n\n", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["Technical product configuration", "c++", "C", "design", "MySQL", "JavaScript", "integration PHP", "HTML"]}