{"JOB DESCRIPTION": "Python Developers (AI & ML): Direction Software LLP : Mumbai  We are looking for Sr. Python Developers (AI & ML ) Please find the job description:(Once Covid is over ,should be willing to travel onsite European Countries  (Passport Mandatory ))Must to Have Skills - Strong preference for hands-on experience- with TensorFlow, Scikit-learn, Torch & Keras ML Libraries. - Extensive programming experience in Python using object oriented architecture. - Should be able to work on project from scratch including analysis, design, building architecture to the delivery of project. - Cleaning & structuring the data by applying feature-engineering techniques. - Training models Responsible for designing, developing and implementing POCs - Excellent written and verbal communication skills - Team Player/Builder Nice to Have Skills (Any of these) - Exceptional mathematical skills, in order to perform computations and work with algorithms - Should be willing to work as an individual contributor when necessary - The ability to work with large, complex datasets. - The ability to explain complex process to people who aren't programming experts - Knowledge on Spark MLlib, MXNet, Caffe, H2O ML libraries Experience    :: 4-6  yrsQualification :: Any Graduate Interest in Data Science • Experience with data frames (preferably Pandas in Python) • First experience of machine learning and deep learning (e.g. using Scikit-learn, Keras, Tensorflow or Torch) • Experience with regression analysis (with Python or R or Java)", "ROLE": "Team Lead/Technical Lead", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Time Series Analysis", "Object Oriented Programming", "Python", "Artificial Intelligence", "Machine Learning", "Deep Learning"]}