{"JOB DESCRIPTION": "Job Details\n\nSoftware Developer \n\nGurgaon,  Haryana \n\nSalary: Dependent on Experience + Extensive Benefits Package \n\nSSP is a global provider of technology systems and solutions across the entire insurance industry. We provide core technology solutions,  distribution and trading capability,  advanced analytics and solution delivery. \n\nWant to want to work with great people,  in modern offices and have the opportunity to progress and develop your career \n\nTHE PURPOSE OF THE SOFTWARE DEVELOPER WILL BE: \n\nWe are growing our Gurgaon office for Software Engineers who can contribute to the programming innovative solutions which will include projects across a variety of solutions in Digital,  SaaS/ PaaS,  DevOps and Cloud in a global team. You will get involved in testing,  module development in current and new environments,  contribute to development processes,  procedures and leading with examples and ideas. As a Software Engineer you will be working with systems that deal with millions of insurance quotes a day and so,  by using your knowledge and experience of software engineering,  you will help the team continue to provide market leading solutions to our customers. \n\nWE D LIKE TO MEET A SOFTWARE DEVELOPER WITH: \n\n Should have practical experience on QlickView. \n\n Ability to work in a global team who can bring innovative ideas \n\n Take business requirements and ideas into complete solutions \n\n Work with Business Analysts,  Project Managers,  Testers,  Support and external customers \n\n Application support and problem investigation to releasing fixes \n\n Code reviews,  testing,  performance tuning,  analysis and quality standards \n\n Work in Agile and SDLC \n\nTHE SOFTWARE DEVELOPER RESPONSIBILITIES INCLUDE: \n\n Applying data analysis,  data modelling,  and quality assurance techniques,  based upon a detailed understanding of business processes,  establishing,  modifying or maintaining data structures and associated components (entity descriptions,  relationship descriptions,  attribute definitions). Advising database designers and other application development team members on the details of data structures and associated components. \n\n Specifying user/ system interfaces,  and translating logical designs into physical designs taking account of target environment,  performance requirements and existing systems. Producing detailed designs and documents all work using required standards,  methods and tools,  including prototyping tools where appropriate. \n\n Designing,  coding,  testing,  correcting,  and documenting moderately complex programs and program modifications from supplied specifications,  using agreed standards and tools. Conducting reviews of supplied specifications,  with others as appropriate \n\n Identifying and resolving issues with applications,  following agreed procedures. Using application management software and tools to collect agreed performance statistics. Carrying out agreed applications maintenance tasks \n\n Developing a broad understanding of technical publication concepts,  tools and methods and the way in which these are implemented. Developing an understanding of development support activities,  such as information gathering,  user task analysis,  creating draft documentation,  and illustration,  and printing and publishing. \n\n Defining the integration build and producing a build definition for generation of the software. Accepting software modules from software developers,  and producing software builds for loading onto the target hardware from software source code. Configuring the hardware environment,  producing integration test specifications,  conducting tests and records the details of any failures. Carrying out and reports fault diagnosis relating to moderately complex problem. \n\nWHAT S IN IT FOR YOU \n\n A unique,  modern working environment \n\n Clubs Crickets and Chess activities,  JOSH club for social events,  quarterly company Town Hall events \n\n Yammer collaborate on ideas and suggest future business opportunities through our lightbulb groups \n\n A clear,  personal learning and development plan to develop your career further \n\n Generous holiday allowance (32 days + Public Holidays),  free parking and life assurance,  Family insurance cover. \n\n SSP flexible benefits and Day care Facilities,  Maternity pay,  Flexible working option \n\nBEHAVIOURS: \n\nWe have a strong,  clear vision to be the leading provider of insurance technology software and our values describe what makes SSP unique,  and capture the SSP spirit that runs through everything we do. \n\nRespect Ownership Collaboration Innovation Energy", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Printing", "Performance tuning", "Application support", "Data analysis", "Publishing", "Coding", "Agile", "Data structures", "Application development", "SDLC"]}