{"JOB DESCRIPTION": "  THE PURPOSE OF THE SOFTWARE DEVELOPER WILL BE:    We are growing our Gurgaon office for Software Engineers who can contribute to the programming innovative solutions which will include projects across a variety of solutions in Digital,  SaaS/PaaS,  DevOps and Cloud in a global team. You will get involved in testing,  module development in current and new environments,  contribute to development processes,  procedures and leading with examples and ideas. As a Software Engineer you will be working with systems that deal with millions of insurance quotes a day and so,  by using your knowledge and experience of software engineering,  you will help the team continue to provide market leading solutions to our customers.    WE D LIKE TO MEET A SOFTWARE DEVELOPER WITH:    Technical graduate-  B.tech/B.E.,  or equivalent qualifications,  plus considerable work experience in a relevant role. OR Substantial work experience in a relevant role   Demonstrable 4+yrs practical experience in the development of software for external customers   Ability to work within agreed time estimates   Track record for thinking about more than technology issues,  and for integrating the technical with the business and information aspects for complete solutions   Proven history of quickly comprehending the functions and capabilities of new technologies,  understanding how new capabilities can be integrated into the SSP solution,  to add value to SSP and our customers.   Good working knowledge and responsible attitude to development standards and the software development lifecycle   Understanding agile software development lifecycle   Insurance industry experience,  preferably from an Insurer or commercial broker perspective   Design and implementation of high transaction solutions.   Knowledge of TDD,  SOLID principles,  multi- threading,  garbage collection Apache Cassandra database    Technical skills required:-     1. VB.NET,  ASP.NET   2. WebForms   3. SQL Server (2005/8/12)   4. XML/XSLT/XSD   5. TFS (2015 currently in use)   6. Visual Studio 2010 upwards   7. IIS Configuration   8. NuGet Packaging    THE SOFTWARE DEVELOPER RESPONSIBILITIES INCLUDE:    Contributes,  matures the prescribed SSP development processes,  procedures and standards leading by example   Leads and designs new functional areas running whiteboard sessions,  documenting complex and large developments   Working closely with business analysts to assist in the requirements gathering and shaping process by bridging the gap between requirements and the art of the possible   Providing application support for production environments for complex problem investigation to releasing emergency fixes   Assist the development manager during planning and estimation sessions to challenge estimates as necessary.   Coach s team members when problem solving ranging from difficult business problems to performance tuning analysis and resolution.   Ensures code reviews take place in order to maintain high standards for new and existing solutions.   To adequately test developed software to demonstrate that components meet all functional and technical requirements and to ensure the software is of a high quality   To take all reasonable steps to complete development assignments within realistic deadlines providing regular updates on progress   To analyse and evaluate enquiries/problem reports and make recommendations   Able to rapidly prototype new solutions and willingness to shape new solutions with their own ideas   May incorporate career manager responsibilities. As a career manager,  you will provide leadership,  and functional guidance and direction to the assigned individuals. Your focus will be on mentoring and developing them to achieve their maximum potential    WHAT S IN IT FOR YOU  A unique,  modern working environment   Clubs Crickets and Chess activities,  JOSH club for social events,  quarterly company Town Hall events   Yammer collaborate on ideas and suggest future business opportunities through our lightbulb groups   A clear,  personal learning and development plan to develop your career further   Generous holiday allowance (32 days + Public Holidays).   SSP flexible benefits and Day care Facilities,  Maternity pay,  Flexible working option    BEHAVIOURS:    We have a strong,  clear vision to be the leading provider of insurance technology software and our values describe what makes SSP unique,  and capture the SSP spirit that runs through everything we do.    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Production/Industrial, Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Performance tuning", "Application support", "IIS", "XML", "Agile", "Packaging", "XSLT", "Visual Studio", "Apache", "SQL"]}