{"JOB DESCRIPTION": "(Freshers) Off-Campus : B.E. /  B.Tech /  M C A /  B Sc (I T/ C S) /  B C A : .N E T Developers @ Navi Mumbai  Disclaimer - We are not affiliated or associated or have authorized or have endorsed or in any way officially connected with placement or recruitment agencies or any of its subsidiaries or its affiliates.\n Please D O N O T pay any money to these agencies. We D O N O T charge for interview or job placement.  \n Job Details Desired Qualification:  Desired Skills: C/ C++ and O O P S Concept  Desired Experience: 0 Years Job Description Systenics Solutions is looking to hire Freshers as Trainee Software Developers for working on its products. Systenics focuses on the latest technologies from Microsoft and needs candidates that are self-learning and motivated to stay on top of latest technologies. Our primary development platform is Microsoft .N E T with C# as preferred language. We develop Web and Windows -based products for our international client base. We are looking for Freshers with good knowledge of C/ C++ and Object Oriented Concepts with excellent problem solving skills. Good oral and written communication skills are mandatory. Come join us if you wish to work with a team of smart individuals that churn new technology innovations every day.\n  Resume must be sent as mentioned below. Written and Oral tests on C/ C++ and Logic skills will be administered. \n  To know more about our interview and selection process,  read \"Getting Hired at Systenics as Fresher\" post. \n This is N O T a direct Walk-In. You need to apply through your Facebook account and  to us. Only shortlisted candidates will be called for personal interview. This is a direct job with our company. There will N O T be any Training/ Recruitment/ Registration/ Consulting fees collected from candidates before/ after the placement. Only local candidates from N A V I M U M B A I should apply. No relocation assistance will be provided.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Sc in Chemistry, BCA in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Selection process", "c#", "C++", "development", "C", "software", "HTML", "Windows", "microsoft", "SQL", "Recruitment", "web", "Consulting", "ASP.Net"]}