{"JOB DESCRIPTION": " JOB DESCRIPTION :  Software developers with 2 -  6 years of experience in React JS,  Core PHP and MVC frameworks. who will be dedicated to work on e- commerce systems and web applications. The work location will be at MWT Technologies Pvt. Ltd.,  World Trade Center,  Infopark,  Kochi -  India. You will be a part of a PHP development team that is responsible for all aspects of software development from the initial specification,  through to developing,  testing and launching.   REQUIRED QUALIFICATIONS :  Bachelor?s Degree/ Master?s Degree/ Diploma  RESPONSIBILITIES :  Designing,  researching and writing new software programs to meet the client requirements.Project plan,  estimation and task breakdownScheduling and monitoring of projects.Familiarity with MySQL databases.Good knowledge of relational database concepts.Perform a mix of new development,  enhancements,  and maintenance as required.Project release plan and production deployment.To choose right Framework / CMS as per the requirements and specificationsCoding,  Debugging,  TroubleshootingIntegration: API,  Payment Gateway,  Plugin.Customization of the PluginTo meet all the deadlines of project accurately and successfully.Should have experience in agile development model.Proficient in project management software JIRA.Good communication presentation skills.       KEY SKILLS  Working skills on  MVC frameworks( CakePHP,  Laravel,  CodeIgniter)Working skill in Front- End technology like React JS,  HTML5,  CSS3,  and Bootstrap.MVC Framework ? Cake PHP,  Laravel ,  CodeIgniter ,  Yii,  Node JSReact JS,  JavaScript,  HTML5,  CSS3,  REST API ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["QA", "POP", "Trade", "Front end", "Project management", "PHP", "Lead System Administrator", "Monitoring"]}