{"JOB DESCRIPTION": "  Role   Responsible for design, developing, managing multiple Managed Information Service projects build on PHP / Mysql. This role envisages client interface, design of specifics, development of all server-side logic, definition and maintenance of the central database, and ensuring high performance and responsiveness to requests from the front-end. The position is of technical developer that will involve coding, integrating the front-end elements built by your co-workers into the application, ensuring the implementation on time lines with zero deficiency.     Responsibilities and Duties       Responsibilities      Integration of user-facing elements developed by front-end developers   Build efficient, testable, and reusable PHP modules   Solve complex performance problems and architectural challenges   Manage multiple teams involving design, development, optimization, testing and deployment of multiple cloud based projects.          Required Experience, Skills and Qualifications       Skills Technical      Superlative analytical abilities , coding skills   Strong knowledge of PHP web frameworks    such as Laravel etc     Understanding the fully synchronous behavior of PHP   Understanding of MVC design patterns   Basic understanding of front-end technologies, sound Knowledge of object oriented PHP programming   Understanding accessibility and security compliance   Understanding fundamental design principles behind a scalable application   User authentication and authorization between multiple systems, servers, and environments   Integration of multiple data sources and databases into one system   Creating database schemas that represent and support business processes   Sound expertise with MYSQL databases and their declarative query language   Knowledge of code versioning tools, such as Git          Skills Behavioral     Candidate should be result & detail oriented possessing good communication and leadership attributes.     Educational Qualification:   Any Degree / MCA / BE / B.TECH ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "MCA in Computers"}, "KEY SKILL": ["Front end", "GIT", "PDF", "Coding", "Analytical", "MySQL", "Database", "PHP", "MVC", "Monitoring"]}