{"JOB DESCRIPTION": "Software EngineerJoin a newly formed teamBe part of a global teamBe valued and have your contribution make a differenceOur Company With over 40 years of experience, Hansen Technologies is a leading global provider of customers of customer care, billing software and data management systems across 80 different countries with specialisations in the utilities and telecommunications industries. We are successful because at Hansen, our people focus on our customers. On solving problems. On transforming customer experiences, because CX is in our DNA. With 1500 people across 31 offices globally, our people bring a deep expertise, that drives innovation and ideas to ensure we deliver exceptional products and services. The Software Engineer will be part of our ICX team in Pune. The RoleReporting to Agile Development Manager based in Pune as a Software Engineer you will be responsible to develop our Customer Care and Billing product. You should have rich working experience in enterprise software industry as an experienced associate developer or developer. You need to be able to analyze requirement, design system behavior, complete programming, perform testing and future maintenance. Backgrounds in the Pay-Tv industry or business support systems are highly desirable.How you will contribute You will work within the Global Development Team to provide quality services to external managed service clients as well as internal business units. You may be required to participate in an on-call roster system to support our global offices and clients. In this role you will be responsible to Develop software solutions by studying information needs; studying systems flow, data usage and work processes; investigating problem areas; following the software development life cycle.This job will offer you opportunities to Work collaboratively with internal teams and various roles in Agile/Scrum methodology to meet delivery deadlines.  You will be involved in a range of activities including: Design and develop new feature as well as maintain existing functionality.Develop software solutions by studying information needs; studying systems flow, data usage and work processes; investigating problem areas; following the software development life cycle.Document and demonstrate solutions by developing flowcharts, layouts and diagrams.Work collaboratively with internal teams and various roles in Agile/Scrum methodology to meet delivery deadlines.TravelSome travel may be required.Our Ideal PersonAre you an experienced Engineer who is ready for a new challenge or a Software Engineer ready to make your next career move, then as our ideal person you will have:BE/BTech from IT or Computer Science 3+ years development experience in commercial/enterprise business systems with Microsoft technologies. E.g. C# and .NET Framework.Proficient at B/S application development.Experience in web technology like WCF/Web Service/RESTful Service/WebAPI/HTML/JavaScript/ jQuery/Angular/React/Backbone/Knockout will be preferable.Experience working in a cloud environment and/or Software-as-a-Service is a plus.Experience with Kafka, Elastic/Logstash/Kibana, Redis, PostgreSQL is a plus.Thorough knowledge of unit test and test-driven development techniquesExperience in Agile/Scrum methodology and ability to work independently in a multi-cultural team environment.Experience with professional software engineering best practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing and operationsEagerness and willingness to learn new technologiesIf you have all of the above Then we really want to talk to you, so dont delay  apply now!Benefits Competitive SalaryGreat, inclusive team environment", "ROLE": "Software Developer", "INDUSTRY TYPE": "Other", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "MCA in Any Specialization"}, "KEY SKILL": ["C#", "Angularjs", "ASP.Net", "angular framework", ".NET Framework"]}