{"JOB DESCRIPTION": "     The Role:           Software Developer will be a valuable member of our Provisioning team who will be responsible to design, develop and maintain programming systems.           How will you contribute            On any given day you will be expected to undertake responsibilities including:          Understand the Hansen COTS capabilities and the overlay implementation needs from customer       Work closely with team leads and management       Responsible for Designing and developing programming systems as per the functional/performance needs       Analyze, design, own the specific development and testing of systems        Responsible for analysis of module based on current programs/configuration, Interfaces design and development       Contribute on performance, diagnosis and troubleshooting of problem       Responsible for developing new programs and proofing the program to implement needed changes to assure production of a quality product. Responsible for development of assigned programs, complying programming standards and development processes        Respond promptly and professionally to bug reports and service requests       Responsible to review and repair legacy code with recommendations for retrofit. Should be able to create software builds, patches, support the QA/UAT/Acceptance test phases in multi time zone (based on needs of project)                        Our Ideal Person:              If you are someone who prides themselves in being innovative, dedicated, agile, driven to exceed expectations and a champion of celebrating success, we want to hear from you           3 to 5 years of work experience       Experience with Core Java        Experience with Apache Spring and Camel components protocols ( like CFX, REST , File,Routes) is must       Experience with Rest/Soap Webservices is must       Experience with XML/JSON (design, mapping, marshalling , unmarshalling, object mapper, POJO ) is must       Productivity tools usage (Eclipse, Junit, Wiki, winscp, putty,Jira,V1)       Docker container - based application development/deployment       Experience with Oracle and PL/SQL       DevOps & Cloud Exposure is preferred       Experience in Telecom Order Fulfillment domain would be plus                  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Telecom", "Core Java", "Web services", "Data management", "XML", "Billing", "PLSQL", "Application development", "Troubleshooting", "Oracle"]}