{"JOB DESCRIPTION": " We are on the hunt for a Software Developer to join our team and make the most of working in a fun environment while learning from the best. The incumbent is expected to write functional code with a sharp eye for spotting defects and must be passionate about designing and developing enterprise applications.   Every project is implemented in a distributed agile environment while continuously collaborating with customers stationed at various locations around the world.     Technical Skill Set: .Net, Python, Web API (C#), RestFul Web Services, NoSQL (Big Plus), TDD and Unit Testing.    Challenges     You will help us continuously improve our platform   Together we will create best in class services that support the needs of our customers   Taking part in team ceremonies like grooming, planning and retrospective   Develop new featuresmodules.   Improve code quality by doing pair programming or code reviews   Continuously improve and monitor our product     Key Responsibilities     Own and consistently deliver high-quality end-to-end product features while keeping in view technical and business expectations    Add meaty features to the product which will deliver substantial business value    Pioneer clean coding and continuous code refactoring    Understands and appreciates the existing design and architecture of the product.    Understands the pros and cons of the various technology options available    Takes technical ownership of some of the sub-systems of the product    Makes changes in the product designs to achieve the required business valuemileage    Identify and address technical debts    Understands the technical vision and road-map of the product and expectations    Understand the purview of key pieces of deliverables and own few of these pieces     Day at work     Pioneer proof of concept of new technologies while keeping in view product road-map and business priorities    Self-study and share his her learning within the team and across teams    Provide required help to other team members    Pioneer in various team events and work towards the objectives of these events    Make meaningful suggestions to make ceremonies more effective     About You     You have several years of experience with Software Development.    You have worked successfully with product teams in the past and ideally have experience working with cross-functional teams.   You like working in a collaborative environment where there is collective ownership of the code.   You work in Continuous Integration and always strive for Continuous Delivery.   You like to share and enable others to increase your whole team's performance     Qualifications     Batchlors degree with relavent work experience.          ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Publishing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["metadata", "Publishing", "Coding", "Enterprise applications", "TDD", "Agile", "Workflow", "Unit testing", "Business process management", "Python"]}