{"JOB DESCRIPTION": " Technical Skills: VBA, TABLEAU, .NET, ADVANCE EXCEL Proficiency in VBA/Advance VBA and .NET, Advanced MS Excel functions Platforms / Tools : Tableau, SFDC, CPQ platforms Proficient with UI technologies and User Centered Design. Expertise with Mobile Technologies and App design including HTML5 based  Expertise in Scripting  Javascript, VBA with Microsoft Excel. Understanding of Rule based Engines  Proficiency in SQL Database and query skills Proficiency with all the .NET technologies.  Proficiency with multi-threaded programming and parallel processing.  Should be able to identify patterns and repeatable processes. Proficiency with Service Oriented Architecture.  Database Management and Data Analytics skills.   Responsibilities:Responsible  for  100%  development  of  code,  in  partnership  with  internal  functions, various stakeholders, 3rd party vendors if any Ensure 100% documentation of code developed Prepare detailed user manual for support team and end users Own deployment of developed tool and training of users Responsible for ongoing maintenance and upgradation of the tool, resolving user support tickets (1st, 2nd line support) Setup and maintain all users Test code developed/ enhancements to the tools Fix bugs as and when identified Maintain  entire  support  infrastructure  along  with  ledger  of  tickets  raised,  resolution provided and be accountable for delivering within agreed service level agreement Adhere  to  SLA  /  agreed  timelines  and  deploy  code  with  due self-quality checks without any bugs / quality issues.   Behavioral Skills:  Good communication, both verbal and written (English). Ability  to  prioritize  jobs  as  per  the  timelines with  discussion  with  reporting  manager  and internal stakeholders. Ability to interact and build relationships with customers and internal stakeholders. Ability to carry out risk assessments.Position: PermanentOnce shortlisted candidate will be deployed at clinet location near hadapsar/magarpatta Pune.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Sc in Electronics, Computers, Other Graduate, BCA in Computers", "PG": "PG Diploma in Computers, Electronics, M.Tech in Computers, Electronics/Telecommunication, MCA in Computers"}, "KEY SKILL": ["Excel", "VBA", "Html5", "Programming", ".Net", "Tableau"]}