{"JOB DESCRIPTION": "   Software Developer        Be an integral part of a successful team        Exciting opportunity to be part of a global business        Take your career to next level        The Role   :          Software Developer will be a valuable member of our Device Provisioning team who will be responsible to design, develop and maintain programming systems.       How will you contribute       On any given day you will be expected to undertake responsibilities including:       Leverage best practices to write and continually improve the code base.        Develop mastery in the tools, languages and frameworks used by the team.        Become proficient in the real-world use of Hansen Provisioning Products you are developing.        Own the specification of software requirements and designs, engaging with Product owners to understand functional and business requirements        Learn to engineer quality, maintainable and testable code        Learn how to measure non-functional aspects of the code, particularly Security, performance and scalability.        Adhere to project and department standards for quality, proficiency, and customer satisfaction.        Ensure all your assigned deliverables are completed on specification, quality and according to agreed timelines        Design, develop features on DPM, provide suggestions/features for improving the product.        Review design/code from peers, run through code quality checks and provide feedback, provide support to team as required.        Anticipate and discuss issues/risks and identify potential solutions along with Manager for items on plate        Understand DHCP, DOCSIS, PACKETCABLE and other specs for effective product development    .        Our Ideal Person:        If you are someone who prides themselves in being innovative, dedicated, agile, driven to exceed expectations and a champion of celebrating success, we want to hear from you        3 - 5+ years of experience in core development.        Experience building, testing, and deploying high quality, highly reliable, scalable web applications, APIs, and user-interfaces in a team environment.        Experience working on enterprise level Product development using an agile methodology.        Low-Level Level Design & Analytical Skills        Should have strong experience in Core Java, Web Service, HTML, CSS, SQL, messaging queue, Play framework, Linux/Solaris OS, Junits, tomcat, SSL.        Exposure to Telecom Domain and protocols like DHCP, DOCSIS or working experience with Device Provisioning like product would be a plus.        Hands on experience in working on Security and Performance related backlogs will be preferred.        Experience with Telecom domain specially working experience on device provisioning/DHCP related products will be preferred.        Problem Solving, Very good team player, Delivering High Quality Work, Business Acumen, Adapting to Change.        Communicating Effectively, Championing Customer Needs, Decision Making        Critical Thinking, Agile Methodologies, Interpersonal Skills, Testing, Technical Mentoring        Eagerness and willingness to learn and implement new technologies and concepts.          ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Core Java", "Tomcat", "Linux", "Solaris", "Billing", "Agile", "HTML", "SSL", "DHCP", "SQL"]}