{"JOB DESCRIPTION": "We are looking for you if you: * are a very good programmer* has very good grasp of data structures,   databases,   algorithms,   etc. * love solving problems* like informal working environment,   no office politics and good foodWe are a Pune based product development company in the space of clinical  (medical)  research. We work with top-  notch research centers like Stanford University,   Johns Hopkins University,   University of Melbourne,   University of New South Wales,   Singapore General Hospital,   Sweden,   India,   Egypt,   etc. Visit www.openspecimen.org for details of our product. Technology stack While we work on the following technologies,   it does not matter if you do not have specific experience in them. We believe if you are a great programmer in one language,   you are a great programmer in any language!•  Java  (Spring,   Hibernate,   etc) •  Angular JS•  REST APIs•  Strong in databases Job Profile:  If 0 -   2 years experienced:  •   Expert in at least one programming language •   Has in-  depth knowledge of data structures,   algorithms and databases If 2 -   15 years experienced:  •  Expert in SQLs and databases•  Expert in Unix environment•  Database transaction management•  Performance engineeringEnvironment We work in a very startup environment,   i.e. informal dressing,   open table seating,   free lunch & snacks,   flexible work from home and many others.What are we looking for •   Very enthusiastic -   working in a startup need a lot of energy! •  Good English -   written and oral•   Keen learner and self-  motivated •   Explore and experiments new ideas on own •   A \"problem finder\" rather than a \"problem solver'", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Unix", "rest", "Hibernate", "development", "transaction management", "Programming", "Data structures", "it", "research", "EnglishSnacks", "database", "Algorithms", "java", "Performance engineering"]}