{"JOB DESCRIPTION": "        We are looking for a Mobile application developer responsible for the development and maintenance of applications aimed towards Android and iOS, including mobile phones and tablets. Your primary focus will be the development of such applications and their integration with other services. You will be working alongside other engineers and developers working on different layers of the infrastructure. Therefore, a commitment to collaborative problem solving, sophisticated design, and creating quality products is essential.      Responsibilities         Design and build applications for Android and iOS.         Ensure the performance, quality, and responsiveness of applications         Collaborate with a team to define, design, and ship new features         Innovative thinking for problems solutions. Solid implementation.         Identify and correct bottlenecks and fix bugs         Achieving Code, module delivery dates within time.         Help maintain code quality, organization, automatization and documentation.       Skills         Proficient in all versions of Kotiln and Swift, with a good knowledge of its ecosystems.          Solid understanding of object-oriented programming.         Experience in Play store and App Store distribution process and Enterprise distribution of Apple.         Good knowledge of performance limits and characteristics         Knowledge of memory management and multi-threading, background thread handling, Android assets and iOS file systems.         Knowledge of Java for Android, private framework in swift and objective C language.         Experience with embedded databases and other system datastores         Experience of automated testing platforms and unit tests for Mobile applications.         Familiarity with RESTful APIs to connect to back-end services         Good sense of UI design and a user-oriented focus         Knack for benchmarking and optimization         Proficient understanding of code versioning tools e.g. Git         Familiarity with continuous integration         Authorized certification of Android and iOS development, swift language will be value added.         Experience with Cocoa APIs on iOS and Apple frameworks AR, ML and swift UI is good to have         Min 3 years of work experience in Mobile application development.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Mobile application development", "GIT", "Memory management", "Mobile phones", "Swift", "ios development", "IOS", "Object oriented programming", "Android"]}