{"JOB DESCRIPTION": "We seeks an extremely talented c# developer to help building high performance trading solutions. To be successful in this role you must be able to design, build and re - engineer highly distributed, low latency trading system with a focus on quality and performance. looking for a highly skilled C++ programmer to join our core development team. Do you consider yourself an expert in: C++ using Linux and MS Visual Studio, STL and Boost and feel you are excellent at problem solving and troubleshooting\n\nRequirements \n\n Strong C# programming, WPF, WinForms, ASP.NET, GDI+, Custom Controls \n\n Excellent knowledge of the .NET framework (especially 4.5) \n\n Detail knowledge of computer architectures, memory management and Operating Systems \n\n Advanced Data Structures, Advanced Algorithms, Design Patterns \n\nKnowledge of High Performance Computing, low latency and real - time application development; \n\n Strong knowledge of TCP / IP multicast and socket programming required \n\n Deep understanding of multithreading, parallel programming and real - time software architectures \n\nGood knowledge of HTML5, JQuery, WebSocket and latest web frameworks \n\nAdvanced Threading, Networking (TCP, UDP, Multicast), IPC \n\nAdvanced Data Structures, Advanced Algorithms, Design Patterns \n\n Strong, nearly obsessive attention to detail \n\n Experience working in a team - oriented, collaborative environment \n\n Task and result oriented with strong work ethics and values \n\nEducation and Experience \n\n BS / BTech / MCA Degree in Computer Science or Math \n\n 2+ years of experience in core C# development \n\nIf you have the described qualifications and are interested in this exciting opportunity, please !", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["TCP", "C++", "jQuery", "Multithreading", "Linux", "Networking", "Application development", "Windows", "WPF", "Troubleshooting"]}