{"JOB DESCRIPTION": "We are looking for a highly skilled C++ programmer to join our core development team. Do you consider yourself an expert in: C++ using Linux and MS Visual Studio, STL and Boost and feel you are excellent at problem solving and troubleshooting \n\nRequirements \n\nExcellent C / C++ programming and debugging skills in a Linux environment\n\nDetail knowledge of computer architectures, memory management and Linux kernel optimization \n\nDevelopment experience of, Multithreading, BOOST library, STL, Template Programming is required \n\nKnowledge of High Performance Computing, low latency and real - time application development; \n\nExperience with multithreading in C++ \n\n Knowledge of Cross - platform development (Windows and Linux) \n\nAdvanced Threading, Inter - process communication, Networking (TCP, UDP, Multicast), IPC \n\nAdvanced Data Structures, Advanced Algorithms, Design Patterns \n\nStrong knowledge of TCP / IP multicast and socket programming required \n\nStrong, nearly obsessive attention to detail \n\nExperience working in a team - oriented, collaborative environment \n\nTask and result oriented with strong work ethics and values \n\n Knowledge of capital market trading, C++ 11 a plus \n\nEducation and Experience \n\nBS / BTech / MCA Degree in Computer Science or Math \n\n2+ years of experience in core C++ development in Linux environment \n\nIf you have the described qualifications and are interested in this exciting opportunity, please !", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["Socket programming", "Multithreading", "Linux", "Networking", "Linux kernel", "Debugging", "Data structures", "Application development", "Windows", "Troubleshooting"]}