{"JOB DESCRIPTION": " Hiring For Software EngineersAbout UsGreeva Software Solutions Private Limited is a specialist engineering services & solutions company servicing clients across a range of engineering segments helping improve their engineering efficiency, support their global footprint and improve their competitiveness.  Job Description:Location Chennai for Client place (Permanent role)Email- jobs@greeva.comSoftware DeveloperWe are looking for an energetic Developer to be part of a cross-functional team thats responsible for the full software development life cycle, from conception to deployment using latest technologies with the following Excellent verbal communication skills. Good problem solving skills with individual contribution. Attention to detail. Priority given for immediate joiners.Requirements (Skill Set) :3+ years of software development experience of scalable windowsapplications in C++ (C++ 11 / 14 / 17)Understanding of distributed systems, data structures and algorithms Experience of using thrid-party libraries such as boost, openssl, zlib, regex, log4cxx &jsoncpp Experience of message encoding with json &protobuf Knowledge of IOCP and socket programming with TCP and UDP Knowledge of object-oriented programming and multi-threading Good command in verbal and written English Detail oriented, self-motivated and disciplined, with ability to complete assigned tasks with minimal oversight in a professional and timely manner.Responsibilities :Analyze, design and develop securities and futures systems according to requirements Plan, design and implement high quality windows applications using the latest C++ technologies Prepare functional specifications and design documentations Perform coding, unit testing, debugging and performance tuning Provide system support, troubleshoot and maintenance Communicate with business users on system issues.Preferences:We will reject those who work on the software of hardware system such as printers, meters , network equipment, display panels etc. These are not the software experience that I am looking for.The second criteria We would filter is if the candidate has work experience only on Unix / Linux environment3rd criteria is if he changes job frequently. We prefer those who is under employment now with at least 1 year at the current companyWe do not prefer those who has discontinue work experience, or on bench for several monthsin contrast, if the candidate has work experience in securities brokerage, asset management, banks, transaction-related firm, they will have high prioritybut we expect the candidate to perform what they should perform regarding the expected salarycommunication is important in interview, at least we can verbal communicate before we can hire them.Interested candidates can reach me on jobs@greeva.comNote: Please share your updated resume with Skype ID must.Contact Person : Ms.Lakshmi ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Electrical, Electronics/Telecommunication, Computers"}, "KEY SKILL": ["C++", "Software Development", "Algorithms", "Multithreading", "Linux", "Boost", "Data Structures", "Socket Programming", "Object Oriented Programming", "Openssl"]}