{"JOB DESCRIPTION": " Nextpoint (nextpoint.com) is seeking a talented   Software Engineer within Application Development   who will join us in building the next generation of SaaS litigation technologies. At Nextpoint, Software Engineers play a critical role in the delivery of cloud-based solutions critical to our clients success.   The role embeds you with a motivated development team where you will be identifying, planning, and executing tasks that deliver real value to our clients. You ll play multiple roles and contribute to our mission: delivering software solutions to increase our clients command of their data.   The right candidate will be well-versed in object oriented programming, have an analytical approach, and be both a great individual contributor and team member.   This position is open to candidates with a minimum of 3 years experience.     A typical day.      Build new tools and solutions to enable client self-service.   Design and develop high quality, efficient software   Employ best practice development techniques   Seek ways to push and improve Nextpoint development processes, introducing new methods +/- technologies   Identify and track meaningful metrics, not just pretty graphs. Apply the scientific method - set meaningful hypotheses.      This is who we want to work with.      You communicate well with others, working iteratively to interpret and execute diverse project requirements.   You take great pride in your work and your own continued learning.   You have ideas and the confidence to contribute.   You have the ability to conceive of an idea and carry it all the way through to implementation.   You are not afraid to handle time-critical tasks.   You go the extra mile to assist and improve both the systems you support and the co-workers you build them with.      Whats in it for you      An awesome team.     You ll learn a ton. Guaranteed.   An environment that encourages self-improvement and learning.   The opportunity to make a real and direct impact.   A workplace that stresses respect, listening, and teamwork; where individuals are valued and heard.   Work/life balance. We do the majority of our deploys during business hours, and we understand that you ll need to schedule appointments during the day at times.   While applicants must intend to reside in Madison, WI -- remote work is frequently possible.      Qualifications:      Self-motivated, with strong oral and written communication skills.   Great team member. Take responsibility and work collaboratively.   Report to the Nextpoint Lab , located in downtown Madison, WI.   Minimum of 3 years of experience with object oriented development (Ruby, Java, Perl, etc).  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Legal", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Software Developer: App Development"]}