{"JOB DESCRIPTION": "Roles and ResponsibilitiesIntroductionSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do. Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide. At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.Your Role and ResponsibilitiesIBM Cloud has a global cloud presence that continues to grow and expand its reach. IBM's Cloud Developer Tools is a core part of our company's strategy and of the IBM Cloud platform developer experience. This team is responsible for end-to-end development of services on IBM Cloud based on microservices architecture, from the inception phase of a new idea, to prototyping, development, integration, deployment and operations/monitoring. An IBM Cloud Software Development engineer will be the key individual responsible for development of new cloud services on the IBM Cloud Platform. You will get to work with Fortune 100 Enterprise clients and build hyperscale cloud services for the largest companies in the world. We are a global team, so communication skills (both verbal and written) are critical as well as flexibility to work with team members in other time zones.Key ResponsibilitiesWe are looking for early tenure back end or full stack software developers to develop a mix of new features and support existing code on critical projects with high visibility. If you are passionate about Cloud Development and the opportunity to have great tools to work with, then this may be the opportunity for you.Required Technical and Professional ExpertiseBachelors Degree in Computer Science from a reputed university/college. MS is preferable. Can consider non-CS degrees if there is strong relevant experience.About 2-3 years of experience in the role of software engineer. Experience in multiple of the following areas is desirable:Proficiency in at least one of the following programming languages - Java / JavaScript (Node.js) / Go Lang Strong understanding of object-oriented design principles and patternUnderstanding and experience with RESTful APIs, Kubernetes, Database systemsExcellent verbal and written communication skills, Strong analytical and problem-solving skill, positive attitude and eager to learn.Preferred Technical and Professional ExpertiseMasters or equivalent degree is preferred.Experience in multiple of the following areas is desirable:Passion for software testing and interest in learning emerging technologiesUnderstanding and experience with Cloud Technologies, Microservices ArchitectureExperience/Knowledgeable in Continuous Integration/Deployment, Docker/Kubernetes Container Service", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Sc in Computers, B.Tech/B.E. in Computers, BCA in Computers", "PG": "MS/M.Sc(Science) in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Java", "Software Development", "Software Engineering", "Cloud Development", "Ibm Cloud", "Javascript", "Go", "Programming", "Node.Js", "Microservices"]}