{"JOB DESCRIPTION": "We are looking for a .Net developer to build software using languages and technologies of the .NET framework. You will create applications from scratch, configure existing systems and provide user support.In this role, you should be able to write functional code with a sharp eye for spotting defects. You should be a team player and excellent communicator. If you are also passionate about the .NET framework and software design/architecture, we’d like to meet you. Your primary responsibility will be to design and develop these applications, and to coordinate with the rest of the team working on different layers of the infrastructure. Thus, a commitment to collaborative problem solving, sophisticated design, and product quality is essential.Required Candidate profileRequired Candidate profile:•    Proven experience as a .NET Developer or Application Developer•    Familiarity with the ASP.NET framework, SQL Server and design/architectural patterns (e.g. Model-View-Controller (MVC))•    Knowledge of at least one of the .NET languages (e.g. C#, Visual Basic .NET) and HTML5/CSS3•    Familiarity with architecture styles/APIs (REST, RPC)•    Understanding of Agile methodologies•    Excellent troubleshooting and communication skillsResponsibilities:•    Participate in requirements analysis•    Design, build, and maintain efficient, reusable, and reliable .Net code•    Ensure the best possible performance, quality, and responsiveness of the applications•    Identify bottlenecks and bugs, and devise solutions to these problems•    Help maintain code quality, organization, and automation•    Collaborate with internal teams to produce software design and architecture•    Test and deploy applications and systems•    Improve existing software•(Agile)•    Serve as an expert on applications and provide technical support   Skills:•    Understanding of OOP (Object Oriented Programming)•    Strong understanding of data structures and algorithms.•    Familiar with various design and architectural patterns•    Proficient in Python, with a good knowledge of its ecosystems•    Experience in MSSQL•    Understanding fundamental design principles behind a scalable application•    Implementing automated testing platforms and unit tests•    Proficient understanding of code versioning tools, such as GitJIRA", "ROLE": "Software Developer", "INDUSTRY TYPE": "KPO, Research, Analytics", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "Any Postgraduate in Any Specialization, Post Graduation Not Required", "DOCTORATE": "Any Doctorate in Any Specialization, Doctorate Not Required"}, "KEY SKILL": ["c#", "ms sql", "asp.net mvc", "c", "git", "asp.net", "object oriented programming"]}