{"JOB DESCRIPTION": "                           CIBT is seeking a talented Software Web Developer to join our team. We are looking for early career candidates interested in developing global websites for a dynamic and growing company. The right candidates will be well organized, detail oriented, a quick thinker and problem solver. You will support your teammates, take ownership, stretch, and never settle. You take initiative and can work independently but also thrive in a team environment. You have an unwavering dedication to flawless work and always adhere to deadlines.      DUTIES AND RESPONSIBILITIES:         More specifically, you will take ownership of the following duties and responsibilities:       Participate in full software development life cycle          Participate in Web and mobile application design and development: prototyping, user interface, and front end and back-end programming, unit testing.    Write scalable and extensible code   Implement and consume SOAP and REST based web services   database modeling and use of object-oriented programming principles   Install, configure, administer and troubleshoot software in multiple environments          Team with other Software Developers for implementing and maintain various features into the new and existing websites.           Collaborates with other developers to better understand the project requirements, provide a plan for implementation and help resolve technical problems.    Partner with global teammates in the coordination and execution of projects   Track progress of projects and deliverables     KNOWLEDGE, SKILLS, ABILITIES:         To be successful you will have the following education, experience, skills and knowledge:       Bachelor s degree in Computer Science or related field.        Software Developer with minimum 3 years of experience with developing websites.          Experience is PHP, MySQL, HTML5, CSS, JavaScript, jQuery required.              Experience in PHP frameworks, MVC, JavaScript frameworks, NodeJS, React, Angular.          Experience building and deploying, configuring web applications on Linux, Apache.                 Experience with Docker will be a plus.     MySQL: designing database schemas; writing procedures, queries and views   Implementation of SOAP and REST web services            Experience with content management systems and responsive design and development   Subversion and Git Version control.   Security Coding Practices.                        Analytical, problem solving, and detail oriented.                            Organized and manage own time effectively.            ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Legal", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Content management", "jQuery", "Linux", "Coding", "MySQL", "Javascript", "PHP", "MVC", "Unit testing", "Apache"]}