{"JOB DESCRIPTION": "JOB DESCRIPTION:-The candidate with any U.S visa (H1B\\B1.etc..) is preferred  & Salary for right candidate is not a constraint.A growing PCBA Tooling and Precision Machine shop, servicing High Tech industries, is seeking aSoftware Developer Architect. The software developer Architect should have a strongunderstanding of SDLC and OOPs. Must have rich explore in methodology for softwaredevelopment.Software Architect needs to design and develop software systems and applications. They maycreate software for specific needs or to create products geared for Designing Software (desktopapplications). They act as high-level decision makers in the process, determining everythingfrom design choices to technical standards, such as platforms and coding standards. SoftwareArchitect works closely with other members of a development team such as programmers.The developer will provide application development support with experience in Microsoft .NETframework. This effort involves detailed analysis of the current system, program revisions,maintenance, enhancements and post implementation support of the application/ system/database.JOB QUALIFICATIONS: Master \\ Bachelors degree in Computer science, IT and related discipline/experiencepreferred.JOB RESPONSIBILITIES: Collaborating with other professionals to determine functional and non-functionalrequirements for new software or applications Using tools and methodologies to create representations for functions and userinterface of desired product Developing high-level product specifications with attention to system integration andfeasibility Define all aspects of development from appropriate technology and workflow to codingstandards Communicate successfully all concepts and guidelines to development team Oversee progress of development team to ensure consistency with initial design Provide technical guidance and coaching to developers and engineers Ensure software meets all requirements of quality, security, modifiability, extensibilityetc. Approve final product before launch. Write well-documented code, and maintain existing software applications. Provide technical assistance and support as needed. Troubleshoot coding problems quickly and efficiently to ensure a productive workplace. Collaborate with peer organizations, quality assurance and end users to producecutting-edge software solutions Prepare an easy to understand report for supervisors detailing achieved milestones andshort-term project goalsEXPERIENCE AND TECHNICAL SKILLS: Proven experience as software architect Experience in Dot-Net programming. Experience in Scripting Language: VBA, Python, Javascript. Experience in software development and coding in various languages (C#, .NET, Javaetc.) Experience in developing languages like C++, STL, OPENCASCAD, BOOTSTRAP,MULTITHREADING, MVVM and MFC added advantages. Strong knowledge on any 3D modeling software APIs and customization. Strong in Data Structures. Excellent knowledge of software and application design and architecture Excellent knowledge of UML and other modeling methods Familiarity with HTML/CSS, JavaScript and UI/UX design Understanding of software quality assurance principles A technical mindset with great attention to detail High quality organizational and leadership skills Outstanding communication and presentation abilities Proficiency in use of updated versioning of Visual Studio and Dot-Net Framework. 10+ years of experience in software programming. Experience in creating WebAPIs using .Net is extra advantage.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Mechanical, Computers"}, "KEY SKILL": ["OOPS", "C#", "Java", "C++", "Software Development", "Software Developer Architect", "Data Structures", "Programming", "STL", "MFC", "Software Design"]}