{"JOB DESCRIPTION": "   Duties Responsibilities      Develop software in modern enterprise-class languages and development platforms, with strong emphasis on Javascript and Node.js and ability to potentially mix in other new and emerging technologies as appropriate.   Develop software confidence and reliability by creating testing artifacts, developing tooling and providing the communication needed to ensure modified artifacts are continuously releasable.   Agile/Scrum planning and process involvement.   Architectural planning and design.   Ideally seeking full-stack developer, with some expertise in cloud-based software development.   Estimate and report development efforts.   Clearly and concisely document code additions and code changes.   Work with a global team.       Required Qualifications       BS in Computer Science or related field; MS in Computer Science or related field preferred.   4-7 years of software development experience, with a strong focus on application development preferably using Javascript and Node.js.   Expertise in developing software using AWS services.   Strong working knowledge of XML/JSON, HTML/CSS3, and associated modern technologies.   Good working knowledge of Node.js.   3 years experience developing systems with enterprise databases involved, including good working knowledge of No-SQL and SQL databases.   Previous experience, of at least three years, building medium to large-scale, mission criticalhigh availabilityproduction systems that directly support essential business, and technical, or operational functions.      Preferred Qualifications       Experience with Angular, Node.js. strongly preferred    Experience with MS Azure Cloud technologies, strongly preferred    Strong understanding and application of OOP principles, strongly preferred    Strong network programming skills, strongly preferred   Experience with mobile app development for Android and iOS applications, Objective C, Java, Xamarin.   Experience with developing software that integrates with hardware.    Experience with NoSQL database.   Experience with AWS cloud technologies.   Experience interfacing with IoT devices.   Test automation experience (C# and Coded UI tests).   Familiarity with Microsoft TFS or Azure DevOps.   Familiarity with Agile development methodologies.    Ability to work efficiently as a member of the software development team.    Strives to continuously build knowledge and skills.   Strong troubleshooting skills.   Strong analytical and critical thinking skills.   Detail Oriented.   Strong organizational skills.   Excellent communication skills.   Good Team-player.   Gives and welcomes feedback.   Works well in group problem solving situations.   Creative, out-of-box thinker.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["XML", "Configuration management", "Javascript", "HTML", "Application development", "JSON", "microsoft", "Troubleshooting", "SQL", "Android"]}