{"JOB DESCRIPTION": "  Qualifications    B.Tech. M.Tech. in CS or MCA    Key DutiesResponsibilities     The key responsibilities are      Proficiency and extensive work Experience with Node JS , TypeScript and GraphQL   Proficiency in Front End Development Skills like Angular JS , ES6   Experience in Distributed Stream processing platforms like Kafka   Experience in Event-driven and Microservices architectures with DevOps.   Experience in OO, DI, IoC design patterns   Creating self-contained, reusable, and testable modules and components   Architecting and automating the build process for production, using task runners or scripts   Professional, precise communication skills      Mandatory Skills      Backend Skills: Node JS, Typescript, Jest or equivalent, Rest API (GraphQL),Kafka    Databases : Postgres , Cassandra ,SequalizeTypeORM   Architecture: Event-driven and Microservices architectures with DevOps.   Design patterns: OO, DI, IoC      Preferred Skills      Front End Skills : Angular JS , ES6   Experience working in AWS, Azure Cloud Environment, Linux server operations   Lead Developer with Extensive Knowledge in developing Enterprise Application using Node JS, TypeScript and GraphQL    We need individuals who have a passion for working in a tightly-knit team to construct tool-chains for continuous build, integration, test and delivery (CICD) of software applications from development to operations. Initially it will include explorations to decide the tools and techniques for the purpose. After setting up the pipelines, you will need to manage the builds and deployments (liase between Dev and Infrastructure team).      Mandatory Skills:      Work experience in Kubernetes or Openshift.   Strong knowledge in Ansible.   Providing Systems admin support for several platforms in Kubernetes.   Ability to work with minimum supervision.   Good Communication Skills (written and verbal)   Work Experience in ELK, kafka stacks   Experience with Linux and Windows (Either one strong)   Basic Knowledge in Github.   Knowledge in Golang is added adavantage.   Strong command line expertise with BASH      Preferred Skills:      WindowsLinux Server Administration Experience   Understanding of infrastructure as code with tools (such as Terraform)   Database administration experience   Knowledge of one cloud platform - Azure or AWS    Powershellbash Experience    Full Stack Developers, highly skilled, hands-on cloud application programmer who is comfortable with both front and back end programming.    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Ceramics"}, "KEY SKILL": ["Core Java", "jQuery", "Linux", "Database administration", "Agile", "Application development", "Windows", "Analytics", "SQL", "Ajax"]}