{"JOB DESCRIPTION": "  Roles & Responsibilities     Design, build, and maintain efficient, reusable, and reliable code. Write clean, scalable code using .NET programming languages.   Participate in requirements analysis.   Responsible for Designing and Developing the Reusable UI Components Like MVC Master Pages Layouts and Nested Layouts , View Start and MVC User Controls Partial Views .   Implement Entity Framework Code First Approach to interact with Database and also implement the Mappings, Model Changes, CRUD operations and dealt with performance issues.   Use lambda expressions LINQ To SQL and LINQ to entities for retrieving and inserting data in database.   Implement WEB API Services for CRUD operations with HTTP verbs GET, POST, PUT and DELETE.   Work on all the required Stored Procedures, User Defined Functions, Triggers, and Views using T-SQL as per business logic.   Create and implement a multi-language framework to fit into the application. It provides application users with an ability to toggle between English and Spanish language.   Test and deploy applications and systems.   Analyze the Critical and Major production issues which are routed through JIRA software.   Identify bottlenecks and bugs, and devise solutions to mitigate and address these issues.   Help maintain code quality, organization, and automatization.    Skills   Strong understanding of object-oriented programming.   Involved in the full Life Cycle of the project including Architecture, Analysis Design, Development, Debugging, Testing and Deployment.   Worked in AGILE SCRUM environment regularly attending the Status Meetings and updating status to Scrum Master and involved in Code Review meetings, Implementing User Stories.   Familiar with various design and architectural patterns. Understanding of fundamental design principles for building a scalable application.   Familiarity with Microsoft SQL Server, MySql, PostGreSQL.   Experience creating database schemas that represent and support business proces    .Net Technologies and Frame works:   ASP.NET, ADO.NET, LINQ, WPF, ASP.NET MVC, Entity Framework and .NET Framework    Development Tools:   Visual Studio 2013/2012/2010, Visual Source Safe(VSS), SVN, JIRA ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["jQuery", "XML", "MySQL", "Debugging", "Javascript", "HTTP", "Visual Studio", "Stored procedures", "WPF", "Ajax"]}