{"JOB DESCRIPTION": " Business Segment: GI Consulting   Location: Cochin, India    Job Description   We re looking for software developer experienced in front and backend technologies. Responsibilities will include bridging the gap between graphical design and technical implementation, taking an active role on both sides and defining how the application looks as well as how it works.    Job Responsibilities    Developing user interface components and implementing them.    Coordinate with the rest of the team working on different layers of the infrastructure.    Commitment to collaborative problem solving, sophisticated design, and quality product is important.    Translating designs and wireframes into high quality code with extreme attention to detail in code and user experience.    Work closely with our design teams to create engaging and user experience focused products.      Job Requirements     Strong knowledge in JavaScript.    Familiar with Typescript.    Familiar with latest Javascript libraries such as Vue.js, React or AngularJS    Strong responsive design skills for mobile and desktop applications    Worked with RESTful APIs, third party SDK Integrations and common technologies like HTTPS, JSON and GraphQL    Good knowledge of node.js based server frameworks    Familiarity with Git version control system    Eager to learn new technologies    Familiarity with javascript server libraries      Preferred Qualifications     Degree in computer science or equivalent experience   Experience in application development for web and mobile platforms   Experience with React or Vue.js         ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Computer science", "Backend", "Version control", "Consulting", "Javascript", "Application development", "JSON", "SDK", "Outsourcing", "SRM"]}