{"JOB DESCRIPTION": "   Track, report, and analyze website analytics and search console     Perform ongoing keyword discovery, expansion, and optimization     Research and implement search engine optimization recommendations     Research and analyze competitor advertising links     Work with the development team to ensure SEO best practices are properly implemented on newly developed code     Work with graphic and marketing teams to drive SEO in content creation and content programming.     Basic knowledge social media platforms( FB, Quora,     Twitter, Pinterest, Instagram, TikTok)                 Roles and Responsibilities:            The candidate should have minimum experience of 1 year in direct sales in digital marketing with the digital product portfolio comprising of AdWords, Tech services, Web Development, SEO, SMO and Facebook campaigns.   Researching and interactive with prospective clients and ongoing digital campaigns within your market and turn these into increased business.   Grow and manage the sales pipeline by pitching digital advertising services on AdWords, Facebook, and LinkedIn.   Using knowledge of the market and competitors, identify and develop the company s unique selling propositions and differentiators.   Meet potential clients by growing, maintaining, and leveraging your network.   Closing the deal and onboarding the client while building long-term relationships with new and existing customers.   Synergizing with Internal teams for execution and success of the campaigns.             Work Experience and Education requirement:    Only those candidates can apply who:     1-4 years of experience in pre-sales/ ad sales/ network sales.   Candidate should be comfortable working with MS Excel and data.   Any experience in making client proposals and ppts would be an added advantage.   Any Graduate or Post Graduate qualification.     ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Advertising, PR, MR, Event Management", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Backend", "Data analysis", "Linux", "Market research", "HTML", "Windows", "MS Office", "SEO", "microsoft", "Analytics"]}