{"JOB DESCRIPTION": "We are looking for 3-5 years experienced web development team lead (PHP, MySQL) with a strong passion for software development. The candidate should be an expert in this field with the capability to both- a) Guide, mentor, lead and supervise a team of junior software developers as well as b) be very comfortable and very confident with advanced level programming skills and concepts. Previous experience with large scale projects is mandatory.Experience in every phase of the SDLC in large projects including PoC (proof of concept) design, implementation, test and optimization of code is absolutely essential. Team lead is expected to know each and everything in the process including right toolkits to use, right code version control, right IDEs to use, very fluent with LAMP server config fundamentals. You will be eventually responsible for bringing the project to completion in the time frame that you estimate. There will be high expectations from the candidate that fills this role.You will also be responsible to keeping management up to date with progress on all tasks assigned. Our clients will be based in USA and UK/Europe and you may be frequently asked to interface with the client as well.Educational requirementsWe will accept candidates with any of the following qualifications:BTech or BE in computers, electronicsMCACombination of a computer degree and MBASkills requiredFluent in English language with excellent communication skillsSystem Architecture, and designDatabase designExceptional programming knowledge of Core PHP and MySQLThorough knowledge of frameworks such as Zend, CakePHP, Codeignitor, YiiThorough knowledge of popular platfroms such as Wordpress, Magento, Opencart etcGood grasp of front end Technologies such as HTML, Javascript/Jquery, AJAXGood grasp of Linux system admin related to web development (Apache, Mysql, PHPmyadmin and other common tools). This includes building server from scratch.Experience in performing unit testing on developed codeGood technical documentation skillsSalary:Perks and Benefits commensurate with skill and experience", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - eCommerce, Internet Technologies", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization, Graduation Not Required", "PG": "Post Graduation Not Required, Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required, Any Doctorate in Any Specialization"}, "KEY SKILL": ["HTML", "lamp", "Zend", "JQuery", "Codeigniter", "apache", "MySQL", "Wordpress", "linux", "Javascript", "php", "CakePHP", "Core PHP", "Ajax"]}