{"JOB DESCRIPTION": "FOR SOFTWARE ENGINEER / SOFTWARE DEVELOPER:Have good working knowledge on .Net, Asp.net, C#, MVC, Angular JS, Web (ASP.NET, JQuery , JavaScript), LINQ, HTML, CSS)- Strong MS SQL and ability to write procedure and SQL functions and queries.- Keen to learn new technologies like Artificial Intelligence, Machine Learning.- Working exposure to Test, Link, JIRA, GIT, Jenkins, Visual Studio 2015 or later, OOPs concepts, Cloud concepts.- Should have availability and flexibility to work collaboratively in a team.- Strong Communication Skills- Proven Track Record in being able to work independently as well as manage a 2-3 member team. FOR TECHNICAL LEAD: Brief about role:  We are looking for candidates who are technical oriented. Candidates should also be self-motivated, enthusiastic, quick learners, capable of adapting to our client culture and able to work in a very dynamic environment.Primary responsibility would be working with our development team and take the application development ahead. You should be a performer and contribute to good coding standards, best practice implementation.As a Full Stack Developer, you are expected to have a good hands-on experience working with Angular JS, .net. Collaborate with other teams and address business, technical, and logical needs.This position plays a key role in Bluekaktus, with significant impact on project activities and corporate success. Roles & Responsibilities:1. Expected to spend 80% of the time on hands-on development, design and architecture and remaining 20% on guiding the team on technology and resolving other impediments2. Work closely with business and IT teams to clarify and refine functional data requirement specifications.3. Translate detailed business requirements into optimal databases and solutions. 4. Collaborate well with other developers, leads and data implementation specialists to design and create advanced, elegant and efficient products5. Significant knowledge of PL/SQL including tuning, triggers, and stored procedures6. Prepare and package scripts and code across development, test and QA environments7. Participate in change control planning for production deployments8. Performs requirements gathering and analysis on projects9. Addresses any requirements changes, improvements or project deliverable issues10. Experience working with and/or integrating to systems such as ERP11. Strong technical abilities within application development, configuration, implementation, and supportWe allow Developers to work from home. Perks and Benefits No salary bar for the right candidate", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization, Graduation Not Required", "PG": "Any Postgraduate in Any Specialization, Post Graduation Not Required", "DOCTORATE": "Any Doctorate in Any Specialization, Doctorate Not Required"}, "KEY SKILL": ["C#", "CSS", "LINQ", "Javascript", "ASP.Net", ".Net", "HTML", "MVC", "JQuery", "Angular"]}