{"JOB DESCRIPTION": "  PRIMARY RESPONSIBILITY:    Designs and develops software for enterprise services. Responsibilities may include: translating functional requirements into conceptual and detailed designs; providing estimates for development effort; implementing proof of concept, prototypes, and production-grade software; creating unit and acceptance tests; coordinating sign-off from QA/Test; automating deployment; and assisting Operations and Support staff in trouble-shooting software issues, as well as implementing bug fixes. Working knowledge in one or more programming languages, technologies, and software platforms. Adheres to established coding and process best practices. Demonstrates progressive strive toward working autonomously.         KNOWLEDGE/SKILLS/ABILITY:   Has or works on developing general knowledge of at least one technology relevant to current assignment. Learns to formulate new and alternate ideas, approaches, and designs. Learns to be systematic and structured in problem solving approach.         JOB COMPLEXITY:    Designs robust, scalable, secure, and globalized feature. Identifies risks and mitigation for own feature. Effectively manages dependencies for own feature. Efficiently implements own feature with minimal technical debt. Ensures feature area is bug free. Includes unit tests for own feature to achieve established code coverage targets. Feature areas are test-driven designed, enabling efficient regression testing. Focuses on a single feature or sections of code while building basic experience and expertise.         SUPERVISION:   Works independently under general supervision.     EXPERIENCE/EDUCATION:    Bachelor s degree or equivalent in a technology related field required, and 4+ years of experience in software development, engineering, testing, or a related field. Understanding of software engineering fundamentals gained through training, course work, or relevant experience. Experience may substitute for the degree requirement at a ratio of 3 years of experience for each year of education.     PHYSICAL DEMANDS:   General office environment. May require long periods sitting and viewing a computer monitor. Moderate levels of stress may occur at times. No special physical demands required. Schedule flexibility to include working a weekend day regularly and holidays as required by the business for 24/7 operations.     POLICY COMPLIANCE:   Responsible for adhering to company security policies and procedures and any other relevant policies and standards as directed.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Civil", "Coding", "Manager Technology", "Programming", "Regression testing", "Management", "rackspace", "Troubleshooting", "Supervision", "Testing"]}