{"JOB DESCRIPTION": "  Responsibilities will include:?    Obtain and master information on a particular subject matter and become the mentor for that subject? Coordinate and monitor the workload of the development team and ensure work is done in accordance with quality guidelines and timelines? Update US Team Leads and the US Project Manager on team progress and become the point person for issues concerning the development team? Analyze root causes of system errors and processing issues in application software and coordinate repair activities? Investigate complex requests to determine if request should be grouped with other requests to decrease duplication of work?    Evaluate team resolution timelines to ensure timelines can be achieved? Execute software performance matrix tests, when necessary, to ensure new products and product enhancements are complete within quality guidelines.? Train team on transaction processing outputs, troubleshooting errors, and processing requests that are within the projects? Partner with US Team Leads to ensure they are updated on requests; status and resolution timelines?    Motivate team to meet and exceed departmental goals set by the Director of Information Systems and reward team members if goals are exceeded? Oversee the quality assurance of programs including testing of product quality? Analyze the technical comments within the business and functional requirements to ensure references are clearly written and transferrable to other System Developers? Develop, define, and recommend technical best practices within the department to ensure quality and efficiently?    Examine code and development techniques to certify that the code is efficient in execution and that best practices are observed? Provide documentation to support all phases of the project life cycle including project charter, requirements specification and plans for staff resources?    Coordinate all project activity ensuring that goals are met and/or exceeded while controlling change, achieving quality and proceeding on schedule? Act as a back up to Project Team Lead? All other duties as assigned   Qualified Candidates will possess:? Bachelors in Computer Science, Software Engineering, Project Management or equivalent, Masters a plus? 5+ years of experience in .Net, C#, VB, ASP and SQL? 5+ years of experience managing software projects with strong analytical, planning, performance management and process improvement skills? MCTS, MCSD or MCSA certification a plus? Experience in an EDI transaction environment a plus?    Knowledge of testing procedures? Ability to work in a fast paced team environment with changing priorities? High level of multi-tasking ability and time management skills? Excellent ability to communicate clearly and effectively both verbal and written?  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Computer science", "MCTS", "MCSD", "Performance management", "XML", "Analytical", "Process improvement", "EDI", "Troubleshooting", "SQL"]}