{"JOB DESCRIPTION": "Position Title   : Web Developer &  Senior Software Engineer Salary                : Best as Per Industry StandardsExperience       : Upto 2 years minimumLocation           : Saki Naka, work from home option can be availedEducation         : Candidate should be a graduate or post graduate in any stream About GRT Global Logistics:GRT Global Logistics is one of the leading international freight forwarder and logistics service provider based in Mumbai. GRT is a systems centric and process driven company focused on creating value for its employees, investors, customers and other stake holders. GRT is in advanced stages of developing a world class ERP solution to manage sales, operations, CRM, accounts, finance and other functions for the logistics and freight forwarding industry. Roles & Responsibilities for Web Developer Develop user friendly and professional looking user interfaces.Work with the business analyst/product owner to design efficient process workflows. Convert designs created by designers into functional user interfaces and integrate with server-side APIs collaborating with the back-end development team. Verification and validation of the user interfaces Work closely with operations, business analyst, development team and other stake holders.  Desired Candidate Profile:Candidate should be passionate about process design and UI design.Should have an eye for details and user-friendly process flows.Quick learners and should possess excellent problem-solving skills.Good team player.Ability to communicate effectively with stake holdersDesired skills for for Web DeveloperExposure to HTML5, CSS3, Bootstrap, LESS/SASS, JavaScript and JQuery.Must have a very good understanding of Responsive designs and media queries.Must have Experience about 1.5 to 2yrs in Angular 10, TypeScript.Extensive hands-on experience working with REST service integration.Roles & Responsibilities for Senior Software Engineer Develop high-quality software following the most appropriate architectureCollaborate with internal teams to fix and improve productsPerform validation and verification testingDevelop new modules of the application by writing code following coding standards and industry best practicesAnalyze requirements and design solutions for modulesReview and Debug CodeDeployment and production support Desired skills for Senior Software Engineer Minimum 3 years of experience in software developmentVery strong OOPs fundamentals and strong Core Java skillsExtensive experience in software development, scripting and project managementGood exposure to HTML5, CSS3 and Bootstrap Knowledge of programming languages like Spring, Hibernate, JavaScript, Maven, Angular and the Java/J2EE platformIn-depth knowledge of relational databases (MySQL)Web application servers like Apache Tomcat or Jetty Desired Candidate Profile for Senior Software Engineer Good communication skills Excellent organizational and leadership skillsTeam PlayerAnalytical mind with problem-solving ability", "ROLE": "Software Developer", "INDUSTRY TYPE": "Courier, Transportation, Freight , Warehousing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["Software Development", "Web Technologies", "Web Development"]}