{"JOB DESCRIPTION": " Job Description   Job Summary      We are looking for a Java Developer with minimum 4 to 10 years of experience in building high-performing,      scalable, enterprise-grade applications with strong core Java and OOPS concepts and strong understanding      of collection fundamentals. You will be part of a talented software team that works on mission-critical      applications.      Required Experience: 4 to 10 years   Job Summary   Required Skills:      Should have strong knowledge of Core Java and OOPS concepts      Sound knowledge of Web application development fundamentals and have worked on Servlets, JSP and any MVC framework      Strong analytical and reasoning skills and ability to learn and unlearn new technology on back end as well as on front end      Ability to understand functional and requirement specifications and transform them to solution      Understand the client s problem domain and suggest and implement solution which brings value to the business      Can estimate, develop and deliver project from start to end      Should have professional service experience with any product      Experience working with onshore team and ability to communicate with clients and stakeholders      Ready to travel onshore      Experience with any Business Process Management products like Activity, Bonita soft BPM, IBM BPM etc.      Sound knowledge of RDBMS      Can communicate well with clients and collaborate with cross functional team to deliver high quality deliverable      Should have knowledge of Agile/Scrum methodology    Good to have below skills:      Good knowledge of JS frameworks like Angular, Backbone or similar MVVM frameworks      Knowledge of Enterprise Service Bus architecture and exposure to any framework in same area      Knowledge of any Application servers like Weblogic, JBoss or Websphere would be a plus      Knowledge of how to design and implement J2EE compliant enterprise applications      Ability to write and good technical documentation      Ability to write Unit and integration test cases using JUnit or Test NG      Strong knowledge of JSP/Servlets and web application development in Java with any MVC framework (Struts, Spring MVC etc ).      Good knowledge of relational database, JPA and hibernate or any other ORM framework      Knowledge of Spring framework and build tools like Ant, Maven or Gradle      Strong knowledge of latest Java script frameworks complying to MVVM pattern      Should have knowledge of HTML and CSS      Maven or Gradle      Unit testing   Responsibility & Duties   Responsibilities and Duties:      Java/Java EE application development while providing expertise in the full software development life cycle, from concept and design to testing.      Contribute in all phases of the development life cycle      Write well designed, testable, efficient code      Ensure designs are in compliance with specifications      Prepare and produce releases of software components      Support continuous improvement by investigating alternatives and technologies and presenting these for architectural review   Benefit     Health Insurance- Family Health Cover      Constant Learning      Regular Employee Engagement Activities      Competitive Pay      Birthday and work anniversary celebration      Company annual 1 Day picnic      Healthy Work environment      Employee friendly policy   Skills   JAVA  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Maven", "Hibernate", "Core Java", "JBoss", "RDBMS", "Enterprise applications", "Weblogic", "Struts", "J2Ee", "HTML"]}