{"JOB DESCRIPTION": "     At adidas, every day is a chance to flip the script. An invitation to take everything we know and reinvent it. Do it better. Never settling for good enough. Every day we get up, invent, adapt, improvise, find new ways to collaborate, and do the unexpected. We re creators, makers and doers. Helping athletes make a difference, not just in their games, but in their lives and in their world. It s an obsession. We ve been doing this for more than 70 years. With an unmatched history and tradition of creating iconic products, consumer connections, and experiences, we ve been defining sport culture since the beginning. And we re never done. Come be a part of shaping the future together with us.       Junior Software Developer (m/d/f)      We are using technology to create solutions that are transforming how products are being digitally created. We are putting collaboration tools in place that ease and speed up product creation and sourcing for thousands of employees. We are harnessing data which enables our employees to make better decisions. We are working in a fast paced, startup alike environment where we truly believe that technology can automate most of the mundane tasks and free up time for creators to do what they really need to do create.       As part of the engineering team your mission is to deliver high quality software at speed. You will be developing and operating our software products, showcasing your creativity and using the latest technologies to bring ideas to life.    WHAT YOU CAN EXPECT      You will bring your ideas to life in a buzzing environment of highly engaged, multinational agile teams, who at their core build game-changing software products. Right there with you!       You will focus on elegant software solutions     You will understand the full E2E process along frontend and backend components.         Get ready to work with QA & DevOps cracks and collaborate with solution architects, product owners and project managers            You will be a sponge, continuously learning the latest tech from experienced colleagues, conferences, and trainings always growing and improving          You will follow existing release process to enable developed features in live systems        You will ensure team code is compliant with code quality and standards         You highlight tech debt and ensuring it s addressed as part of product roadmap      WHAT WE ARE LOOKING FOR   College or university degree with focus on IT or equivalent.         First IT experience within a relevant area would be great (ideally with JAVA but all coding languages are welcome).           Eager to look for perfection in your coding through software development best practices      Motivation to never stop learning in the digital IT space   Strong interpersonal and communication skills.  Fluent in English. WHAT WE WANT TO OFFER      You will be part of a strategic program for adidas with a lot of opportunities to grow and reach your expectations. You will join a team of talented and passionate engineers and you will work with latest technologies (Spring Boot, React, Kafka and so on). Together and individually we will use, contribute and release open source. You will be working in a flexible and family friendly environment and culture. We have options for cab service, food, nice and modern office, and other benefits that you ll love        THROUGH SPORT, WE HAVE THE POWER TO CHANGE LIVES      Check out the adidas developer portal to see our latest projects, platforms and tech stacks:       At adidas we have a winning culture. But to win, physical power is not enough. Just like athletes our employees need mental strength in their game. We foster the athlete s mindset through a set of behaviors that we want to enable and develop in our people and that are at the core of our unique company culture the 3Cs: CONFIDENCE, COLLABORATION and CREATIVITY.     CONFIDENCE allows athletes to make quick decisions on the field, to reach higher. For us at adidas confidence means acknowledging that we don t have all the answers. But we are willing to take risks, we try new things. And if we fail, then this is part of our learning it helps us improve.  COLLABORATION. Every elite athlete relies on partners: coaches, teammates, and nutritionists. We, too, know that we are stronger together. Winning as one team takes open and candid dialogue, inclusiveness and trust in each other s abilities and talents.  Being the best sports company in the world takes CREATIVITY. No great athlete succeeds by copying their predecessors training plans and strategies. We have to be open to new ideas, explore, gain an edge and stand out. Only then can we succeed.        adidas celebrates diversity, supports inclusiveness and encourages individual expression in our workplace. We do not tolerate the harassment or discrimination toward any of our applicants or employees. We are an Equal Opportunity Employer.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Wellness , Fitness , Sports, Beauty", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Training", "spring boot", "Backend", "Coding", "Agile", "Open source", "Information technology", "Software solutions"]}