{"JOB DESCRIPTION": "  Responsibilities        A Software Developer is a person that creates software either completely, or with other companies or people. The phrase software development often means more than just designing or writing the software, it usually means someone who manages the project, or does only the main things. Most software developers are still led by a lead programmer (a software engineer that guides the project).   A Software Developer serves as a member of the software development team. They aid in the innovation and creation of company software and programs. Generally found in tech-heavy industries and large corporations, a Software Developer will work alongside a team of programmers to code programs that meet the need of the company or client. They seek to facilitate the proper design and implementation of software.   Software Developers use software development languages and tools to write, edit, maintain, and test computer software. Software Developers follow the software development lifecycle (SDLC) to plan, design, build, test, and deploy software applications, ranging from websites and mobile applications to web applications and video games. In addition to creating new software, Software Developers improve and maintain the working order of existing software.       Job Description     Will be responsible for Software design, Specification, Requirements analysis, Development and Maintenance.    Actual core implementation (programming which is often the most important portion of software development).    Other required implementations (e.g. installation, configuration, customization, integration, data migration).    Will participate in software product definition, including business case or gap analysis.   Feasibility and cost benefit analysis, including the choice of application architecture and framework, leading to the budget and schedule for the project.    Testing, including definingsupporting acceptance testing and gathering feedback from pre-release testers.    Participation in software release and post-release activities, including support for product launch evangelism (E.g. Developing demonstrations andor samples) and competitive analysis for subsequent product buildrelease cycles.    Determine operational feasibility by evaluating analysis, problem definition, requirements, solution development, and proposed solutions.    Document and demonstrates solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code.    Prepare and installs solutions by determining and designing system specifications, standards, and programming.    Obtain and licenses software by obtaining required information from vendors.    Recommending purchases. Testing and approving products.    Protect operations by keeping information confidential.    Develop software solutions by studying information needs. Conferring with users.    Studying systems flow, data usage, and work processes. Investigating problem areas.    Following the software development life cycle.    Analyzing user requirements, Researching, designing and writing new software programs, Testing new programs and fault finding, Creating technical specifications and test plans.    Developing existing programs by analyzing and identifying areas for modification, Integrating existing software products and getting incompatible platforms to work together.    Continually updating technical knowledge and skills by attending in-house andor external courses, reading manuals and accessing new applications.    Work with team members to design innovative software programs that improve and simplify the online shopping experience for customers across various products and brands.    Ensure all new software functions smoothly across various programs and platforms, including Microsoft and Apple products and mobile systems    Perform intensive testing of all new and existing programs to ensure they are free of errors and function as intended    Keep up to date on the newest technological innovations in the field and be ready to apply relevant innovations to our software systems          Qualifications      Trained or educated as Software Developer or similar role   software developer skills are Analyzing Information, General Programming Skills, Software Design, Software Debugging, Software Documentation, Software Testing, Problem Solving, Teamwork, Software Development Fundamentals, Software Development Process, Software Requirements etc.    Up-to-date with recent technological advances and developments, advances in computer technology and how this affects the business environment and have a strong client focus.    Familiarity with Agile development methodologies    Experience with software design and development in a test-driven environment    Knowledge of coding languages (e.g. C++, Java, JavaScript) and frameworkssystems (e.g. AngularJS, Git)    Experience with databases and Object-Relational Mapping (ORM) frameworks (e.g. Hibernate)    Excellent communication skill    Highly self motivated, hard-working and ambitious in achieving goals and ready to do whatever it takes.    Expertise in current computer hardware and software.    Expertise and Ability to use one or more development language.    Working knowledge of the main programming languages and operating systems used, for example: SQL, Java, C++, XML, Smalltalk and Visual Basic; Oracle, UML (Unified Modelling Language), Linux and Delphi; .NET frameworks (such as C# (C-sharp), ASP and VB).           ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["C++", "Hibernate", "Linux", "UML", "XML", "Javascript", "Oracle", "VB", "ASP", "SQL"]}