{"JOB DESCRIPTION": " About the Role    The recently incorporated team at Monech has a mission of building systemic intelligence across Financial Advisory ecosystem. This team is currently a part of its future thinking, potential financial advisory start-up subsidiary Monech Where tech meets money    Having been in the financial services industry for the nearly 25 years in India, we believe in creating products and advice that cater to the future. In addition to interacting with more than 1000 clients, we have data from huge number of investors and sellers going back decades.    The numerous TBs of data generated per day has complete mix of data types in terms of financial, graphical, numerical data, structured text, unstructured text, etc.    We are currently in search of an experienced Software Developer to create and maintain software, in-house hardware and network systems. The successful candidate will also help to develop critical products for our clients and offer excellent technical support. This is a fantastic opportunity to engage in a positive and creative work environment that offers    Job Responsibilities    Work with Data Scientists, Analysts to design algorithms and flowcharts Produce clean, efficient code based on specifications Integrate software components and third-party programs    Verify and deploy programs and systems Develop and implement new software programs Maintain and improve the performance of existing software Clearly and regularly communicate with management and technical support    Design, test, update and software database/products to ensure strong functionality and optimization    Troubleshoot, debug and upgrade existing software Gather and evaluate user feedback Create technical documentation for reference and reporting    Desired Candidate Requirements    Qualifications:    Proven experience as a Software Developer, Software Engineer or similar role Familiarity with Agile development methodologies Experience with software design and development in a test-driven environment Knowledge of coding languages (e.g. C++, Java, JavaScript) and frameworks/systems    Experience with databases and Object-Relational Mapping (ORM) frameworks (e.g. Hibernate) is a plus    2+ years experience in web and software development is ideal    Strong analytical and critical thinking skills Self-motivated. Capable of working with little or no supervision Strong written and verbal communication skills Enjoy challenging and thought-provoking work and have a strong desire to learn and    Ability to manage multiple tasks and requests Must demonstrate a positive, team-focused attitude Ability to react positively under pressure to meet tight deadlines    Good inter-personal skills combined with willingness to listen Structured, disciplined approach to work, with attention to detail Flexible - able to meet changing requirements and priorities Comfortable working with ambiguity (e.g. imperfect data, loosely defined concepts, ideas, or goals) and translating these into more tangible outputs    Maintenance of up-to-date knowledge in the appropriate technical areas Able to work in a global, multicultural environment Entrepreneurship and Project Ownership abilities are an added advantage    Masters/PGP in Statistics, Computer Science, Applied Mathematics, Data Analytics, Business Analytics or other similar advanced degrees from a top tier educational    Graduate in Statistics, Computer Science, Applied Mathematics, Finance/Accounts or other similar advanced degrees is a must.  ", "ROLE": "Sales/Business Development Manager", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "Sales, Retail, Business Development", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Retail Sale", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "MBA/PGDM in Marketing, Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Financial advisory", "C++", "Analytical", "Business analytics", "Capital market", "Business intelligence", "Portfolio management", "Financial services", "Technical support", "Stock broking"]}