{"JOB DESCRIPTION": "      Job Description     The Trivedi Centre for Political Data (TCPD) at Ashoka University seeks to hire a full-time software engineer/data scientist to help build a new infrastructure, data and technology for research on Indian political data. At TCPD, you will have opportunities to deep dive into the following areas of work:    Open source technologies in various fields, such as databases, data visualization, UI/UX design, RESTful API, containers and cloud services.    Working on POC (Proof of Concept) product prototype with other software engineers. ? Building the field of computational methods for social science research.    You will also collaborate with researchers, academics in political science and computer science in India and abroad, attend major technology and computational methods conferences to learn hot technologies in political science and computer science. You will also be encouraged to conduct and publish your own research.    1. BASIC QUALIFICATION REQUIREMENTS    Bachelor?s degree in Computer Science, Data Science or related fields. Experience in two or more of the following languages: R, Java, Python.Proficiency with Web application development.    Knowledge of server side scripting.    Proven ability at looking at solutions in unconventional ways. Sees opportunities to innovate and can lead the way.    Good communication (verbal and written) and interpersonal skills to convey key insights from complex analysis and an ability to effectively communicate with technical teams.    Ability to work with shifting deadlines in a fast-paced environment.    2. PREFERRED QUALIFICATIONS    Master?s degree or above in Computer Science, Data Science or related fields.    At least one year of experience in Web application development.    Experience with SQL and RDBMS    Experience with frontend technologies Javascript, React or similar framework,    CSS, HTML, Bootstrap. Experience in amazon web services. Experience in containers, such as Docker.    Proficiency with Linux and systems administration.    Geospatial packages: Atc/QGIS   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Telcom, ISP", "FUNCTIONAL AREA": "IT Software - Other", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Computer science", "Prototype", "Linux", "RDBMS", "Javascript", "HTML", "data visualization", "Open source", "SQL", "Python"]}