{"JOB DESCRIPTION": "    Position Summary    ThinkZone is expanding and is seeking talented and driven software developers to work towards making a difference to the way early childhood and primary education is imparted to students from under-resourced communities by creating Accessible technologies.      The software developers will have the unique opportunity to work on creating user friendly, innovative and scalable mobile applications.      Software Developers with knowledge of MEAN STACK will be responsible for development of mobile applications using MongoDB, ExpressJS,Ionic 34, Node.js, Rest Api etc as well as providing systems analysis, program design and documentation.      SheHe will be working in an agile, rapid development and prototyping environment where effective communication is paramount and contributing to building a positive, can-do, high-performance culture is absolute.           1. Developing new user-facing features on Ionic 34  2. Creating web services using NodeJS (Express) and Mongo DB.  3. Practice clean, stable, unit-tested code and managing code repositories using Git  4. User authentication and authorization between multiple systems, servers, and environments  5. Building reusable components front-end libraries for future use  6. Deploy applications on AWS cloud with ability to debug hosting related issues.      1. 1 to 2 years proficiency with MEAN stack development  2. Backend database experience with MongoDB  3. Experience in implementing applications using Angular 46, Ionic 34  4. In depth knowledge of NodeJS, ExpressJS+ REST APIs  5. Experience with modern frameworks and design patterns and in creating secure RESTful web services  6. Experience in server management and AWS knowledge  7. Native Mobile Application Development Experience         ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Mobile application development", "Backend", "Front end", "GIT", "Web services", "Agile", "Server management", "MongoDB", "Mobile applications", "AWS"]}