{"JOB DESCRIPTION": "Roles and Responsibilities :Data modelling, implementing business logic as well as focusing on engineering and design of the platform. API design and developmentImplementation of CRUD (Create, update, read, delete)Writing reusable, testable, and efficient codeDesign and implementation of low-latency, high-availability, and performant applications Integration of user-facing elements developed by front-end developers with serverside logic Write and implement software solutions that integrate different systemsIdentify and suggest ways of improving efficiency and functionalityCome up with reusable code that is efficient and easily testableUse backend logic to integrate user-facing featuresDevelopment of middleware ensuring high performance and responsiveness to requests from the front-end and also development of a complex & secure data aggregation systemDiagnose bugs and other issues in productsWrite and implement Low-Latency ApplicationsImplement security and data protectionDesign and build scalable REST APIsDevelop, test, tune for performance and deploy web servicesWork with product team to build innovative, robust, and easy-to-use features. Collaborate with the team, optimize and refactor the back-end architectureContribute to architectural and design discussionsEnsure smooth and timely communication with both the internal and external stakeholders.Participate in estimations and ensure timely delivery of the featuresDesign, Develop & Unit test features in the productConduct peer reviews and ensure quality of committed codeRequired Skills:Excellent software engineering skillsSolid foundation in data structures and algorithmsData modelling and database design. Expert in Python, with knowledge of at least one Python web framework {such as Django, Flask, etc}Good understanding of server-side templating languages like DTL, Jinja 2Good understanding of front-end technologies, such as JavaScript, HTML5, and CSS3 Knowledge of at least one ETL tool or framework (Such as apache airflow)Familiarity with SQL and any ORM frameworkIn depth knowledge of any one web server like nginx or apache2 would be a plus. Competent in designing and building web applications and/or web services in a commercial settingCompetent in design/implementation for reliability, availability, scalability and performance Working knowledge of code versioning tools such as Git Strong unit test and debugging skills are a plus Good understanding of designing micro services A self-starter attitude, the ability to work independently and in a group, demonstrated initiative, and good writing/briefing skills are great to haveShould be good at analytical thinking and breaking down large problems into solvable chunks Demonstrated the ability to think creatively and come up with ideas / thoughts with significant business/ organizational impactAbility to quickly adapt to changing technological trendsQualification: B.E., B.Tech, MCA, Computer Science, equivalent in computer science or IT.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "MCA in Computers", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Jinja 2", "Restful API", "Django", "API", "ETL", "DTL", "Python"]}