{"JOB DESCRIPTION": "Roles and ResponsibilitiesIntroductionSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do. Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide. At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.Your Role and ResponsibilitiesIBM Cloud is currently looking for a Software Developer to join our global development team building the next generation of AI-infused, cloud-native management tools for hybrid and multi-cloud environments. As a Software Developer on the Observability team, you’ll be responsible for developing quality code to collect data from a wide array of systems our clients use. This data feeds our AI systems that extracts meaningful insights our clients can use to increase resiliency, performance, and quality of service. Working in an agile environment, you will be part of a multi-disciplinary squad working on our observability framework. Your work will involve close collaboration with Architects, DevOps Engineers and Offering Managers across our global organization. The successful candidate will have deep technical skills in software development with multiple languages, agile practices, distributed systems, networking, data collection and observability technologies running on Linux and Kubernetes/OpenShift. Responsibilities:Work as part of a development squad to deliver software for data collection and observability.Follow Agile development methodologies/best practices to produce quality code and documentation deliverables.Participate and present at regular playbacks to the broader team, showing the output of the squad.Contribute to and implement functional specs/designs to feed into a larger system architecture.Deliver customer value through innovative solutions that address customer business problemsRequired Technical and Professional Expertise3+ years of software development experience of backend systems using any of the following languages: Golang, Python, Java.2+ years experience working with observability technologies like open source technologies: Prometheus, Grafana, ELK, Jaegar, fluentd, or commercial products such as Sysdig, Datadog, AppDynamics, New Relic, Dynatrace2+ years experience working with Kubernetes/OpenStack or related cloud-native technologies2+ years working with Linux, virtualization technologies (VMware, KVM), networking and cloud providers1+ years experience with automation and test frameworks using Python, Bash, JEST, NightwatchExperience working with CI/CD processes, DevOps methodologies and tools such as git, Jenkins, Travis.Experience with REST API back-end developmentStrong communication skills and the ability to work in a fast-paced environment with remote office locationsWillingness to roll up your sleeves and do whatever it takes.Preferred Technical and Professional ExpertiseProven knowledge of OpenStack projectDemonstrated understanding of object oriented design principles and patternsProven knowledge of MVC architecture and implementationA positive attitude and willingness to drive projects to completion in a fast paced environment", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["MVC Architecture", "KVM", "Linux", "PAAS", "Artificial Intelligence", "Iaas", "Openstack", "Bash", "Virtualization", "Python"]}