{"JOB DESCRIPTION": " We are seeking talented front-end web developers to join our Customer Experience team. Customer Experience is responsible for the administrative customer management portal. We run our own multi-factor authentication system based on Identity Server and develop C# APIs to serve our React web application.    The team is well experienced and delivers high-quality code quickly and often. We maintain our own automated build pipelines and blue-green cluster deployments onto virtual machine clusters. We write automated tests for all of our code, and have a mature development and deployment process. Our main products are often deployed multiple times per day.    The primary technologies we use are React 16 for our admin webpage and C# for our supporting APIs. An ideal candidate will be very proficient with Javascript and would have strong C# skills.         Responsibilities:     Deliver product features for our Control Panel User Interface    Write clean, maintainable code using engineering best practices    Collaborate with other developers, product managers, and user experience designers daily, to identify the right technical solutions that achieve product goals    Continuously broaden and deepen your skill set to solve new technical challenges    Provide Fanatical Support for our production system by fixing bugs and triaging alerts         Qualifications:     The ideal candidate will have the following:    4+ years practical experience in one or more of the following domains:    Building web applications with a modern JavaScript framework (React, Angular, Ember, or similar)    Building and consuming HTTP APIs in a service-oriented architecture    Building SaaS applications (including handling deployment, monitoring, logging)    Demonstrated passion for independent learning    Experience working in a team that practices continuous delivery    BS in Computer Science or related field, or equivalent experience    Excellent verbal and written communication skills  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Administration", "Front end", "SOA", "Javascript", "Manager Technology", "HTTP", "Control panel", "rackspace", "Monitoring"]}