{"JOB DESCRIPTION": "  You will be responsible for delivering high qualityperformance maintainable code       Go extra mile to identify issues in existing code and actively participate in code and product review meetings.       Work with senior engineers, product managers to come up with best solution to real world problems.       Work on server side technology to maintain current products and build new software products.      Bring to the table new ideas for development.    Reviewing current systems    Presenting ideas for system improvements, including cost proposals    Working closely with analysts, designers and staff    Producing detailed specifications and writing the program codes      Testing the product in controlled, real situations before going live      Preparation of training manuals for users      Maintaining the systems once they are up and running      Providing support to current clients.     Desired Qualification:      Years of Experience: 1 - 5 Years       Proficiency in Mobile Development (Android is a must, Additional iOS experience is a plus)      Highly proficient in Java.    Problem solving and quick learner.      Strong logical reasoning and ability to pick up programming languages on the job as per requirement.      Previous work with REST services and cloud infrastructure.    Previous work experience in Tech Startups.    Good sense of UIUX.    Efficient in software development design patterns and algorithms.    Provide software training to other employees.     If you feel you have the above qualifications and can make a difference please fill the form below and upload the latest copy of your resume.      Job Application Form What position are you applying for Available start date What is your current employment status Please provide your resume link: Please upload your resume on Google Drive WeTransfer or any file sharing platform and provide the link below.    In 150 characters or less please indicate why you are best suited for this role.      Would you like to list references        Add fields using buttons on the left window or simply drag and drop them here.                   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["Training", "Mobile development", "Cloud", "Production", "Infrastructure", "Programming", "Windows", "IOS", "Android", "Testing"]}