{"JOB DESCRIPTION": "Collaborate with developers,  programmers,  and designers in conceptualizing and development of new software programs and applications Analyze and assess existing business systems and procedures Assist in the definition,  development,  and documentation of software s business requirements,  objectives,  deliverables,  and specifications on a project-by-project basis in collaboration with internal users and departments Assist in defining software development project plans,  including scoping,  scheduling,  and implementation Research,  identify,  analyze,  and fulfill requirements of all internal and external program users Conduct research on emerging application development software products,  languages,  and standards in support of procurement and development efforts Consistently write,  translate,  and code software programs and applications according to specifications Write programming scripts to enhance functionality and/ or performance of company applications as necessary Design,  run and monitor software performance tests on new and existing programs for the purposes of correcting errors,  isolating areas for improvement,  and general debugging Administer critical analysis of test results and deliver solutions to problem areas Proficient in the LAMP stack,  MEAN stack is a plus Should have knowledge of C#,  php,  Nodejs,  MongoDB,  SQL,  AWS Requirements include the following:\n\nExcellent understanding of coding methods and best practices Hands-on experience developing test cases and test plans Able to communicate effectively with non-technical staff and with members of interdisciplinary teams Flexible and adaptable in regards to learning and understanding new technologies Strong written,  oral,  and interpersonal communication skills Ability to conduct research into software-related issues and products Proven analytical and problem-solving abilities Ability to effectively prioritize and execute tasks in a high-pressure environment Ability to work both independently and in a team-oriented,  collaborative environment We are not looking for freelancers. This position is ideal for those who are looking towards a Technical Architect role going forward. Salary is dependent on the experience and skillset.\n\n", "ROLE": "Software Developer", "INDUSTRY TYPE": "Media, Entertainment, Internet", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["Procurement", "Coding", "Analytical", "Debugging", "PHP", "Application development", "Scheduling", "MongoDB", "Test cases", "SQL"]}