{"JOB DESCRIPTION": "   Qualification / Skills required:      Experience -   Minimum 3-6 years     Maintain documentations for all support activities including product development, enhancement, engineering and marketing activities.   Provide product trainings to staffs and customers.   Work with support team to evaluate complex customer problem, identify root causes and derive resolutions.   Guide support team in addressing customer problems within established response time.   Analyze customer suggestions and recommend product revisions.   Support Account Managers in identifying new customers and retaining existing customers for business growth.   Develop knowledge bases and FAQs for product support activities.   Document support activities, customer issues and resolutions for reference purposes.       Web application development and support for a SaaS platform. App and API development using Django and PostgreSQL.            Rest API development using Django Rest Framework. Good understanding of implementing role based access control systems in Django.            Prior experience in developing multi-tenant systems a plus.             Responsibilities                    Mentor and lead junior developers           Take ownership in a fast paced environment           Solid understanding of release management processes including use of version control systems           Writing reusable, testable, and efficient code           Integration of user-facing elements developed by front-end developers with server side logic           Interact with clients for technical queries           Implementation of security and data protection           Design and implementation of low-latency, high-availability, and performant applications           Integration of data storage solutions (may include databases, key-value stores, blob stores, etc.)    Key skills:   Python, Django, Django REST framework, RabbitMQ, Celery, HTML, CSS, Javascript, PostgreSQL, Web Application Development, Web Technologies Team Handling    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Payroll", "jQuery", "Javascript", "HTML", "SEO", "Photoshop", "Release management", "Technical support", "Ajax", "Python"]}