{"JOB DESCRIPTION": "(Roles Responsibilities)Visualization and Conceptualization of websites from the scratch.\n\nExecute all visual design stages from concept to final hand- off to engineering.\n\nSound Knowledge of Adobe Photoshop,  Macromedia Dreamweaver,  Adobe Illustrator /  Coral Draw.\n\nPresent and defend designs and key milestone deliverables to peers and executive level stakeholders.\n\nKnowledge of security aspects of web app,  mobile app,  RESTful APIs \n\nProficiency in HTML,  CSS,  and JavaScript for rapid prototyping.\n\nKeeping abreast of emerging technologies,  particularly UI (User Interface )design using HTML,  HTML 5,  CSS,  CSS 3,  DHTML,  Java Script,  J Query and Responsive Web Design \n\nHands on experience in tools like Photoshop,  Dreamweaver,  Visual Code \n\nParticipating in all phases of website development: Planning,  Information Architecture,  Design,  Development, . Deployment \n\nAble to handle designing to web Pages,  templates,  newsletters website design /  redesign \n\nExperience in creating wireframes,  storyboards,  user flows,  process flows and site maps.\n\nProficiency in Photoshop,  Illustrator,  or other visual design and wire- framing tools.\n\nGood experience understanding of Website app layout designing-  Responsive layout design and Parallax Design.\n\nKnowledge of custom HTML Theme creation and integration in WordPress,  Joomla,  Magento.\n\nWork with multiple teams to create HTML mocks up. \n\nCoordinate with business and solicit usability requirements. \n\nKnowledge of UI and UX design and improvement will be a plus. \n\nOther skills required are design of landing pages,  emailers,  ecommerce websites and web applications.\n\nCreative,  Good Internet Research ability to learn new things.\n\nBasic Skills:Creative flair \n\na strong visual sense \n\nstrong computer skills \n\nsoftware knowledge like HTML,  WordPress,  and flash \n\nthe ability to grasp client needs and consider practical solutions \n\nthe ability to pay attention to detail \n\nthe ability to balance work on several projects at a time \n\ngood team working skills \n\na matter of fact approach when ideas or designs are rejected \n\nA savvy HTML 5 Programmers/ Developer to develop the next class of Web/ mobile based websites! \n\nQualification:Any Graduation \n\nHTML5,  CSS3,  SASS/ LESS,  AngularJS,  jQuery,  JavaScript,  Bootstrap.\n\nGood Knowledge in SASS/ LESS,  AngularJS \n\nComfortable working in Startup Environment.\n\nJob Type:Full Time\n\nExperience:Experienced Candidates -  4 6 yrs\n\nFAQ'SWhat does ArtiimaZ doArtiimaZ Pvt. Ltd. provides IT services in technology and consulting services. We provide a wide range of services related to online/ offline advertising marketing contents for business or companies to portrait in a dynamic and interactive way and digital solutions which integrates multiple strategies to build a product which fulfill the need of our customers.\n\nWhat's the best thing about working at ArtiimaZ What's the interview process likeWhat should I do if I have submitted an application,  but I have not yet heard anything backWhat can I expect on my first day at ArtiimaZ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["IT services", "Macromedia", "Illustrator", "Wordpress", "Consulting", "Internet research", "Joomla", "DHTML", "CSS3", "Visual Design"]}