{"JOB DESCRIPTION": "Hummingbird is a product company that builds and maintains WordPress Plugins, WordPress Themes and SaaS PHP Applications.We are looking for enthusiastic software developers to work on one or more of the following areas:WordPress Plugin Development,WordPress Theme Development,SaaS product Development.Selected candidates will be provided with TRAINING. We build and maintain WordPress Themes, WordPress Plugins, and PHP/Node  Software products.These products are used over 11 million people around  the world. Come join the team that builds and supports WordPress products used by millions of users around the world.Technologies you will work on:PHP  MySQLWordPress Plugins/ThemesJavaScript (React, Node)HTML5/CSS3Linux/Mac OS/WindowsRequirements:Good Hands-on knowledge of any programming languageWillingness to learn and work on PHP /Javascript /HTML /CSS FrameworksGood English communication skillsExcellent analytical skills and programming skills for solving real-world problems.Willing to learn new technologies and frameworks as required.Ability to work in a team and collaborate to build great products.Ability to work remotely, learn skills and collaborate online.If you are looking for a workplace where you will learn a lot, enjoy your  work environment, build great products, and have lots of fun along the way - apply today.Perks and Benefits  we offer medical insurance, life insurance, paid time off, and the flexibility to work from anywhere. You  can be located anywhere in the world, and still work with us, apply  today to explore if you can join our awesome team.                              ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - eCommerce, Internet Technologies", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["CSS", "Html5", "Programming", "HTML", "Theme Development", "CSS3", "Product Development", "Software Development", "Linux", "Wordpress", "MySQL", "Javascript", "PHP", "Mac Os", "Web Development", "Plugins"]}