{"JOB DESCRIPTION": " Zippr is looking for a strong hands-on rockstar developer who can work on web technologies and server side programming. The position demands working with a team of highly accomplished tech geeks who are very passionate about solving real world problems through technology. The ideal candidate should have the drive and passion to thrive in a startup environment.   What?ll keep you busy at Zippr    Understand product requirements and be able to quickly turn-around a functional prototype for internal review and further refinement   Create applications on both the server-side and on the web interface for maximum impact   Be able to provide technical and analytical solutions to evaluate the merits and challenges of a product idea   Be able to work independently on a project-by project basis and also work in a collaborative and fast-paced team environment   Keep abreast with the latest industry trends in large-scale technologies    What we are looking at for this Role    Total of minimum 3+ years in Java/J2EE, JavaScript (AngularJS,  React, NodeJS, etc),  Python, with at least 2 years in web or mobile projects with end-to-end participation   SQL and NoSQL key-value data store (ex: Mongo, Redis, etc)   Should able to write SQL for a relational database or NOSQL based project development   Familiarity with GIT etc.   Be able to write elegant, readable, and well-documented code   Links to your stackoverflow (or related developer forums), blogs and github should be supplied with job application    Preferable    Should have exposure to any or more than one of following environments: MEAN   Exposure to NGINX   Basic Linux and Cloud Administration (AWS, etc)   Familiarity with ElasticSearch, and/or other search engines    Education    BCA/MCA/B.E./B.Tech/M.Tech or equivalent in computer education from reputed college  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "BCA in Computers, B.Tech/B.E. in Production/Industrial", "PG": "M.Tech in Electronics/Telecommunication, MCA in Computers"}, "KEY SKILL": ["Prototype", "GIT", "NoSQL", "Linux", "nginx", "Analytical", "Javascript", "server side programming", "SQL", "Python"]}