{"JOB DESCRIPTION": " We are looking for a Java Software Developer with 4+ years of experience in the industry. The successful candidate will possess good verbal and written communication skills, as well as strong interpersonal skills with a desire to work in a flexible and globally dynamic environment.      Roles and Responsibilities:   Develop, test (TDD), implement and maintain software applications  Conduct software analysis, programming, testing and debugging  Identify bottlenecks and bugs, and devise solutions to application problems  Conduct research on provider?s API and Content. Identify information/meta-data to be mapped to NewsML G2 specification  Write XSL transformations  Ensure designs comply with specifications  Help maintain code quality, code organization  Recommend changes to improve established Java applications  Document software workflows, implementation steps, content specifications, installation and configuration instructions      Required Skills:   A bachelor or master degree in computer science  5+ years of work experience with software development companies  Work experience on: Java, REST Web Services, Spring Boot, JPA, FreeMarker, AngularJS  Work experience on XML/JSON technologies like: XSL, JAXB, XML, XSD, DTD, JSON  Optional but it would add advantage if experienced on: Maven, Git, Jenkins, JIRA, BitBucket, AWS, Linux  Confident communicator; able to argue a point concisely and deal positively with conflicting views  Good root-cause analysis and problem-solving skills  Good written and verbal communication skills ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Maven", "JAXB", "Linux", "TDD", "XML", "Debugging", "JSON", "JPA", "JIRA"]}