{"JOB DESCRIPTION": " We are seeking Software Developers - .NET Full stack who are passionate about creating an excellent backend micro services, rich UI/UX and enjoy taking on new challenges. The Software developer will be responsible for the end-to-end development, testing, deployment, and support of web apps, micro services and back end databases for our online test delivery platform and various Test Prep applications.   Your Role     Develop and test end-to-end web applications and micro services   Build responsive user interface (UI) screens that scale across all devices (Phone, Tablet and Computer)   Develop new back-end infrastructure and related features directly impacting the future of our product   Work with a small team of experienced and talented developers in developing modern web-applications with focus on scalability, performance and usability.   Take ownership of assigned tasks, features and any other development activities in the product lifecycle from early conception to post-deployment in fast-paced environment   Employ best practices for code sharing and development to ensure common code base abstraction across all applications.     Environment:   C#, .NET, jQuery/JavaScript, CSS, HTML, REST services, Redis, Elastic Search, MySQL and MS SQL Server    2 years of Software Development Experience in Web applications using Microsoft Stack (.Net, C#, SQL Server, etc).    Degree in Computer Science (preferred but not a must)   Working knowledge/experience with C# programming using .NET framework   Experience with integration of Gateway APIs and third-party libraries   Experience with creating and publish REST services   Working in cloud-based environment with focus on performance   Passion for building software that impacts millions of users   Good skills of seeing a big picture and system architecture planning   Strong knowledge of Relational Databases (MySQL, MS SQL server, Postgres) and NoSQL Databases (MongoDB, Cassandra, Redis)   Soft Skills    Working proficiency and communication skills in verbal and written English   Excellent attention to detail and organization skills and ability to articulate ideas clearly and concisely   Ability to work effectively within a changing environment that is going through high growth   Exceptional follow-through, personal drive, and ability to understand direction and feedback  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Education, Teaching, Training", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "System architecture", "MS SQL", "Backend", "jQuery", "MySQL", "Javascript", "HTML", "MongoDB", "microsoft"]}