{"JOB DESCRIPTION": "A full stack JavaScript developer having hands on experience on AngularJS and NodeJS Skill set\n\nAs an AngularJS developer,  you will be required to implement a complete user interface in the form of a mobile and desktop web app,  with a focus on performance. \n\nAs a NodeJS developer,  you will need to focus on the development of all server-side logic,  definition and maintenance of the central database,  and ensuring high performance and responsiveness to requests from the front-end. \n\nResponsibilities Participate in the full development life cycle,  including implementing design,  coding,  testing and production release.  Your main duties will include creating modules and components in AngularJS and coupling them together into a functional app.  Understanding the nature of asynchronous programming and its quirks and workarounds.  Integration of multiple data sources and databases into one system.  Creating database schemas that represent and support business processes.  Drive innovation through rapid prototyping and iterative development.  \n\nSkills Passionate about developing amazing user experiences.  Strong proficiency with JavaScript  (Object Oriented) .  Deep knowledge of AngularJS practices and commonly used modules based on extensive work experience along with Node. js applications on top of RESTful APIs.  Experience with web frontend technologies such as HTML5,  CSS3,  Bootstrap.  Proficient understanding of code versioning tools,  such as Git is a plus.  Knowledge Experience in building ionic/ hybrid apps is a huge positive.  \n\nExperience : 1-2 years of experience working in MEAN stack especially Angular,  NodeJS. ", "ROLE": "Software Developer", "INDUSTRY TYPE": "BPO, Call Centre, ITeS", "FUNCTIONAL AREA": "IT Software - System Programming", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Front end", "GIT", "Web technologies", "Coding", "html5", "Javascript", "Database", "bootstrap", "angularjs", "CSS3"]}