{"JOB DESCRIPTION": "  Position description:     Participate in feasibility analysis of requirements for implementation.    Contribute to technical discussions regarding requirements, implementation adopting best practices/ methodologies, platforms for development and support methodology.    Estimation and timely implementation of the requirement(s) by developing a modular, scalable, high-performance code by adopting best practices.   Own up the defect-free code delivery of module/application and provide support during integration/implementation.    Bug fixing, code optimization.   Collaborate with the testing team to understand and resolve the bugs.       Primary Responsibilities:     Application Development with C and QT       Required Skills:     Extensive hands-on experience in Desktop application development using QT technology   Experience with GUI implementation and debugging desktop applications using Qt   Experience in real-time communications software development and related build environments, with focus on mission-critical, low latency multithreaded applications   Experience designing, developing and debugging networked client/server applications   Experienced with source/version control software, including Git   Strong proficiency in C , with a fair knowledge of the language specification   Thorough knowledge of the standard library, STL containers, Data Structures, and algorithms   Good understanding of memory management in a non-garbage collected environment   Knowledge of the latest C 11,C 14,C 17 standard    Familiarity with system call wrapper library functions   Thorough knowledge of Nginx, Redis, Kafka, RabbitMQ, MySql   Familiarity with language tools, such as Valgrind    Sound knowledge of Postgre and MySQL  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Version control", "GIT", "nginx", "Memory management", "MySQL", "Debugging", "Data structures", "Application development"]}