{"JOB DESCRIPTION": "  Job Description       Looking for software designers with the experience in the following areas : Frontend programming/markup languages : Typescript/Javascript , html, css, svg   Frontend development frameworks / libraries: Angular 2 , Node.js/npm, D3.js, gulpFrontend testing frameworks / libraries: Protractor, JasmineBackend programming/markup languages: Java/J2EEBackend development frameworks/libraries: maven, Spring Data/Security/MVC   Backend testing frameworks/libraries: junitDB: Neo4j (graph DB), Oracle DB, PostgreSQL TimescaleDB   Others Skills: ElasticSearch , Drools, Kafka integration, ReST (on Spring MVC), SSO (LDAP, Reverse Proxy, OAuth2)Programming theory: algorithms and data structures, relational and graph database concepts, etcDomain: Telecom, OSS, Inventory    Responsibilities :    Responsible for the design, development, unit testing, documentation and analysis of modules or features of new or upgraded software systems and products.   Develops and/or executes implementation according to project plans and priorities.   Able to work independently and has good technical communication skills to collaborate in a team.    General Activities    Major activities involve: Creating / Extending GUI components like grids and reports using the core product modules   Creating network, service topology and device GUI diagrams for telecommunication / networking technologies   Creating device and service models for telecommunication / networking technologies like DWDM/OTN, SONET, MPLS, GPON, FTTH, etc.   Understanding the existing code, coding and documentation standards and extending the core product components without breaking backwards compatibility and with adhering to coding/documentation standards.   Writing queries, procedures on databases primarily Neo4j, PostgreSQL, Oracle.   Writing Java/J2EE codeCollaboration with stakeholders   Work in a global team environment Attend status calls with stakeholders as needed   Work closely with the product team   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Software Developer"]}