{"JOB DESCRIPTION": "  You have approx. 3/4 yrs of experience in Full-stack Web application (PHP, NodeJS, VueJS)      You are currently writing code in PHP but have knowledge of NodeJS and are inclined to code in NodeJS     You can join immediately    You think about the customer and his needs first    You are a person who thinks out of the box    You are not just coder, but a visualiser     You have a knack of user ergonomics and understand the pain areas of user interfaces      You are always ready to take head-on the challenges and overcome them     You can find your way in tough situations    You are always willing to discuss newer ways of solutions    You are always seeking improvements and optimisations as you progress    You are always open to learning newer stuff     You are a self-learner and are a true believer of getting things done     You can express yourself freely and without any hesitation     You have one of the following degrees: BCA, MCA, BE/BTech, ME/MTech, BSc, MSc      What you will be involved in?     You will be working on challenging software projects for international clients     You will be using technologies like PHP-Laravel, NodeJS and its intelligent frameworks.     You will use MySQL, NoSQL, MongoDB, RESTful services     You will be deeply involved in the design and deployment of the application     You will deliver the production ready solution    You will be using Agile software development methodology     You may get a chance to work on ML / AI / Blockchain / IoT related projects   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Sc in Chemistry, B.Tech/B.E. in Production/Industrial, BCA in Computers", "PG": "M.Tech in Electronics/Telecommunication, MCA in Computers, MS/M.Sc(Science) in Chemistry"}, "KEY SKILL": ["NoSQL", "Ergonomics", "Web application", "MySQL", "Agile", "PHP", "Deployment", "MongoDB", "international clients"]}