{"JOB DESCRIPTION": "B. Tech/ B. E.  -  IT, BCA -  Computers,  PG -  M. Tech , MCA Computers.  Job Responsibilities : \n Develop features across multiple subsystems within our applications,  including collaboration in requirements definition,  prototyping,  design,  coding,  testing anddeployment.  \n Understand how our applications operate,  are structured,  and how customers use them.  \n Provide engineering support (when necessary) to our technical operations staff when they are building,  deploying,  configuring and supporting systems for customers \n Participate with the engineering and operations teams to define plans for standardizing,  scaling and enhancing our products and the services utilized to deploy/ install/ release those products.  \n Participate in interactions with customers as a technical expert for product subsystems \n Investigate,  analyze and make recommendations to management regarding technology improvements,  upgrades and modifications \n Other duties from time to time as determined by management Desired Candidate Profile \n 2 -  4 years of experience independently designing and implementing small or medium-  sized software systems and components.  \n Ability to communicate the design and implementation of software systems including relevant strengths/ weaknesses and reasons for implementation decisions.  \n In- depth knowledge of at least two programming languages,  at least one of which is . net or php.  \n Excellent algorithmic and problem solving skills.  \n Excellent written and verbal communication skills \n Team player and great collaborator,  also self- motivated and able to work independently", "ROLE": "Software Developer", "INDUSTRY TYPE": "BPO, Call Centre, ITeS", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["Technical operations", "Senior", "Coding", "Programming", "PHP", "Software", "Time", "Prototyping", "Management", "Verbal communication"]}