{"JOB DESCRIPTION": " We are looking for a Software Developer with min 2 years of experience and who is motivated to combine the art of design with the art of programming. Responsibilities will include implementing visual elements and their behaviours with user interactions. You will work with both front-end and back-end web developers to build all client-side logic. You will also be bridging the gap between the visual elements and the server-side infrastructure, taking an active role on both sides, and defining how the application looks and functions.   Responsibilities    Develop new user-facing features   Build reusable code and libraries for future use   Ensure the technical feasibility of UI/UX designs   Optimize applications for maximum speed and scalability   Assure that all user input is validated before submitting to back-end services   Collaborate with other team members and stakeholders    Skills    Strong understanding of JavaScript, its quirks, NodeJS, Python and workarounds   Basic understanding of web markup, including HTML5 and CSS3   Good understanding of {{Depending on the specific case, a developer should have the knowledge of advanced JavaScript libraries and frameworks such as AngularJS, KnockoutJS, BackboneJS, ReactJS, DurandalJS etc.}}   Good understanding of asynchronous request handling, partial page updates, and AJAX   Proficient understanding of cross-browser compatibility issues and ways to work around such issues   Familiarity with JavaScript module loaders, such as Require.js and AMD   Familiarity with front-end build tools, such as Grunt and Gulp.js   Proficient understanding of code versioning tools, such as {{Git / Mercurial / SVN}}   Good understanding of browser rendering behaviour and performance    Other Behavioral / Attitude aspects:    Dynamic, self-motivated and self-driven   Having a sense of ownership.   Be willing to travel periodically, both Domestic and International   Qualifications / Proficiency B.Tech, B E , BCA or MCA   Location New Delhi   Pop out widget   End this chat session  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Diploma in Mechanical", "PG": "MBA/PGDM in Marketing"}, "KEY SKILL": ["Front end", "Javascript", "CTI", "Oracle", "cisco", "Python", "Ajax", "CRM", "Salesforce", "CSS3"]}