{"JOB DESCRIPTION": " Position Description    Software Test Engineer   India - Bangalore   City   Bangalore   Job ID #   37659          Software Test Engineer    Altair seeks Software Test Engineers to validate UIs, APIs and embedded systems designed in the latest cutting - edge technologies. Working within the SmartWorks division means working on a platform as a service designed by IoT engineers for IoT engine. Our platform leverages the latest and greatest in web components, containerization, CI/CD, and test driven development practices. Our QA team works closely with developers, and development operations to keep new code moving through the software development lifecycle efficiently, and with a keen eye for quality. The SmartWorks QA team is unique in that team members may be writing code in any of five languages, or doing bash scripting. With a mixture of web, embedded and mobile development our team is constantly touching the latest and greatest in new technologies in the IoT industry.   Ideal candidates will have five years of experience and be a demonstrated self - starter. Experience working with distributed teams greatly preferred.     Required Skills:      5 years of experience writing Python and Javascript: Nodejs, ES5, ES6 a plus.     2 - 5 years of experience writing unit tests in PyUnit, Mocha/Chai etc.     2 years of experience working with restful APIs.      Experience Desired but not required:      Experience working with Postman for API testing and API mocking.     Experience with Mobile Application development and testing (iOS and Android)     Experience in C++ or Golang     Bash or shell scripting    EEO/AA Employer/Veterans/Disabled ", "ROLE": "Testing Engineer", "INDUSTRY TYPE": "Construction, Engineering, Cement, Metals", "FUNCTIONAL AREA": "IT Software - QA & Testing", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Mobile application development", "Shell scripting", "API Testing", "Javascript", "Software development life cycle", "test driven development", "high performance computing", "Android", "Python", "Testing"]}