{"JOB DESCRIPTION": "Roles and ResponsibilitiesIntroductionAs a Hardware Developer at IBM, you’ll get to work on the systems that are driving the quantum revolution and the AI era. Join an elite team of engineering professionals who enable IBM customers to make better decisions quicker on the most trusted hardware platform in today’s market.Your Role and ResponsibilitiesSoftware Test Specialist (Functional Verification Test). IBM Spectrum Scale is the Software-Defined Storage solution for the new era of data. This is an opportunity for a talented Software Test Specialist to join the growing IBM Spectrum Scale Raid and Elastic Storage Server Development and test teams in changing the world. The ideal candidate is a technophile who thrives in a fast-paced environment, is passionate about learning new tools and technologies, and is comfortable interacting with internal and external clients.Required Technical and Professional ExpertiseThis role requires 6-12 years of relevant storage industry experience, preferably with prior experience in designing, developing and testing Storage Software. S/He should have BE in Computer Science and Electronics and preferably MS in Computer Science with proven track record of technical leadership for software development.Strong background with Systems and software products preferably in Storage.Excellent understanding and hands-on experience with File system.Hands on skills and solid experience on development using programming languages like C and/or scripting languages.Prior experience of working on high performance scalable storage software development preferable.Understanding and experience of working in Agile methodology across global teams. Unix Kernel / user space troubleshooting/debugging skillsPreferred Technical and Professional ExpertiseHPC workloads, debugging/performance optimizationBackup, TSM/HSM, archival systems conceptsEncryption, socket communicationDMAPI concepts/standardsModern DevOps pipeline experience (e.g., GitHub, Jenkins)Container technology knowledge (e.g. Kubernetes, OpenShift).", "ROLE": "Team Lead/Technical Lead", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - QA & Testing", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Electronics/Telecommunication, Computers", "PG": "MS/M.Sc(Science) in Computers", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Test Engineering", "Jenkins", "Agile Methodology", "Software Development", "Cloud Computing", "File System", "Scripting Languages", "Functional Verification", "Technology Consulting", "Ibm Servers"]}