{"JOB DESCRIPTION": " Mission     You are part of our R&D department which develops Nagra s gateway security solutions for our customers. More particularly, within a Server team, you are a Java developer in charge of several components based on Java/JEE technologies that implement web services and web applications devoted to managing gateway security solutions.      Responsibilities    Contribute to define software architecture by proposing efficient solutions      Challenge technical decisions, web services designs and provide inputs for improvement      Provide qualified code (tested and documented)      Fix issues that arise from testing/customers      Create or update all the relevant and required technical documents (design, Test etc.)      Follow quality development rules and recommendations (unitary test, change management, build management, Software factory )      Perform code reviews and suggest improvements      Work in Agile mode and Test-Driven development process     Collaborate and work closely with our team in Nagra Headquarters at Cheseaux, Switzerland         Requirements / Profile     Bachelor s degree / Master s degree in technology or Computer science      Strong programming experience in Core Java      Good hands-on knowledge on any of the cloud platforms,   preferably AWS       Strong knowledge in the following technologies: Software Design, RESTful web Services.      Knowledge in the following technologies: SOA, AWS, Docker, SAAS / PAAS, PostgreSQL, Spring Boot, Unix basics, shell scripting     Optional/Good to have skills    Hands-on Python programming      Interest in Machine Learning and Data Science, clustering, anomaly detection and time series     What we value    Curious and proactive mindset with a high sense of ownership and commitment and willing to learn new skills when required      A hard worker, independent and gets the job done with enthusiasm in a very demanding business environment      Good communication and collaboration skills      A team player with positive energy      Ready to go extra-mile to achieve great results  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["Unix", "Computer science", "Core Java", "Change management", "Software design", "SOA", "Postgresql", "Shell scripting", "Agile", "Python"]}