{"JOB DESCRIPTION": " Opening for Freshers have strong Academic throughout !!  Must  *  We are looking for B.Tech/ MCA freshers from good colleges candidate who have done some internship and live projects in Python.   Perks and Benefits First 3 months-Internship with Stipend.After that package will be 3-5 LPA (Depends on Interview) The Job Description is as follows for your ready reference. Summary:  The primary focus will be the development of all server-side logic, ensuring high performance and responsiveness to requests from the front-end. You will also be responsible for integrating the front-end elements built by your co-workers into the application; therefore, a basic understanding of front-end technologies is necessary as well. Ultimately, you will build highly responsive web applications that align with our business needs.Accountabilities: Expertise in Python: Design, code and build product Will be responsible to writing codes individually Ensure the best possible performance, quality, and securityIdentify bottlenecks and develop code for the organizationUnderstanding of established software development life cycles Ability to prioritize and multi-task in order to meet deadlines Develop new modules into the Odoo ERP.Integrate different 3rd party systems as modules into the Odoo ERP.End to End implementation of the Odoo ERP system as per the business needs.Customize, enhance and maintain existing modules of the Odoo ERP.- Ability to create new modules.Ability to customize existing core modules and add / remove additional features in it.Must have ability to write / create / implement complex business logic in backend.Added advantage for candidate who has knowledge of Odoo UI JS framework. Skillset: 0-1 years of experience in Design or/and Development with JavaScript & Python. (Must have capability to write bug free codes in python)Should have experience in JavaScriptWho are working as full stack Developer are preferred.The person must have experience in developing web based applications in python (Product Development).Strong Unit Testing practiceUnderstanding of design patterns, Micro-services Architecture Understanding of relational database like PostgreSQL and MySQLVery Good Communication skillsRequired Candidate profileMust have at least 6 months internship in Python and any live project during college.Must have basic understanding of Python languageGood communicationMust have strong will power to learnMust have good academic score (above 80%)Good Colleges and Universities are preferred. ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "BCA in Computers, B.Tech/B.E. in Any Specialization", "PG": "M.Tech in Any Specialization, MCA in Computers", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["python", "information technology", "mca fresher", "MCA", "bca fresher", "b tech fresher", "it", "Odoo", "Software Development", "computer science", "Django", "Software Engineer", "Fresher", "B.tech"]}