{"JOB DESCRIPTION": "Position Description:Job SummaryAs the Software Engineer, you will develop custom application software for the company's range of programmable power products. Essential Functions/Responsibilities: Business Strategy • Key member of technical team for development application software for new and existing products using Microsoft development platforms. Performance, Metrics & Reporting • Review technical requirements and develop project plan support development for windows application software development • Manage and maintain Project schedule • Provide weekly updates on project progress. People Management & Employee Development • Interface with the other team members  (digital and hardware team) for applications development • Adhere to personnel policy requirements •   Maintain confidentiality in all aspects of staff and departmental and company information Operation & Execution • Analyze functional requirements for the windows application software required for the power supplies • Develop design methodology for the application program • Implementation and code development using relevant Microsoft technologies platforms, • Testing with the power supply hardware. • Releasing and maintaining the source code using appropriate tools • Sustenance support for existing products. • Other duties as assigned by the reporting manager.Position Requirements:  • 5+ years Experience with Microsoft technologies (C#, MFC, .Net 4.x, WPF, Visual Studio) • Experience developing applications for Windows platforms • Experience developing services for Windows • Routinely uses software best practices: coding standards, code commenting, unit testing, and version control • Strong documentation skills • Experience with debugging and diagnostic techniques and tools • Experience with programmable power device is a plus. • Experience with other programming languages (like Python, Java Script) is a plus. • Fluent in written and spoken English • Experience with remote site development (e.g. India-USA) Job Requirements • Develop application specific windows software using Microsoft .NET technologies, WPF platforms • Develop design for the user interface software. • Understanding and maintaining of the existing software. • Implementation and verification of the functional requirements of the software • Releasing the software and maintaining the source code as required.", "ROLE": "Software Developer", "INDUSTRY TYPE": "Oil and Gas, Energy, Power, Infrastructure", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["C#", "WPF", "Windows Application", "Microsoft Technologies", "Java", "Software Development", "Javascript", ".Net", "Visual Studio", "MFC"]}