{"JOB DESCRIPTION": "We  are looking for a passionate Lead Software Engineer with extensive development experience  in Microsoft Windows 10, 8 and 7.JOB CODE: WAP023LOCATION: BANGALORE  EDUCATIONAL QUALIFICATION The candidate must have a  Bachelor's  degree in Computer Science or equivalent field of study.  EXPERIENCE   8+ years of hands on experience in  designing and developing scalable applications on various Windows Application  Platforms.   The candidate  should have successfully delivered multiple projects with one or more of the  below Windows Application Platforms              - Universal Windows Platform (UWP)              - Windows Presentation Foundation (WPF)              - Windows Forms (.NET)              - Win32 ROLES AND RESPONSIBILITIES   Develop Windows  components and libraries to be used in .NET based applications.  Lead the development of  proof-of-concepts that will focus on brand new technologies.  Analyse, debug and fix  complex issues, continuously drive innovations by  working with cross functional teams.  To provide technical  direction, oversight, and execution guidance for several new Windows  applications across various windows platforms.  To champion the  development best practices for building secure applications from the ground-up.  Conduct security reviews  from high-level application architecture to OS-level parameters and complex  interactions with BIOS and drivers to meet security & business goals. ESSENTIAL SKILLS   C++, C#, XML, REST, JavaScript,  React Native.  Architectural knowledge of Microsoft  Windows Application Platforms such as UWP, WPF, XAML, .NET, Win32  Good understanding of Windows  internals.  Application  packaging.  Familiarity with  Networking and Security on Windows Desktops.  Familiarity of  various avenues for delivery of Microsoft Applications and modern  User-Interface frameworks such as React Native.  Must have very  strong debugging and troubleshooting skills. COMPETENCY   Team player, can-do  attitude and takes initiative.  Ability to work  independently as well as in a team.  Good communication  skills to work with cross-functional groups.  Strong skills in  large-scale software design and development.  Excellent verbal  and written communication skills.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Electronics/Telecommunication, Any Specialization, Computers, BCA in Computers, B.Sc in Computers", "PG": "M.Tech in Computers, Electronics/Telecommunication, Post Graduation Not Required", "DOCTORATE": "Doctorate Not Required, Any Doctorate in Any Specialization"}, "KEY SKILL": ["C#", "XAML", "Win32", "universal windows platform", "C++", "react native", "WPF", "UWP", "Rest", "Windows Forms", "Javascript", ".Net", "Windows Application", "Windows Presentation Foundation"]}