{"JOB DESCRIPTION": " Responsibilities:   • Build the next generation multi-tenant, elastic computing cloud platform with infinite scalability, reliability, manageability.  • Produce high-quality software that is unit tested, code reviewed, and checked in regularly for continuous integration.  • Collaborate with team members and QA to build features that delight customers  • Own features from a technical standpoint  • Accountable for delivery of projects within schedule   Job Summary:  Enthusiastic & talented individuals with a proven track record, impeccable knowledge & experience in the field of .NET programming, Having good knowledge of C#, MVC,SQL server is preferred.  Key Skills Set:   • 3-8 years of experience in Microsoft Technology stack (C#/.NET, SQL Server, Web API). • 1+ years of experience in developing and deploying cloud-based (Azure / AWS) applications. • 1+ years of experience in Angular 2.0 and above. • Deep expertise in object-oriented design and implementation. • Understanding or scalable architecture (Azure Service Bus, Service Fabric, Kubernetes, Docker, Data Lake) • Must have experience in CI/CD, Git, Branching/Merging. • Familiarity with Scrum methodology and test-driven software development. • Demonstrated ability to deliver highly complex projects • Strong communication skills  About Milestone :  For over 20 years, Milestone has been a leading provider of digital marketing software and services for location-based businesses. Over 2,000 companies in the Hospitality, Retail, Financial Services, and Automotive industries rely on Milestone to power their digital marketing strategies. Milestone has garnered over 500 awards, has been shortlisted 3 consecutive years for the US Search Awards and won Search Engine Land's prestigious \"Best overall SEO-SEM campaign\" in 2018. Milestone has gained a reputation for blending outstanding digital marketing expertise with advanced technological capabilities and is one of Silicon Valley Business Journal's fastest-growing companies and an Inc. 5,000 company.    Top Reasons to Work for Milestone:   • Work in an innovative digital marketing software + services organization  • Great place to learn with phenomenal growth opportunity  • Stable and rapidly growing company  • Opportunity to work with a fun, amazing and talented team  • Great benefits  Mediclaim and paid holidays (per year)  • Exciting and innovative work environment  • Employee referral incentive program  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["Software Development", "MVC", "Angular", "C#", "Web Api", "Azure", "Web Technologies", "C#.Net", ".Net", "SQL Server"]}