{"JOB DESCRIPTION": "  Job description           Qualification      B.E/B. Tech/M.E/M. Tech in Computer Science or Electronics and Communication/MCA      Skill Sets      Strong expertise C# ASP .Net, MVC, Web Services, REST    Experience in MS Azure Cloud Services, Azure Virtual Networks, Azure Storage, Azure Active Directory    Experience on C# .Net application using Web Forms and MS SQL is added needed.    Experienced in MS Azure Table Storage/ NoSQL (MongoDB), DocumentDB    In-depth design and development experience with minimum of 1 project life cycle on Cloud / SaaS    Experience with working in Agile / SCRUM teams and Scrum Masters are preferred      Responsibilities      Building a platform for Industrial Devices connectivity   Develop storyboards translated from customer s requirements    Ability to understand and implement the cyber security requirements for cloud    Translate application storyboards and use cases into functional applications    Prototype, Design, build, and maintain efficient, reusable server side code    Ensure the best possible performance, quality, and responsiveness of applications    Identify bottlenecks and bugs, and devise solutions to these problems    Ability to understand Honeywell s cloud based offering and its current service model and identify opportunities of reuse      YOU MUST HAVE      Bachelors degree in Engineering or Computer Science      WE VALUE      Understanding various software development lifecycle    Some relevant experience    Knowledge of software configuration management and change management practices    Diverse and global teaming and collaboration    Effective communicator    Wide degree of creativity and latitude    Individuals who are self-motivated and able to work with little supervision, who consistently take the initiative to get things done, do things before being asked by others or forced to by events.    Ability to consistently make timely decisions even in the face of complexity, balancing systematic analysis with decisiveness.    Can quickly analyze, incorporate and apply new information and concepts.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization, B.Tech/B.E. in Production/Industrial", "PG": "M.Tech in Electronics/Telecommunication, MCA in Computers"}, "KEY SKILL": ["Computer science", "Change management", "MS SQL", "Prototype", "NoSQL", "cyber security", "Aerospace", "Software configuration management", "Software development life cycle", "Automotive"]}