{"JOB DESCRIPTION": "  JOB DESCRIPTION      Qualification      B.E/B. Tech/M.E/M. Tech in Computer Science or Electronics and Communication/MCA      Skill Sets      Hands-on experience on ASP.Net, MVC 3, HTML5 Web App, CSS3, Java Script, REST Web Services    Strong experience working with various libraries and frameworks (AngularJS, REACT, KendoUI, backbone, bootstrap)    Strong experience in development of cross-platform website and web application    Hands-on experience in designing and developing scalable web applications and enterprise architecture    Understanding of UX and UI design with an emphasis on maximizing usability    Experienced in Agile / SCRUM based development and SCRUM Master is added advantage    Has energy and enthusiasm to constantly motivate the team with experience in working in cross locations structure    Work with the other teams in taking up the initiatives that are appropriate to the team    Strong experience in information architecture and data visualization    Should perform critical design and code reviews and provide technical leadership to drive product quality and Illities      Responsibilities      Building a platform for Industrial Devices connectivity    Develop storyboards translated from customer s requirements    Ability to understand and implement the cyber security requirements for cloud    Translate application storyboards and use cases into functional applications    Drive design, development and architectural decisions   Prototype, Design, build, and maintain efficient, reusable client side code    Ensure the best possible performance, quality, and responsiveness of applications    Identify bottlenecks and bugs, and devise solutions to these problems    Ability to understand Honeywell s cloud based offering and its current service model and identify opportunities of reuse      YOU MUST HAVE      Bachelors degree in Engineering or Computer Science      WE VALUE      Understanding various software development lifecycle    Some relevant experience    Knowledge of software configuration management and change management practices    Diverse and global teaming and collaboration    Effective communicator    Wide degree of creativity and latitude    Individuals who are self-motivated and able to work with little supervision, who consistently take the initiative to get things done, do things before being asked by others or forced to by events.    Ability to consistently make timely decisions even in the face of complexity, balancing systematic analysis with decisiveness.    Can quickly analyze, incorporate and apply new information and concepts.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Production/Industrial, Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization, M.Tech in Electronics/Telecommunication, MCA in Computers"}, "KEY SKILL": ["Computer science", "Product quality", "Change management", "Prototype", "Architecture", "Aerospace", "Software configuration management", "Software development life cycle", "Automotive", "CSS3"]}