{"JOB DESCRIPTION": "  Job description           Mandatory Tech skills         .NET Fundamentals ( Classes, Data structure, algorithm Collections framework, Exception handling, Logging, Multithreading.)   Experience in C#.NET backend/driver/application development, Strong Design and Architecture fundamentals a must-have.   Prior experience working on IoT/IIoT based products/solutions is preferred. JD The developer Engineer shall be responsible for technical architecture, design, implementation and delivery of product feature/functions for IoT/IIoT based software products/solutions.   The person should have strong experience on Java technologies (listed below) and aspire for new technology learning.   Exposure to Cloud/SaaS based product/solution building Is good to have.     Skills     .NET Fundamentals (Classes, Data structure, algorithm, Collections framework, Exception handling, Logging, Multithreading.)   Experience in C#.NET driver/application development, Strong Design and Architecture fundamentals a must-have.   Prior experience working on IoT/IIoT based software products/solutions is preferred.   Design and Architecture, problem solving.   Exposure to Code quality practices/tools agile processes will be advantage.   Should be hands-on and able to own couple of modules on the project   Should be pro-active in learning new technologies, processes and work with minimum supervision    Good understanding of Design Patterns     YOU MUST HAVE      Bachelors degree in Engineering or Computer Science     WE VALUE      Understanding various software development lifecycle   Some relevant experience   Knowledge of software configuration management and change management practices   Diverse and global teaming and collaboration   Effective communicator    Wide degree of creativity and latitude   Individuals who are self-motivated and able to work with little supervision, who consistently take the initiative to get things done, do things before being asked by others or forced to by events.    Ability to consistently make timely decisions even in the face of complexity, balancing systematic analysis with decisiveness.    Can quickly analyze, incorporate and apply new information and concepts.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Production/Industrial, Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Change management", "Backend", "Multithreading", "Software configuration management", "Agile", "Software development life cycle", "Application development", "Technical architecture", "Supervision"]}