{"JOB DESCRIPTION": "Roles and Responsibilities Are you? Senior Principal Software Development Engineer:As a Senior Principal Software Development Engineer, you will be responsible for the Architecture, design and development of our fastest growing AI product on the cloud.You will need to demonstrate technical leadership with new feature development of highly complex software requirements as well as enhance existing applications. You will need to analyze the customer problem and define a design that is optimum for our users. You will need to be hands-on with variety of programming languages implementing new features, troubleshooting, leading discussions as well as assisting other team members. You will collaborate with subject matter experts and stakeholders across programs, work with system architects and the chief technologist, and security team to ensure effective design and implementation for our product and our customers adhering to the security standards within the committed timelines. You will provide technical perspective to the product owners and/or R&D management on features and solutions, address concerns, and provide detailed updates in timely manner. You will provide technical direction to the team, estimate and establish delivery timelines, as well as assists junior staff in providing their timeline recommendations. You will also identify challenges and technical interdependencies and suggest solutions to address them. We want talented individuals who enjoy learning and contributing in a fast-paced software development environment.Education and Experience - • Bachelor’s Degree in Computer Science or Software Engineering or a related field.• Minimum 12 -15 years of relevant experience in a professional software development role.• Full SDLC experience, including release to operations and production of cloud products.Expected Skills-• Expert in technical designs for cloud applications, complying patterns and principles, security aspects, and implementing, troubleshooting major portions of a production stack• Experienced in leading teams technically.• Proficiency with multiple software development languages including C#, Java Script and .Net.• Expertise in back end development on Microsoft Azure with core infrastructure concepts including Microservices, Worker roles, Web Apps, REST Web API, VMs, Service Fabric, NoSQL databases, ARM based deployment and containers.• Experience and applicable knowledge on front end development with HTML 5, CSS3 and Angular 2 and Angular 2+• Expert in low level development and debugging of memory and performance issues. An expert to identify and analyze a situation or problem using pattern recognition or logical reasoning that results in appropriate and practical solutions.• Have deep and broad knowledge of current and emerging technologies.• Experience in Test Driven Development, Continuous Integration and Continuous Delivery.• Experienced with ALM, Infrastructure Management tools and Dev Ops.• Familiarity with test automation techniques.• Work experience in Industry digitalization products would be an added advantage• Experience in working in an Agile or SCRUM team environment, and with remote team.• An inclination towards communication, inclusion, visibility, and transparency.• Ability to find requirements and break them down into an actionable execution plan for the team and proactively identify problems.• Innovation and Creativity – to show a willingness to understand innovative ideas and to apply new insights to existing situations.• Collaborative communication skills (written and oral) - Ability to convert technical concepts into non-technical.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "BCA in Computers, B.Sc in Computers, B.Tech/B.E. in Computers", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Java", "Web Api", "Software Development", "Front End", "Javascript", ".Net", "troubleshooting", "HTML", "Angular", "Microservices"]}