{"JOB DESCRIPTION": " Skill   - Java Full Stack Developer   Experience - 5 to 10 Years   Job Location - Bangalore   Notice Period - 0 to 30 days max   Designation - SSE or Lead Analyst      Your future duties and responsibilities:   Fullstack developer focuses on Developing and maintaining Product with cutting edge technology which matches trending industry standards, responsible for building stable product with micro-services freamwork and follow Agile and DevOps ways-of-working.   Implement new features as per the product improvement/revamp cycle     Required qualifications to be successful in this role:   Member will be involved in Developing and maintaining Product which matches industry standards.   Member will be Responsible for implementing the new features as per the requirement.   Member is expected to Build and consume RESTful APIsand exposed to Java Springboot   Knowledge of RESTful Web Services, XML, JSON. Documenting of Webservices using Swagger.   Must have worked on micro-services applications, containerization of applications.   Experienced Software Engineer with 3 to 5 years experience in Enterprise Software Development   Have an understanding of agile software development life cycle processes with DevOps experience   Good to have strong understanding & working experience on either of the Public Cloud like AWS or Azure   Basic understanding of front-end technologies such as HTML5, Angular JS and CSS3   Creating database schemas that represent and support business processes (NoSql Mongo)   Implementing automated testing platforms and unit tests ( JUNIT or similar)   Proficient understanding of code versioning tools, such as Git   Understanding fundamental design principles behind a scalable application     Skills:    AngularJS   Java   Multi-tasking   Strategic Thinking   Analytical Thinking   Communication (Oral/Written)   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Web services", "Front end", "GIT", "NoSQL", "XML", "Analytical", "Agile", "Software development life cycle", "JSON", "CSS3"]}