{"JOB DESCRIPTION": "Roles and Responsibilities POSITION PURPOSE: Senior Software Engineers are full members of an agile software development team. They interact with product management, customers, and engineers on their (and related) teams while applying their own experiences to build relevant technical solutions to business problems. They seek out and own mid- to long-term deliverables while refining their domain and technical knowledge. They also mentor and coach more junior engineers while building relationships with senior engineers across the company. YOUR TASKS AND RESPONSIBILITIES:  Work as part of an agile development team to build and support applications. Work with team and product manager to manage project priorities, deadlines, and deliverables. Interact directly with business customers to gather and understand requirements and how they translate in application features. Develop applications and services using the right tool for the job. Consistently contribute to solving common problems including shared libraries and frameworks. Conduct functional and non-functional testing. Troubleshoot and debug applications. Deploy applications across all environments in collaboration with development team, product management, and delivery. Champion code quality including unit and integration testing. Evaluate existing applications to refactor, update and add new features. Develop any technical documentation needed to accurately represent application design and code. Identify and pursue opportunities to improve own knowledge and skills and those of more junior engineers.  Help to shape the vision for their own team's products and those of related teams, taking into account impacts, dependencies, and opportunities to collaborate with other teams and groups Identify opportunities to develop new and better solutions. Anticipate and address technical obstacles affecting own team and related teams.  Provide guidance for technical design and architecture decisions within the team. Participate in the evaluation and selection of new technologies.  Mentor other people and teams on technologies, techniques or standards across the organization. WHO YOU ARE:  Bachelors degree in Computer Science, Computer Engineering, or equivalent experience. Minimum 5 years (Masters +3, or Doctorate +1) of experience in solving challenging technical problems in two or more of the following areas: o Single page web application development o Unix/Linux environment management o Cloud based continuous delivery and environment management o Mobile application development o Micro-service design and development o Large, distributed system development o Software security o Processing and analyzing large data sets  Minimum 3 years designing cloud-based software solutions or certification equivalent. Practical experience and knowledge of industry practices.  Expertise in at least one technology or facet of product development (research, design, programming, testing). ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Agriculture, Dairy", "FUNCTIONAL AREA": "IT Software - Other", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Sc in Computers, B.Tech/B.E. in Computers", "PG": "MS/M.Sc(Science) in Any Specialization", "DOCTORATE": "Any Doctorate in Any Specialization"}, "KEY SKILL": ["Product Development", "cloud", "Software Development", "Software Engineering", "Web Technologies", "Computer Science", "Web Application Development", "Application Design", "Agile Development", "Mobile Application Development"]}