{"JOB DESCRIPTION": " The platform engineering group is responsible for development and maintenance of core platform on which rest of the exotel telephony and frontend stack / services are developed. Some of the key responsibilities include influencing reliability (monitoring, alerting, logging), scalability, security and performance of the system.   A Software Engineer within the platform engineering group is responsible for development and maintenance of the core platform.    The job involves all aspects of software engineering: designing and architecting services and features, development, testing, instrumentation, deployment, stabilization and operations.    What we are looking for   Role of a Software Engineer 3 - Infra/DevOps within the team includes   Lead projects pertaining to development of distributed system infrastructure: Orchestration frameworks, Logging and Monitoring frameworks, distributed queues and databases, Platform as Service   Exploration and adaptation of technologies for Orchestration, Platform as a service    What you will do   We are looking for candidates with a strong understanding of computer / distributed systems and strong programming skills. We want people who love designing and engineering distributed systems (which is lot more than programming)     Must-Haves    2-4 years working with major cloud solutions (AWS, Azure, GCP) desired. AWS preferred   Experience developing few of the monitoring, logging, metrics, CICD pipelines.     Familiarity with technologies such as Rsyslog, Filebeat, Prometheus, Jenkins, ArgoCD, VictorOps, etc.   Experience developing/setting up elements of platform as a service: orchestration frameworks, distributed queues, databases etc.    Familiarity with technologies such as Containers, K8s, AWS-Lambda, etc.   Experience with IAAC technologies: Ansible, Terraform, Puppet   Experience working with juniors and leading project teams to deliver critical software solutions   Experience with few of programming languages: Java / Go / Scala / C# and scripting languages: PHP / Ruby / Python   Strong networking fundamentals: Firewalls, DNS, Loadbalancing, etc.   Strong in Computer Science fundamentals and strong exploratory skills for exploring new age technologies   A \"devops\" mindset. You own what you will develop.    Good-to-Have    Experience with security technologies: CSPM tools (e.g. Aquascan), Intrusion Detection and Prevention Systems. Vulnerability assessment tools is a plus    Experience working with data ETL pipelines and distributed databases is a plus   Exposure to AI/ML technologies   Practical Experience in managing Production scale systems   Experience: 4-6 years ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Backend", "Product engineering", "Marketing Intern", "Technical Associate", "Software Development Engineer II", "Talent acquisition", "inbound marketing", "Financial Analyst", "Inside sales", "Marketing Associate"]}