{"JOB DESCRIPTION": "         What you ll do:                  As a Software Engineer in Test, one of the main areas you'll be working on is Performance and automation                 You will contribute to the development of a cutting-edge product in a quality-driven engineering culture.                 You'll be interacting and speaking with customers on a regular basis in order to bring back the customer context to the Engineering and Product teams                 Write test plans, create automated tests in JS - E2E, Smoke, Performance, etc.                 Track quality gate metrics such as code coverage, code smells and work with the team to get them resolved.                 Contribute to developing and evolving the Test Strategy                 Be the intersection between engineering, product, and design                 Inculcate a QA mindset within teams - be a proponent of test early, test often philosophy                   You should apply if                  You re passionate about Performance Engineering: you enjoy working with the team on scaling the system from a few thousand to a few hundreds of thousands to a few million customers.               You re excited about the problem we re solving!               You enjoy talking to customers and stakeholders               You believe that QA is not just a stage in the software development lifecycle, and have                Fullstack QA experience               with a strong background in Backend Test Automation, Performance Testing, Cloud Native, Test Planning, and different types of testing.               You have used tools such as k6, BlazeMeter, Jmeter, or equivalent               Experience with Cloud-native build/test/deploy of a platform (AWS/Azure/Google Cloud)               Experience with different automation testing frameworks using either one or more of Jest, Jasmine, Mocha, Cucumber.js, Cypress or equivalent               You have                0-1 type of experience               in scaling performance testing before               Experience with CI/CD and Build pipelines               Excellent analytical skills: proven ability to look at a use case from several different angles               Proactively gives suggestions to improve product and processes               One who thinks about quality as a cultural mindset rather than a functional task                   Bonus points:                 Experience with security testing of a system and is aware of OWASP               Experience in Identity Systems or Open source technologies is a plus               Experience in back end / full stack developer roles is a plus         ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["QA", "Analytical skills", "Backend", "Test strategy", "Performance testing", "Software development life cycle", "Security testing", "Open source", "Logistics", "Testing"]}