{"JOB DESCRIPTION": "    As a Software Engineer I, you will be part of an agile team responsible for developing, testing, delivering maintaining features for our logistics solutions. Collaborating with your team members, scrum master product owner, you will regularly identify opportunities to improve deliverable quality and team productivity. You must be comfortable working in both Windows Linux environments and ready to learn new programming languages technologies.             Primary Responsibilities               Participate in all activities ceremonies as an agile team member             Participate in design decisions for new and existing application development, proactively escalating issues and seeking assistance to overcome obstacles             Prepare and provide project status and risk assessments to their manager with appropriate levels of detail to ensure that programs stay on schedule             Compile test results to provide data for use in solving problems             Perform engineering level tests to find defects; troubleshoot and debug development and production issues, collaborating with other engineers to develop optimal product test plans             Work with product owner to clarify and estimate feature work             Work with QA Engineers to develop optimal product test plans and resolve new feature issues as QA finds bugs during release stabilization               Qualifications              2 years in software development, test automation, or equivalent combination of education and experience           Good proficiency required in .NET and C#, MSSQL, JavaScript, Angular 2 or above, ASP.NET MVC.            Familiar with Visual Studio or VS Code and source control (TFS, Git, SVN)           Familiar with SDLC and Agile methodologies           Highly motivated self-starter with a desire to help others and take action           Strong written and verbal communication skills with the ability to translate technical concepts into non-technical terms           Ability to independently work as a contributing member in a high-paced and focused team           Ability to multi-task and prioritize tasks with competing deadlines           Strong problem-solving and analytical skills with the ability to work under pressure           Ability to socialize ideas and influence decisions without direct authority           Collaborative in nature with a strong desire to dig in and learn independently and as well as through asking questions           Considers best-practice standards, as well as departmental policies and procedures           Computer science fundamentals: OOP, design patterns, data structures algorithms           Retail and wholesale petroleum industry knowledge experience preferred     ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Computer science", "Linux", "Javascript", "Agile", "Data structures", "Application development", "Scrum", "Windows", "SDLC", "Logistics"]}