{"JOB DESCRIPTION": "  We are looking for a great JavaScript developer who is proficient with React.js (preferred), Angular or Vue (or any other JS framework).     Your primary focus will be on developing user interface components and implementing them following well-known React.js workflows (such as Flux or Redux).    You will ensure that these components and the overall application are robust and easy to maintain.    You will coordinate with the rest of the team working on different layers of the infrastructure. Therefore, a commitment to collaborative problem solving, sophisticated design, and a quality product are important.                        Responsibilities       Generating error-free code and compliance of SOW   Managing development processes working notes    Growing technical skills and be an active part of technical transformation in the company    When required managing client communication for projects assigned    Reporting on project activities and ensuring timely completion of projects/assignments    Guiding Jr. Developers for completion of their work      Additional Responsibilities       Managing a good environment in the company    Supporting team leaders and members for their work    Supporting other team members growing technically and training them    QC of own work [Perform Unit Testing of work done]          Skills Required          Must Have       JavaScript    ES6    ReactJS    Flux Pattern    Understanding of APIs (REST).    HTML/CSS    Build tools - create-react-app, npm, Webpack/Parcel/Rollup, Babel, ESLint, prettier.    Source control - git.      Nice To Have       Progressive WebApp and configuring service workers.   React component patterns. (HOC, renderProps, containers).    State management library. (e.g. Redux, mobX).    GraphQL/Apollo client.    Optimization techniques (Code-splitting, Chrome dev tools, Bundle analyzing, react/redux dev tools)    Deployment (AWS or any static hosting solution)    Tools to make JavaScript a statically typed language (e.g. Flow, TypeScript).    Testing tools - Jest, Enzyme.      Benefits     Why Solute Technolabs       Self-funded with zero debt and liabilities   5 days week with flexible working hours    Profit sharing linked with assigned tasks and projects   State of the art infrastructure at par with MNC companies    Career growth mentoring by IT industry mentor having 25 year experience   KRA based contribution evaluation instead of routine appraisal based growth    merging technology skill development workshops         ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Front end", "GIT", "Skill development", "Testing tools", "Infrastructure", "Javascript", "HTML", "SOW", "Unit testing", "Management"]}