{"JOB DESCRIPTION": "Posted 8 months ago \n   Skill:-  Java,  spring,  hibernate,  JavaScript Must be strong in Java,  Spring,  Hibernate. Good Communication. Interview Process : 2 technical rounds and 1 managerial round\n\n\n Sr. Software Engineer Java Development ITSource Sr. Software Engineer Java Development Skill:-  Java,  spring,  hibernate,  JavaScript\n\nMust be strong in Java,  Spring,  Hibernate. \nGood Communication. \nInterview Process : 2 technical rounds and 1 managerial round  Job Features Job Category Skill Java,  spring,  hibernate,  JavaScript 4- 6 Years Apply Online A valid email address is required. United States United Kingdom Albania (Shqipri) American Samoa Antigua and Barbuda Austria (sterreich) Azerbaijan (Azrbaycan) Belgium (Belgi) Benin (Bnin) Bosnia and Herzegovina ( ) Brazil (Brasil) British Indian Ocean Territory British Virgin Islands Burkina Faso Burundi (Uburundi) Cameroon (Cameroun) Cape Verde (Kabu Verdi) Caribbean Netherlands Cayman Islands Central African Republic (Rpublique centrafricaine) Chad (Tchad) Christmas Island Cocos (Keeling) Islands \n\n\n Congo (DRC) (Jamhuri ya Kidemokrasia ya Kongo) +243  Congo (Republic) (Congo- Brazzaville) Cook Islands Costa Rica Cte dIvoire Croatia (Hrvatska) Czech Republic (esk republika) Denmark (Danmark) Dominican Republic (Repblica Dominicana) El Salvador Equatorial Guinea (Guinea Ecuatorial) Estonia (Eesti) Falkland Islands (Islas Malvinas) Faroe Islands (Froyar) Finland (Suomi) French Guiana (Guyane franaise) French Polynesia (Polynsie franaise) Germany (Deutschland) Ghana (Gaana) Greenland (Kalaallit Nunaat) Guinea (Guine) Guinea- Bissau (Guin Bissau) Hong Kong () Hungary (Magyarorszg) Iceland (sland) Isle of Man Italy (Italia) Latvia (Latvija) Lithuania (Lietuva) Macedonia (FYROM) () Madagascar (Madagasikara) Marshall Islands Mauritius (Moris) Mexico (Mxico) Moldova (Republica Moldova) Montenegro (Crna Gora) Mozambique (Moambique) Myanmar (Burma) () Namibia (Namibi) Netherlands (Nederland) New Caledonia (Nouvelle- Caldonie) New Zealand Niger (Nijar) Norfolk Island North Korea ( ) Northern Mariana Islands Norway (Norge) Panama (Panam) Papua New Guinea Peru (Per) Poland (Polska) Puerto Rico Runion (La Runion) Romania (Romnia) Saint Barthlemy (Saint- Barthlemy) Saint Helena Saint Kitts and Nevis Saint Lucia \n\n\n Saint Martin (Saint- Martin (partie franaise)) +590  \n\n\n Saint Pierre and Miquelon (Saint- Pierre- et- Miquelon) +508  Saint Vincent and the Grenadines San Marino \n\n\n So Tom and Prncipe (So Tom e Prncipe) +239  Saudi Arabia ( ) Senegal (Sngal) Sierra Leone Sint Maarten Slovakia (Slovensko) Slovenia (Slovenija) Solomon Islands Somalia (Soomaaliya) South Africa South Korea () South Sudan ( ) Spain (Espaa) Sri Lanka ( ) Svalbard and Jan Mayen Sweden (Sverige) Switzerland (Schweiz) Timor- Leste Trinidad and Tobago Turkey (Trkiye) Turks and Caicos Islands U.S. Virgin Islands United Arab Emirates ( ) Uzbekistan (Ozbekiston) Vatican City (Citt del Vaticano) Vietnam (Vit Nam) Wallis and Futuna Western Sahara ( ) land Islands A valid phone number is required.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["san", "c++", "development", "C", "technical", "software", "integration PHP", "HTML", "javascript", "Technical product configuration", "java", "design", "MySQL", "JavaScript", "email"]}