{"JOB DESCRIPTION": "  Sr Software Engineer         Role Summary/Purpose    In this role, you will develop innovative software products and solutions for the TCOS (Train Control Office Suite) program as part of Network & Logistics group in Digital Solutions business vertical within Wabtec India. You will be responsible for design and development of customer features, components and/or feature sets. You will be leveraging best practices and processes while demonstrating ability to learn and adapt to technologies and problem-solving abilities.      Essential Responsibilities    Skilled in breaking down problems, documenting problem statements and estimating efforts.   Ability to take ownership of small and medium sized tasks and deliver while mentoring and helping team members.   Has the ability to analyze impact of technology choices.   Expert in writing code that meets standards and delivers desired functionality using the   technology selected for the project.   Drive code quality through best practices, unit testing and code quality automation   Demonstrates the initiative to explore alternate technology and approaches to solving problems.   Promotes transparency by proactively sharing design choices with appropriate audiences, with the appropriate level of detail and timeliness.   Demonstrates expert understanding of functional and nonfunctional requirements and their priority within the backlog.   Work as an individual contributor and closely collaborate with architect and technical leaders      Qualifications/Requirements    Master's/Bachelor of Engineering in Electrical & Electronics or Electronics and   Telecommunication or Computer Science or Instrumentation or equivalent with at least 7 years of relevant experience in Object oriented design/development, design patterns, database tools and front end technologies.   Experience developing web applications (Spring MVC, RESTful, JAX-WS, Web Services)   Experience with front-end technologies such as Javascript, HTML5, CSS, jQuery, AngularJS, Web Components, NodeJS   Experience with database tools (JPA, Spring Data, Hibernate, etc.)   Experience with modern tooling (Eclipse / IntelliJ, Maven, NPM, Grunt, Git, Chef, Cloud Foundry,etc.)   Knowledge of Object Oriented Design, Software Design Patterns and Java coding principles   Demonstrates the initiative to explore alternate technology and approaches to solving   problems   Experience working as part of teams following Agile Scrum methodology   Strong oral and written communication skills   Skilled in breaking down problems, documenting problem statements and estimating efforts   Experience with modern software tooling and Continuous integration/continuous deployment practices   Strong ownership and focus on high quality delivery   Experienced at driving technical excellence and mentoring team members      Desired Characteristics       Business Acumen:    Have a solid understanding of the underlying infrastructure needed to run a large distributed web application   Has the ability to break down problems and estimate time for development tasks   Has the ability to make basic technology choices based on experience   Demonstrates awareness about competitors and industry      Leadership:    Has the ability to take ownership of small tasks and deliver without supervision while using their discretion to seek help when necessary   Voices opinions and presents clear rationale. Uses data or factual evidence to influence   Recognizes collaborative behavior and participates in collaborative activities   Learns organization vision statement and decision making framework. Able to understand how team and personal goals/objectives contribute to the organization vision     ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Courier, Transportation, Freight , Warehousing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Maven", "Hibernate", "Automation", "Software design", "jQuery", "Coding", "Eclipse", "Javascript", "HTTP", "Unit testing"]}