{"JOB DESCRIPTION": "Townscript, a BookMyShow enterprise, is a self serve event ticketing platform. It helps its clients with registrations and selling of tickets for their events. We are present in 27+ countries and it is widely used worldwide, mainly in countries like the United States of America, Canada, Indonesia, India, Singapore (and expanding).Our mission is making online event registrations and ticketing an easy and seamless experience for event organizers, and bridging the gap between organizers and enthusiasts. What are we looking for A lot of energy to deliver well written code with little to no Micro management. 1 to 3 years of hands on experience in building scalable applications/APIs. Dabbled around in at one of our mainstream backend languages (Java/GoLang/Python) Dabbled around in at one of our mainstream frontend languages (Angular/React/Vue) Naturally fast learners with the will to ship well tested code with a long tail in mind. Automation believers (We don't like doing things manually around here!!)What kind of challenges do we have?Automate deployments, setup real-time performance monitoring dashboards, and integrate CI/CD pipelines.Work with our Product & Design team to craft customer centered applications used by millions of people every day.Write algorithms to improve our personalization and recommendation systems and drive discovery of events to millions of users.What will you do? Collaborate and Deliver well tested modules with your team. Experiment with new & relevant technologies and tools and drive adoption for the same. Contribute to open source. We encourage you to give back!! Also.... DEVELOP -> BUILD -> TEST -> REPEAT.", "ROLE": "Software Developer", "INDUSTRY TYPE": "Media, Entertainment, Internet", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Electrical, Electronics/Telecommunication, Computers"}, "KEY SKILL": ["Java", "angular", "Software Development", "React.Js", "Python"]}