{"JOB DESCRIPTION": " • You will be actively involved with development of server backend that support mobile apps. • You will be architecting and implementing best-in-class complex - real time- web software and/or messaging systems to power highly scalable apps for users. • Translate high level business problems into scalable design and code. Create libraries & Utilities for larger consumption. • Work closely with UI/UX designers to create exciting user experiences and ensure delivery of graphic assets as per modern web standards. • You will be continuously keeping an eye on the latest cutting-edge technologies and leveraging these in one's own and the team's work as necessary. • Care about the business results of what you build, not just the elegance of the technology you build. • Work on the end to end stack (Platforms, UI, distributed systems, databases) rather than specialize in one area. • And of course, get hands dirty by writing server-side code for mobile-based applications, create robust high-volume production applications, and develop prototypes quickly.      Requirements   4+ years of experience on Node.js based web applications and systems   development.   • Strong knowledge of MEAN, Linux/UNIX based development & client-side   JavaScript/jQuery.   • Knowledgeable on ORMs, their utility and limitations.   • Knowledge of web services and serialization techniques like REST, SOAP, XML   & JSON.   • Knowledgeable about caching mechanisms & tools like memcache, CDNs,   nginx.   • Scripting experience in using Shell/Python for creating quick technology   solutions to problems.   • Prior expertise of working with AWS Cloud, CDNs and other PAAS based   services.   • A strong penchant for Object-Oriented Design.   • Experience of working with version control, bug tracking, continuous   integration and other productivity enhancement software like SVN, Bugzilla,   Jira etc.   • Prior experience in implementing Agile software methodologies.   • Passionate about software development & modern-day web technologies   like :   • Server-Side JavaScript - Node.js, Backbone.js   • Web Sockets   • NoSQL based databases like MongoDB/Couchbase/Redis   • Big Data   • Taking responsibility and ownership in the team's work     QualificationB.Tech/BS/BE/BS/MS/M.Tech/MS   in Electronics or Computer Science from a premier institute in India (IITs,   BITS, NITs, etc) or abroadMobile Number:  09953138435 ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Electronics/Telecommunication, Computers", "PG": "M.Tech in Computers, Electronics/Telecommunication, MS/M.Sc(Science) in Computers, Electronics", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Software Development", "NoSQL", "Javascript", "Redis", "Node.Js", "JSON", "MongoDB", "Backbone.Js", "JQuery", "Web Services"]}