{"JOB DESCRIPTION": "  Your Opportunity    You will work closely with Business team to understand the requirements, drive design, architecture and influence the choice of technology to deliver solution working closely with senior architects and leadership team.    Join our young, highly energetic and dynamic team, and take part in defining the new age e-commerce and in club shopping experience. You will also have challenging opportunities to cross-collaborate with inter-disciplinary product and engineering teams to solve some of the unique challenges in multi-channel shopping experience.      Your Responsibility     As a lead of the team you will be expected to design, build, test and deploy cutting edge solutions at scale, impacting millions of customers worldwide.   You will need to exhibit strong leadership and communication skills to collaborate with product, engineering and management across different geographic locations   Create and recommend solution design options factoring in requirements, standards and current Infrastructure environment. Communicate and present solutions to the other stakeholders    Guide and mentor others members in the team to promote highly technical and self-sufficient teams.       Your Qualifications     Bachelor s degree in computer science or related discipline with 6 to 10 years of core software product development experience.   Strong computer science fundamentals in algorithms, data structures, databases, operating systems, etc.   Hands on in developing web applications using REST, Messaging and SOA   4 or more years of experience with Java, springboot in building multi-threaded high performance scalable applications   Experience with Cloud Computing platforms: Microsoft Azure, Google cloud or similar is a plus   A self-motivated learner and builder with strong customer focus and obsession to quality           Our Ideal Candidate   You have a deep interest and passion for technology. You love writing and owning code and enjoy working with people who will keep challenging you at every stage. You have strong problem solving, analytic, decision-making skills. You are self-driven and motivated with the desire to work in a fast-paced, results-driven agile environment with varied responsibilities.", "ROLE": "Software Developer", "INDUSTRY TYPE": "Pharma, Biotech, Clinical Research", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Cloud computing", "Product engineering", "SOA", "Operating systems", "Agile", "Manager Technology", "Data structures", "Software product development", "microsoft azure"]}