{"JOB DESCRIPTION": "IntroductionAs an Application Developer, you will lead INCEDO into the future by translating system requirements into the design and development of customized systems in an agile environment. The success of INCEDO is in your hands as you transform vital business needs into code and drive innovation. Your work will power INCEDO and its clients globally, collaborating and integrating code into enterprise systems. You will have access to the latest education, tools and technology, and a limitless career path with one of the fastest growing IT companies.. Come to INCEDO and make a global impact.Roles and Responsibilities  Work with team of application developers and collaborate with a senior architect and solution designer to effectively deliver projects, enhancements, and applications.Develop end to end RPA solutions from requirements gathering to bot deployment focusing on scalability and extensibility using UI Path and .netWork with the Product Owners, Business Analysts, RPA Architect, and operations teams including teams from Incedos clients for creating technical design documents and project implementation.Develop solutions following the best practices around coding, design, quality, and performance.Develop solutions considering functionality, data, security, integration, infrastructure, and performance and ensure maximum robot utilization.Agree and set automation SLA\\'s and standardize automation reporting process.Work with testing teams and other users to assist in test design/test cases creation and during SIT/UAT etc.Desired Candidate Profile Technical graduate or post graduate.Minimum of 2+ years of experience in UIpath and overall 6+ years of work experience.Good interpersonal and communication skillsLooking for immediate joiners.INTERESTED CANDIDATES CAN SHARE UPDATED RESUME TO (sourabh.malaviya@incedoinc.com) along with below details-Current CTC/ Expected CTC/ Notice period/ Current locationThanksTEAM HR INCEDO", "ROLE": "Technical Architect", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "BCA in Any Specialization, Other Graduate, B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["Application Development", "Rpa", "Design Development", "Software Engineering", "Requirement Gathering", "Project Implementation", ".Net", "Deployment", "Uipath", "Robotics"]}