{"JOB DESCRIPTION": "Maersk is going through times of unprecedented change. From the farm to your refrigerator, or the factory to your wardrobe, we are developing solutions that meet customer needs from one end of the supply chain to the other. Digitization and IT are taking center stage in enabling our customers to trade globally and we are building our core products in-house. Join the worlds largest container shipping company and help us re-think what technology can do by using the latest technologies. You will be joining an IT organization consisting of more than 3000 dedicated individuals and it is an outstanding opportunity for a global career. Join us as we re-think what technology can do. As a Lead Software Engineer you will be a key driver in building products that will enable our customers to realize their dreams. We offer You will be part of the Service Delivery Platform focused on streamlining, optimizing, and automating container operations via advanced software solutions. You will join one of our highly capable scrum teams in Bangalore and will work closely with both business and technology to build the digital backbone of our global container logistics business.  As a Lead Software Engineer you are the technical anchor for your team. Your focus is to ensure that the team delivers high quality and high value software products for our business and you understand that empowering everyone in the team is the most efficient way to get there. You will help guide the technical direction of the team, take part in architectural discussions, do hands-on software development, and actively engage with stakeholders from both business and technology to align expectations and remove roadblocks. The Service Delivery Platform is a geographically distributed initiative, with world-class engineering teams in Denmark (Copenhagen), Spain (Algeciras), and India (Bangalore, Pune), and end users and stakeholders situated all over the globe - you will be part of this international and diverse organization consisting of highly talented and motivated people from across the world. We offer an exciting and attractive career in an ambitious and competitive environment, with the possibility of continuous professional and personal development. How we work The Service Delivery Platform consists of several cross-functional feature teams, each tackling a different problem within our business domain. We aim to keep teams co-located and self contained, but thrive working with stakeholders from across the organization. Scrum is our methodology of choice, and we seek to continuously refine our process to suit our needs.  We strive to empower each team with as much autonomy as possible, but don't shy away from cross team alignment when it adds value. We feel accountable for our work, and are not afraid to take on the full DevOps responsibility for what we build. Our work culture is informal with collaboration at its center, and we believe that giving everyone a chance to be heard is the best way to achieve great results.  Our technologies of choice are C# and .NET Core on the backend, TypeScript and Angular on the frontend, and Microsoft Azure as our go-to infrastructure platform. Our target architecture is microservice-based and we aim to always use the technologies and cloud services that best suit our needs. Key responsibilities  Be the technical voice for your team and establish strong relationships with stakeholders across Maersk.  Guide the technical direction of the team and ensure that we are building the right things in the right way.  Use your deep technical insight to ensure that your team delivers great quality software products, with a continuous focus on both business value and technical sustainability (incl. maintainability, reliability, performance, and availability).  Drive features through to completion, and take responsibility for the value we deliver.  Promote an agile mindset and good software practices within your team, and help mentor less experienced engineers.  Continuously stay up-to-date on relevant technologies and use this knowledge to push the team forward. We are looking for  A highly competent software engineer with proven experience in C#, .NET Core, ASP.NET Core, and Microsoft Azure.  A broad understanding of software architecture and technical design.  A great team player and a strong collaborator.  As a performance-oriented company, we strive to always recruit the best person for the job - regardless of gender, age, nationality, sexual orientation or religious beliefs. We are proud of our diversity and see it as a genuine source of strength for building high performing teams.", "ROLE": "Technical Architect", "INDUSTRY TYPE": "Shipping, Marine", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers"}, "KEY SKILL": ["C#.Net", "Asp.Net Core", "Microsoft Azure", "C#", ".Net Core", "Software Development", "Typescript", "Software Engineering", "Software Architecture", "Angular"]}