{"JOB DESCRIPTION": "Roles and Responsibilities Title - Software Engineer -  Hadoop/Talend AdminExperience – 3 to 5 yearsRequired Minimum Qualifications  Bachelor's degree in Computer       Science, CIS, or related field and 3+ years of experience in software       development or a related field. Additional equivalent work experience may       be substituted for the degree requirement. Candidate must have a 3+ years       of experience in Administering Data Integration tools - Informatica &       Talend on UNIX platform 3+ years of IT experience       Hadoop Administration knowledge 2+ years of experience working       in a large matrixed organization 2+ years of experience working       with an IT Infrastructure Library (ITIL) framework 2+ years of experience working       with application and integration middleware 2+ years of experience working       with defect or incident tracking software (e.g., HP Quality Center,       Remedy) 2+ years of experience working       with source code control systems Establish and enforce technical       standards for deliverables of projects Must be proficient and have       extensive experience in Data Integration Technologies (Hadoop,       Talend) Strong communication skills Retail Industry Experience a       Plus Knowledge in Linux  Required Skills  Hadoop Administration Talend Administration Unix SQL Core Responsibilities Completes work assignments by applying up-to-date knowledge and  expertise in subject area; leveraging an understanding of policies, data, and resources  to support projects or initiatives; collaborating cross-functionally to solve  platform issues; identifying and monitoring priorities, deadlines, and  expectations; communicating progress and information; identifying,  recommending, and implementing ways to address improvement opportunities Pursues self-development and effective relationships with others  by organizing resources and information; openly sharing information, advice,  and expertise with co-workers and customers; influencing others through  technical explanations and examples; providing occasional mentoring to team  members; seeking performance feedback; adapting to and learning from change,  difficulties, and feedback.  24*7 support with Night shift Candidate should be willing to       work independently in shifts. Informatica Service log       Monitoring and log Management. Server log monitoring and       analysis. Users/Groups Creation, Access       Management (Privileges and Permissions). Folder Creation and Code       Migration Export/Import, Folder Migration, Deployment Group. Release Management Managing object versions. Connection Management       Relational, Application, FTP and Loader Connection Start and Stop Informatica       Services and Nodes Managing Domain, Node and       Service configuration. Hot Fix and EBF Installation. New Server Installation Domain       / Node Setup, Informatica Service Creation, ODBC, Directory Setup for       Service and Folder level variables, Server Upgrade / Migration DR Setup and performing DR. Domain and Repository Backup. Setting up monitoring       jobs/scripts using Informatica Command Line Utilities. Generating stack traces of core       files. Modifying Node Configuration       Changing DB configuration, Port / Server Name changes. ", "ROLE": "DBA", "INDUSTRY TYPE": "Retail, Wholesale", "FUNCTIONAL AREA": "IT Software - DBA, Datawarehousing", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Admin/Maintenance/Security/Datawarehousin", "EDUCATION": {"UG": "BCA in Computers, B.Sc in Any Specialization, B.Tech/B.E. in Any Specialization", "PG": "MCA in Computers, M.Tech in Any Specialization, MS/M.Sc(Science) in Any Specialization", "DOCTORATE": "Other Doctorate"}, "KEY SKILL": ["Software Development", "Support", "Software Engineering", "Informatica Talend", "Hadoop", "Computer Science", "hadoop admin", "Data Integration"]}