{"JOB DESCRIPTION": "Important information regarding COVID-19: Your health and well-being are a top priority at Greytip. We understand that there may be concerns about traveling or in-person interviews. Greytip is moving to virtual interviews.  Office Location: We are supporting our teams to work remotely during COVID and will gradually start work at the office post-Mar 2021. (Koramangala 6th Block, Bangalore)Position PurposeFor a technology business, it's the quality, robustness, performance, and scalability of our software products that gives us a distinct edge over the competition. At Greytip, we have a track record of leveraging the best and latest technologies to deliver great solutions for our customers.We are looking for passionate engineers who want to build next-generation web apps that have the reach to millions of users. Unlike other places where you may end up playing bit roles, at Greytip you will have the satisfaction of seeing your ideas and efforts bear fruit in charting the destiny of the company, an opportunity to work with a few of the best talents in the industry, and growing with the company.You will not only grow professionally but will also enjoy every minute at Greytip with all the challenging work, the energy all around, and great co-workers.About Product Development & Engineering Team:Our Product Engineering department has a number of teams focusing on various product facets.As a Front End Developer, you will be a part of one of the teams and will work closely with the Product Management team in designing and delivering fast, responsive and scalable products. This is a great opportunity to learn and make meaningful contributions to the growth of the business in some of the hottest programming areas of this decade.We invite you to explore this career-boosting opportunity at Greytip for a challenging and exciting role.Skills and Qualifications 3+ years of hands-on experience with web technologies like Javascript (ES6), Typescript, Bootstrap, CSS, and Strong knowledge of Angular framework Understanding of HTML5, CSS3, and responsive design concepts A good understanding of various OOP concepts, design patterns, DDD, and programming best practices. Strong problem solving and other higher-order thinking skills. Preferred: exposure to reactive programming concepts and libraries (RxJs, ngrx-store), etc. Good to have: experience one of the popular JS IDEs e.g. Sublime / Atom / WebStorm and understanding of bundlers like Webpack/Gulp etc Understanding of UI/UX best practices and high-quality design Experience in startups like a fast-paced work environment is desirable.Responsibilities Take ownership of all front-end aspects of an application or module including design, development, and testing. (Naturally, it is a team effort and will involve other team members.) Ensure deadlines are met and work with a sense of urgency. Ensure high throughput and quick go-to-market without sacrificing quality or creating technical debt through Agile processes like Kanban. Come up with beautiful solutions to a few of the toughest problems in web applications. Requirements analysis and translation of the UI/UX design to actual code that will produce visual elements of the application. Work as a team-lead with coaching / mentoring of colleagues. Learn fast. Develop various POCs and stay abreast of technological changes. Introduce new ideas, tools, techniques, and technologies for the benefit of the business and its customers.Benefits A lot of freedom in choosing technologies, making decisions about products and features, and seeing your code help and impact millions of users. Flat hierarchy where you get to work closely with CTO and highly talented peers. Opportunity to work on the latest hot technologies of the software industry. Complete ownership of product features and modules. Excellent compensation, facilities, and benefitsOur Tech StackAngular, React Native, Svelte, TypeScript, Node JS, Bootstrap 3 & 4, HTML5 / CSS3, Ionic, Java, Python, GraphQL, Spring Boot, Hibernate, Django, Play Framework, Redis, Kafka, Zookeeper, ElasticSearch, Kubernetes, Amazon Web Services.If all of this is exciting to you please APPLY NOW and we will reach out to you soon!  ", "ROLE": "Database Architect/Designer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - eCommerce, Internet Technologies", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["advance javascript", "Front End", "Algorithms", "scss", "Html5", "Data Structures", "Problem Solving", "Javascript", "ES6", "Web Application Development", "frontend developer", "CSS3"]}