{"JOB DESCRIPTION": "Roles and Responsibilities  Technical expertise is required in a wide range of languages and technologies including .NET/C#, WPF/MVVM, VC++/MFC, SQL Server, Threading, OPC Server Design, Windows Services, etc. Ability to deliver solid object-oriented designs is required. Refer to the Experience and Qualifications section for a detailed list of the technical expertise required.  Desired Candidate Profile  At least 8 years experience as an IT professional with a Masters Degree in computer science or engineering related field;  OR at least 10+ years experience as an IT professional with a Bachelors Degree in a computer science or engineering related field.  Some demonstrated experience as a technical team lead on software development projects, with experience evaluating alternative technologies and making objective recommendations. Extensive WPF/C# Development Skills and Experience Experience with .NET Web Development in the following areas: 1.) ASP.NET, Javascript and AJAX 2.) Service oriented architecture 3.) C#.Net  Some experience with C++/MFC  Solid Understanding of Design and Design Patterns, especially MVVMWorking knowledge of UML (eg: with Enterprise Architecture)Relational database experience (SQLServer) Implementation/enforcement of XML schemas, XML transformations  Experience with Azure DevOps/GiT or similar (VSTS), including working experience with Agile/Scrum/Kanban development. Experience with Use or Development of OPC Servers and/or OPC Clients (OPC UA knowledge / experience a plus) Working knowledge of Process Control systems and concepts: 1.) Knowledge/understanding of Distributed Control Systems and terminology (eg: Honeywell, Yokogawa, Emerson, Foxboro, ABB) 2.) Knowledge of Data Historians (PI) 3.) Some experience with Oil and Gas industry4.) Optional: Experience with advanced process control or related software is a plus  Perks and Benefits ", "ROLE": "Other", "INDUSTRY TYPE": "Other", "FUNCTIONAL AREA": "Other", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Othe", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["C#", ".Net", "WPF", "MVVM", "VC++", "Software Engineering", "Windows Services", "SQL Server", "MFC"]}