{"JOB DESCRIPTION": "Roles and Responsibilities  Role of a Software Engineer 2 - Infra (DevOps) within the team includesDesign, develop, test and maintain software for pipelines such as monitoring, audit logging, logging, metrics Participate in exploration and adaptation of new technologies such as Containers and Orchestration, Serverless, IDPS, Platform as a service Monitor existing deployments to ensure committed SLAs are metA lot of focus in what you do will be outside of just adding features and will be related to pushing a distributed system to its limits - you will be constantly thinking of \"how do I scale out my cluster to twice its size with 60 seconds?\", \"how do I increase the platform uptime from 99.95 to 99.99?\", \"how to shave off a few extra millisecond in response times?\".We are looking for candidates with a strong understanding of computer/distributed systems and strong programming skills. We want people who love designing and engineering distributed systems (which is lot more than programming) Desired Candidate ProfileStrong in Computer Science fundamentalsStrong exploratory and learning skills for exploring/learning new age technologiesExperience with Linux distributed systems, Fundamentals of NetworkingExperience with one of the cloud platforms (AWS, GCP, Azure)Experience with one of IAAC technologies (Ansible/Chef or Puppet)Experience with one of programming languages Java / Go / Scala / C++ / C / C#Comfortable scripting in at least one of PHP / Ruby / PythonExperience with few of the following: containers and orchestration frameworks (E.g. K8s), Logging (Rsyslog), Monitoring frameworks (Prometheus, Nagios), CI/CD pipelines, Security frameworksA \"devops\" mindset. You own what you will develop.Perks and Benefits Strong in Computer Science fundamentalsStrong exploratory and learning skills for exploring/learning new age technologiesExperience with Linux distributed systems, Fundamentals of NetworkingExperience with one of the cloud platforms (AWS, GCP, Azure)Experience with one of IAAC technologies (Ansible/Chef or Puppet)Experience with one of programming languages Java / Go / Scala / C++ / C / C#Comfortable scripting in at least one of PHP / Ruby / PythonExperience with few of the following: containers and orchestration frameworks (E.g. K8s), Logging (Rsyslog), Monitoring frameworks (Prometheus, Nagios), CI/CD pipelines, Security frameworksA \"devops\" mindset. You own what you will develop.", "ROLE": "Devops Engineer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Telecom Software", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Not mentione", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["C#", "Java", "orchestration frameworks", "Azure", "C++", "C", "Chef", "Go", "Software Development", "GCP", "Ansible", "SCALA", "PHP", "Linux Distributed Systems", "containers", "AWS", "Puppet", "Ruby", "Python"]}