{"JOB DESCRIPTION": "Roles and Responsibilities We are looking for technically very strong candidates, with a strong understanding of computer systems. We want people who love designing and building infrastructure components and large complex services. We are looking for engineers driven by a passion to create applications systems that can redefine the contact center communication space. You will be a part of the Product Engineering team at Exotel. Specifically, we are looking for engineers for building services and dashboard backends that help customers use Exotel in a variety of ways.Responsibilities include end-to-end software engineering aspects:Designing and architecting and plan systems and servicesDevelopmentTestingDeploymentInstrumentation, dashboarding and monitoringDebugging production issues and handling production incidentsProject & Stakeholder managementMentoring and technical evangelizingDesired Candidate Profile 5+ years of experience with a Bachelor / Master's Degree in Computer Science or equivalent.1+ years of end-to-end application services development experience in product engineering organizations.Very strong in Computer Science fundamentalsExpertise with one of Java / Go / Scala / C++ / C / C#Experience in web Services, REST APIs / SOAP / RPCs.Experience building large scale distributed systems OR done core systems programmingKnowledge of different data stores, data modelling and scaling themA \"DevOps\" mindset. You own what you will develop.Excellent written and verbal communication skills, with strong attention to detail and a head for problem-solving.Team-player, flexible and able to work in a fast-paced environmentPerks and Benefits Exposure to telephony protocols, ISDN, SIP, WebRTC & others like TCP/UDP etc.Comfortable scripting in at least one of PHP / Ruby / PythonKnowledge of LinuxExposure to AngularJS, Express.js, React, and Node.js and/or other js librariesExposure to database like Mongo, Redis, Mysql or other relations dbsStrong understanding of Microservice design and distributed architectureExposure to build and deploy pipeline and tools", "ROLE": "Team Lead/Technical Lead", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Telecom Software", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers"}, "KEY SKILL": ["C#", "Java", "Software Development", "C++", "C", "SCALA", "RPCs", "Go", "Production Engineering", "SOAP", "Web Services", "REST APIs"]}