{"JOB DESCRIPTION": "  Role Summary:       Baker Hughes has a new opportunity for Senior Software Development Engineer in Test to join the team in Bangalore, India.   Senior Software Development Engineer in Test will be responsible for testing a component, feature and or feature set.      Essential Responsibilities :     Makes technology choices at individual level and has ability to analyze impact.   Applies principles of SDLC and methodologies like Lean/Agile/XP, CI, Software and Product Security, Scalability, Documentation Practices, refactoring and Testing Techniques.   Expert in core data structures and algorithms. Integrates project testing with continuous- integration process.   Works with fellow team members to diagnose bugs and formulate solutions. Demonstrates the ability to understand, debug and contribute to code base.   Demonstrates the ability to drive team change for the betterment of the product quality.   Provides expertise in the quality engineering, test planning and testing methodology for a software project.   Provide mentorship to junior level engineers and help them grow to the next level. Bring best practices from industry drives across the team.   Develops and executes maintainable automation tests for acceptance, functional, and regression test cases.   Understands performance parameters and can assess application performance using various tools like Jmeter, LoadRunner etc.   Expert in writing Automate tests for both API UI on platforms like Java, JavaScripts etc.   Collaborates with Quality Leaders in creating test plans. Implements and configures testing tools and at times help junior staff. Implements system-level integration testing.   Prepare and present technical data to internal and external customers.         Qualifications/Requirements :     Bachelor s Degree in Computer Science or in STEM Majors (Science, Technology, Engineering and Math)   A minimum of 5 years of professional experience   Must have strong software knowledge 5+ years experience writing scripts in scripting languages: Java/avaScript using Selenium on Unix/Windows.   Database / PostGres / Timeseries / SQL / Oracle knowledge and experience of Windows/Unix/Linux.   Experience of testing API, Web, client server and GUI applications.       Desired Characteristics :     Familiar with methods and techniques of structured reviews.   Experience of working in an environment with strict quality procedures.   Effective oral expression and written expression, easy contact, adaptable, can foster team spirit.   Excellent Planning and organizational skills.   Excellent communicator and team player.   Experience working in Agile development environment  ", "ROLE": "Testing Engineer", "INDUSTRY TYPE": "Oil and Gas, Energy, Power, Infrastructure", "FUNCTIONAL AREA": "IT Software - QA & Testing", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Unix", "Computer science", "Automation", "Linux", "Testing tools", "Data structures", "Windows", "Selenium", "Test cases", "SDLC"]}