{"JOB DESCRIPTION": "  Basic Qualifications    4 to 10 years of software development testing automation experience    BE / BTECH / ME / MTECH in Computer Science or equivalent    Required Skills:    Strong Testing Skills   Experience in Test Automation frameworks using Java and Python and support tools.    Expert in Test Planning, Automation, Execution Analysis of scale and performance tests, Experience with Git, TestNG, Cucumber and result dashboard.   Good understanding of the best practices, SDLC/SQLC processes, QE methodologies   Strong analytical and debugging skillsRest APIsNetworking fundamentals   Strong experience with Linux systems and its internals and fundamental operating systems concepts .   Familiarity with Agile ways of working.   Good to haveJava and Spring stack development experience   Architecture and design skills   Data structures and fundamental programming concepts and techniques including Object Oriented Programming   Production experience with scalability, security, high-availability, software maintenance and software updates.   Team player, excellent communication skills including listening skills.   Experience with modern container driven application development and deployment stack Cloud Native Apps, Kubernetes, Microservices Architectures, Containers/Docker Internals, Container Registries   Practical experience with Continuous Integration and Continuous Deployment software development practices.   Experience with software testing Units tests, Functional tests, Integrations tests and best practices therewith   Hands-on networking fundamentals - TCP/IP , DNS, DHCP , L2/L3 protocols.    Good to Have:    Experience with Virtualization stack ESX, vSphere ,VMs and related networking concepts is a definite plus  ", "ROLE": "Testing Engineer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - QA & Testing", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Production/Industrial", "PG": "M.Tech in Electronics/Telecommunication"}, "KEY SKILL": ["VMware", "Linux", "Networking", "Agile", "Data structures", "Application development", "microsoft", "Open source", "SDLC", "Python"]}