{"JOB DESCRIPTION": "Roles and ResponsibilitiesLead projects related to Exotel's telephony and VoIP stack. Responsible for driving project throughout its lifecycle.Work with team of engineers to explore, design, develop, test, deploy, and operationalize a product features & improvements.Build fault-tolerant, scalable and real-time distributed voip systemEffectively work in collaborative and agile team environmentSupport team with timely analysis and debugging of operational issuesBe on rotational on-call roster to handle operational issues - Emphasis on automation and scripting. -Mentor junior engineers in the team.Desired Candidate Profile Bachelors or Masters degree in Computer Science or Communications EngineeringSolid knowledge on VoIP domain technologies including SIP, SDP, RTP, RTCP.Solid knowledge on IP networking concepts and L2/L3 routing including Subnets, VLAN, NAT Traversal (ICE/STUN). - Experience leading project team to deliver critical software solutions3+ years experience in high-availability, scalable and fault tolerant voip infrastructure.3+ years experience in working with server-side voip infrastructure components like Asterisk/Freeswitch, Kamailio/Opensips. including understanding of stack internals3+ years experience in working with a major cloud platform like AWS (preferred), GCP, Azure2+ years experience in design and development of REST-based microservicesExperience in programming with one of Golang (preferred), Ruby, C/C++Experience in scripting with shell, python - Experience with datastores such as MySQL, PostgresExperience with DevOps tools like Ansible, Jenkins, Terraform, kubernetes, Git - Good understanding of data structures, multi-threading and concurrency concepts.Proficiency in working in Linux environmentExperience working in Agile SDLC processStrong analytical, problem solving and toubleshooting skillsExcellent written and verbal communication skillsTeam-player, flexible and able to work in a fast-paced environmentA \"devops\" mindset. You own what you will develop.Perks and Benefits Experience with custom development on Asterisk/Freeswitch/Kamailio/Opensips is a plusExperience with SIP or any other SIP testing tools - Experience with ISDN, WebRTC technologiesExperience with elasticsearch queries and visualization tools like grafana, kibanaExperience with monitoring frameworks like Nagios, PrometheusExperience with developing Android, iOS based voip clientsExperience with Java, Javascript languages", "ROLE": "Team Lead/Technical Lead", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Telecom Software", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Electronics/Telecommunication, Computers"}, "KEY SKILL": ["kubernetes", "Kamailio/Opensips", "golang", "VOIP", "RTCP", "VLAN", "RTP", "Asterisk/Freeswitch", "Software Development", "MySQL", "Rest Based Environment", "Postgres", "AWS", "Ruby", "SDP", "Azure", "C++", "c", "NAT Traversal", "IP Networking", "Jenkins", "GIT", "GCP", "Ansible", "terraform", "SIP"]}