{"JOB DESCRIPTION": "Responsibilities and Duties:  Reports to the Project Manager at the project level. Responsible for the software development activities including developing, verify and manage  the change requests for one component of a project solution. Responsible for the Design of the software architecture and interfaces for the component to  meet functional and performance requirements. Responsible for testing software functional, design and quality requirements for the  components. Assist Software Architects to maintain and improve in-house software modules and technical  support.Requirements: Any graduate with computer science background (BE-CSE, ECE, B.Tech-IT, B.Sc, BCA, MCA,  M.Sc,  M.S, etc). Should secure 60% of minimum marks in 10th, 12th and Degree. Pass out: 2017 to 2020 Be strong in Quantitative Aptitude, Analytical and Logical Reasoning. Good listening and communication skills. Good team player and willing to learn.  Required Experience, Skills and Qualifications:  Knowledge in C/C++/PHP programming with good debugging skills is preferable. Knowledge in Linux/Unix is a plus. Basic knowledge in RDBMS is a plus. Basic knowledge in HTML, CSS and JavaScript is a plus.  Benefits:  ** Salary Breakup  1 to 6 months Rs. 8,000/month (Fixed) 7 to 18 months Rs.16,000 Rs /month (Fixed) 19 to 30 months Rs. 24,000 to 32,000 /month (Hike 50% to 100%) * The salary hike and incentive will be based on performance. Terms of employment:1. Immediate employment for all selected candidates.2. No bond/cheque needed.3. Commitment period - 2 years (excluding 6 months of training). 4. If the selected candidate breaks the employment within the commitment period, they will NOT get any benefits (including experience certificate) from the company. Recruitment Process:  1. Online Test (Aptitude + Programming) 2. Technical Round One or more (Theory + Programming) 3. HR Round Direct Walk-in from 27th Jan to 17th Feb 2021 at 10.00 am to 04.00 pm. (Only on Mon to Fri)   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Sc in Computers, BCA in Computers, B.Tech/B.E. in Any Specialization, Computers", "PG": "M.Tech in Computers, MCA in Computers"}, "KEY SKILL": ["Bsc", "Computer Science", "MCA", "Communication Skills"]}