{"JOB DESCRIPTION": "   Skillset Requirements       Exceptional comprehension skills and ability to learn and contribute with minimal oversight - a self starter .   Absolutely strong foundation required in Object Oriented Programming concepts.   Ability to think in abstract and quickly grasp the essence of the job at hand.   Excellent written and verbal communication skills, dealing with technical data.   Ability to work with development team in the US.     Technical Requirements       Excellent understanding of C, C++ and Oops concepts   .NET - ASP, C#, VB.net are good to know but not mandatory.   Multi-tiered application design and development   RDBMS design (SQL Server, Oracle, etc.)   HTML/DHTML and JavaScript       Job Responsibilities       Participate in regular meetings with Technical Leads to review Technical Design Specifications, obtain development tasks, track progress, and clarify technical issues pertaining to coding and testing of the design.   Learn and work with whatever tools are required to ensure source code control, version management, issues tracking and documentation.   Ensure that coding and development standards and conventions are followed.   Tracking and working on development issues for a given release as previously assigned, and also as they come up, and assimilating them into a status report for the Development Coordinator.   Assisting the Development Coordinator in prioritizing and assigning technical activities to the members of the Development Team, based on the release content decided by the Development Manager.   Assisting the Development Coordinator in managing the development resources and priorities, once assigned to development tasks.   Ensuring that each development item is thoroughly unit tested in a proper deployable environment (outside the development environment), before it is handed over to the Implementation group for Integration Testing, and the QA group for overall Quality Assurance.   Participating in analysis and design meetings for the Product.    Qualifications Skills      Consistently introduces new ideas and demonstrates original thinking       Works well as a member of a group       Ability to Make an Impact   :      Inspired to perform well by the ability to contribute to the success of a project or the organization     Inspired to perform without outside help    Bachelors or better in Computer Engineering or related field.   Bachelors or better in Computer Science or related field.    0-2 years   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "C++", "RDBMS", "Coding", "Javascript", "HTML", "Oracle", "ASP", "SQL", "DHTML"]}