{"JOB DESCRIPTION": "     We are seeking a skilled and highly motivated software engineer to join our development team in a fast-paced, agile environment. This position is responsible for working across a mix of products/programs in a fast paced, mission driven culture. This person works with the business, stakeholders and subject matter experts, to design and oversee the delivery of end to end solutions (i.e. application, integration, infrastructure and deployment).      Skills and Experience       Required        Experience with Java application development (JDK v1.8+)      Experience building and consuming RESTful web services        Desired        Experience with Angular (v8+), JavaScript, HTML, CSS, JSON      Experience with the following: Java Spring Framework (e.g. Spring Boot, Spring Cloud), JPA, Hibernate      Experience with relational databases      Experience using tools such as Eclipse, Git, JIRA, Gradle and Ant       Key Attributes       Focus on contemporary architecture patterns and practice (e.g. understanding of micro- services, REST, responsive design, SQL and NO-SQL, front-end technologies, Dev-Ops)      Understanding of the full end to end technology stack (i.e. front-end client to database, and application to infrastructure)      Expertise in many of these technologies: Java, Spring Framework, JavaScript, Angular, Docker, Ansible, AWS, Azure, Packer, Terraform, Networking, Protocols, Node.js, Python, Shell scripting, Unix, Linux, Windows, ELK Stack, Kafka, JMS, message queuing      Ability to communicate effectively and to maintain meaningful relationships with business and technology stakeholders      Have a solid understanding of agile methods and tools and have worked in an agile environment       ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Unix", "JMS", "Hibernate", "Linux", "Shell scripting", "HTML", "Application development", "Windows", "SQL", "Python"]}