{"JOB DESCRIPTION": "        Summary   The Production Engineer (PE) position has responsibility for deploying and configuring the application on customers staging and production systems. In this role the PE will act as an Engineer to setup, configure and integrate the iXTools platform. The PE also works to troubleshoot and resolve issuesickets as they are found during testing from customer or implementation teams. This position reports to the Manager\\Director of Production Engineering.    Essential Duties and Responsibilities   include the following. Other duties may be assigned.   Deploys the application to the customer environment including the cloud being used.   Deploys the packages to the customer environments.   Works to troubleshoot and resolve the issues during the deployment and any related tickets.   Politely interacts directly with end users.   Documents ticket resolution for future reference.   Searches available documentation to resolve tickets.   Investigates application and system configuration.   Performs database queries to research issues.   Escalates tickets to the appropriate teams.   Conforms to the daily, weekly and monthly reporting requirements for PE s   Periodic travel (once in 6 months or more.)    Qualifications   To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required.    1  -2 years of SQL Server knowledge or any other RDBMS.    1-2 years Writing the SQL Queries to access the data from the databases.    2 years Knowledge\\ Experience in SQL Server profiler for performance tuning.    2 Years Knowledge\\ Experience in IIS (Internet Information Services).    2 Years Knowledge\\ Experience in Windows and Unix Server environments.    1 Years Knowledge\\ Experience of open source databases like mysql, posgreSQL is plus.    2 Years Understanding of OSetwork\\firewalls is plus.    Strong troubleshooting skills.    0-1 years managing SQL Server based applications.    0-1 years experience performing end user support.    Comfortable using Windows applications including Word, Excel, and PowerPoint.    Education and/or Experience    Bachelor s or Masters Degree in Computer Science or Engineering or another related field is required.   Language Skills    An individual must also have excellent communication in English both oral and written, proficiencies in other languages is a plus.    Physical Demands The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.   Work Environment The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Telcom, ISP", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Unix", "Computer science", "Performance tuning", "IIS", "RDBMS", "MySQL", "Windows", "Roaming", "Open source", "SQL"]}