{"JOB DESCRIPTION": " Description of the position Senior Software Engineer. Responsibilities     Essential Duties:       Designing and development of software for Nagra s embedded security products, by working closely with other experts, designers and developers      Candidate must constantly drive/learn new technologies and new approaches for defining company s   security   solution roadmap in domain of CAS/DRM and Open devices security (iOS/Android)      Experience in STB (set-top-box) or DTV domain will be a plus      As an agile team member doing end-2-end coding, validation and testing of the features      Documenting User Guides, Requirement Specifications, and Design Specifications      Work in Agile environment and enable team to deliver on all technical fronts      Understand business needs and should demonstrate flexibility in taking up new tasks        Required Skills:        Hands on experience in C, C++ programming language in an embedded software context      Excellent understanding of operating system concepts      Good understanding of security domain (secure coding, vulnerabilities, Secure SDLC)      Hands-on experience on DRM (Digital Rights Management) technologies like Playready/FairPlay/Widevine is desirable      Android TV and Set-Top-Box experience will be a plus      Hands-on experience working on iOS and Android devices will be a plus      Understanding of IPTV/OTT/DVB architecture and CAS (conditional access system) is definite   plus       Hands-on experience on trusted execution environment (REE/TEE / ARM TrustZone / Intel SGX) will be a definite plus      Sound knowledge of OOPS and UML      Should have excellent analytical, debugging and problem-solving skills      Should demonstrate flexibility in taking up new challenges, in line with the business needs of the organization    Requirements / Profile    Profile:      Engineering Degree preferability in Computer Science or Electronics (or MCA)      Exhibit high sense of responsibility, commitment and collaboration.      Excellent analytical skills and ability to grasp and synthesize complex technical problems and concepts.      Work with autonomy in an environment of uncertainty.      Constantly stay up to-date on technology and industry trends.      Build relationships and maintaining friendly and pleasant work conditions.      Work in project with customer or partners.      Motivate the team & create a positive atmosphere      Inculcate a culture of Innovation amongst the team      Fluent English mandatory       Technical Skills:       C / C++ / UML/ OOPs      Embedded Systems/ STB/ DTV/ IPTV/ DVB      Open devices (iOS, Android)      Secure programming      RTOS / Linux      Object oriented design and programming      Requirement management   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Network Administration, Security", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "MCA in Computers"}, "KEY SKILL": ["RTOS", "Linux", "UML", "Coding", "Debugging", "Consulting", "Agile", "SDLC", "Android", "Embedded software"]}