{"JOB DESCRIPTION": " This engineer is expected to make significant, direct and high quality contributions to verify quality, security and scale of the service that lead to increased market share and customer happiness. Main responsibilities include reviewing product designs and customer expectations, designing and developing monitoring solution around cloud native product such as kubernetes and docker, stress and scale tests. This engineer should have a good understanding of Kubernetes, Docker and related cloud-native technologies.   Responsibilities    Design, architect and develop a solution for discovering and monitoring kubernetes and docker infrastructure.     Write automated scenario, stress, performance and scale tests to validate the new solutions getting delivered into cloud native service     Review product designs for customer experience, quality concerns and testability     Develop common test libraries and infrastructure to be used by other engineers     Ensure that quality measures are part of the CI/CD process     Play an active hands-on role ensuring quality across the entire software development life cycle, including helping to deliver software into production and ensuring that it continues to operate as designed. This includes participation in periodic on-call duty.     Preferred Qualifications    The ideal candidate will possess the following experience:    Good subject matter expertise with Kubernetes, Docker and other container orchestration tool.     Practical experience developing, testing and operating a service in a hybrid cloud.     Outstanding coding/scripting skills, preferably in Go.     Experience with Linux/Unix     Experience in Jenkins and CI/CD environment     Strong oral and written communication skills   Bachelors in Computer Science or equivalent;    Masters preferred  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Unix", "Computer science", "orchestration", "Linux", "Coding", "Cloud", "Software development life cycle", "Infrastructure", "Subject matter expertise", "Monitoring"]}