{"JOB DESCRIPTION": " Job Description   Job Title: Associate UI Developer   Location: Bangalore, India   Function: Engineering   Position Type: Full - Time   Position Level: Associate Software Engineer  - UI   Xactly Corporation was founded to solve an important challenge: how to help people everywhere connect and unleash their human potential through seamless, perfectly aligned Sales Performance Management. Xactly s comprehensive Sales Performance Management (SPM) suite leverages data from a sales performance AI platform to provide timely insights across the entire SPM value chain, from sales planning to execution, including compensation to optimization. Xactly takes Sales Performance Management from a dark art to a science, providing decision - makers with the data insights they need to tap the motivational power of their incentive compensation. With access to predictive analytics and benchmark data, enterprises can now optimize territories, design the right compensation and incentive plans and accelerate attainment and optimization of sales performance.   THE OPPORTUNITY   This position will be a part of the Engineering team working on the major product Insightst at Xactly. You will partner with other Engineering teams in the company to drive continuous development of new features, innovation as well as establish trust across the org with Product Managers, Support, Data Center Operations, and peer engineering teams. You will be a hands on engineer who will be working with engineering team to have quality code and perfect releases.   THE TEAM   Xactly s Engineering team is growing rapidly and we need someone who can work the product Insights. Covering offices in San Jose, Denver, Bangalore, and Toronto, we have a strong focus on cutting - edge and high - quality code and products. All engineers are encouraged to operate independently with the highly level of accountability, but also have the ability to be a team player and work with multiple teams.   REQUIRED SKILLS:    B.S/M.S -  0 - 2 years of experience in web application development and architecture.     Experience using open source software libraries     Experience in at least one MVC architecture or application of the pattern     Understanding node.js, react.js and HTML5     Java skills in the application tier and familiarity with application containers.     Must have built end to end continuous integration and deployment infrastructure for UI services     Commitment to good engineering discipline and process including code reviews and delivering unit tests in conjunction with feature delivery     Must possess excellent communication and teamwork skills. Strong presentation and facilitation skills are required.     Self - starter that is results focused with the ability to work independently and in teams.     B.S. or M.S. in Computer Science or other relevant technical field    GOOD TO HAVE:    Prior experience using a modular, common and scalable UI platform     Experience using chef, puppet or any other deployment automation tools     Experience working within a distributed engineering team including offshore     Bonus points if you have contributed to an open source project     Familiarity and experience with agile (scrum) development process     Experience working within a distributed engineering team including offshore     Proven track record of identifying and championing new technologies that enhance the end - user experience, software quality, and developer productivity     Hands of experience in deploying services on AWS or Google Cloud platform     Experience in both small and large companies    WITHIN ONE MONTH, YOU LL:    Attend New Hire Training     Learn the Dev and QE processes     Gain exposure to Xactly s product suite     Learn about Xactly s tools and technologies     Get to know your team     Local development environment should be up and running    WITHIN THREE MONTHS, YOU LL:    Fix product issues/bugs in different areas     Able to contribute to all the design discussions     Code reviews     WITHIN SIX MONTHS, YOU LL:    Ensure the best dev practices are being used     Ensure that he/she is releasing high quality product     Participate and contribute in maintenance and new product development and Should be able to work individually on any tasks    WITHIN TWELVE MONTHS, YOU LL:    Partner and work cross functionally with other dev teams and the QE team     Take full ownership of features and processes of the product     Continuously think about and work on process improvements for an always high - quality product    BENEFITS & PERKS    Paid Time Off (PTO)     Comprehensive Insurance Coverage     Tuition Reimbursement     XactlyFit Gym/Fitness Program Reimbursement     Kitchen Stocked Daily with Tasty Snacks, Fruit and Drinks     Free Parking and Subsidized Bus Pass (a go - green initiative!)  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Medical-MS/MD in psychology"}, "KEY SKILL": ["Computer science", "Product quality", "SAN", "Sales planning", "Performance management", "Software Associate", "Cloud", "software quality", "Open source", "Operations"]}