{"JOB DESCRIPTION": " At E2open,  you will be an integral member of a dynamic organization,  working on cutting- edge SaaS technology that transforms the way companies do business with their trading partners in complex,  multi- tier supply chains. Currently,  E2open is seeking an enthusiastic QA automation engineer to join Product Development.       Responsibilities      This position involves testing activities of all phases of software development life cycle and the development of GUI automated tests for end- to- end testing of a Business- to- Business web application that spans Front Office (website) and Back Office (Linux) implementations. The successful candidate will be working closely in a team environment with product development engineers and quality assurance to create automated acceptance,  functional,  smoke tests and performance tests.    Ownership of the entire test cycle for an Agile team,  including story decomposition and sizing,  test and test automation approach,  test plans and objective creation,  testing.    Maintaining test suites and test tools,  test environment setup,  defect management,  test execution and test reporting.    Work on improving Best Practices in Test Management and Quality Assurance Process.      Requirements      0- 3 years of experience.    Minimum 6 months of Experience in Selenium Webdriver.    Good understanding of QA methodology,  automation expertise and ability to code.    Good understanding of various operating systems such as Microsoft Windows and Linux/Unix.    Good knowledge of SQL and relational database such as Oracle,  MS SQL Server,  and MySQL.    Good understanding of browser technologies such as Internet Explorer,  Mozilla,  Firefox,  and Google Chrome.    Good knowledge of Rest API testing.    Some knowledge of programming/scripting languages/environments such as XML,  JavaScript,  Perl,  PL/SQL and Unix/Linux Shell,  Python.    Some understanding of network protocols such as TCP/IP,  HTTP and SSL.    Some knowledge of programming languages such as Java.    Experience with tools such as Selenium strongly desired.    Experience with tools such as cucumber strongly desired.    Experience in supply chain management software and industry an advantage.    Ability to work both independently and in a team    Must possess critical thinking skills in addition to good interpersonal and communication skills.    Willing and able to create and adapt to new tools or technologies.      Qualifications:      Bachelor Degree in Computer Science,  or equivalent experience.             ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - QA & Testing", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Unix", "Automation", "MS SQL", "Linux", "XML", "MySQL", "Javascript", "Perl", "Oracle", "Python"]}