{"JOB DESCRIPTION": " ACCOUNTABILITIES:Designs, codes, tests, debugs and documents software according to Dell systems quality standards, policies and procedures.Analyzes business needs and creates software solutions.Responsible for preparing design documentation.Prepares test data for unit, string and parallel testing.Evaluates and recommends software and hardware solutions to meet user needs.Resolves customer issues with software solutions and responds to suggestions for improvements and enhancements.Works with business and development teams to clarify requirements to ensure testability.Drafts, revises, and maintains test plans, test cases, and automated test scripts.Executes test procedures according to software requirements specifications Logs defects and makes recommendations to address defects.Retests software corrections to ensure problems are resolved. Documents evolution of testing procedures for future replication.May conduct performance and scalability testing.RESPONSIBILITIES:Offers limited systems recommendations for defined business needs. Creates documentation on all programming work.Performs maintenance on existing software products.Assists in coding, testing and debugging new software or making enhancements to existing software. Writes programs according to specifications from higher-level staff.Provides input into simple estimation efforts on projects.Conducts a limited variety of quality-control tests and analysis to ensure that software meets or exceeds specified standards and end-user requirements.Drafts and revises test plans and scripts.Executes test scripts according to application requirements documentation.Retests software corrections to ensure problems are resolved. Documents evolution of testing cases/scripts for future replication.Description Comments,Detailed Job Description & Roles and Responsibilities With manual testing back ground with at-least 1-3 years of Experience Should have good Networking knowledge . Good Understanding of OS like windows and Unix systems . Good Understanding of STLC . Understanding of Virtualization and associated technologies like Citrix ,Vmware ,Microsoft RDP . Automation skills with exposure to Pyhton etc would be a plus Mandatory Skills Software testing, Virtualization Networking Relevant Experience required - 6months - 2 years Work Location (Location & Site) - Dell-11 Work Shifts timing - 8:30 am to 5:30 pm", "ROLE": "IT/Technical Content Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - QA & Testing", "EMPLOYMENT TYPE": "Full Time, Temporary/Contractua", "ROLE CATEGORY": "Othe", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["Scalability Testing", "Test Procedures", "Test Data", "Software Engineering", "Software Testing", "Manual Testing", "Test Scripts", "Test Cases", "STLC", "Software Solutions"]}