{"JOB DESCRIPTION": "Position:C++ Developer (Digital Media- Machine Learning Expert)Experience: Fresher    Mandatory Skills-Experience in Machine Learning based methods for Computer Vision.Experience in VLSIEducational  Qualification: B.Tech/BE/MS/MCA/M.Tech in CS/IT (from premier engineering  institutes like IIT, DTU, NIT etc.)Interview  Procedure : Online Test (Technical + Aptitude)  1-2 Technical round of discussions (Skype) HR Discussion (Skype)  Job  Location : Noida Sector-9 Working  days: Monday  to Friday, Normal day shift Job Description     Should have the capability to understand    the design and implementation of existing software product.    Should have the capability to design and    implement an extensible architecture for technology product features.    Design, implement and deliver new features    required in the product as per deadlines.    Should have interest in Innovation and    creating new concepts and algorithms by acquiring in-depth knowledge about    the subject.    Applying innovation and creativity in    design and implementation of features.    Resolve issues observed during testing and    usage of the product.    Document code consistently throughout the    development process, perform thorough testing and take ownership.    Follow the processes defined by the project    manager and the organization.    Candidate should be self-driven, motivated,    innovative, good team player and open to feedbackRequired Candidate profileRequired Skill Set     C++ programming, Data    Structures, Algorithms, has good Software Design and Architecture Skills.    C++, Windows or Linux/Unix Platform (C++    must)    Should have very good Analytical skills.     Mandatory-  Experience in Machine Learning based methods    for Computer Vision. Experience in VLSIExperience in designing and    developing algorithms for Image/Video processing, Computer Vision,    Pattern Recognition. Good Mathematical background to understand and design new concepts.  Educational Qualification B.Tech/BE/MS/ M.Tech in CS/IT/EE preferably from premier engineering    institutes like IIT, DTU, NIT etc.", "ROLE": "Fresher", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Embedded, EDA, VLSI, ASIC, Chip Design", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Othe", "EDUCATION": {"UG": "Graduation Not Required, Any Graduate in Any Specialization", "PG": "Post Graduation Not Required, Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required, Any Doctorate in Any Specialization"}, "KEY SKILL": ["C++", "VLSI", "Data Structures", "Algorithm design", "Machine Learning & VLSI", "Machine Learning"]}