{"JOB DESCRIPTION": "   Provide and develop solutions for complex business process design powered by APIs in direct support of Empower Retirement?s Data and API strategies.  Deliver high quality, efficient and performant APIs taking advantage of standard patterns for consumption by variety of systems in support of internal processes and external partners     In this rapid paced environment, the person must possess a \"can-do\" attitude while demonstrating a strong work ethic     This person should have a strong aptitude to help drive decisions and implement solutions using company selected technology stack engineered on top of open-source and SaaS software deployed on AWS.      The ideal candidate will leverage her/his technical skills with the development organization to be able to prove technical concepts quickly using a variety of tools, methods, & frameworks.        DUTIES / RESPONSIBILITIES / ESSENTIAL FUNCTIONS:       ? 3-6 years developing solutions across multiple architecture domains (application, data, integration, infrastructure and security) involving multiple of the following technologies and architecture styles: APIs,   integration/middleware,   mobile, web technologies, and service-oriented architecture  ? Solid 3-6 year experience with one or more of the following technologies: Java (Spring, SpringBoot), Web Services (JSON/XML), RESTful architectures, AWS API Gateway, Lambda, NodeJS, Python  ? Good understanding of front-end and web frameworks such as React and Angular and how they integrate with APIs and backend services  ? Experienced in modern deployment models using Jenkins and CI/CD pipelines  ? Proficient with source code version control such as   GitHub/GitLab/BitBucket   ? Strong SQL knowledge, RDBMS experience on any recognized database (Postgres, Redshift, Aurora, MySQL, Oracle ?etc.) and exposure to data warehouse principles  ? 1+ year experience on the AWS platform and services and other cloud products  ? Knowledge of modern Software Development Life-Cycle (SDLC) and the agile methodology  ? Excellent verbal skills and ability to influence and build relationships at all levels of the organization (capable of communicating clearly and effectively to with technology team members and internal business partners)  ? Detail oriented, self-starter with strong organizational skills to multitask and ability to work independently or as part of a team  ? Able to work under pressure to meet tight deadlines while remaining professional and courteous  ? Able to keep knowledge up-to-date in the appropriate technical and business related areas  ? Collaborates with colleagues regarding development best practices and/or application issues  ? Advises and works on strategic initiatives to mitigate and/or alleviate core data application issues, including opportunities for process automation  ? Operates independently with some latitude for un-reviewed actions or decisions. Completes other duties as assigned.  ? Demonstrated competency applying architecture frameworks and development methods   EDUCATION:  ? Bachelor?s Degree in Computer Science or related field (Information Systems, Mathematics, Software Engineering)   OTHER PREFERRED QUALIFICATIONS:  ? 3-6 years programming experience in data driven environments  ? Familiar with DevOps principles and practices  ? Comfortable with Linux, UNIX, and Windows based OS  ? 2 years IT in financial or other highly regulated industry  ? Understanding how to secure APIs using standard security frameworks such as OAuth2  ? Preferred work experience using JIRA in Agile or related development methodologies  ? 2 years providing technical support of an enterprise software system in a customer-facing role.  ? Communicate in a friendly and professional manner with customers and colleagues remain calm in stressful situations independently troubleshoot program errors regardless of technology write user-friendly explanations of highly technical functionality  ? Customer Focus: Delivers internal and external customer service excellence. Exhibits listening, patience, empathy, authenticity, pro-activity, and perseverance with external and internal customers. Upholds commitment to delivering optimal solutions, in a timely manner, and balances customer needs with the best interests of the organization. Maintains a positive approach despite challenges, constraints, and/or customer emotions.  ? Collaboration across teams including IT Infrastructure, PMO office, Business, and third-party integrators in reviewing, evaluating, designing and implementing solutions  ? Building Partnerships: Builds collaborative and cooperative relationships; effectively manages conflict. Finds common ground and builds trust with co-workers, managers, partners, and customers through demonstration of inclusiveness and appreciation for diverse backgrounds, cultures, thoughts and experiences. Operates with integrity and communicates respectfully in language, writing, and actions. Shows interest in and supports the success of others; provides encouragement, celebrates wins. Addresses conflict openly and respectfully, addresses through proper channels.   PHYSICAL REQUIREMENTS/WORKING CONDITIONS:  ? The noise level is quiet, but may occasionally be moderate  ? Team coverage extends from 7:00 am to 5:00 pm MT, so employees may be asked to work different hours than their preferred shift when coverage is required.  ? Occasional overtime and weekend work is required. ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Process design", "Unix", "Linux", "XML", "Customer service", "Windows", "Oracle", "Technical support", "SQL", "Python"]}