{"JOB DESCRIPTION": "Roles and Responsibilities                                       Meredith Digital – CMS    Meredith has an exciting opportunity for talented software  engineers to join the team building the next-generation Digital Content  Management platform. This platform provides our editorial teams with many  features including content creation, layouts, social media support, video, and  user generated content for our consumer experiences and is critical to the  business. You will work closely with stakeholders in editorial, business, and  product development to understand requirements, build prototypes, and deliver  world-class products and features.    Responsibilities:   The applicant needs to be a highly motivated, self-directed, enthusiastic person with a sharp mind who works well under pressure and thrives in an atmosphere of rapid and iterative design and development. You must be comfortable working collaboratively with stakeholders and have a strong desire and ability to deliver innovative solutions to complex interaction problems.       Implement advanced editorial  workflows and content editing tools to provide users with a best-in-class  editorial user experience.  Develop robust custom  modules supporting must-have features such as Video, Social, and Affiliate  integrations.  Work with leading-edge  CMS and micro-service technologies with an emphasis on WordPress and WordPress'  Gutenberg.  Participate in code  reviews, dev syncs, whiteboard sessions, and an Agile daily and weekly routine.  Build assertion tests  and custom processes as part of our continuous integration release/deployment  process.  Own production  services, investigate and resolve issues, bottlenecks, and inefficiencies.  Provide thorough and  clear documentation for all services including documentation, screenshots, and  screencasts to assist product and QA in testing/planning features.  Collaborate closely  with other engineers, product, QA team members, and editorial staff to define  innovative ways to improve services and reduce costs.  Participate in  technical mentorship with engineers on the team by performing thorough code  reviews, pairing, team dev sync, and white-boarding workflow sessions.  Work with other teams  across engineering to share and establish best practices.  Be passionate about  code quality and lead by example to produce high quality, complex services, and  applications under tight timelines.                                            Skills & Experience:    Successful candidates will take initiative and ownership of their tasks.  They will possess the following:  Required  Skills:   BTech  or MTech in Computer Science or related field, or equivalent industry  experience.  3+ years' experience  in engineering complex web-based applications.  Highly proficient in at least one JavaScript application  framework (preferably React or Vue).  Demonstrated proficiency with state management using Redux.  Experience with PHP7  and MySQL preferred.  Fluency in HTML and  CSS.  Experience with  NodeJS, Lambda, and AWS.  Experience with  WordPress plugins and the WordPress Admin UI.  Experience writing  tests in PHP and JS.  Experience with object-oriented  design and data modeling.  Strong background  building CMS-based, service-oriented integrations based on the REST/JSON model.    Solid experience  working with source/version control systems such as Git and SVN.  Understanding and  experience working with the Gitflow model and Github.com Pull Requests.  Strong communication,  time management, and analytical/problem-solving skills.  Experience with web  application security considerations.  Ability to translate  user stories into technical tasks.  Ability to estimate  effort effectively.  Good to Have Skills:   Basic knowledge of Command  Line Tools like WP CLI.   Knowledge of enforcing  security through REST calls.   Basic knowledge of writing  Elasticsearch queries a plus.   Ability to work with  WordPress' Gutenberg Block Building.   Basic idea about Headless  WordPress Development.  Working Hours : 11 AM – 8 PM IST Work  Location : RMZ Eco World,  Bengaluru Role  : Individual Contributor", "ROLE": "Software Developer", "INDUSTRY TYPE": "Media, Entertainment, Internet", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Graduation Not Required"}, "KEY SKILL": ["Product Development", "Software Developer", "Software Engineering", "Wordpress", "CMS", "PHP"]}