{"JOB DESCRIPTION": "Roles and ResponsibilitiesDescriptionAbout you:We are seeking an exceedingly talented and creative Software Engineer to join our team. As a Software Engineer you will responsible to develop enterprise-class commercial quality web and mobile applications, design and implementation of new development initiatives, application enhancements, and troubleshooting issues. In addition to working with established requirements, you will contribute creatively to the design process and software development for assigned feature sets. The position will report to the R&D Manager.What you need to succeed: Bachelors’ Degree in Computer Science, Engineering, Math, or related field3 years of experience developing object-oriented software systemsProficiency in Node.js and Type Script.Experience in Go language, Terraform, and RESTful APIs.Experience in working on GitHub.Experience working with Agile and Kanban / Scrum processes and following strong development and testing processes.Experience in working on AWS Serverless computing will be an advantage.Past work experience in a product development companies is a big plus.Why you’ll love working here:You’ll tackle unique challenges and face the unknown often, supported by an amazing team who really want you to succeed.Your growth opportunities are endless. From professional development to job shadowing, we’ll work with you to make your career goals happen.You’ll become part of a greater community. We believe in mentorship, supporting students to explore opportunities in STEM, and many other important causes.You’ll be paid well and enjoy great benefits, onsite gym and other perks to keep your mind and body healthy, paid days off to volunteer in your community, relocation opportunities to our international offices and more.", "ROLE": "Software Developer", "INDUSTRY TYPE": "BPO, Call Centre, ITeS", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.A in Maths, B.Tech/B.E. in Any Specialization, Computers, B.Sc in Maths, Computers, BCA in Computers", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Software Development", "Terraform", "Mobile Applications", "Software Engineering", "Github", "Web Technologies", "Build", "Audit Compliance", "Go", "Node.Js"]}