{"JOB DESCRIPTION": "  Software Engineer - JG4 Software Engineering is responsible for the delivery of software, which may include new development, configuration and installation of third party packages, and software integration efforts.    It may include tasks from every part of the software development lifecycle, including software and website design, development, programming, and software deployment (both the installation and decommissioning of software).    Request is for DevOps engineer to support SDU Program.    Experience supporting DevOps tools and process automation along with cloud infrastructure.    Exposer on Amazon Web Services (AWS) including AWS EC2, VPC, Security Groups, Target Groups, ELB, S3, ECS, ECR, EKS, Cloud Watch.    Automated the process of installation, configuration of the Kubernetes servers and web application servers using Ansible.    Expertise in configure and maintain of Continuous Integration and build tools like Jenkins, GITHUB, Maven and Ant. Extensively worked on Jenkins for continuous integration and Continuous Delivery for End to End automation for all build and deployments.    Experience with shell/batch and Python scripts to automate release/build process and environment maintenance.    Understanding of DevOps processes and agile development, working in Agile environments, especially managing CI/CD processes.    Strong experience with Docker, Kubernetes, AWS, Azure & VSTS Experience with automation/configuration management (e.g. Selenium, Ansible, Chef, ) Broad experience with open source technologies, especially databases including SQL and NoSQL    Demonstrated ability to quickly become familiar with relevant DevOps tools and related technologies  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Process automation", "Maven", "github", "NoSQL", "Configuration management", "Software development life cycle", "Selenium", "Open source", "SQL", "Python"]}