{"JOB DESCRIPTION": " A customer focused, hands-on Java developer, responsible for designing, implementing and delivering state of the art payments solutions for Growth markets of the company. The ideal candidate is an individual with experience building large scale systems engaging across the full software lifecycle, from system design and development of front-end systems components. Business acumen, hands-on technology skills, positive work ethic and a collaborative mindset are key to the success of this role.   The prospective candidate will be an individual contributor working with various cross functional groups (business, product, analytics, user experience design and engineering) and will require admirable collaboration skills . The role would involve building new and emerging payments platforms and experiences for India, and similar hyper growth markets, that would redefine how customers of the company pay and get paid.    Key Responsibilities:     Demonstrate a customer centric mindset as part of day-day work.   Ensure that the design and implementation adheres to defined specs and processes.   Own end-to-end quality of deliverables during all phases of the software development lifecycle.   Understand technical designs by working within the companys cross-functional technology team.   Collaborate between business, product and technology in the process of understanding the requirement and coming up with implementation options   Ability to function effectively in a fast paced environment and manage continuously changing business needs.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Front end", "Software development life cycle", "Manager Technology", "System design", "Customer support", "Software Engineer 3", "User experience design", "Individual Contributor", "Analytics", "Financial services"]}