{"JOB DESCRIPTION": "Lead UX / UI Designer | Senior Product Engineer   With Amphisoft, you can gain a varied experience in different levels of product ideation, product development, product operationalisation, content creation, business management, client interaction, demonstrations, branding, marketting, etc. You get a lot of entrepreneural insights on software product development and business. At a very initial stage in your career you get to interact with a lot of professionals from top management ( C Level executives ). Amphisoft is a very good spring board for a fresher who looks forward to an entrepreneurial venture in the IT product industry.    I have been given a chance to develop my skill set by a variety of responsibilities. I feel like Amphisoft is more of a family rather than a company. The fact that together, we are making a noticeable contribution towards our shared goal really pulls people together. Youre definitely not just a number with a small company and you have more of an opportunity to shine.    I have been a part of Amphisoft for the past two years. Amphisoft is the best place for a fresher to kick start his/her career. Here, the designation is used only on a letter pad , there will be no discrimination based on the experience. Everyone's idea's is taken into account. The way a fresher gets intensively trained is something which I admire. You are let to swim in a sea, without getting drowned. Amphisoft is not just a company, it's a family. I am fortunate to be a part of Amphisoft.    I have been working in Amphisoft for the past 1 year  -  the place where I discovered my Talent. One thing I like about Amphisoft is that the company encourages new ideas. The best place to gain knowledge in different fields.    To me learning and sharing what I learnt, comes first. At Amphisoft I got the opportunity to learn, experience and implement new concepts. Amphisoft has also provided me a platform to share my knowledge and learnings with everyone else.    I am working in Amphisoft for past 10 months. I joined Amphisoft as an Intern and now I am a full time employee. The work atmosphere and guidance offered by Seniors and Team Leads is excellent. As a fresher, that too from a non - cs background ( Mechatronics ) I was able to gain more knowledge in software development within a very short span of time.    Team Lead | Talent Rank and Talent - Box    Working at Amphisoft has been an exploratory journey where ideas get crystallized as wonderful designs and get developed into products that are market - ready. The whole journey is enabled by a very supportive young enthusiastic team who put their efforts together to achieve the target. The coordial work environment with a very supportive team creates a delightful work experience that you look forward to everyday!!    Senior Product Engineer | Team Lead  -  E - Box Online Services    I have been working with Amphisoft for more than five years. There's a lot of scope for a fresher to learn and work in cutting - edge technologies. An individual can learn to play multiple roles in a short span and gain a lot of knowledge and exposure. There's a lot of space and flexibility to switch teams and even roles at any point in your career. The company values individual skills and talents.    More than a company, Amphisoft is like second family to me. When I feel settled it gives me challenges, when I feel tired it gives support. Although the journey has been rough and steep, it has led to a rapid growth both professionally and personally. During my tenure with Amphisoft I have learnt to mingle and deal with a diverse set of people. This has helped me personally and professionally.    Amphisoft is an excellent product based company. I have been with Amphisoft Technologies for more than a year, A very good place to start your career, you can explore new technologies and you will be boosted up to think innovative and implement the same in your projects with friendly environment and good team.    Lead UX / UI Designer | Senior Product Engineer  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["Mechatronics", "Intern", "Software product development", "Business management", "Client interaction", "Spring", "Product Architect", "Fact"]}