{"JOB DESCRIPTION": " About companyCasepoint provides full eDiscovery capabilities through a powerful, secure, cloud-based platform. We are repeatedly chosen by leading law firms and multinational corporations for their largest matters. On an upward trajectory for almost a decade, Casepoint is looking to expand its team globally. Team cooperation, work hard, play hard attitude, open communication, and kindness mark Casepoint’s culture.Number of positions currently vacant: 15Job Description:Software Engineers are the brains behind the design, installation, testing and maintenance and client support of software systems. You do more than play around with code; what you write will likely help the business run more smoothly, or provide better service. Knowledge of programming skills is a prerequisite. However, the particular language you will focus on depends on the requirements of the specific project. The role of the Software Engineer is to build high-quality, innovative and fully performing software that complies with coding standards and technical design.Key job responsibilities:Take ownership of customer issues reported and see problems through to resolutionResearch, diagnose, troubleshoot and identify solutions to resolve customer issues at detail levelDevelop and test module as per requirement and time assignedProvide customer support in shift rotationFollow coding standard of organizationFollow the instructions given by superiorCheck-In/Check-Out code and update status in TFSPrepare technical document for the resolved requestFollow standard procedures for proper escalation of unresolved issues to the appropriate internal teams- Transfer or Share Knowledge within teamProvide customer support in shift rotationDaily activity report to Reporting ManagerAdhere to the procedures of the organizationRequired skills & experience06 months to 5 years experience required. Fresher with good programming skills will be preferred.ASP.NET, MVC, C#, MS SQL ServerJavascript, jQuery, AngularJS, Web APICompensation & culture:Excellent culture produces an excellent product. We value our team members, so we provide a nurturing environment of camaraderie. We recognize talent with competitive compensation and career empowerment.Job Location: Surat", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["C#", "Web Developer", "Dotnet", "SQL Server", "ASP.Net MVC", "JQuery", "SDLC", "Kendo", "Software Development", "Software Engineering", "Javascript", ".Net", "C# Developer", "Windows developer"]}