{"JOB DESCRIPTION": "  What you will do    As a Software Engineer in Machine Learning for Xperi?s Music Metadata engineering team, you will help develop systems to automatically glean insights from Xperi?s vast music data warehouse that are useful to the business and consumers. Specific responsibilities will include:    Implement scalable machine learning models as guided by Data Scientists.   Create robust and manageable pipelines to pull and clean data from various sources, and then use that data to train ML models.   Move these components into production and help support them.     Required Education     Bachelor?s degree or higher (Master?s preferred) in Computer Science, Mathematics, Statistics, Data Science or closely related technical field.     Minimum required skills and experience     Experience developing and delivering machine learning-based product features and/or services.   Experience with machine learning and data analytics tools and libraries such as numpy, pandas, scikit-learn, Jupyter Notebooks and XGBoost.   Experience with machine learning models such as logistic regression, SVMs, random forests and convolutional neural networks (CNNs).   Strong Python programming skills.   Moderate SQL query skills.   Working knowledge of the Linux CLI.   Experience working as a member of a distributed Agile team.     Skills and Experience     Experience with relational databases such as SQL Server.   Basic knowledge of TensorFlow.   Familiarity with message broker and stream processing technologies like Kafka and RabbitMQ.   Familiarity with cloud computing platforms like AWS EC2.     Desired Skills and Experience     C#   Microsoft SQL Server  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Media, Entertainment, Internet", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Computer science", "Cloud computing", "Logistic regression", "metadata", "MS SQL", "Linux", "Neural networks", "Machine learning", "Agile", "Python"]}