{"JOB DESCRIPTION": "ROLEWere looking to add a Software Engineer- I to an already awesome engineering team. You will be responsible for building and maintaining multiple mobile applications in the social media space. You will work in small, cross-functional teams and love delivering value to our customers through shipping code.WHAT YOULL DO ? Develop and unit test high quality code to implement features Perform code reviews and improve code quality by applying solid design principles Exhibit end-to-end ownership of a feature/task/bug Collaborate with the team making sure deliverables are delivered on time and with high quality. Collaborate with team making sure deliverables are delivered on time with high quality Suggest design/code changes to improve Product FeaturesWHAT WE ARE LOOKING FOR ? A Graduate in Computer Science or equivalent degree Experienced in building REST API based Mobile solutions for about of 2 years Ability to design and develop scalable mobile solutions Strong communication skills and ability to collaborate in a multicultural environment Experience with the Android/iOS ecosystem and the libraries available for common tasks - Dependency Injection, Networking, Image Loading, etc.  Understanding of modern architectural patterns such as - MVVM, MVP, VIPER, etc.WHAT WOULD ADD VALUE ? Experience working with React Native framework and Redux Experience with CI/CD for Mobile development using Jenkins or Bamboo Experience of working on a REST APIs based apps Experience with git, pull requests and good software development practices A good understanding of Social media domain Knowledge of practical Agile and ScrumWHY SHOULD YOU JOIN OUR TEAM ?Awesome CulturePerformance DrivenFlexible Working hoursGreat BenefitsHealth, Dental & Visual insuranceGym AllowanceWell stocked PantryCommute and leave allowanceGenerous leave policyCompetitive CompensationAmong the best in industryAnnual bonusEqual employment opportunityOur employment practises ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["Software Development", "Mobile Applications", "Mobile Development", "Software Engineering", "MVP", "Viper", "Rest Api", "React Native", "IOS", "Android"]}