{"JOB DESCRIPTION": "  About The Role     Real-time communications is a particularly challenging space. We are looking for talented engineers who build elegant, scalable software platforms. We re less concerned with GPA, years in industry, or particular technologies and more interested in passion, potential, and perseverance.     At Dialpad, you will solve complex business problems, set technical strategy and deliver solutions with lots of autonomy and opportunity for leadership. You will participate in design meetings, mentor more junior engineers, and be a core part of setting up the company for the next 10 years of growth.     Responsibilities:      Architect and develop scalable systems capable of handling 10x our current traffic     Own the full Software Development Lifecycle for platform components from planning to maintenance     Ensure the platform is responsive and resilient to meet our products high availability needs     Continuously leverage state-of-the-art tools, technology, and techniques to maximize the platform s capability and efficiency     Collaborate closely with internal teams to ensure our Infrastructure is ready to meet their future needs.      Minimum qualifications:      10 years of industry and software development experience     A solid foundation in computer science, with strong competencies in data structures, algorithms, and software design     Ability to quickly learn different technologies and programming languages     Experience using and making code changes to machine orchestration technologies like Ansible, Puppet, Kubernetes, OpenStack, etc is a great to have.      Experience mentoring more junior engineers     Comfortable in a small, intense and high-growth start-up environment     BS, MS, or PhD in Computer Science or related technical discipline (or equivalent)       ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - eCommerce, Internet Technologies", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Computer science", "SAN", "Software design", "orchestration", "Software development life cycle", "Programming", "Data structures", "Healthcare", "openstack", "microsoft"]}