{"JOB DESCRIPTION": "  Purpose Overview    Individual contributor that designs and constructs simple to complex bolt-on functionality or reporting in SAP and simplifies complex designs or integrated solutions.       Responsibilities     Experience with SAP ABAP programming languages.   Excellent Technical skills in Reports, Forms, Interfaces, Conversions, Enhancements, Smart forms and Scripts   Well versed with Object Oriented (OO) concepts of SAP ABAP and ABAP on HANA   KnowledgeExperience on at least any of the niche skills ODATA, Workflow, Adobe Forms and Fiori   Knowledge on HANA Native development (XSA) or ABAP on HANA (with HANA Query Optimization) is added advantage.   Excellent knowledge of ABAP Debugging, SAP Code inspector other SAP standard tools for development   Experience working in few of the following SAP modules (SD, MM, FI, GTS, IS Retail)   Implementation in S4 Project will be added advantage   Experience with all phases of the software development lifecycle   Strong judgement and problem-solving skills   Strong collaboration skills with the ability to build business partnerships.   Strong verbal and written communication skills   Experience developing and implementing highly complex integration with SAP and other business  applications.        Qualifications       Minimum of 2 to 4 years of experience with minimum 1 end to end Implementation project experience   Bachelor's degree in Computer Science or equivalent combination of coursework and experience.   Typically, no direct reports. May lead projects.    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Retail, Wholesale", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Adobe Forms", "query optimization", "Debugging", "GTS", "Software development life cycle", "Programming", "Workflow", "Business applications", "Information technology"]}