{"JOB DESCRIPTION": "    What you'll do   We are looking for Software developers with experience writing code and building a cloud infrastructure to support our scalable cloud service solutions.  As Engineer in the Epsilon IQ product team, you will design, develop, document and test software delivered as part of the Epsilon IQ Cloud Service.  You will be asked to evaluate cloud technologies and implement features using a variety of mostly serverless solutions based on AWS.  Strong written and verbal communication skills (in English) are required to facilitate work across multiple countries and time zones.                What you'll need   To be successful as Software Engineer, you should be able to drive the software change and release management processes, assisting with the overall maturity of the software development lifecycle. Ultimately, a top-notch Software Engineer will ensure that software deliverables comply with quality standards and are completed on time.  Strong object-oriented software development background  Willingness to use any programming language that will achieve the best desired outcome  Most important languages: Java, JavaScript (Node.js / TypeScript), Python, Scala  Extensive experience building APIs or services such as RESTful services  Attention to detail in design, documentation and test coverage of what you build                Preferred Qualifications:   3+ Years of programing experience with bachelor's degree in Computer Science or related field.  Cloud-based development, especially on AWS.  Designing, coding, and debugging software. Improving the performance of existing software.  The ability to multi-task and strategic in planning/designing.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Strategy, Management Consulting Firms", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Quality standards", "Coding", "Debugging", "SCALA", "Software development life cycle", "Infrastructure", "Software Engineer 2", "Release management", "Python"]}