{"JOB DESCRIPTION": " Role :   Lead a small team of Automation QA engineers on their day to day activities.  Work with product owners who are remote to understand and groom requirements/stories.  Participate in test case/test plan creation and reviews.  Ability to work on test/regression strategy for any given release  Work with the various software engineering groups to increase unit and test automation test coverage.  Validate ETL data transformations and Data Ingest process  As part of the scrum / agile team be a gatekeeper for QA.  Participate in root cause analysis and reduce gaps in testing thereby reducing defect leakage to production.  Work with the release engineering team to provide stable automated smoke tests to enable CI / CD.  Maintain and publish QA metrics for product releases.  Define coding standards and framework for test automation.  Participate in Automation code reviews.  Work with the QA team in Maintaining the health of the Manual and automated tests continuously by putting QA best practices in place.  Requirements :   6+ years of demonstrated experience in Software engineering with a focus on quality, working with and mentoring Global teams in QA best practices and test automation best practices.  Experience in developing/testing distributed systems, complex workflows, and user interface.  Strong knowledge of quality assurance, continuous integration, and continuous deployment best practices, and proven experience driving positive change into the development/QA / delivery process.  Proven experience in participating in automation design, implementation, and acceptance.  Proven track record of successfully operating under aggressive time constraints with cross-functional teams.    Ability to work on multiple projects/tasks at once and the organizational skills to balance and prioritize work.      Agile experience as either a member or scrum master.  Excellent written and verbal communication skills  Bachelor's degree in computer science or equivalent or equivalent experience.  Experience in testing and validating Data Ingest and ETL transformations and automating the same. (Python / Data Validation engineers only)  Skill Set   SQL,  Java and Selenium  Jmeter / Loadrunner ", "ROLE": "Software Developer", "INDUSTRY TYPE": "KPO, Research, Analytics", "FUNCTIONAL AREA": "IT Software - QA & Testing", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Sr. Software Development Engineer Quality"]}