{"JOB DESCRIPTION": "Roles and ResponsibilitiesJob Location : Powai (Mumbai)Job description :We are looking for a Sr. Back end web developer/Lead passionate towards building high performance web applications which can scale for B2C businesses. We are looking for self- driven individuals who love to find innovative solutions and can perform under pressure. An eye for details and being proud of produced code are the must have attributes for this job.Responsibilities :- You will be responsible for converting Product team requirements to modular, testable and efficient code.- You will be required to design and implement data storage solutions (Databases, caching layers etc).- You will also be required to cater to NFRs related to security and performance.Skills :- At least 5 years of experience in working on NodeJS/Java/Ruby- Proficiency in RDBMS such as MySQL/PostgreSQL.- Experience of building/deploying applications on AWS is a definite advantage.- Familiarity with some ORM (Object Relational Mapper) libraries like Sequelize is required.- Experience in some NoSQL databases (e.g. DynamoDB/Elasticsearch/Redis Cache etc) is a definite plus.- Good understanding on architectural patterns (e.g. MVC) is required.- Good communication and analytical skills are the basic needs for this role.- An urge to create awesome applications that people will enjoy using is a must.- Other technologies : MySQL, Redis, AWS, Microservices, REST API .- Knowledge of Javascript is preferable.- AWS or some cloud experience.- Should have built web application technology.- Should have understanding of DevOps and Database.- Should have done application performance tuning.Qualification :- Engineering graduates from Tier I or II institutes.- B.E/ B.Tech/ MCA/ ME/ M.TechThis is a once-in-a-lifetime chance to gain tremendous experience watching a organization being built from the ground-up (and subsequently, earn life-changing equity) for an exceptional Backend Web Developer.", "ROLE": "Team Lead/Technical Lead", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "M.Tech in Any Specialization, MCA in Computers", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Java", "RDBMS", "PostgreSQL", "MySQL", "Ruby Programming", "Redis", "Node.js", "ORM", "MVC", "Backend Architecture", "AWS"]}