{"JOB DESCRIPTION": "At AMD, we push the boundaries of what is possible.  We believe in changing the world for the better by driving innovation in high- performance computing, graphics, and visualization technologies building blocks for gaming, immersive platforms, and the data center.  \n\nDeveloping great technology takes more than talent:  it takes amazing people who understand collaboration, respect, and who will go the extra mile to achieve unthinkable results.  It takes people who have the passion and desire to disrupt the status quo, push boundaries, deliver innovation, and change the world.  If you have this type of passion, we invite you to take a look at the opportunities available to come join our team. \n\nKEY RESPONSIBILITIES: \n\nThe ideal candidate will participate in all aspects of the software development life cycle; he or she will be expected to provide full ownership of specific components and drive assignments to completion: \n\n•Design and implement Linux device drivers/  firmware supporting security features like Secure boot HDCP/  Content Protection/  Trusted Execution Environment \n\n•Create novel tools and methodologies to effectively validate hardware and software functionality \n\n•Engage in pre- silicon development activities including emulation/  simulation \n\n•Engage as an team player, interfacing with cross- functional development teams \n\n•Assist in resolution of customer, quality and certification issues \n\n•Actively participate in design reviews and discussions REQUIRED SKILLS AND EXPERIENCE: \n\n•2- 6 years of relevant industry experience \n\n•Experience developing Linux Device Drivers/  Bootloader /  ROM code \n\n•Exposure to applied Cryptography & Security protocols such as AES, DES, RSA will be an added advantage \n\n•Strong analysis and problem solving skills \n\n•Team player with good communication skills #LI- DD1\n\nRequisition Number:  Job Function:  Software Engineering Find similar jobs:  \n\nWe noticed that you are already a member of our Talent Community.  Please enter your password to continue. \n\nrequired field\n\nSign in We noticed you have accounts in our Talent Community \" and Application \" systems.  We take security seriously and need to verify your identity to synchronize your accounts. \n\nAccount Email:  Please follow these steps to synchronize your accounts.  \n\n1.  Reset your password:  The \"reset password \" link will open in a new browser window.  Return to this page to enter your new password. \n\n2.  Enter your NEW password here:  Account Verification 2.  Enter your NEW password here:  Your accounts have been successfully synchronized.  Use your new password when accessing our systems. \n\nAccount Verification You are already a user of this site.  Please sign in. ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Graphics", "Simulation", "Software development life cycle", "Silicon", "high performance computing", "Firmware", "Software Engineer 2", "Cryptography", "Gaming", "Linux device drivers"]}