{"JOB DESCRIPTION": "          Core Job Responsibilities      We are looking for a strong, hands-on Senior Software Engineer with experience working in a small, agile team. We are looking for collaborative and creative associates that thrive in a team environment, creating solutions for challenging customer driven business needs. We are specifically looking for a backend java engineer with some level of experience working with analytics, machine learning, and/or AI. The successful candidate will work to turn analytic requirements into highly scalable and reliable analytic algorithms running on our analytic engine.          Work on the inception phase of projects, including collecting requirements, suggesting methodologies and technologies, and release planning            Active researcher, keeping up with the latest trends in software development               Influence and strengthen agile development culture               Inspire, mentor, and encourage developers to apply industrys best practices.               Design and implement a solid API strategy for internal and external customers.               Design, implement, and support cloud based solutions and applications.                   Key Competencies (Must Have):         Java 8, Spring            Strong database skills (SQL and NoSql)               RESTful web services and API development               Strong Linux background               Strong focus on testing (TDD/BDD, unit tests, mocking frameworks)               One or more of the following               Degree in Mathematics / Analytics               Experience writing analytics in Java, R, and/or Python               Experience with machine learning / AI                  The ideal candidate would also be familiar with one or more of the following:           Building highly scalable / reliable applications            Cloud / AWS               HP Vertica / Columnar DBs               Application Security background               DevOps Knowledge               Full Stack developer               Big data / Analytics background             Minimum Qualifications:           Bachelor s Degree in Engineering, Physics, Mathematics or Computer Science and at least 8 years of developing software using object-oriented design and implementation.     ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Other", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization, B.Tech/B.E. in Production/Industrial", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Object oriented design", "Computer science", "Linux", "Software development", "big data analytics", "Machine learning", "Mathematics", "Application security", "SQL", "Python"]}