{"JOB DESCRIPTION": "About Company:       The Company is a manufacturer of electronic interconnectors.  It sells over 100, 000 products,  including everything from electrical and fiber optic interconnects solutions,  to switches and application tooling.  The Company supplies a variety of industries,  including the telecom,  data com,  computer and peripheral,  automotive,  premise wiring,  industrial,  consumer,  medical and military markets.     About Position: -       Position:  \"Senior Software Engineer      Location:   -Bangalore     Experience: - 1 to 4yrs     Education:        B. E. / B. Tech Degree in Computer Science  (CSE)  /  Electronics & Communication  (ECE)  /  Electrical & Electronic  (EEE)  /  Instrumentation & Control  (ICE)  /  Embedded Systems  (ESE)  Engineering    M. E. / M. Tech Degree in Computer Science  (CSE)  /  Electronics & Communication  (ECE)  /  Electrical & Electronic  (EEE)  /  Instrumentation & Control  (ICE)  /  Embedded Systems  (ESE)  Engineering    Work Experiance:      Minimum 1-4 years of progressive software development experience with a strong understanding of hardware interfacing by using software design.      Job Description:         Design and develop software for RF/ microwave electrical test systems used in the manufacturing of multi-gigabit cable assemblies based on standards such as Ethernet,  Infiniband,  Fibre Channel,  PCIe,  SAS,  SATA,  etc.  Integration of custom designed circuit boards and mechanical fixtures with off-the-shelf test equipment such as digital sampling oscilloscopes,  TDR modules and network analyzers.  Analyze test data using statistical modeling tools and perform root cause analysis of rejected parts.     Job Requiremnets     Develop complex software in C/ C ,  Python,  TCL/ TK,  Visual Basic . net to extend and refine the capabilities of existing test systems across multiple manufacturing regions.  Must coordinate software development activities with various teams,  like product development,  manufacturing,  marketing,  quality,  etc.     Develop software that performs electrical testing of multi-gigabit cable assemblies,  analyze data,  identify critical to quality aspects of product design and manufacturing process,  perform root cause /  corrective action analysis and write reports to summarize findings.     Develop,  modify,  support and maintain ownership of software madules used for product testing and qualification across the product development and manufacturing.     Utilize software engineering tools such as configuration management systems,  build processes,  debuggers in the software development process    Create and execute test plans,  conduct software reviews,  perform system verification and validation,  analyze and resolve failure modes and document results.     Create product and test system documentation,  specifications and work instructions.     Understand,  support,  and contribute to Molex TQM and Quality /  Environmental Management Systems by following approved policies and procedures.     SKILLS & ABILITIES:      Experience with compiled programming languages such as C/ C and VB with the Microsoft . NET framework.     Experience with scripted programming languages such and TCL/ TK and Python.     Demonstrated knowledge and understanding of standard techniques for software verication and valdation.     Ability to apply computer programming concepts to solve complex problems in a variety of programming environments.     Strong verbal and written communication skills that demonstrate the ability to express complex technical concepts clearly and concisely with global teams.     Analytical ability to apply logical reasoning,  test assumptions,  observe results and make corrections    High proficiency using analytical tools such as Microsoft Word,  Excel,  Power Point and others as required.    If interested please send your UPDATED Profile with below mentioned details.    Current CTC:      Expected CTC:    Notice Period:    Reason for Job Change:      With Regards,      Reshmi-HR Recruiter     Aarna HR Solutions     Mob No:  :  990257971", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["product design", "software development", "rf", "product development", "documentation", "switches", "telecom", "instrumentation", "automotive", "fixtures"]}