{"JOB DESCRIPTION": "  Responsibilities:     As a Staff Software Development Engineer in Test, you will be a key member of the product team responsible for product quality. This product team works within the larger platform group to create and maintain the system that allows for access between the users device and secured content. We design and deliver those aspects of the platform that streamline and improve developing and deploying applications and customizations. The team is focused and follows agile methodology for development.   The ideal candidate will be a hands-on craftsman with technology and code. They should be comfortable in a heterogeneous environment that is rapidly evolving and demands quickly mastering new technologies as we integrate these into our platform.     The Role:     Design robust test plans and strategies for features   Creative approaches to debug/isolate bugs and system weaknesses   Performs risk analysis to maximize efficiency   Build and maintain an automated CI build and test pipeline with a goal of continuous delivery   Participate in design and code reviews ensuring accepted design patterns and programming language idioms   Identify needs and process improvements and takes the initiative to implement changes   Design, build, and monitor longevity simulations using test harnesses   Responsible for testing efforts for features   Define, design and drive the end-to-end, integration, automation (API and UI) tests as part of the agile/scrum process for features and products   Interface with customers to understand customer use cases and configs   Execute tests with complex setups, varied data shapes   Monitor product and/or feature-level quality health metrics (testability, test health, test coverage, etc)   Works closely with senior developers, PM, and UX to ensure their features are delivered to meet business and quality requirements   Troubleshoot production issues     Technical Requirements:     Strong Unix/Linux knowledge   At least 7-8 years of programming experience in Java or C with good understanding of data structures, algorithms, Object Oriented fundamentals.   At least 7-8 years of test/automation (client and/or server) experience.    Fluent with at least one scripting language such as TCL/Expect, Ruby, Perl, Python is a plus   Previous web experience a plus; should be willing and able to pick up web programming   Knowledge of revision control software (ex. Git, SVN, Perforce, etc.) and development lifecycle..     Nice to have     These are not must have haves but would be a plus if any of these attributes match    Experience with UI Automation frameworks like Selenium.   L4 networking programming with Asynchronous I/O and TCP/HTTP/SSL protocols.   Working knowledge of SaaS technology and SSO solutions.   Understanding of ciphers, cryptography and security testing.      Behavioral Attributes     Must have a passion for quality and a bias towards speed.   Be a good evangelist for the benefits of test automation.   Must be a motivated self-starter with a quick learning curve.   Must be able to learn and adapt to new technologies quickly.   Ability to communicate effectively - Verbal Written   Team Player: Must be capable of working in team setting. Collaborate with other QA/Dev team members.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Media, Entertainment, Internet", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Other"}, "KEY SKILL": ["Unix", "TCP", "Linux", "Networking", "Data structures", "Perl", "HTTP", "Selenium", "Ruby", "Python"]}