{"JOB DESCRIPTION": " We are looking for a senior    Devops    engineer with 6+ years of professional platform operations experience who enjoys working on challenging problems and is passionate about growing their skills in the pursuit. You need to understand how to support a complex, scalable full stack app on top of at least one popular web framework like Ruby on Rails, Sprint, React JS etc. We are looking for passionate and experienced    Devops engineers who has deep knowledge of K8s deployments of a large scale, complicated application on a public IaaS such as GCP or AWS and worked on    CI / CD automation (Experience in    Buildkite    Concourse preferred) to join our team to enhance and optimize the current continuous integration and deployment infrastructure. You will create, enhance and promote tools and frameworks that will help build, deploy, configure and test releases in a consistent, repeatable and scalable fashion. You will own and operate tools which will directly impact and improve developer productivity. Our goal is to protect the customer experience and deliver outstanding levels of availability with fast turnaround for feature rollouts.    You will have knowledge of SRE practices and principles  . Experience with    Bash scripting, Helm  , Kubernetes/Docker,    Solr,     CloudSQL    and experience in debugging and scaling them, Redis or Memcached,    GCP load balancers    and similar web servers load balancers, operating and maintaining different types of NoSQL databases like Elasticsearch, scripting languages like Golang/Python would be a plus.    Experience monitoring a complex K8s deployment on a public IaaS using tools like Wavefront, Pingdom, New Relic and PagerDuty to adhere to    mentioned SLAs is highly desired. We promote code to our cloud native production environment multiple times a day leveraging continuous integration and deployment. This role will provide opportunities to work across the organization and will be a catalyst for technical and professional growth.      Success in the Role: What are the performance goals over the first 6-9 months you will work toward completing    Good understanding of Production Operations for a SaaS Product: You should be able to acquaint yourself comfortably with existing product code and development    deployment    process involved and is passionate about sharing your knowledge and experiences with a collaborative, balanced team   Ability to    deploy, monitor, automate,    maintain, upgrade, and improve a cloud native application platform: When given a challenge, you research on the same, break them into deliverable parts and further you leverage on available resources to come up with a quality solution   Enable continuous integration / continuous delivery: Code developed on an incremental basis should be promoted to production environment hosted in cloud on a regular basis       What type of work will you be doingWhat assignments, requirements, or skills will you be performing on a regular basis     As part of the Tracker Engineering Team, you will be:     Deploying using K8s and monitoring using Wavefront, Pingdom, New Relic, PagerDuty as well as GCP logs console on monitoring services      Operating and maintaining a platform using GKE, AWS, Docker/Kubernetes,    Helm, Bash Scripting  ,    Solr,    PagerDuty, Google, Cloud SQL   Developing code and deploying them to cloud infrastructure production environment via CI/CD tool like    Buildkite    Concourse is highly preferred   Continuouslyimprove CI/CD pipeline, tools, processes and procedures.    Supporting customers by providing the on-call support,     especially on hard-to-reproduce issues    Supporting a full stack web SaaS application developing using test driven development approach   Using web frameworks like Ruby on Rails, React JS, etc to involve in fixing product issues and enhancing it on a need basis   Understanding how to architect a complex, scalable full stack app   Owns the quality of work and is passionate about providing the best solutions possible for our internal/external customers       What is the leadership like for this roleWhat is the structure and culture of the team like     The hiring manager for this role is Ashok Venkiteswaran, Director, Tanzu Mission Control. His expertise was built through involvement in leading software development test projects across various technology organizations for the past 24 years, the last 8 years working with VMware. His management philosophy is to create a flexible, inclusive work environment that fosters learning where people can achieve their best results and career goals. He does this by hiring a right skilled team, creating a learning work environment promoting good teamwork and a rewarding culture. He provides the best of opportunities for engineers and provides required guidance and mentoring for engineers in his team to grow further in their career. Ashok?s team is made up of self-starters, who have a passion for technology and getting things done. ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["VMware", "Automation", "Postgresql", "MySQL", "Web development", "Debugging", "HTTP", "Analytics", "SQL", "Python"]}