{"JOB DESCRIPTION": "    Job Responsibilities         As a Software Engineer, you will work with a world class team developing and deploying new technologies on a cutting edge network. You will design, develop and deploy new and innovative technology into a service provider network. Viasat s unique position as a service provider and equipment manufacturer allows you to experience the whole life cycle of software development all the way from design to deployment.     You will be a member of the software team that is changing the way the internet is experienced. We are developing web acceleration technologies that enable customers to flip through web pages as quickly as turning pages in a book. Our team members enjoy working closely with each other utilizing an agile development methodology. Priorities can change quickly, but our team members are able to stay ahead of deadlines to delight every one of our customers whether they are internal or external to Via sat. We are searching for candidates who enjoy working with people and have a technical mind that excels when being challenged.     Required Skills:    - 5 to 8 years of software engineering experience in Object Oriented Programming (C/C++, Python, Go or any modern programming language) with strong emphasis on software architecture and design.    - Experience with network programming and concurrent/multithreaded programming.    - Strong hands-on working knowledge of L2/L3 protocols and L4-L7 applications.    - Working experience with Intel DPDK, SRIOV, OVS.    - Demonstrated experience in Networking (TCP/IP, OSPF/BGP), protocol development and troubleshooting expertise.    - Agile and DevOps experience.    - Strong oral and written communication skills.    - Bachelor s degree in Computer Science, Electrical Engineering, or related Engineering Disciplines.    - Up to 10% of travel.     Preferred Skills:    - Experience with telecom / networking / satellite / wireless communications.    - Experience leading a team of engineers.    - Experience building CI/CD pipeline and automated software deployments.    - Experience working in cloud environment.   Additional Requirements and information   Minimum education:   BA/BS or equivalent experience   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Telcom, ISP", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Wireless", "Telecom", "C++", "Networking", "Software Development Manager", "Agile", "Troubleshooting", "Python", "OSPF"]}