{"JOB DESCRIPTION": "  Job description     Expertise in designing and building Native advanced applications for the Android platform Java and Kotlin(primary).   Should have basic knowledge in developing native applications for the iOS platform   Good to have prior experience in releasing Apps to Google Play-Store App-Store   Collaborate with cross-functional teams to define, design, and ship new features.   Should work with outside data sources and APIs.   Excellent in Unit-test code for robustness, including edge cases, usability, and general reliability.   Should be proficient with automated unit test platforms such as Espresso, Appium and Detox   Proficient with consuming google service such as maps, location, Firebase push notifications   Proficient with better optimization for apps and performance improvements   Preference will be provided if worked with WebRTC for audio and video communication, native audio video processing, other cross platform technologies like ReactNative, Flutter, Xamarin   Should be proficient with Agile practices and methodologies and have experience of working in fast paced scrum teams.   Should be proficient to use CI-CD pipelines and should have delivered apps features at a regular cadence of 1 week.   Should be a thorough team player and work with Architects to understand architecture and design and translate in to code. Should also be able to support junior team members in the scrum team.   Should have good analytical and problem solving skills     YOU MUST HAVE      Bachelors degree in Engineering or Computer Science     WE VALUE      Understanding various software development lifecycle   Some relevant experience   Knowledge of software configuration management and change management practices   Diverse and global teaming and collaboration   Effective communicator    Wide degree of creativity and latitude   Individuals who are self-motivated and able to work with little supervision, who consistently take the initiative to get things done, do things before being asked by others or forced to by events.    Ability to consistently make timely decisions even in the face of complexity, balancing systematic analysis with decisiveness.    Can quickly analyze, incorporate and apply new information and concepts.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Production/Industrial, Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Change management", "Software configuration management", "Analytical", "Agile", "Software development life cycle", "Scrum", "Unit testing", "Supervision", "Android"]}