{"JOB DESCRIPTION": "           Your Opportunity    You will participate in building and packaging Informatica software on Hadoop as well as in testing our enterprise software. You must test and critique software components and interfaces in great technical depth, write test frameworks and programs to assure high product quality, and develop advanced test tools that increase productivity and efficiency.         Our Ideal Candidate    This position is suited for a highly energetic and self-driven individual who aspires to achieve challenging goals as part of hisher career objective. We are looking at hiring a Senior Software Development Engineer in Test (SDET) who can test new features, build frameworks, and also build the product binaries across major Hadoop distributions.     Your Responsibilities     You will be responsible for building Informatica binaries for multiple Hadoop distributions   You will be involved in first level bug fixes of Informatica product on hadoop   You will be responsible for designing and automating functional, i18N, concurrency, stresslongevity test plans, test cases based upon requirements and CustomerField use cases   Design automation frameworks.   Participate actively in functional, system and regression testing activities.   Certifying multiple Informatica products like BDM, LDM, IDL across multiple industry leading Hadoop distributions mentioned below,   Cloudera   Hortonworks   MapR   BigInsights   Amazon EMR   Azure HDInsight   Working with internal teams and external customer to better understand use cases and design effective test strategy    Innovating new ideas for automation and tools for overall QA productivity    Collaborates effectively with peer engineers and architects to solve complex problems    Innovating new ideas for automation and tools for overall QA productivity    Working with cross geographical R&D engineering and QA teams    Mentoring junior engineers      Your qualification     4 or more years of relevant professional experience, a portion of which was within an enterprise software company   Knowledge of database internals such as query parsing, processing, and optimizations, developing core scalable parts of a system or server-side multi-threaded development experience is essential   Demonstrated ability to write quality code in Java andor C++   Knowledge of Big Data technologies (including Hadoop) is desired   Proven ability to work well with others in a fast paced, iterative product definition and development environment   Ability to communicate and express thoughts and ideas in a big group   Strong interpersonal and relationship building skills within an organization   Able to work independently with little direct supervision and take initiative; willing to mentor and develop others   Strong analytical problem solving and decision making skills   BSMSMCA in Computer Science           ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "MCA in Computers"}, "KEY SKILL": ["Computer science", "C++", "Automation", "Data management", "Test strategy", "Analytical", "Packaging", "Regression testing", "Informatica", "Test cases"]}