{"JOB DESCRIPTION": "We are looking for a talented Software Engineer II to join our agile development team. As an experienced member, you will participate in all aspects of the software development life cycle: scoping, design, coding, testing, implementation and support. You will help in the development of Eagleview?s scalable micro-services platform and geospatially-aware applications across multiple industries and form-factors. In this role, you must be able to multi-task, quickly adapt to new development environments, learn new systems, create reliable/maintainable code, and find creative and scalable solutions to difficult and complex problems. You take pride and ownership in your work as well as the overall contributions of the team. You must also have the ability to take a system-wide understanding, recognize use of system components and disparate technologies and be able to diagnose and debug components across an entire system. Your ability to communicate clearly and concisely (both written and verbal) is key, as is being a self-starter.         Primary Responsibilities      Design, architect and develop advanced software solutions in a cross functional Agile team supporting multiple projects and initiatives   Collaborate with product owners and/or the business on requirements definition, development of functional specifications, and design   Collaborate on or lead development of technical design and specifications as required   Code, test and document new applications as well as changes to existing system functionality and ensure successful completion   Take on leadership roles as needed  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Media, Entertainment, Internet", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Design Architect", "Coding", "Technical design", "Software Engineer II", "Agile development", "Agile", "Software development life cycle", "Development Lead", "Software solutions", "Testing"]}