{"JOB DESCRIPTION": "We are looking for a talented Senior Software Engineers to join our agile development team. As an experienced member, you will participate in all aspects of the software development life cycle: scoping, design, coding, testing, implementation and support. You will help in the development of highly available, scalable, secure and flexible solutions for our ecommerce platform. In this role, you must be able to multi-task, quickly adapt to new development environments, learn new systems, create reliable/maintainable code, and find creative and scalable solutions to difficult and complex problems. You take pride and ownership in your work as well as the overall contributions of the team. You must also have the ability to take a system-wide understanding, recognize use of system components and disparate technologies and be able to diagnose and debug components across an entire system. Your ability to communicate clearly and concisely (both written and verbal) is also key as is being a self-starter.      PRIMARY RESPONSIBILITIES     Collaborates with PMO and Business on requirements definition and functional specifications and design   Collaborates on or leads development of technical design and specifications as required   Ensures coding, testing and documentation tasks are successfully performed for new application development as well as enhancements to existing system functionality   Supports the QA group in developing and executing test plans and test scripts   Ensures appropriate documentation is produced for client integrations including that of web services   Takes on leadership roles as needed   Codes, tests and documents new applications as well as changes to existing system functionality   Other duties as assigned  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Media, Entertainment, Internet", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["QA", "Web services", "Test scripts", "Coding", "Technical design", "Agile development", "Software development life cycle", "ASP.Net", "Application development", "Testing"]}