{"JOB DESCRIPTION": " HPE StoreOnce product offers efficient backups and recovery of data in a seamless manner. The product works with majority of the backup tools available in the enterprise market. HPE StorOnce has a strong road map and there are several releases planned for customers. The requirement for the offered position is mentioned below-       Designs, develops, troubleshoots and debugs software programs for software enhancements and new products. Develops software including operating systems, compilers, routers, networks, utilities, databases and Internet-related tools. Determines hardware compatibility and/or influences hardware design.        Responsibilities:      Leads multiple project teams of other software systems engineers and internal and outsourced development partners responsible for all stages of design and development for complex products and platforms, including solution design, analysis, coding, testing, and integration.    Manages and expands relationships with internal and outsourced development partners on software systems design and development.    Reviews and evaluates designs and project activities for compliance with systems design and development guidelines and standards; provides tangible feedback to improve product quality and mitigate failure risk.    Provides domain-specific expertise and overall software systems leadership and perspective to cross-organization projects, programs, and activities.    Drives innovation and integration of new technologies into projects and activities in the software systems design organization.    Provides guidance and mentoring to less- experienced staff members.          Education and Experience Required:      Bachelor's or Master's degree in Computer Science, Information Systems, or equivalent.    Typically 6-10 years experience.          Knowledge and Skills:      Extensive experience with multiple software systems design tools and languages.    Excellent analytical and problem solving skills.    Experience in overall architecture of software systems for products and solutions.    Designing and integrating software systems running on multiple platform types into overall architecture.    Evaluating forms and processes for software systems testing and methodology, including writing and execution of test plans, debugging, and testing scripts and tools.    Excellent written and verbal communication skills; mastery in English and local language. Ability to effectively communicate product architectures, design proposals and negotiate options at senior management levels.        Required Skills:-      C, C , Java    System Programming    Strong Linux and OS internals knowledge    Ability to solve complex issues.    Ability to convert customer use cases and implement the same.    Ability to provide inputs towards product architecture and design and owns the same.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Computer science", "Product quality", "Linux", "HP data protector", "Architecture", "Coding", "Analytical", "Debugging", "System programming", "Hardware design"]}