{"JOB DESCRIPTION": "We are looking for Freshers / Experienced - Software Engineers having anyone of the below skill sets for Vizag Location.    Java Developer - Job Description:  Must have Strong development knowledge in Java based web applications. Knowledge in developing interactive, user-friendly applications. Mandatory Skills: Core Java, Jsp & Servlet.   SQL (or) PL/SQL Developer - Job Description:   Expert in SQL or Oracle PL/SQL packages, Procedures and Functions. Design and implementation of data models Performance tuning of the queries, procedures, programs. Concepts like Object types, Bulk Bindings, Collections and table imports/extracts.  C / C++ Developer - Job Description: Designing and developing software applications using C/C++.Working knowledge in MySQL or Oracle SQL or MS SQL.Comprehensive knowledge of data structures, modules, algorithms and object-oriented programming.Knowledge in developing high performing multi-threaded /multi-process components.Actively engage in the development of ground - breaking software to provide quality, high performance delivery.Develop enhancements to existing product line as well as develop new product.Good knowledge in pointers, memory management, linked lists, data structures.   Required Experience, Skills and Qualifications:   Experience : 0-3yrs (Freshers also can apply)  Mandatory Skills : Any - JAVA / PL/SQL / C,C++ Skills  Work Location : Vizag  Qualification : Any Degree Contact HREmail ID : hr.vizag@betamonks.com, hr.chennai@betamonks.com Immediate Joiners can please send your profiles at the mentioned email ID's.Freshers should have completed any course.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["C++", "java", "C", "Database Management System", "Data Structures", "programmer", "software developer", "Oracle", "core java", "plsql", "sql"]}