{"JOB DESCRIPTION": "Senior Software Engineer /  TL-  Backend Development (JAVA) Senior Software Engineer /  TL-  Backend Development (JAVA) | Tech Blog -  Zoomcar WE RE LOOKING FOR A...\n\nSenior Software Engineer /  TL-  Backend Development (JAVA) About Zoomcar: Zoomcar is India's first and largest self- drive car rental service. We're intensely focused on redefining urban mobility through our dynamic car sharing marketplace platform that creates a world class experience for both owners and renters.\n\nB.Tech./  BE -  Computer,  IT,  Electronics only\n\nRequired Skills: \n\n5+ year of web development with any object- oriented language. \n\nStrong understanding of web standards,  front- end web programming,  and modern client-  \n\nGood understanding of data structures and algorithms. \n\nExcellent analytical and problem- solving skills. \n\nExperience with deployments. \n\nBasic sysadmin work (monitoring changes via tail and watch ,  determining server health with top ,  creating symlinks,  restarting services,  etc.). \n\nMySQL or any other RDMS. \n\nExperience in project management,  and documentation Good to Have Skills: \n\n4+ years of experience in using Java/ J2EE tech stacks \n\nExposure to Ruby,  Go,  Rust and Scala will be desirable. \n\nGood understanding of data structures and algorithms. \n\nExcellent analytical and problem solving skills. \n\nAbility to work in a fast paced internet start- up environment. \n\nExperience in technical mentorship/ coaching is highly desirable. \n\nUnderstanding of AI/ ML algorithms is a plus. If your experience is this close to what we re looking for,  please consider applying. Experience comes in many forms skills are transferable,  and passion goes a long way. We know that diversity makes for the best problem- solving and creative thinking,  which is why we re dedicated to adding new perspectives to the team and encourage everyone to apply. Not what you re looking forCheck out these similar roles. Senior Software Engineer Frontend Development Engineering,  Posted: 10 Jul 2018 -  Bangalore\n\nSenior Software Engineer /  TL-  Backend Development (RoR)", "ROLE": "Software Developer", "INDUSTRY TYPE": "Courier, Transportation, Freight , Warehousing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Backend", "Front end", "Project management", "Analytical", "MySQL", "Web development", "SCALA", "Data structures", "Ruby", "Monitoring"]}