{"JOB DESCRIPTION": "Senior Software Engineer Frontend Development | Tech Blog -  Zoomcar WE RE LOOKING FOR A...\n\nSenior Software Engineer Frontend Development About Zoomcar: Zoomcar is India's first and largest self- drive car rental service. We're intensely focused on redefining urban mobility through our dynamic car sharing marketplace platform that creates a world class experience for both owners and renters.\n\nB.Tech./  BE -  Computer,  IT,  Electronics only (Preferably from Premier Institutes)\n\nRequired Skills: \n\n4+ year of web development with any object- oriented language. \n\nStrong understanding of web standards,  front- end web programming,  and modern client- side Engineering. \n\nExcellent analytical and problem solving skills. \n\nStrong expert in Javascript / ES6. \n\nGood understanding of React /  Vuejs /  ReactNative. \n\nExperience in project management,  and documentation Good to Have Skills: \n\nJava /  RoR,  experience. \n\nGood SQL skills. \n\nExperience of importing and manipulating data with SQL scripts. \n\nGood operational knowledge on Unix (Linux). \n\nExperience with database optimization. \n\nExperience with serverless deployments. If your experience is this close to what we re looking for,  please consider applying. Experience comes in many forms skills are transferable,  and passion goes a long way. We know that diversity makes for the best problem- solving and creative thinking,  which is why we re dedicated to adding new perspectives to the team and encourage everyone to apply. Not what you re looking forCheck out these similar roles. Senior Software Engineer /  TL-  Backend Development (JAVA) Engineering,  Posted: 10 Jul 2018 -  Bangalore\n\nSenior Software Engineer /  TL-  Backend Development (RoR)", "ROLE": "Software Developer", "INDUSTRY TYPE": "Courier, Transportation, Freight , Warehousing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Unix", "Backend", "Front end", "Linux", "Project management", "Analytical", "Web development", "Javascript", "Operations", "SQL"]}