{"JOB DESCRIPTION": "  Job Description    This is a growing place and we are looking for a bright and enthusiastic Software Development Engineer Test (SDETI) who is skilled in test, wants to contribute to automation and be part of this exciting new roadmap. We are looking to dramatically increase the scope and scale of our existing solutions and we are also looking at new approaches and technologies to tackle areas where we are just getting started. You will help to kick-start a new chapter and have an enormous opportunity to help implement a strategy fostering a mindset of quality across the organization, all while collaborating with a mix of both business and technical partners. If you are creative, customer focused, have a passion for automation, and would like to try the new technologies, this team is right for you! This is a team where you will have tons of opportunities to build new stuffs for the team and to develop your own career.    As an SDET in this team, you will be responsible for setting the direction for test automation and test methodologies, as well as finding the automation solution to improve the efficiency in testing and testing process. You will design and implement automated testing frameworks to reduce manual testing effort. Your test tools shall be scalable, reliable and fast. Some high-level examples of what we would like to see in a SDET:    SDET should able to perform Test Automation and setting up frameworks on multiple application platforms like Web, Mobile, and Desktop.   Investigate customer problems referred by the technical support team.   Create & manage bug reports and communicate with the team.   Able to build different test scenarios and acceptance tests.   SDET needs to handle technical communications with Partners to understand client s systems or APIs.   SDET also work with deployments teams and resolving any level issues for the system.   SDET should also able to set up, maintain, and operate test automation frameworks.     BASIC QUALIFICATIONS      Education with 5+ year of working experience.   2+ years in SDET/SDE role.   Ability to write quality code in at least one high level language like Java, C# etc. Computer Science fundamentals in OO design, data structure and algorithms. Experience of building test automation frameworks.     PREFERRED QUALIFICATIONS      Passion for automation and quality. Solid knowledge of QA methodology and tools, with Demonstrated QA experience in an SDET or QAE role.   Experience with android/iOS devices test automation, from scoping requirements through actual launch.   Strong organizational skills, demonstrated ability to track multiple tasks in a past pace, highly collaborative, and dynamic work environment.   Demonstrated ability to achieve stretch goals in a highly innovative and fast paced environment.   Excellent communication skills to drive other technical teams, and management to collect requirements, evaluate alternative, develop processes, etc.   Practical experience of professional software engineering practices & best practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Manual testing", "Coding", "Test scenarios", "Software development life cycle", "Management", "Technical support", "Automotive", "Android", "Testing"]}