{"JOB DESCRIPTION": "  Overview:     We are looking for a highly competent lead engineer who can work on developing solutions in the UCaaS (Unified Communications As A Service) domain. The candidate must have in-depth experience in designing and implementing complex Cloud systems and have excellent performance optimization and troubleshooting skills.      Responsibilities:       Analyse the requirements, come up with the design, implement, test and fix post release issues.     Develop and architect features that leverage the latest Cloud technologies     Develop scalable cloud software     Generate new application ideas which enables simple and elegant usability     Track evolving UCaaS applications and technologies and incorporate them as required     Actively participating in product feature and design discussions to help shape products        Requirements:       Candidates must have 5-8 years experience developing software     Excellent programming skills in Golang/Node JS and good exposure to C/C++     Experience with Micro Service, Serverless and other Cloud architecture     Good knowledge of SQL, NoSQL and other database technologies     Exposure to implementing cloud solutions and cloud technologies (GCP, AWS, Azure etc.)     Excellent troubleshooting and problem-solving skills     The successful applicant must be able to work with minimal supervision     Ability for learning quick is a must        Additional Skills :       In depth experience in technologies / Applications used in UCaaS     Exposure to build pipelines and CI/CD       ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Hardware & Networking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["C++", "NoSQL", "Software development", "GCP", "Cloud", "Programming", "Performance optimization", "Troubleshooting", "Unified communications", "SQL"]}