{"JOB DESCRIPTION": " We are looking for   Full Stack software developers   as a key contributor in developing software solutions that supports organization strategy and vision, ensuring alignment between the technical solutions and the business needs. This person will play a role in every part of the software development lifecycle, working with our team to produce high quality, high performing systems that meet our customers needs.      Key responsibilities and duties :       Able to complete a complex software lifecycle: scope, design, code, test and implement     Develop technology components that would integrate with larger SDS (Software Defined Storage) platform and product.     Participate in requirement analysis and definition     Follow established company software development guidelines and procedures     Work with and contribute in a dynamic, distributed team environment.        Requirements :         2 to 2 years of relevant experience     Experience of designing, coding and debugging in Windows, C      Kernel or device driver experience with an understanding of low-level interactions between hardware and software     Experience with Systems Software development over Windows OS     Knowledge / Hands on experience of modern DevOps practices for CI/CD.     Self-starter with extreme comfort in working with geographically dispersed teams     Works effectively with peers, team members and superiors     Strong understanding of White box test principles     Experience with multiple development processes like DDD and TDD     Bachelor degree in Computer Science or engineering equivalent        Preferred skills and experience:      Experience working with products in Storage domain will be a strong plus     Knowledge of Storage related concepts (mirroring, encryption, snapshots, replication, etc.)    Good general working knowledge of the SCSI specification and common transports.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - System Programming", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["SCSI", "Computer science", "Software Developer", "Windows OS", "SDS", "Coding", "TDD", "Debugging", "Software development life cycle", "White box"]}