{"JOB DESCRIPTION": " We are looking for Software Engineers who are motivated and passionate about fixing & diagnosing problems in large bodies of complex code, delivering fixes to customers with rapid turnaround time and high quality. You will be part of our core development team to improve the product based on requirements and defects/issues reported by Support, Customer Success and Field organizations.    Job Duties:      Perform in-depth root cause analysis, implement code fixes to resolve product defects/issues to customers.   Code and Implement improvements requested by customers.   Deep dive into analyzing, troubleshooting and fixing the issues with rapid delivery of the solution.   Collaborate with Team members, Support, Dev, QA and Field teams to diagnose and troubleshoot complex customer issues and orchestrate development and testing of patches/hot-fixes.   You will mentor the team- on writing maintainable code.   Design and implement tools to help support engineers diagnose problems thereby reducing time to resolution.     Requirements:      You bring 8-15 years of experience in developing and troubleshooting large scalable distributed systems written in C/C or Go-Lang or Python.   Strong coding, analytical, debugging and troubleshooting skills including use of tools such GDB,Python Debugger.   Problem-solver who can dive deep to solve complex problems/issues.   Bring good testing methodologies and passion for building quality products.   Experience in developing, sustaining and maintenance of enterprise software.   Looking for great communication skills.   Understanding of hyper-converged storage systems architecture is a big plus.     Education:      BE/B.Tech/M.Tech in Computer Science, Engineering  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Root cause analysis", "Data management", "Coding", "Analytical", "Debugging", "Distribution system", "Enterprise software", "Python", "Testing"]}