{"JOB DESCRIPTION": "  1. Engineering Web   Full time    About the Role    At Hotstar, we have 300 million users and capture close to a billion click stream messages daily. The engineering team at Hotstar is at the centre of the action and is responsible for creating unmatched user experience. Our engineers solve real life complex problems and create compelling experiences for our customers.    We are striving to create the best Video content destination for our consumers on a varied set of devices, from phones to tablets, including devices coming out with bleeding edge of technology. Our web application team is heavily focused on delivering an unmatchable user experience on these devices while our consumers watch the content they love!   The pace of our growth is incredible if you want to tackle hard and interesting problems at scale, and create an impact within an entrepreneurial environment, join us!  Your Key Responsibilities    Work with stakeholders of product to deliver new user - facing features on the website.     Build reusable, high quality code and libraries for future use which can be used across multiple projects.     Ensure the technical feasibility of UI/UX designs and implement them.     Collaborate with other team members, designers and stakeholders to deliver on the features.   What to Bring    A solid grounding in Computer Science fundamentals (based on a Bachelor's or Master's in Computer Science or related field)degree and 4+ years experience as a software developer.     You are an expert JavaScript developer.     Highly enthusiastic and enjoy learning new technologies and frameworks.     You know why a framework is necessary and know any of React, AngularJS etc.     Open source contribution is a plus.     Proficient understanding of code versioning tools Git.     Familiarity with front - end build tools, such as Grunt or Gulp.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Usage", "Front end", "GIT", "Web application", "Focus", "Javascript", "Manager Technology", "Open source", "angularjs"]}