{"JOB DESCRIPTION": " Senior Software Development Engineer  -  Payments & Subscriptions    Bangalore, Karnataka   1. Engineering User and Subscriptions Management   Full time    About the Role      At Hotstar, we have over 300 million+ users and capture close to a billion click stream messages daily. The engineering team at Hotstar is at the centre of the action and is responsible for creating unmatched user experience. Our engineers solve real life complex problems and create compelling experiences for our customers.     In this role, you will be able to build and contribute to payment and subscription eco systems which is one of the tier - 1 services at Hotstar.      The pace of our growth is incredible if you want to tackle hard and interesting problems at scale, and create an impact within an entrepreneurial environment, join us!   Your Key Responsibilities    You will build robust, secure and scalable micro - services to power Hotstar applications     You will be responsible to implement RESTful services with a metric - driven API Gateway     You will take ownership to build scalable, reliable and performant code that complies with our internal code guidelines     You will influence how we build individual features and products, and bring in best practices and patterns that can be used for engineering lifecycle     You will be driving architecture and design discussions and will be responsible to run and maintain good infrastructure   What to Bring    B.Tech/ B.E. in Computer Science from a reputed college or related technical discipline with 4 - 8 years of experience in software development with strong expertise in Java     Experience with reactive programming     Experience in building RESTful APIs with monitoring, fault tolerance and metrics     Exposure to relational and NoSQL databases (Cassandra,Redis, DynamoDB)     Exposure to server - side services using ElasticSearch and ESB  -  Camel, ActiveMQ     Experience in JEE, Spring, Hibernate     Knowledge of AJAX and Javascript/scripting language     Strong experience with AWS Stack  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "activemq", "Hibernate", "NoSQL", "cassandra", "Javascript", "AWS", "Monitoring", "Ajax", "Scripting"]}