{"JOB DESCRIPTION": "   About the Role    At Hotstar, we have over 300 million users and capture close to a billion click stream messages daily. The engineering team at Hotstar is at the centre of the action and is responsible for creating unmatched user experience. Our engineers solve real life complex problems and create compelling experiences for our customers.   We are looking for technical & product - aware engineers who will build best of breed architecture for our platform. Come and be a part of our small, high - performance iOS team which is heavily focused on delivering an unmatchable user delight!   The pace of our growth is incredible if you want to tackle hard and interesting problems at scale, and create an impact within an entrepreneurial environment, join us!  Your Key Responsibilities    Your role will be focused on improving, reworking, and reimagining our mobile application to deliver a high performance system and highly engaging UI     You will be responsible for the delivery of critical business modules while developing optimized & modular code     You will take ownership of end - to - end product quality, from developing to maintaining core app frameworks that help make the apps more reliable and delightful     You will be part of the team that leads prototypes of new ideas and explore new technologies on the forefront of mobile technology   What to Bring    Bachelor degree in Computer Science or related discipline preferred     Expert - level knowledge of iOS development, including technologies like UIKit, Core Animation, Auto Layout and Cocoa Touch     Excellent Swift and Objective - C coding ability along with strong CS & OS fundamentals     Ability to break down complex problems into simple, innovative solutions that serve business need     Knack for problem solving and ability to work in ambiguity     Entrepreneurial spirit, bias for action & ability to work independently  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Product quality", "Mobile technology", "C", "Architecture", "Coding", "Focus", "Animation", "Swift", "ios development"]}