{"JOB DESCRIPTION": "  Job description          What is the Job like   Building highly-scalable and secure payments platform     Primary owners of one or more components of the platform and will drive innovation in your area of ownership     Working with various product teams gathering requirements and adding capabilities      Working with some of the smartest people in the industry and will have ample opportunity to learn and grow     Using cutting-edge cryptography to secure payments beyond industry standards.     Deriving actionable insights by mining TBs of data.     Building low-level infrastructure that aims to push the boundaries of network performance.     Participating actively in recruitment and nurturing of engineers as awesome as you     Review and influence new evolving design, architecture, standards and methods with stability, maintainability and scale in mind     Identify patterns and provide solutions to class of problems     Research, evaluate and socialize new tools, technologies, and techniques to improve the value of the system      Be able to multi-task, prioritize and handle dependencies with minimal oversight    Who should apply   Bachelor s/Master s degree in engineering (computer science, information systems)     4+ years of experience building enterprise systems     Worked on one or more large scale java applications     Good understanding of nuances of distributed systems, scalability, and availability     Good knowledge of one or more relational and NoSQL databases and transactions     Shrewd focus on latency and throughput of services     In-depth understanding of concurrency, synchronization, NIO, memory allocation and GC     Experience with IaaS clouds like AWS/Google Cloud, Azure, OpenStack etc.     Experience in working with Message Brokers and Application Containers     Great ability to mentor and train other team members    Bonus Points    Clear understanding of the CAP theorem and its implications for real-world distributed systems     Call me maybe is more than just a song for you     You have studied distributed systems like Dynamo, HBase, various messaging and queuing systems and understand nuances of Time, Clocks, and Ordering of Events, rate control, load distribution     You can smell fraud, transaction risks and abuse a mile away  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization, B.Tech/B.E. in Production/Industrial", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["IT services", "Mining", "Computer science", "Backend", "Networking", "Travel management", "ISO 27001", "Product design", "Recruitment", "Core banking"]}