{"JOB DESCRIPTION": "Roles and ResponsibilitiesJob ResponsibilitiesIn this role you will be part of our Robotic Process Automation development team as a developer for the Finance Management Systems DevOps Team. This team focuses on identifying processes that meet our pre-defined RPA criteria. Once a process is approved we prioritize it for process mapping and solution design. Your role will include assisting in design, code development and unit testing, code migration support and production support for all live RPA solutions.Required Skills:RPA experience (2 to 3 years)Solid understanding of databases and SQL.- 5+ Years of software development experience with good knowledge of computer science fundamentals.- Experience with UI Path, Alteryx, Automation Anywhere or similar RPA tool.- Experience with Process Analysis, Design, and Implementation, Problem-Solving, Unit and SIT Testing- Strong scripting experience with PowerShell or Python.- Experience leveraging web API’s including REST and SOAP.- Familiarity with JSON, XML and YAML.- Understanding of continuous integration concepts and microservices.- Experience with remote system administration methods.- Ability to produce concise and clear user documentation.- Experience working in teams using Agile methodologies including scrum or Kanban.- Bachelor’s degree in computer science, computer engineering or electrical engineering or equivalent technical background and experience.- Ability to travel up to 10%.Preferred skills:- Knowledge of VB.Net and C# is preferred.- Finance related project experience.Interested in joining our mission?To learn more about this site and other office locations, please click !Additional Requirements and information Minimum education:BA/BS or equivalent experienceYears of experience: 5-8 yearsTravel: Up to 10%Citizenship: Indian Citizenship requiredClearance: NoneWorker Classification: Employee", "ROLE": "Software Developer", "INDUSTRY TYPE": "Telcom, ISP", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Electrical, Computers, B.Sc in Computers, BCA in Computers", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["C#", "Web Api", "Software Development", "VB.NET", "Automation Anywhere", "Web Technologies", "XML", "JSON", "SQL"]}