{"JOB DESCRIPTION": "Job ResponsibilitiesYou will be part of a team that is building a web based platform and is using the latest and greatest advancements in visualization techniques. Our ideal candidate is well-versed in both back-end and front-end web application development. We are looking for someone with a passion for learning new technologies and applying them to build cutting-edge products that will have a positive impact.Required Skills:- 4+ years of experience in general programming and web application development.- Understanding of software development methodologies (Design Patterns, Object-Oriented Programming), standard methodologies, SOA framework (web services, messaging).- Ability to evaluate system designs through analysis, prototyping and simulation.- Ability to build on existing designs and protocols, adding functional and performance improvements.- Proven expertise in Python, JavaScript and CSS3- Good understanding of networks and how network devices are configured, managed and reported on.- Develop and deploy server-side solutions in a Linux environment, client-side solutions using DHTML, XHTML, DOM and ECMA JavaScript.- Experience in industry standard software design methodologies for development and documentation (e.g. Agile Methodologies, XP).- Develop solutions based on XML technologies such as XPath, XSL, XSLT, SOAP and XML-RPC..- Design scalable multi-threaded applications.- Strong debugging skills.- Bachelor’s degree in computer science, computer engineering or electrical engineering or equivalent technical background and experience.- Ability to travel up to 10%.Preferences:- Background in data structures and algorithm design.- Proficient in software development tools, source code control environment- Knowledge on CI/CD, pipeline with Jenkins, Ansible- Understanding on networking, automations, debugging capabilities- Knowledge of chart libraries like D3.js- Understanding of routing, switching, and basic network communication protocolsAdditional Requirements and information Years of experience:4-6 yearsTravel:Up to 10%Citizenship:Indian Citizenship required", "ROLE": "Software Developer", "INDUSTRY TYPE": "Telcom, ISP", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Electrical, Computers, BCA in Computers, B.Sc in Computers", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["DOM", "Software Development Methodologies", "Algorithm Design", "Javascript", "XHTML", "Web Application Development", "Object Oriented Programming", "Software Design", "D3.Js", "Angular"]}