{"JOB DESCRIPTION": "Software Development Engineer II Bangalore   1-6 Years    More Details      Software Development Engineer II Bangalore     Duties and Responsibility    At Avataar.Me we empower marquee digital marketing and commerce leaders globally with our 3D ARAI platform. We receive a high demand for AR experiences from Big Companies around the world. Our aim is to provide good, creative and out of the box ARAI experiences to a large number to our clients. Being an official partner with Facebook & Instagram, its the best and first of its kind AR Platform to bring the marketing and commerce experience of the client to the next level. We have developed a highly efficient innovation-focused platform for our ARAI Experience with 10+ patents on the technology.    At our core ARAI development team we are looking for a highly motivated, quality delivery focused, smart and effective developer in our Bangalore office.     Responsibilities:     Develop AR experience through SparkAR for Facebook & Instagram.    Develop Web-based (JS, WebGL, jQuery) ARVRAI Experience.    Work closely with Senior and Principal Developers to Expand our core Computer Vision & AI platform as a part of our R&D Innovation Team.      Candidate should be having a master s degree in CS EE or equivalent fields.  Need to be highly motivated to works in the field of ARVR     for this position Allowed Type(s): .pdf, .doc, .docx, .rtf I authorize FresherMart.in and their client to contact me for job openings.                     ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer vision", "jQuery", "PDF", "Web technologies", "Software Development Engineer II", "webgl", "Javascript", "PHP", "Digital marketing", "Principal"]}