{"JOB DESCRIPTION": "       The Senior Software Engineer will lead a team of developers, responsible for building new and support existing products and applications. Senior Software Engineer will develop and enhance information systems by studying customer business operations and requirements; designing, developing and installing software solutions; support and develop software team.     Responsibilities     Develop software solutions by studying information needs; conferring with users; studying systems flow, data usage and work processes; investigating problem areas; following the software development lifecycle   Determine operational feasibility by evaluating analysis, problem definition, requirements, solution development and proposed solutions   Document and demonstrate solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code   Deploy solution in customer environment and perform Site System Testing.   Update job knowledge by studying state-of-the-art development tools, programming techniques and computing equipment; participating in educational opportunities; reading professional publications; maintaining personal networks; participating in professional organizations   Protect operations by keeping information confidential Provide information by collecting, analyzing and summarizing development and service issues   First and foremost, developing software our users need   Mentor junior and mid-level engineers   Make informed decisions quickly and taking ownership of services and applications at scale   Work collaboratively with others to achieve goals   Be a persistent, creative problem solver   Remain cool and effective in a crisis   Stay on the leading edge of development practices   Understand business needs and know how to create the tools to manage them.     Skills Required:      Java,   Unix shell scripting,   Web services,   Web Frameworks,   Analytical and problem solving skills ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["System testing", "Software installation", "Software development", "Analytical", "Software development life cycle", "Mentor", "Operations", "Software solutions", "Unix shell scripting", "Business operations"]}