{"JOB DESCRIPTION": " We are developing a state-of-the-art cloud analytics platform that operates on data at massive scale and across hybrid cloud environments. The scale out solution will be designed for speed, storage efficiency and resiliency to support environments heretofore never imagined. You will work with a small but very passionate and motivated team. If you ve always wanted to work on game changing software and not be limited with the baggage from an existing product, this is the position for you.    Roles Responsibilities:     Design and develop a scale-out hybrid cloud data management platform specifically to provide analytics and complex queries     Define data architecture and schema     Define component architecture, evaluate feasibility, develop for quality and robustness     Optimize for performance     Work directly with key customers as required     Requirements     5+ years of hands on experience in designing, developing and maintaining production systems     3+ years of experience developing analytics or query-based solutions     Proficiency with Machine Learning, AI, Big Data, Databases, search and text-based technologies     Excellent ability to create minimalist designs that simply work     Strong experience in debugging and performance optimization for scalability and high availability     Solid grasp of computer science fundamentals and especially data structures, algorithms, multi-threading     Bachelors or higher in computer science or equivalent degree     Strongly Desired     Experience with Elastic Search, Lucene     Experience with non-SQL databases     Background in statistics and performance analysis  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "CA in CA"}, "KEY SKILL": ["Computer science", "Data management", "Software Development Manager", "Cloud", "Debugging", "Machine learning", "Schema", "Data structures", "Analytics", "SQL"]}