{"JOB DESCRIPTION": "                     Your role in helping us shape the future:          Gogo Commercial Aviation, An Intelsat Company has an exciting opportunity for    a Software Engineer. You will help us design and develop       solutions aimed at providing a means to manage and deploy the configuration specifics of aircraft, based on airlines, aircraft deployed technology, fleet and installation requirements. This solution uses a combination of configuration management and cloud-based deployment using AWS which also requires an understanding of network telecom protocols.        Are you up to the challenge         The ideal candidate for this role will be a working member of an engineering team delivering quality technical solutions carrying through from design to deployment. This role requires solid understanding of the design and development process, using CI CD technologies. Your role will be crucial in designing and delivering complex products and solutions across technologies products and tools, improving quality of the code by following coding standardsguidelines, using static code analysers, maximum unit test coverage and automating the test cases.         Can you drive these processes     Develop groundbreaking and distributed solutions with high availability and impact.           Work with the Architects Technical lead Product Owner to understand user requirements, convert BDD scenarios or user stories into product functionality.                Work with the team members collectively to own and deliver features and flexible to take up any type of tasks like develop, automate and test to complete feature.            Perform code reviews and associated engineering quality checks clearly and consistently.     You should definitely have:     Bachelor s degree in Computer Science, Engineering, or related discipline          2 - 5 Years of experience in systems implementations with a focus on both custom application development & commercial systems software implementations            Knowledge and experience in multiple technical disciplines required (development, QA, devops, etc)          2+ years of in-depth development experience with Java C++ C Go.          Experience in CICD and AWS deployments (EC2, SQS, SNS, Lambda, S3, Aurora, DynamoDB)         Advanced knowledge of software development lifecycles; expert knowledge in Agile and Lean methods.         Proponent of DevOps, TDD, AgileXP practices, and CICD pipelines         Ability to work under pressure, prioritize work, coordinate with onsite stakeholders and well organized.       Flexibility in working with technologies and platforms.        A commitment to excellence, best practices, and the continuous improvement of our products, code base, processes, and tools.        It would be nice if you had:    Experience with Scaled Agile Framework (SAFe) work environments               What it s like to work with us:        Intelsat is connecting the world and transforming the satellite landscape by reaching beyond the traditional satellite industry. We are defining new products that will open new, profitable markets. To help us reach this goal, you should be a bold thinker who will perform a key role in shaping Intelsat innovation for years to come.         We emphasize personal and professional growth     Awesome benefits including Leave Benefits, medical and training    Fun, diverse, and inclusive culture       We re Gogo Commercial Aviation, An Intelsat Company. We believe the internet should do everything it does on the ground, in the sky. Our worldwide inflight Wi-Fi services have made internet and video entertainment a regular part of flying. We are a diverse and mission-minded group of professionals all working together in extraordinary harmony. We connect the aviation industry and air travelers with innovative technology and applications, and we do it all in a high-energy environment that welcomes the next challenge. Be prepared to join a performance-obsessed team that is passionate about bringing the internet to every device, every flight, everywhere.         ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Telcom, ISP", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Telecom", "C++", "Bidding", "Aviation", "Coding", "Configuration management", "Agile", "Application development", "Continuous improvement"]}