{"JOB DESCRIPTION": " As a Software Principal Engineer, responsible for the design and development activities associated with methods for validating hardware\\/software systems, and broader solutions. Prepares test and diagnostic programs, designs test fixtures and test tools, and completes validation specifications and procedures for new and changes to existing products. Plans the labor, schedules, equipment, and software required for validating and evaluating their solutions. Uses current product performance information and other means to gauge customer usage to the product development teams.Principal    Role Responsibilities     Responsible for testing UEFI FW and features.   Responsible for all software and UEFI FW related issues during the planning and validation stages of the program. You will be working on next generations products and will have an opportunity to gain experience on best in the world client technologies.   Your responsibilities may include but not be limited to: Understand feature requirements, architecture and design UEFI FW testing, UEFI FW code debugging UEFI FW testing with other server HW and SW platform components, like CPU, PCH, FW, OS etc.   Participates in the software development lifecycle, which includes research, new development, modification, security, correction of errors, reuse, re-engineering and maintenance of software products   Responsible for the delivery of products within budget, schedule and quality guidelines.   Works with the team to develop, maintain, and communicate current validation schedules, timelines and development status.   Manages or utilizes software that is built and implemented as a product, using best-in-class development process\\/lifecycle management (ex: Agile, Waterfall).   Creates technical documentation of software products\\/solutions. Assists with the validation and review of end user and technical end user documentation.   Protects Intellectual property by working appropriate legal elements (ex: procurement, patents, opensource).   Develops and implements plans and tests for product quality or performance assurance.   Be familiar with Window security features   Technical understanding of common security vulnerabilities and risks, as well as countermeasures and compensating controls.\\u00a0  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - System Programming", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Procurement", "Automation", "Assurance", "BIOS", "Diagnostics", "Debugging", "Intellectual property", "Agile", "Software development life cycle", "Technical documentation"]}