{"JOB DESCRIPTION": "Job Description : \n\nAs an Lead Software Development Engineer in SV R&D,  you will have the opportunity to work with an experienced team developing new solutions for core Singleview. \n\nYou will work collaboratively with other company delivery teams in Bangalore and Brisbane. \n\nYou will leverage industry best practices and methodologies such as Agile,  Scrum,  test automation,  Continuous Integration and Continuous Deployment. \n\nResponsibilities \n\nHave a Bachelor s Degree in Computer Science,  Computer Engineering,  or related field. \n\nHave at least 9 years of technical experience in developing commercial/ enterprise level software products. \n\nExperience with modern CRM systems and concepts is favourable. \n\nDemonstrate exceptional programming ability.\n\nExperience with full stack web development is essential. \n\nYou should possess strong knowledge and ability in using JavaScript,  the AngularJS framework,  and the Node.js platform. \n\nAbility in languages like C/ C++,  Java and Perl is also favourable. \n\nHave excellent experience using UNIX/ LINUX environments to develop,  deploy,  and manage applications. \n\nHave excellent analytical and problem solving skills. \n\nExperience gathering and analysing information for the development of effective solutions to problems or situations. \n\nCan solve highest complexity problems quickly.\n\nBe highly effective at communicating and collaborating across multiple teams,  ensuring understanding of both verbal and written material of the highest complexity,  with the ability to lead solutions in a clear and concise manner. \n\nAbility to leverage effective facilitation and negotiation techniques to elicit requirements from a diverse range of stakeholders\n\nExperience with Agile methods and frameworks such as SAFe,  Scrum,  or Kanban is preferred. \n\nProgramming and administration experience with Oracle (or other databases) is favourable. \n\nBe a self- motivated individual who works well in a team environment. \n\n", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Unix", "Computer science", "C++", "Linux", "Analytical", "Web development", "HTML", "Perl", "Oracle", "CRM"]}