{"JOB DESCRIPTION": "     Engineering    SDET Responsible for the development of test automation framework for our mobile applications,  In- depth knowledge of Appium,  Selenium,  Mocha,  Chai,  Protractor or any other test automation framework     Design,  develop and implement the test automation framework from scratch.Interfacing with our mobile developers to maintain the test automation framework.     Involved in all aspects of development and playing an essential role in the design,  planning,  development,  deployment,  scaling and maintenance of our platform.     Work directly with developers and product managers to conceptualize,  build,  test and realize products / features.     Optimize software performance and keep it up to date with the latest industry standards.     Discover,  evaluate and continuously implement new technologies to maximize development efficiency.     Experience in automated testing of mobile devices,  REST APIs and Web.     Expert in Automation Framework and test script development using UI / WebDriver / Selenium scripts     Understanding of the fundamentals of database and SQL programming     Skills to diagnose and solve complex problems and provide detailed technical analysis     Experience in developing test case automation efforts; design,  develop and maintain test automation frameworks     Test experience on Linux or Unix OS,  test experience in white and black box     Understanding of software testing engineering methodology and process expertise     Work experience within a successful agile development team  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Unix", "automation framework", "Linux", "Agile development", "Software Development Manager", "Selenium", "Business solutions", "Information technology", "Testing", "SQL"]}