{"JOB DESCRIPTION": "Roles and Responsibilities  This is a Techno-Managerial role with active contribution and involvement in the course curriculum design, pedagogy, operations and stakeholder management. You'll be leading and growing the team of academic operations and delivery operations professionals. Managing the Operations of Software development programs across our partner universities and locations Ensuring student engagement through active learning techniques, seamless program delivery and thereby achieving customer delight in our program support and program feedback. Ensuring that the curriculum and pedagogy is best suited for our learners by active involvement in curriculum and course design discussions. Designing and managing performance metrics to monitor student progress and potential outcomes. Working with Internal teams: Career Services and Corporate Engagement, New Product Development, Sales, Marketing, Admin and IT team to fulfill the objectives and seamless delivery of the software development programs. Identify key emerging trends in the industry and recommend changes in the curriculum and program design. Planning of on-campus sessions, Faculty schedules, evaluation and grading  Work closely with senior management at Great Learning to execute the company's visionDesired Candidate Profile  Strong understanding of multiple aspects of Computer Science and latest technologies in Full Stack Engineering. Must have a strong undergraduate education, preferably in Computer Science. MBA from a renowned institution Work experience of minimum 4 years in Software development and technologies Must have atleast 1-2 years of managerial role in his/her career Excellent interpersonal, oral and written communication skills. Planning skills, structured thought process and excel skills", "ROLE": "Team Lead/Technical Lead", "INDUSTRY TYPE": "Education, Teaching, Training", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["Application Programming", "Java", "Software Development", "Front End", "FSD", "Django", "Service Delivery", "Javascript", ".Net", "Operations", "Python"]}