{"JOB DESCRIPTION": " We are current looking for a   Principal   Software   Development Engineer - AWS Architecture   to join our Engineering team.    As part of your responsibilities, you will create architectural approaches for software design and implementation in AWS.    You will research new technologies and best practices in AWS. You will be responsible for helping with development of a cloud-based high-performance computing system in AWS which will support the scalability of our internal systems and products optimized for cost efficiency in the cloud. You will help guide our Engineering teams to design and implement parallelizable processes into a highly efficient containerized processing system, using Kubernetes, as well as help identify areas where native AWS services can be utilized within our environment where appropriate.        Our ideal candidate is one who is passionate about their career and has proven success and experience designing and implementing scalable systems in AWS as a software engineer and architect, not a non-coding ivory tower architect. You must be able to work well in a highly collaborative global setting and have the mindset for finding creative and innovative solutions to the complex challenges facing our teams. The person hired will have the opportunity to work closely with our developing technologies, image and geospatial data while developing and maintaining a scalable computing system.       Primary Responsibilities    ? Defines appropriate technology and workflow for coding standards using AWS technologies   ? Foresees and averts problems   ? Provides estimates covering large, complex technical undertakings    ? Collaborates with our engineering leaders and teams    ? Successfully communicates concepts and guidelines to development team   ? Oversees progress of development team to ensure consistency with design   ? Sees the \"big picture\" and creates architectural approaches for software design and implementation to guide the development team while suggesting approaches to minimize cost.   ? Continually build on skills and knowledge for providing future direction and decisions.    ? Oversees progress of development team to ensure consistency with design   ? Provides guidance and coaching to team members   ? Promotes the adoption of best practices   ? Gives and welcomes feedback, builds morale and group commitments to goals and objectives   ? Collaborates with others to determine requirements for new software or applications   ? Works with product managers and customers to interpret, define and validate broad requirements     ", "ROLE": "Technical Architect", "INDUSTRY TYPE": "BPO, Call Centre, ITeS", "FUNCTIONAL AREA": "IT Software - Other", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Architect", "Software design", "Architecture", "Coding", "Manager Technology", "Workflow", "high performance computing", "AWS", "Cost", "Principal"]}