{"JOB DESCRIPTION": " Job Description   We arecurrent looking for a   Principal    Software    Development Engineer AWS Architecture   to join our Engineeringteam. As part of your responsibilities, you will create architectural approaches for software design and implementation in AWS. You will research new technologies and best practices in AWS. Youwill beresponsible forhelping with development ofacloud-based high-performance computing system in AWS which will support the scalability of our internal systemsand products optimized for cost efficiency in the cloud. Youwill help guide our Engineering teams to design and implement parallelizable processes into a highly efficient containerized processing system, using Kubernetes, as well as help identify areas where native AWS services can be utilized within our environment where appropriate.    Ourideal candidate is one who is passionate about their career and has proven success and experience designing and implementing scalable systems in AWS as a software engineer and architect, not a non-coding ivory tower architect. You must be able to work well in a highly collaborative global setting andhave the mindset for finding creative and innovative solutions to the complex challenges facing our teams. The person hired will have the opportunity to work closely with our developing technologies, image and geospatial data while developing and maintaining a scalable computing system.     Primary Responsibilities     Defines appropriate technology and workflow for coding standards using AWS technologies    Foresees and averts problems    Provides estimates covering large, complex technical undertakings    Collaborates with our engineering leaders and teams    Successfully communicates concepts and guidelines to development team    Oversees progress of development team to ensure consistency with design    Sees the \"big picture\" and creates architectural approaches for software design and implementation to guide the development team while suggesting approaches to minimize cost.    Continually build on skills and knowledge for providing future direction and decisions.    Oversees progress of development team to ensure consistency with design    Provides guidance and coaching to team members    Promotes the adoption of best practices    Gives and welcomes feedback, builds morale and group commitments to goals and objectives    Collaborates with others to determine requirements for new software or applications    Works with product managers and customers to interpret, define and validate broad requirements   Skills/Requirements   Skills & Requirements    Able to develop high-level product specification with attention to feasibility and cost    Excellent knowledge of design and architecture in the cloud with an emphasis on AWS    Ability to develop a unified and scalable vision for software development    Understands underlying business problems and able to suggest technical solutions    Strong leadership skills    Highly organized    Outstanding communication and presentation abilities    Professional Experience in developing and maintaining HPC systems    Experience developing using clouds solutions in AWS.    Familiarity withhandling large amounts of data using systems based on databases orlarge-scalefilesystems in S3    Programming experience (C++, Python, Java, GoLang) using good software development practices    Fluency in Linux operating systems    Educational Requirements    BA or BS Degree or MSc, MEng, in computer science/engineering or related field  ", "ROLE": "Technical Architect", "INDUSTRY TYPE": "Media, Entertainment, Internet", "FUNCTIONAL AREA": "IT Software - Other", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Architect", "Software design", "Architecture", "Coding", "Manager Technology", "Workflow", "high performance computing", "AWS", "Cost", "Principal"]}