{"JOB DESCRIPTION": "   Responsibilities          Solve and address any issues in the application fundamentals across areas as we continue to build the next generation capabilities for the Teams Mobile Application for Android and iOS.      Improve the system architecture to scale the mobile development agility.      Be customer obsessed. Understanding and anticipating the needs of our customers in a changing business and technology landscape is critical.      Have a great understanding of mobile applications, deep understanding of the competitive landscape and usage scenarios. Product vision and ability to plan + design various features in stages to reach the end goal in an evolutionary way is critical.      Be a role model engineer. You will be accountable to the design, implementation and delivery of solutions that will directly impact the customer experience and store rating. Doing this in an efficient, maintainable way with emphasis on reliability and product performance as the top concern is a must.      Earn the technical respect of the people on your team. The ideal candidate should be capable of working in the code, supporting partner services and driving deliverable across a v-teams.            Qualifications        14+ years of Software Engineering experience with track record of shipping successful products. Hands on experience with Android or iOS technologies, Java, Kotlin, Dagger, Swift, Objective-C, etc. is required.      Knowledge of end to end Software development life cycle and Android/iOS platform.      Ability to work in large teams and mentor junior developers in the team      Strong knowledge of computer science, algorithms and design patterns      Ability to appreciate complex problems with a thorough design and collaborate with multiple partners on common goals.      A degree in Computer Science or related field, or equivalent industry experience.          ", "ROLE": "Technical Architect", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Mobile", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "System architecture", "mobile architecture", "Software development life cycle", "Customer experience", "Mobile applications", "microsoft", "IOS", "Android"]}