{"JOB DESCRIPTION": "Mid- level Test engineer assigned to test production software on multiple projects of moderate to high complexity and scope from the QA delivery through release. Utilizes knowledge and relevant practical experience and exercises judgment in completing assigned tasks in an efficient and timely manner. Works on projects requiring technical decision making and input to schedules Work with seniors for the soundness of technical judgment and overall accuracy. Coordinates testing efforts and coaches/ mentors more junior team members. BE or equivalent preferred,  with at least 4 years of directly related work experience. Equivalent experience may be substituted for formal education. Responsible for testing of web applications across multiple browsers. Participate and collaborate in design and specification reviews. Ensure comprehensive test coverage and assist in providing testing effort estimates. Identify,  isolate,  interpret,  and report defects,  and work with developers to analyze requirements,  and reproduce problems to get them resolved. Validate fixes. Responsible for developing test cases,  inspecting and conducting test case inspections meetings,  and updating tests Hands- on Test planning,  test design and execution required. Design,  builds,  maintains test environment/ lab systems including application servers,  database servers,  and network infrastructure. Create effective test plans based on user stories,  or other forms of requirements specification. Follow prescribed Agile software development methodologies; recommend and implement improvement to existing test processes,  and procedures Responsible for communicating and providing feedback of technical issues to developers and test leadership. Recommends and drives improvements and changes. Writes effective manual and intermediate automated test cases or automated frameworks. Oversees software defect tracking and regression for assigned projects. Responsible for integrity of technical quality control work on assigned projects and communicates with team to maintain functionality,  and efficacy. Thorough knowledge of release procedures and software defect tracking", "ROLE": "Testing Engineer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - QA & Testing", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["Software development methodologies", "Senior", "Defect tracking", "Test design", "Agile", "Regression", "Test planning", "Test cases", "Manager Quality Control", "Testing"]}