{"JOB DESCRIPTION": "GREETINGS FROM SHINING STARS!!!!YOU ARE SUGGESTED TO GO THROUGH THE POST BEFORE APPLYING FOR THIS PROFILEHIRING LIVE for FULL STACK DEVELOPER PROFILE for students who passed/passing out in 2019/20/21 of Btech in any branch  PAN INDIA for one of the leading IT brands of India.THIS IS A TRAIN AND HIRE AND, PAID PROGRAM WITH 100% GUARANTEED PLACEMENT.!!!!!!GRASP THIS AWESOME OPPORTUNITY!!!!!Job Description :Combine programming languages, tools, and engineering practices to build, test, integrate, package, deploy, and release non-trivial Web apps.Designation Offered: Product Engineer, Full Stack Software Developer, Software Engineer, Software Developer, Java Developer, Back-end DeveloperSalary: Annual salary of INR 5 - 8 Lacs p.a.Eligibility:B. Tech any Branch, passed out in 2019, 2020, and 2021 only60% and above in X and XII60% and above in graduation or equivalent degreeNo standing back papersRecruitment Procedure:Online Aptitude Test( Co-cubes)Programming TestTechnical InterviewAfter getting selected candidates would undergo a training procedure of 22 weeks. The cost of the company would be incurred from the salary of the candidates in 24 months.Candidates who will be selected for this program need to pay 15000+GST as an initial amount to book their seats for this program. After one month students need to pay another 15000+GST as a training fee. The rest amount will be deducted from the salary. Please note that it is a Train and Hire Program.For further details call us@8528883871(Tanya)", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "MCA in Any Specialization"}, "KEY SKILL": ["Application Programming", "Java", "Software Development", "Accuracy", "Software Engineering", "Coding", "Web Technologies", "Problem- solving skills", "Programming"]}