{"JOB DESCRIPTION": " Hello Aspirants,PLEASE GO THROUGH THE POSTING ONCE BEFORE APPLYING FOR THIS PROFILEWe are hiring for one of the CORE TECHNICAL PROFILE for students who passed/passing out in 2019/20/21 of Btech in any branch.With a 100% job guarantee and it is a paid program(2 Lakh + GST ) but you don't need to pay the fees initially it will be deducted from your salary. Only you need to pay 15000+ GST at the time of enrollment and after completing one month of your training you need to pay 15000+GST and the remaining part will be deducted from your salary, all things will be legally done.We are hiring for CORE Technical Profile for students passed out in 2019/20//21 with Btech any Branch from PAN India for one of the Leading IT Brand in India. DON'T MISS OUT THIS OPPORTUNITY.Job Description :Combine programming languages, tools, and engineering practices to build, test, integrate, package, deploy, and release non-trivial Web apps.Designation Offered: Product Engineer, Full Stack Software Developer, Software Engineer, Software Developer, Java Developer, Back-end DeveloperSalary: Annual salary of INR 5 - 8 Lacs p.a.Eligibility:* B. Tech any Branch, passed out in 2019, 2020, and 2021 only* 60% and above in X and XII* 60% and above in graduation or equivalent degree* No standing back papersRecruitment Procedure:* Online Aptitude Test( Co-cubes)* Programming Test* Technical InterviewAfter getting selected candidates would undergo a training procedure of 21 weeks. The cost of the company would be incurred from the salary of the candidates in 24 months.Candidates who will be selected for this program need to pay 15000+GST as an initial amount to book their seats for this program. Please note that it is a Train and Hire Program.For further details call us@7905958718(Ritu)", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "MCA in Any Specialization"}, "KEY SKILL": ["Application Programming", "Java", "Software Development", "Accuracy", "Software Engineering", "Coding", "Web Technologies", "Problem- solving skills", "Programming"]}