{"JOB DESCRIPTION": "  Requirements     As a Software Development Engineer on the Content team, you ll write the complex airline integrations, as well as making TripStack s software solid and scalable. Youll invent novel ways of collecting data from suppliers bypassing any anti-bot systems of the supplier. Youll innovate and influence the direction of the latest TripStack technologies.    A successful candidate will thrive in fast-paced environments that leverage agile planning techniques, encourage and reward creative design and intelligent risk-taking, and find innovative ways to leverage cutting edge technology. And of course, a demonstrated passion for travel doesn t hurt!    We are looking for an Intermediate C# Developer to join our development team. The ideal candidate will be a natural problem solver, detail-oriented and work both Independently and collaboratively in a fast-paced environment     Mandatory skill set:      Masters or Bachelor s in computer science      0 to 4 years of C# experience.      Strong fundamentals in Algorithms, OOPs and Data Structure.      Knowledge/experience with any of the object-oriented language      Knowledge/experience with Javascript / Ajax / JSON, JQuery      Strong troubleshooting and problem-solving skills.      Jump into existing code and debug, develop and integrate HTTP APIs, XML, JSON, etc.      Collaborate with team members in a multi-functional product team.      Preferred skill set:      Candidates joining in 15 days will be preferred.      Knowledge of Mocking and Unit Testing Frameworks.      Agile development experience.      Experience with GCP is a plus      Experience in Selenium or casperjs is a plus      AngularJS, Python, Go working experience is a plus      Experience in a small team handling while working as an individual contributor      Experience with code review tools like SonarQube      Expertise with Chrome debugger      Open to work with shift timings   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["jQuery", "XML", "Javascript", "HTTP", "JSON", "Selenium", "Unit testing", "Troubleshooting", "Ajax", "Python"]}