{"JOB DESCRIPTION": " Job Description      We are looking for a Java Engineer with 0-5 years experience in building high-performing, scalable, enterprise-grade applications.   He/ She will be responsible for Java/Java EE application development and providing expertise in the full software development lifecycle, from concept and design to testing.    Responsibilities:     Participate in software design meetings and write technical design documents.   Development of the product / modules independently.   Responsible for writing unit test, integration test, re-factoring & documentation.   Understand & maintain existing code-base by regular re-factoring and ing requested fixes and features.   Experience of working within a fast-paced Agile development process.   Maintain application stability by monitoring key metrics and improving code base accordingly.   Troubleshoot complex issues discovered in-house as well as in customer environments   Should be flexible to learn new technology / require frameworks.   Conduct feasibility analysis, produce functional and design specifications of proposed new features.   Qualifications       0-5 years of hands on experience in software development.   Should have excellent knowledge of OOPS Concept and experience in Core Java and J2EE (Java, Spring, Hibernate/ MyBatis).   Good to have experience in REST Web Service development.   Good to have knowledge of building web services using Golang.   Should have good knowledge of databases, preferably MySQL and nice to have knowledge of nosql Dbs like mongoDB etc.   Nice to have knowledge and hands on experience of any of scripting languages like Shell Script / PHP / Python.   Should have good knowledge of Data Structures.   Should have experience in JUNIT.   Good knowledge of Unix OS is preferred.   Working experience of tools/technologies like Kubernetes, Jenkins, Maven, GIT , Docker.   Familiarity with UI technologies like HTML, JavaScript and CSS.   Familiarity with Test Driven Development, re-factoring, code reviews, continuous integration/deliver and Agile development practices.   Should have strong written and verbal communication skills.   Should have a Bachelor s degree in Engineering (CS / IT/ EE / E&TC) or Master s degree in Computer Science (MCS / MCA) from well- known Institutes / Universities    #LI-MD1  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Office Equipment, Automation", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Unix", "Maven", "Hibernate", "Core Java", "Software design", "MySQL", "PHP", "Data structures", "Application development", "Python"]}