{"JOB DESCRIPTION": "Company Profile: https://www.pmsec.in/corp-profileJob Description:We are looking for a seasoned Java developer to design, develop and maintain a greenfield product for a  merchant bank. The product has to be developed and be taken to market. Currently you'll be the founding lead developer responsible for the delivery. For UI & IT you'll have to co-ordinate with onsite and offsite developers. Our project entails designing and constructing the APIs and the system architecture for front end consumption. Skills and Qualifications- Previous experience as java developer for 3+ years- In depth knowledge of Core Java, Spring Boot, REST API designing, Design patterns, MultithreadingKnowledge of the following will be considered as an advantage:* Consumer Web Development Experience for High-Traffic, Public Facing web applications* Experience with cloud technologies also a plus* Creating secure RESTful-based web services in XML and JSON, JavaScript, jQuery* Continuous integration (Jenkins/Hudson) and version control (SVN, Git)Job Type: Full-timeExperience:* Previous experience as java developer for 3+ years (Required)Work Remotely:* Yes (With the below listed pre-requisites)* - Availability to be present a mumbai office location once a week atleast is necessary. - Continuous updation of task status, current WIP & day's schedule has to be done on a granular level without exceptions. *-Developers from around Mumbai ie. Pune, Thane etc. can apply and have a flexible work location.JavaCore javaRest APIWeb serviceFull stackAwsLeadArchitectureAdvanced javaSoftware", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["JAVA", "lead developer", "REST API", "Core Java", "Advanced Java", "FULL STACK", "Software Architecture", "Software", "AWS", "Web Development", "Web Services"]}