{"JOB DESCRIPTION": "    About the Role:       The role is based in the Pune RD Center, at SAS RD Pune facility. For this role, you will join the Retail Solutions team. We are looking for a Java developer to help develop the different Retail modules of retail solutions. You will help with plan and design work and take responsibility for large parts of the application. Furthermore, you will be joining a friendly team with a broad range of experience, to develop cloud-based Retail Solutions. As a senior you will also help mentor and develop more junior members of the team.           Essential Technology Experience:        A minimum of 3-7 years of experience in developing web applications     Good logical problem-solving capability, quick and self-learner.      Proficiency in JAVA, Spring, Kubernetes, docker, Design patterns, Gradle, Jenkins,      A minimum of 2 years of experience with web technologies in REST API development, JSON and XML     Experience with Postgres, Oracle databases or other RDBMS and persistent stores     Must be familiar with all phases of the Software Development Life Cycle (SDLC)     Ability to make recommendations based on solid understanding of the problem resolution, troubleshooting or user interactions            Experience of these items would be useful:        Experience with any Cloud environment, Open stack, docker and/or AWS, GCP, Azure     Experience building components designed for reuse with performance in mind.     Experience with Agile software development methodologies     Ability to use Test Driven Development methodologies (Unit test and UMLs)     Experience with multi-tier full stack web application development would be an added advantage. Working knowledge of Web Application Servers or HTML front-end development, Familiarity with Bootstrap, CSS and react.     Demonstrated experience with disciplined unit, regression, and integration testing     Experience of scripting language (python, Perl, shell-scripting) or go/C/C will be helpful.     Familiarity with Open Source Apache projects like Hadoop, Spark would be an added advantage.        Primary Responsibilities        Work Hands-on with the tools to define and implement multi-tier solutions. Should be able to understand the requirements from the product management and should be able to translate them to the product features and design using new technologies to solve the business problem.     Should be able to present the design of and proposed architecture to the stakeholders. Should facilitate the selection of correct technical choices via collaboration and implement for scale, performance and usability.     Should be able to work independently and guide junior developers and peers in the team for those with 3 year?s experience.     Should be able to implement the architecture with the team and solve complex technical issues.      Should be able to improve on processes related to quality of the software development. Should ensure and work closely with the development and testing teams to ensure quality software development.     Work closely with product management to define the future requirements.        Background and Experience        SAS is seeking a seasoned technical professional with an experience of 3-8 years in multiple software technologies and domains.      The candidate should have successful track record of designing and helping implement enterprise class architected solutions with high-performance and scalability.      Candidate should have excellent verbal and written communication skills and ability to address small and large audiences when required.     Experience of working in Global software organizations engaged in provision of large software development. Also, highly desired is experience in high data volume domains like Retail or others.     Experience working in a Service Oriented Architecture and integrating diverse applications is required.      Experience developing for the cloud, SaaS and DevOps is preferred, involving large scale data migrations and handling.     At least 2-3 years? experience in Software Development (REST API Services, JSON/XML and JMS) hands-on development experience.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["JMS", "SAS", "XML", "Shell scripting", "HTML", "Perl", "Oracle", "Apache", "Troubleshooting", "Python"]}