{"JOB DESCRIPTION": "   Job Description   :     We are looking for a strong developer who can work on React Native on the front end to create Android/iOS Apps.  And has a thorough understanding of React Native and its core principles    Job Responsibilities & Duties :     Create Technical Requirements Documentation based on Product Requirement Documents.  Build high-level user interfaces using rapid prototyping methodologies.  Design application frameworks for use across multiple products.  Work with internal technical teams to identify and build platform elements required to support key mobile product features.        Required Job Experience, Skills & Qualification :     6+ years of mobile application development experience  4+ years of experience with React Native  You ll need to have production experience with at least some of our technologies,   frameworks, and languages. Or at a minimum -- similar ones   that will help you learn and start contributing quickly.  Mobile: React Native  Front-end: Javascript (React), Sass, Bootstrap, Foundation  Back-end: PHP 7, Laravel, Beanstalk, Memcached  Testing: XCode Test, JUnit, Espresso, UI Automator, Tape, Enzyme  Database: MariaDB, TokuDB  Version Control: GitHub  CICD: CircleCI  DevOps: ELK (ElasticSearch, LogStash, Kibana), New Relic, Indicative Analytics  Dev Tools: Docker local environment, Rust CLI productivity tools  IDEs: VSCode, PHPStorm  Hosting: Rackspace (dedicated + virtual servers + CDN), AWS (cloud instances + CDN)  Strong proficiency in JavaScript, including DOM manipulation and the JavaScript object model  Experience with popular React workflows (such as Flux or Redux)  Familiarity with RESTful APIs  Experience creating, optimizing, and integrating Application Programming Interface (API)   calls; background in API development preferred.  Agile Communication: Clubhouse, Slack, and Github  Handling large volumes (Terabytes) of data  Creating and scaling web APIs (RESTful, MVC)  Product Design / UX experience  Active Open Source contributions  Languages: Rust, Kotlin, Go  No-SQL databases (Cassandra, MongoDB, RedShift, etc.)  Strong Dev-Ops tools (logging, monitoring, cloud provisioning) chops  Big Data stack (Hadoop, MapReduce, Hive, HBase, Pig)  Data Science, Machine Learning: scikit-learn, Pandas, TensorFlow, Keras, etc  Experience leading/mentoring a team.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Telecom Software", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Front end", "Javascript", "Agile", "PHP", "MVC", "Open source", "Analytics", "Monitoring", "SQL", "Android"]}