{"JOB DESCRIPTION": "IntroductionAs an Application Developer, you will lead IBM into the future by translating system requirements into the design and development of customized systems in an agile environment. The success of IBM is in your hands as you transform vital business needs into code and drive innovation. Your work will power IBM and its clients globally, collaborating and integrating code into enterprise systems. You will have access to the latest education, tools and technology, and a limitless career path with the world’s technology leader. Come to IBM and make a global impact!Your Role and ResponsibilitiesAs a Maximo Developer, you will participate in full software development life cycle including requirements analysis, solution design, software development and testing. You will focus on supporting existing integrations ensuring business processes flow end to end across different systems within any given Maximo solution estate. You will have previous experience with Maximo integrations including understanding troubleshooting and configuration using the Maximo Integration Framework.Responsibilities Gather and effectively translate business requirements (e.g. business case, requirement specifications, non-functional requirement specifications & use case models specific to the Maximo solution) into technical solutionsConduct gap analysis.Develop solution architecture and work with client IT and business teams to build consensus.Create macro & micro designs working with IBM and client development teams.Demonstrate technical acumen to maintain awareness of product enhancements, especially related to vertical specialties and functionalityMaintain awareness of service solutions, upcoming software releases and patches;Participate in Requirements WorkshopsAssist with Solution and Systems DesignDevelop Technical Designs, and developDevelop application framework and establish foundation and standards for code development.Familiarity with multiple operating system platforms, application frameworks and tools would be a definite assetIf you thrive in a dynamic, collaborative workplace, IBM provides an environment where you will be challenged and inspired every single day. And if you relish the freedom to bring creative, thoughtful solutions to the table, there's no limit to what you can accomplish here.#GBSISAICO20Required Technical and Professional ExpertiseMinimum 5+ years of experience as Maximo Developer with Integration expertiseProficient in Software Configurations / automation scripts / workflows along with ReportsExpertise in integrations with Third-Party External Systems using the MIFExperience in Data Conversion, Extensions and Software Quality Assurance TestingProven Experience with Relational Databases and SQL (Oracle, SQL Server, DB2), Java, ESB, ETLRelevant experience with IBM Maximo Asset Management version 7.5 or higherExpertise on Maximo Integration Framework, Maximo Object Structures, Inbound/Out bound integrations, Rules configurations.Experience of Integration setup with External system using JMS and Web services, Rest API.Expertise with Maximo Adaptors for Oracle or SAP and exposure to Integrations.Proficient on Data Flow design, Data Mapping and Functional & Technical Documentations.Experience in Design, Build, Configure & Customize applications to meet business process and application requirementsPreferred Technical and Professional ExpertiseIBM Certifications preferredYou love collaborative environments that use agile methodologies to encourage creative design thinking and find innovative ways to develop with cutting edge technologiesAmbitious individual who can work under their own direction towards agreed targets/goals and with creative approach to workIntuitive individual with an ability to manage change and proven time managementProven interpersonal skills while contributing to team effort by accomplishing related results as neededUp-to-date technical knowledge by attending educational workshops, reviewing publications", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Application Development", "Software Development", "Enterprise Asset Management", "Relational Databases", "Software Quality Assurance", "Technology Consulting", "SQL Server", "Solution Design", "Software Design", "Web Services"]}