{"JOB DESCRIPTION": "IntroductionAs an Application Developer, you will lead IBM into the future by translating system requirements into the design and development of customized systems in an agile environment. The success of IBM is in your hands as you transform vital business needs into code and drive innovation. Your work will power IBM and its clients globally, collaborating and integrating code into enterprise systems. You will have access to the latest education, tools and technology, and a limitless career path with the world’s technology leader. Come to IBM and make a global impact!Your Role and ResponsibilitiesAs a Hybris Developer, you willWork in an Agile environment (with Product Owners, Requirement Managers, Developers, QA) to define requirements and design the solution, depending on the project.Participate in the software design, software development, and package implementation using industry standard platforms of SAP Hybris CommerceInterfaces with system integrators and IT engineers on projects to ensure proper adherence to SDLC and platform integrity.Ensures software developed is held to high quality standards through code and design reviewsBecome an integral part in providing Hybris Solutions to B2B and B2C customersProvide architectural oversight for new implementation projects and support client’s digital transformation programEnsure adoption of best-in-class practices and standards for development, support, quality control and documentationRequired Technical and Professional ExpertiseMinimum 4 to 5 years of experience in IT Industry in the SAP Hybris Commerce.Expertise with 5+ years in Java, Advance Java, Spring Framework, Java ScriptProficient in Hybris Commerce experience with 8+ years’ experience along with Hybris Commerce Implementation ProjectHands-on development experience in Hybris CommercePortfolio of previous work must be presented incorporating UI designs and/or sketches that demonstrate an understanding of wireframing, interaction design, visual design and design best practices.Preferred Technical and Professional ExpertiseProven Soft skills in written and verbalYou love collaborative environments that use agile methodologies to encourage creative design thinking and find innovative ways to develop with cutting edge technologiesAmbitious individual who can work under their own direction towards agreed targets/goals and with creative approach to workIntuitive individual with an ability to manage change and proven time managementProven interpersonal skills while contributing to team effort by accomplishing related results as neededUp-to-date technical knowledge by attending educational workshops, reviewing publications.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - ERP, CRM", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["SAP Hybris", "Java", "Software Development", "Javascript", "Agile", "Spring Framework", "Hybris Commerce"]}