{"JOB DESCRIPTION": "Roles and ResponsibilitiesIntroductionSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do. Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide. At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.Your Role and ResponsibilitiesYou are a Full Stack Application Developer, who will Design, develop and/or re-engineer complex application components, and integrate software packages, programs and reusable objects residing on multiple platformsResponsibilities:Design, develop and/or re-engineer complex application components, and integrate software packages, programs and reusable objects residing on multiple platformsBe responsible for maintenance and improvement of critical IBM internal applicationsPerform application development based on Agile methodologies & participate in requirements / user story analysis, design and executionEmploy and drive a strong Test-Driven Development approach; detect, report, investigate and fix defects in the application.Continually focus on improving the applicationWork effectively in collaboration with other team members, partners and other support functions when requiredRequired Technical and Professional Expertise2+ years’ experience primarily in Scala using Apache Spark, Kafka and SQL preferably in Data Engineering projects with a strong TDD approach. 2+ years’ experience & applied knowledge of Cloud Native development preferably on Kubernetes/ Openshift (Java/Scala).Must possess Strong Database fundamentals and exposure to complex SQLs. (DB2/Oracle/MySQL)Good to have Familiarity in web development with PHP (Laravel/Angular) Understanding of Web Service implementation (RESTful and SOAP)Experience with source control management tools (GitHub, Jira)Preferred Technical and Professional ExpertiseHands on experience with Data Analysis & Querying using SQLs and considerable exposure to ETL processes.Expertise in developing Cloud applications with High Volume Data processing.Worked on building scalable Microservices components using various API development frameworks.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Java", "Software Development", "Web Technologies", "MySQL", "PHP", "Apache", "Laravel", "Web Development", "Angular"]}