{"JOB DESCRIPTION": "      Responsibilities:      Participates as a member of development team. Performs basic analysis of functional or business requirements. Completes code stubs prepared by more senior developers. Participates in code review. Prepares and executes Unit tests. Applies advanced technical knowledge to maintain a technology area (e.g. Database Administration).   May perform solution design. Applies the company and 3rd party technologies to infrastructure and software solutions of moderate complexity. Implements end- user or enterprise infrastructure or services prepared by more senior technologist.   Engineer responsible for the development and operation on multiple software applications.         Education and Experience Required:      Typically a technical Bachelor's degree or equivalent experience and a minimum of 2 years of related experience or a Master's degree and up to two years of experience.         Knowledge and Skills:      2 or more years of experience writing code (such as, and not limited to, Java, C, C , C#, VB.Net; databases like SqlServer/ Oracle. Experience of one or more full release cycles. Basic understanding of modern software development methodologies (Object).   Basic understanding of modern software development tools and SCM (software configuration management).   Basic understanding of Software Test methodologies, test scripting and testing tools.   Understanding of Basic Database Administration.   Good verbal and written communication skills.    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Supply chain", "Software development methodologies", "Testing tools", "Coding", "Software configuration management", "Database administration", "Oracle", "SCM", "Information technology"]}