{"JOB DESCRIPTION": "  The individual will proactively  learn the functionality and feature set of their software product.   The individual should be  capable of fixing bugs and their quality should be of a high standard.  Performing unit and integration  testing that meets the defined quality criteria.  Performing and receiving  software walk through to educate and encourage the team to build high quality  software. Creating a highly cohesive and modular product that ultimately lowers  the cost of adding new functionality to it.   Be aware for current milestones  and deliverables that the Team Leader imparts.   Capable of planning and  estimating the timeframe of deliverables assigned to them.   Responsible for monitoring  their progress in producing any deliverables and report any slippage that has  or may occur in a timely fashion.  Proactively providing advice  and recommendation whilst assisting the Team Leader in interviewing suitable  candidates for joining the team.Required Candidate profile   (6-8)+ years of experience in  developing large scale, multi-tier software applications   Experience with software  development in a Windows environment.   Comfortable with working with  multi-site teams that span multiple time zones.  Back-end C# and .Net development  and will have a strong experience of C# and .Net Framework (or .Net Core) at  the minimum.  Working with RESTful API’s  derived from ASP.NET frameworks.   Working with SOLID principles  applied within past solutions.   Applying Domain Driven Design  (DDD) concepts and Object-Oriented data modelling   Working with Commercial and  Open-Source .NET frameworks such as MSEL, Log4Net, Unity, NInject, MsTest,  NUnit .etc.   Strong Visual C++ commercial  experience   Possess strong SQL skills  preferably using Oracle  Visual Studio 2015 or later  Understanding of XML and  associated technologies such as XSLT & XSD  Windows & MFC Programming  Experience  Microsoft ATL and COM knowledge  Strong written and verbal  interpersonal English Communication skills.  Essential: C#, C++, working in a Windows environment  Desirable: Familiarity with CI/CD processes and DevOps, Docker. Oracle &  Telecom experience  Academic  Criteria: Honours degree and/or Masters, Ph.D in  Computer Science, Electronic Engineering,   Experience  Range (In years):  6-8 + years in development        ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Telcom, ISP", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Any Doctorate in Any Specialization"}, "KEY SKILL": ["C#", "C", "Software development", "Software Engineering", "data structure", "oops", "application programming", "windows", "algorithm"]}