{"JOB DESCRIPTION": "Roles and ResponsibilitiesIntroductionAs an Application Developer, you will lead IBM into the future by translating system requirements into the design and development of customized systems in an agile environment. The success of IBM is in your hands as you transform vital business needs into code and drive innovation. Your work will power IBM and its clients globally, collaborating and integrating code into enterprise systems. You will have access to the latest education, tools and technology, and a limitless career path with the world’s technology leader. Come to IBM and make a global impact!Your Role and ResponsibilitiesYour day in the role will include...You will translate complex functional, technical and business requirements into architectural designs using industry standard methodologies and owns the solution Blue printYou will define standard methodologies in the critical evaluation, selection and/or development of the software components and hardware requirements of applications and data.You will provide architecture services for Adobe Marketing Cloud (AEM/CQ5, Adobe Campaign, Adobe Social etc.)You will come with...Experience on creation and integration of solution using Adobe Marketing CloudYou will use your expertise in application development to evaluate and select development methods, processes, standard methodologies and toolsHow we’ll help you grow...You’ll have access to all the technical and management training courses to grow your expertise.You’ll learn directly from guide developers in the field; our team loves to mentor.You have the opportunity to work in many different areas to identify what really excites you#GBSMP2020INDRequired Technical and Professional ExpertiseMinimum 4+ years in development using DevOps and Agile methodologyValidated documentation and modeling skillsConfirmed software development, design and application architecture skillsIndependent personality who can quickly ramp up, determine plan of actions, resolve issues, and strive towards the goal with minimal assistancePreferred Technical and Professional ExpertiseExperience in application development using Java and AEMExperience of working on Hybris Commerce, Full Stack Java and AEM", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Application Development", "Java", "Software Development", "Application Architecture", "Cq5", "Adobe Marketing Cloud", "Aem", "Technology Consulting", "Adobe Campaign", "Hybris"]}