{"JOB DESCRIPTION": "Roles and ResponsibilitiesIntroductionSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do. Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide. At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.Your Role and ResponsibilitiesWho you are:We are looking for strong Software Developers and Technical Leads to join the IaaS File and Block Storage development team at IBM. The primary focus of this role will be the development, integration, and support of storage systems, using open-source storage technologies, the vendor-exposed APIs, and the internal development platform. In this role, you will be expected to take a primary part of the planning, design, development, testing, and deployment of software solutions and to provide the ongoing support for the File and Block products. In addition to primary software development, automated testing, unit test coverage, and some database design will be a part of the ongoing responsibilities in this role. Resilient, secure, and scalable development is mandatory in this role, as we are responsible for one of the core foundational products in the cloud environment.If you are a motivated engineer who seeks responsibility, thrives when empowered, and understands the importance of personal accountability, then we would like to talk with you. As a member of the File and Block Storage development team, you have the opportunity to directly impact the continued success of the company. We strive to make IBM Cloud Infrastructure Storage a place where you want to be – a place where you are proud to work and where you are motivated to produce the best results possible.What you’ll do:As a Software Developer or a Technical Lead, you will be responsible for development in the cloud infrastructure storage area, implementing and consuming APIs in the cloud infrastructure environment.Responsible for designing and developing storage integrations to enable and support cloud platform business efforts. You will be required to produce code that is secure, scalable, and reliable, supported by unit tests, functional tests, and technical documentation.You will also be required to participate in code reviews for your peers' development work, triage and solve live customer issues, and participate in all scrum activities. Additionally, you will monitor, measure, and improve code and data performance for the application you help to develop. All of this will take place in a strong team environment, which necessitates strong communication.How we’ll help you grow:You’ll have access to all the technical and management training courses to become the expert you want to be.You’ll learn directly from Senior members/leaders in this field.You'll have the opportunity to work with multiple clients.Required Technical and Professional Expertise6-15 years of of delivering code for active Cloud services/projects.Strong programming experience in GoLang/C/Python/Java programming Development.Hands on experience working on KVM, QEMU and System Programming in LinuxExperience with cloud computing technologies such as AWS, VMware, Azure, and/or SoftLayerIntegration experience with enterprise tools and back office systems is a big plusExperience in Docker /Kubernetes programming.Experience working on controllers.Preferred Technical and Professional ExpertiseThe candidate should be passionate about programming and developing new applications with a penchant for high code quality and to learn new industry best practices.The candidate should be passionate about developing highly performant, scalable and resilient cloud native applications.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Network Administration, Security", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Java", "System Programming", "Software Development", "C", "Linux", "Docker", "Qemu", "Watson", "Python", "Kubernetes"]}