{"JOB DESCRIPTION": "Roles and ResponsibilitiesIntroductionAs an Application Developer, you will lead IBM into the future by translating system requirements into the design and development of customized systems in an agile environment. The success of IBM is in your hands as you transform vital business needs into code and drive innovation. Your work will power IBM and its clients globally, collaborating and integrating code into enterprise systems. You will have access to the latest education, tools and technology, and a limitless career path with the world’s technology leader. Come to IBM and make a global impact!Your Role and ResponsibilitiesAs Business Transformation Consultant, you will be trained and mentored to work in development and support projects of ICO practice.Responsibilities:Enterprise Asset Management is an exciting space and @ IBM India, Maximo Asset Management is part of the fast-growing Industry4.0/ Digital Factory journey. We are expanding to serve some of the best global businesses around the world, would like to welcome you to join and be part of this journey to take your career to the pinnacle of Asset Management journey.At IBM India, we are looking to expand our Smart Products & Industry 4.0 team and if you are interested to get trained and grow as an Industrial Software/Embedded/Application Architect or Developer or SME, here is your chance to launch your career. Required Technical and Professional Expertise2 years of experience in development using Java and / or Node JS is mandatorySolid understanding of Software Development Life Cycle (SDLC)Willingness to explore careers in Enterprise Asset Management (Maximo) or Internet of Things (IoT)Familiarity with the Internet of Things Concepts.Hands-on experience on Java 8, JEE, Node JS, CSS3, HTML5, Any RDBMS database (DB2, Postgre, MYSQL, Oracle, etc.) and SQL knowledge, Git.Familiarity with modern back end builds pipelines and tools. Familiarity with code versioning toolsAn intuitive individual with an ability to manage change and proven time managementProven interpersonal skills while contributing to team effort by accomplishing related results as neededPreferred Technical and Professional ExpertiseYou love collaborative environments that use agile methodologies to encourage creative design thinking and find innovative ways to develop with cutting edge technologiesAmbitious individual who can work under their own direction towards agreed targets/goals and with creative approach to workIntuitive individual with an ability to manage change and proven time managementProven interpersonal skills while contributing to team effort by accomplishing related results as needed", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Java", "Software Development", "GIT", "Oracle SQL", "RDBMS", "Html5", "MySQL", "Javascript", "JEE", "Postgres"]}