{"JOB DESCRIPTION": " JOB TITLE : SOFTWARE ENGINEER LOCATION : PUNE, INDIA COMPANY PROFILE:First Insight is a product based software development company based in Portland, Oregon (USA). Our expertise and domain lies in 'Health care' and 'Insurance'. We are a forward thinking, visionary company that provides high-quality software solutions, support, and training to nearly 1,000 ophthalmic practices in the U.S. and Canada. We have carved a niche in the health care industry with our high quality products: e-commerce solutions, practice management software and electronic medical records that are revolutionizing the field of eye care. To know more about us please visit us @ www.first-insight.com Our major software development and technical support happens from the Pune office. To meet our rapidly expanding business growth we need talented assets. 'You donate us your talent and we'll nurture a fine future for you'; that's the FIC principle. We are hiring Software Engineers (MVC Specialist) for our facility in Pune. The details are as under: JOB DESCRIPTION:* Development experience in web based applications is a must. Knowledge in MVC is a must.* Must be a self-starter with good problem solving skills and should be a good 'team player'.* Should have ability to multi-task across multiple projects.* Should be able to complete comparable tasks more quickly.* Experience of the full software development lifecycle: from requirements gathering and functional specification authoring, to development, testing and delivery. * Should be good with developing Websites* Should be able to tackle more complicated/complex problems and provide solutions. * Candidates should have excellent communication skills. Only candidates willing to relocate to Pune need apply. BRUSH UP ON THE FOLLOWING BEFORE INTERVIEW:MVC4/5:Action FiltersReturn typesHtml HelpersRoutingBundling and MinificationModel BinderViewData, ViewBag, TempData.Session ManagementSecurity componentsError Management.Web API:RestVerbsSecurityBenifitsMediatypeformattercontent negotiationsC# /OOPS:Pillars of oops.DelegatesEventsIOCDependency InjectionTPLAsync AwaitInterface and Abstract classDesign Patterns- Good to haveSQL:Stored ProcedureFunction and typesTemp Variable, Table variable, Temp tableJoinsJQuery:AjaxSelectorsAttributesScenario based QuestionsSALARY: Remuneration will be at par with the best industry standards; will not be a constraint for the right candidate.  EXPERIENCE : 2-4 years of core development experience in ASP.Net and MVCSKILLS : ASP.NET, MVC, HTML5, CSS3, Javascript, Jquery, Web API QUALIFICATIONS: BE (Comp)/ MCA / MCS / BCS. Any additional certification like MCP will definitely be an advantage. Interested candidates, please forward your updated resume on akhilac@first-insight.com    -------------------------------------------------------------------", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Other", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["Web Api", "jQuery", "ASP.Net MVC", "Software Development Life Cycle", "Software Engineering", "Html5", "Web Technologies", "OOPS", "Javascript", "Software Solutions"]}