{"JOB DESCRIPTION": " Roles & Responsibilities:We are looking for a Senior Software Engineer -- Java who will be responsible for programming and maintaining business application systems, as well as testing and supporting a diverse range of applications, using newer technology stacks, including cloud services. This position will also be responsible for analyzing systems and coordinating project efforts.Design, code, and test major features, as well as work jointly with other team members to provide complex software enhancements on top of typical database offerings.Hands-on enterprise development using standard technologies like Java and newer cloud-based service technologies (AWS).Full stack responsibilities covering presentation, data and control layers (MVC) as also allied services.Analyze and suggest improvements in the overall development process.Provide technical leadership and coaching to team members as well as solutions to complex software development problems.Conduct code reviews in accordance with team processes/standards.Construct and design documents and documentation to aid in maintenance and code reuse.Interact with key partners and internal users regarding timelines, technical issues, and infrastructure integration.Collaborate with DevOps team to add instrumentation and monitoring to support production environments.Develop strong working relationships with managers and analysts.Analyze data needs and independently develop logical and physical data models.Provide leadership in the design and implementation of databases.Coordinate the implementation of database application components.Understand and work with data in fixed and delimited formats.Perform other miscellaneous duties as assigned by management. Qualifications:5+ years' experience with JAVA/J2EE/Spring/Springboot technologies.3-5+ years' experience with RESTful API/App development using JAVA/nodeJS/reactJS.Bachelor's degree in a technology related area (Computer Science, Engineering, etc.) is required; Master's Degree preferred.Experience with Java application servers and J2EE and Docker containers (Docker, JBOSS and Tomcat). (3 - 5 yrs.)Good knowledge of object-oriented design methodology and standard software design patterns. (5+ yrs.)Must have experience of working in Agile teams. (5 yrs.)Strong technical written and verbal communication in English. (5 yrs.)Experience with HTTP technologies. (5 yrs.)Knowledge of and experience in synchronous and asynchronous patterns of data transport architecture -- specifically RESTful web services, optimization, and messaging / message buses (e.g. Redis/Couchbase, JMS, Mule ESB, etc.). (3 - 5 yrs.)Proven knowledge of Message queues and their interaction with messaging services (IBM MQ, SQS, ActiveMQ, RabbitMQ etc.) (3+ yrs.)Good working knowledge in UNIX/LINUX (3+ yrs.)Experience with logical and physical database design: (3+ yrs.) Oracle, SQL Server, MySQL, object data stores, rich media databases, LDAP, PostgreSQL is a plus.Proven ability to develop systems and web services for data storage and access. (3+ yrs.)Ability to work in a complex, dynamic team environment with minimal supervision and possess good organizational skills. (5 yrs.)Familiarity with cloud service technologies (AWS) -- (2 yrs. hands-on experience preferred.)Hadoop experience a plus.Elasticsearch / ELK stack experience a strong plus.Gateway services (proxies) experience, particularly Azure Gateway service, familiarity a plus.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["Java", "Programming", "AWS", "Software Development", "Enterprise Development", "Software Engineering", "Cloud Services", "Technical Leadership", "MVC", "Devops"]}