{"JOB DESCRIPTION": "  Job Responsibilities     Do you enjoy working with an outstanding team developing and deploying new technologies on a cutting-edge network    You will design, develop and deploy new and innovative technology. Viasat s unique position as a service provider and equipment manufacturer allows you to experience the whole life cycle of software development all the way from design to deployment.    You will be a member of the software team that is involved in the Control plane management of subscriber network entry. It interacts with different network elements both on Access Network towards adapting with L2 Subsystem, CSN Network towards adapting with service network components. Our team enjoys working closely with each other utilizing an agile development methodology.    Priorities can change quickly, but we are able to stay ahead of timelines to delight every one of our customers whether they are internal or external to Via sat. We are searching for candidates who have a technical mind that excels when being challenged.      Required Skills:     5 to 8 years of software engineering experience in Object Oriented Programming (C/C++, Python, Go or any modern programming language) with strong emphasis on software architecture and design.    Experience with network programming and concurrent/multithreaded programming.    Strong hands-on working knowledge of L2/L3 protocols and L4-L7 applications.    Working experience with Intel DPDK, SRIOV, OVS.    Experience in Networking (TCP/IP, OSPF/BGP), protocol development and troubleshooting expertise.    Agile and DevOps experience.    Strong verbal and written communication skills.    Bachelor s degree in Computer Science, Electrical Engineering, or related Engineering Disciplines.    Up to 10% of travel.      Preferred Skills:     Experience with telecom / networking / satellite / wireless communications.    Experience developing a team of engineers.    Experience building CI/CD pipeline and automated software deployments.    Experience working in cloud environment.    Additional Requirements and information     Minimum education:    BA/BS or equivalent experience      ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Telcom, ISP", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization, B.A in Other Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Wireless", "Telecom", "C++", "Networking", "Software Development Manager", "Agile", "Troubleshooting", "Python", "OSPF"]}