{"JOB DESCRIPTION": "  Job Description :        We are looking for an Android developer responsible for the development and maintenance of applications aimed at a vast number of diverse Android devices. Your primary focus will be the development of Android applications and their integration with back-end services. You will be working along-side other engineers and developers working on different layers of the infrastructure. Therefore, commitment to collaborative problem solving, sophisticated design, and creating quality products is essential.     Job Responsibilities Duties :        1. Experience with native Android application development in Java or Kotlin using the Android SDK.  2. Translate designs and wireframes into high quality code  3. Design, build, and maintain high performance, reusable, and reliable Java code  4. Ensure the best possible performance, quality, and responsiveness of the application  5. Identify and correct bottlenecks and fix bugs  6. Help maintain code quality, organization, and automatization       Required Job Experience, Skills Qualification :        1. 4 or more years of relevant work experience  2. Strong knowledge of Android SDK, different versions of Android, and how to deal with different screen sizes  3. Be willing to work on a variety of project types (Desktop, Web, Mobile) and programming languages (JavaScript, C#, Java, Kotlin, Swift, Erlang, Python, etc.) as needed.  4. Familiarity with RESTful APIs to connect Android applications to back-end services  5. Strong knowledge of Android UI design principles, patterns, and best practices  6. Experience with offline storage, threading, and performance tuning  7. Ability to design applications around natural user interfaces, such as touch   8. Familiarity with modern Android development libraries (RxJava, Dagger 2, etc)  9. Experience with Service Oriented Architecture, JSON and XML.  10. Familiarity with web technologies, HTML and web scripting languages  11. Critical thinker with the ability to demystify complex technical requirements.  12. Familiarity with the use of additional sensors, such as gyroscopes and accelerometers  13. Knowledge of the open-source Android ecosystem and the libraries available for common tasks  14. Ability to understand business requirements and translate them into technical requirements  15. Familiarity with cloud message APIs and push notifications  16. A knack for bench-marking and optimization  17. Understanding of Google s Android design principles and interface guidelines  18. Proficient understanding of code versioning tools, such as Git  19. Familiarity with continuous integration  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Mobile", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Performance tuning", "GIT", "XML", "Javascript", "HTML", "JSON", "Android SDK", "Sensors", "Open source", "Python"]}