{"JOB DESCRIPTION": "   Job Description :           We are looking for a senior mobile app developer to lead the design, development and maintenance of Android and iPhone apps.      The developer will lead the entire app lifecycle right from concept stage until delivery and post launch support. In addition to delivering the product the successful candidate will be heavily involved in driving the mobile strategy globally.      Job Responsibilities Duties :     1. Build prototypes at tech scoping stage of projects   2. Working along with web developers to create and maintain a robust framework to support the apps   3. Working with the front end developers to build the interface with focus on usability features   4. Create compelling device specific user interfaces and experiences   5. Standardizing the platform and in some cases apps to deliver across multiple brands with minimal duplication of effort   6. Optimizing performance for the apps   7. Present technical ideas and high-level concepts and solutions to internal and external team members with varying degrees of technical knowledge   8. Interpret requirements to produce a design that conforms to specifications   9. Convert functional requirements into user interface designs and prototypes, and developed application(s)   10. Collaborate with Product, Operations and other Stakeholders to build the applications   11. Understanding of User Experience, to deliver elegant transitions, flows inside the mobile applications   12. Experience Architecting/Developing Secure applications, securing data on the Mobile Phone and with security concepts of SSL, Certificates and Secure Web services.   13. Leading Android, iOS Cross Platform Technical team   14. Exposure to Mobile testing.        Required Job Experience, Skills Qualification :        1. 4 or more years of relevant work experience.   2. Experience in architecting developing Mobile (Android, iOS, React Native) applications.   3. Proven commercial software development experience desktop and mobile   4. Published examples of mobile applications on the App store or the Android market   5. Experience in Architecting Restful APIs to integrate mobile applications to server-side systems.   6. Excellent knowledge in information architecture, human computer interaction and usability design principles   7. A track record of delivering successful consumer and or business products   8. Ability to use analytic data and user testing to inform design decision   9. Experience in Adopting Mobile API Best Practices.   10. A passion for new consumer technology and the emerging media landscape   11. Ability to multi task and good time management skills   12. Ability to work on their own and as a part of the team   13. Excellent scoping and estimation skills   14. Experience in developing solution architecture.   15. Knowledge of performance testing and optimization techniques.   16. Knowledge of recommended design patterns and architectures.   17. Experience with development tools and workflows (modern source control systems, unit testing, continuous workflow, etc.).   18. Development experience (React Native, HTML5/CSS/Java Script, iOS).   19. Strong OO design and programming skills in Objective-C   20. Familiar with iOS SDK (UIKit, Cocoa Touch, Core Data, Core Location, etc)   21. Familiar with xcode   22. Strong OO design and programming skills in Java (J2EE/ J2ME)   23. Familiar with the Android SDK   24. Knowledge of SQLite, MySQL or similar database management system   25. Familiar with Eclipse   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Telecom Software", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Front end", "Eclipse", "MySQL", "SQLite", "Performance testing", "Workflow", "Unit testing", "Android SDK", "IOS", "SSL"]}