{"JOB DESCRIPTION": " Our development department is currently on the lookout for qualified candidates to participate in the development of web & Automation project. We are a group of dynamic and driven individuals. Our team specializes in Microsoft .NET platform, with extensive use of complementary web technologies such as JavaScript, jQuery, Angular, AJAX and ASP.NET, including Database development with MS SQL server.  If you are looking to build a fulfilling career and are confident you have the skills and experience to help us succeed, we want to work with you! Roles and ResponsibilitiesUnderstand the requirements and work closely with Project Manager to deliver the tasksDeliver across the entire app life cycle concept, design, build, deploy, test, release to stores and support.Build prototypes at tech scoping stage of projects.Working with the front-end developers to build the interface with focus on usability features. Optimizing performance for the apps /web.Desired Candidate ProfileQualifications:Education Requirements:  Bachelors degree in any disciplineTo succeed in this position, you must have 1-3 years of Automation using Selenium and Web development experience with .NET, SQL server 2012+, Ajax /j-query/ LINQ, HTML 5.0, ASP.net, bootstrap will be added advantage platform in the following areas.Programming Language(s): C#ASP.NET: Complete understanding and working knowledge using ASP.NETjQuery: Development experience in jQuery concepts and componentsSQL: hand on experience in SQL query and writing Stored procedure and FunctionsAutomation hand on experience: SeleniumCommon:Understanding of other compiled languages Experience of Automation tools using Selenium and C# Experience on web service integration (SOAP, REST, JSON, XML) Experience of development using web technologies Good understanding of OO programming and design patterns Good understanding of HTML5, JavaScriptRecruiter DetailsName: Mohan KumarPhone: +919087978409E-mail: hr@cmpmsglobal.in", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization, B.Tech/B.E. in Computers"}, "KEY SKILL": ["Software Development", "RPA Developer", "C#.Net", "ASP.Net", "IT", "SQL Server", "Information Technology"]}