{"JOB DESCRIPTION": " Do you speak the coding language fluently   Invent Softlabs (India) Private Limited Build something great with Microsoft certified partner.   Software Engineer  -  small Backend small     Job Intro :   We are looking for a passionate Software Engineer to design, develop and install software solutions.   Software Engineer responsibilities include gathering user requirements, defining system functionality and writing code in various languages, like Java, Fullstack development or .NET programming languages (e.g. C#).   Our ideal candidates are familiar with the software development life cycle (SDLC) from preliminary system analysis to tests and deployment.   Ultimately, the role of the Software Engineer is to build high - quality, innovative and fully performing software that complies with coding standards and technical design.     Your Mission :    Determines operational feasibility by evaluating analysis, problem definition, requirements, solution development, and proposed solutions.    Documents and demonstrates solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code.    Developing and directing software system validation and testing methods.    Write well - designed, testable code.    Updates job knowledge by studying state - of - the - art development tools, programming techniques, and computing equipment; participating in educational opportunities; reading professional publications; maintaining personal networks; participating in professional organizations.      You are Supposed to do :    1 - 3 years of experience in C#, MVC and strong in OOPS concepts.    Ability to work as a team member.    Ability to work creatively and analytically in a problem - solving environment.    ing best practices and standard operating procedures.    Creating innovative solutions to meet our company s technical needs.    Willingness to work additional hours as needed.       We like PDF format Resumes. Which is Smaller than 1 MB.   Lets digitally empower your business. Together.   We provide various types of services.   Want to work with us  Let s Talk.   New projects, Consultation or even a coffee.                        ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["Backend", "PDF", "Coding", "Standard operating procedures", "Software development life cycle", "MVC", "microsoft", "System analysis", "Operations", "SDLC"]}