{"JOB DESCRIPTION": "The Delphix team is seeking engineers to join our engineering team. In this position, you will propel innovative new features for data security and delivery. Delphix Masking provides a single platform to secure and deliver data across the enterprise, ensuring that sensitive information is protected and allowing data operators to centrally manage security policies and compliance requirements. Intelligent profiling automatically identifies sensitive data in source systems and algorithmic masking secures the data. Data can be irreversibly masked in accordance with internal standards and privacy regulations such as GDPR, CCPA, and HIPAA. Delphix provides the ability to define and broadly apply a consistent set of masking policies to mitigate privacy and security risks across non-production environments-where the vast majority of sensitive data copies reside.Organizations around the world use our software to protect their sensitive information while rapidly and efficiently provisioning data.Key ResponsibilitiesDesign and implement specific components of the product in the Java programming language.Takes ownership of portions of the product or testing.Find opportunities to integrate data security and data delivery that unlock unique value for our platform Think broadly about the Delphix product by working with engineering teams, product management, sales, and customers to understand requirements and develop solutions Aid the development of teammates and enable others through mentorship and guidanceRequirements2-4 years of experience building and architecting enterprise applications deployed on-prem and/or in the cloudExcellent analytical and problem solving skillsAbility and desire to work in a fast paced, test-driven, agile, collaborative, and iterative programming environmentAbility to think clearly and articulate your vision with the appropriate technical depthA desire to build great products, learn new technical areas, and dive in wherever there is a needBonus if you haveExperience architecting and implementing enterprise Java applications using Apache Tomcat, Pentaho Kettle, and OpenAPI (Swagger)Perks and Benefits Best in Industry", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "MCA in Computers, M.Tech in Computers, Any Specialization", "DOCTORATE": "Any Doctorate in Any Specialization, Doctorate Not Required"}, "KEY SKILL": ["architecting", "java", "software development", "enterprise applications", "JDBC", "agile", "Spring", "apache tomcat", "programming"]}