{"JOB DESCRIPTION": "Senior Software Engineer -  Protocol Stack Development (4G/ IoT/ 5G) Job Description \n\nThe software protocol stack (Stack) team at Azcoms India Development Center owns the design,  development and delivery of the 4G,  IoT and 5G protocol stacks and applications that power Azcoms own products,  such as Centralized Base Band Unit,  Small Cell and Network in Box,  and enable Azcoms global design services customers to reduce time to market. Currently,  we are building Azcoms NB- IoT stack and empowering customers in Australia and India to develop products for tactical and eMTC communications. The team is looking for motivated software developers who can deliver exceptional results.\n\nAs a software engineer on the Stack team,  you will participate in all phases of the software development life cycle and be responsible for delivering high quality,  optimized software components and subsystems for the Access Network and Core Network elements. Senior software engineers are expected to handle technical interactions with Azcoms global customers off- site and on- site.\n\nThe Senior Software Engineers should possess 2- 4 years of software development experience,  preferably in 4G (LTE),  Internet of Things (IoT) or 5G domains.\n\nTechnical Skills Required \n\nStrong in C/ C++,  Data Structures,  Algorithms Strong in real time OS,  networking,  IPC,  multi- threading Proven track record of design,  development and delivery one or more protocol stacks,  e.g. LTE Layer 2,  Layer 3,  NB- IoT,  eMTC,  etc. Project execution in an agile environment Experience of working in state of art software development environment,  including IDE,  development automation tools,  version control and artefact management Behavioural Skills Required \n\nExcellent analytical skills and problem- solving ability Excellent writing and verbal communication skills Please leave this field empty. File Type: doc or docx or pdf and Max File Size: 2MB", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Hardware & Networking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["C++", "Version control", "PDF", "Networking", "Protocol stack", "Agile", "Software development life cycle", "Design development", "Data structures", "core network"]}