{"JOB DESCRIPTION": "Roles and Responsibilities: Design and build advanced applications for the iOS platform. Collaborate with cross-functional teams to define, design, and ship new features in App.Work with outside data sources and API's.Unit-test code for robustness, including edge cases, usability, and general reliability.Work on bug fixing and improving application performance of App.Continuously discover, evaluate, and implement new technologies to maximize development efficiency.Good knowledge of Swift, Objective-C, X-Code.Hands on experience on iPhone SDK - iPhone application architecture and UIMust have worked on Social API integration, Core location APIs, Payment gateway integration, Google Maps, Geo-Location, Map Web Views, Push Notification Service etc.A deep familiarity with Cocoa TouchExperience working with iOS frameworks such as Core Data, Core Animation, Core Graphics and Core TextFamiliarity with RESTful APIs, SDK integration, Firebase, and Analytics platforms.Experience with third-party libraries and APIsWorking knowledge of the general mobile landscape, architectures, trends, and emerging technologiesShould have experience with version control systems Git, SVN etcDesired Candidate Profile  Solid understanding of the full mobile development life cycleCritical thinker and problem-solving skillsTeam playerGood time-management skillsGreat interpersonal and communication skills Have published two or more iOS apps in the app storeB.E. or above - Computer engineering/ Electronics & Communication Engineering or from relevant branch4+ years of experience in iOS App Software DevelopmentWilling to travel (20% of the time)App Development CompanyMust thrive on solving difficult problems", "ROLE": "Software Developer", "INDUSTRY TYPE": "Consumer Electronics, Appliances, Durables", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["Iphone applications", "Software Development", "Ios Developer", "Ios Development", "IOS Platforms", "iPhone SDK", "iOS App Software Development", "Internet of Things", "IOT"]}