{"JOB DESCRIPTION": "    About the Role:       The role is based in the Pune RD Center, at SAS RD Pune facility. For this role, you will be a part of Deployment test team. We are looking for a Test Engineers to help ensure that the deployment experience for the next generation SAS software being developed is flawless and not intricate. You will help with testing the deployment of various SAS software developed for a variety of domains. Furthermore, you will be joining a friendly team with a broad range of experience.           Essential Technology Experience:        At least 1.5 years of working experience administrating Windows or Unix operating systems.     Mandatory knowledge/experience working on Linux/Unix operating system.     Basic understanding of Cloud computing, knowledge of any one Cloud providers like AWS, Google, OpenStack, etc.     Knowledge of programming/Scripting language such as Shell Scripts, Terraform, Python etc. for automation.     Install and administer any of Postgres, Oracle, MySQL, SAS or related DBMS.     Understanding of DevOps process and awareness of Jenkins and CI/CD pipeline.     Independently support / install / configure test environments for multiple projects.     The position requires strong ability to think and act like an end-user administrator who would deploy SAS software.      Bachelor's degree in Engineering, preferably in Computer Science, MCA or related discipline.            Experience of these items would be useful:        Experience with Agile software development methodologies     Flair for automating test and routine processes.         Primary Responsibilities        Validation and Testing of Deployment/Install process of SAS Software on windows and Unix platforms.     Installation/configuration of testing systems for multiple solutions on internal and external cloud infrastructure.     Automation for CI/CD pipeline using Jenkins, shell scripts, Python, etc.      Support of SAS Solutions infrastructure and continuous deployment infrastructure.      Debugging Issues with SAS Solutions.      Participation in meetings/reviews concerning product Install and configurations      Install and administer Postgres, Hadoop, Oracle, MySQL, SAS or related DBMS for testing group.     Administration of system, third party, and SAS software            Background and Experience          SAS is seeking a software testing professional with an experience of 1.5 to 4 years in multiple software technologies and domains.      The candidate should have successful track record of working in testing organizations preferably developing software products for global teams.     Candidate should have excellent verbal and written communication skills and ability to address small and large audiences when required.      Experience of working in Global software organizations engaged in provision of large software development.    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Production/Industrial", "PG": "MCA in Computers"}, "KEY SKILL": ["Unix", "Automation", "Linux", "SAS", "MySQL", "Debugging", "Agile", "Windows", "Oracle", "Python"]}