{"JOB DESCRIPTION": "    About the Role:       The role is based in the Pune RD Center, at SAS RD Pune facility. For this role, you will join the Retail Solutions team. We are looking for a DevOps engineer to help deploy, test, troubleshoot and monitor the different Retail modules of retail solutions. You will help with plan and design the automation work and take responsibility for large parts of the solution automation. Furthermore, you will be joining a friendly team with a broad range of experience, to ensure delivery of quality, scalable cloud-based Retail Solutions. As a senior you will also help mentor and develop more junior members of the team.           Essential Technology Experience:        A minimum of 3-7 years of experience in all facets of software testing in a product-based software development environment     Experience testing n-tier web-based and data-centric solutions and currently with Cloud and DevOps environment.     Proven analytical problem-solving skills, a quick and self-learner who is driven by curiosity.     Experience in RDBMS Database testing and Base SAS is an added advantage     Must be familiar with all phases of the Software Development Life Cycle (SDLC)     Ability to make recommendations based on solid understanding of the problem resolution, troubleshooting deployment and environment and functional interactions            Experience of these items would be useful:        Experience with any Cloud environment, Open stack, docker and/or AWS, GCP, Azure     Excellent teamwork and ability to work closely with remote and local development teams     Bachelor's degree in Engineering, preferably in Computer Science, MCA or related discipline with more than 3 years of experience     Contribute to testing of in-house test automation framework     Ability to documents testing artefacts, Reporting defects in the software     Creating, maintain and running automated test-ware using established practices and tools     Interacts directly with developers/programmers to test program code during development to ensure software quality and functionality     Exposure to JIRA, Jenkins tool desirable     Have working experience of BDD, ATDD and DevOps     Experience of scripting language (python, Perl, shell-scripting) or go/C/C will be helpful.        Primary Responsibilities        Work with a team to review requirements, functional specs, and use-case scenarios, test and report issues for the SAS applications which involves n-tier architecture and includes Java and SAS based components.     Duties will include understanding of the SAS solution and develop Manual and Automation test Suites and execute them on various versions/builds     Have working knowledge of REST API testing using scripting languages.     DevOps - involving deploying, troubleshooting environmental issues.     Assisting in communication of requirements to development; responding to questions     Creating testing scenarios for assigned domain areas     Designing, documenting, executing, and verifying test cases, which may include data integrity, and/or usability     Reporting and documenting software defects and verifying fixes     Interpreting consultant and customer reported problems and assisting in resolution     Performing other duties as assigned.            Background and Experience          SAS is seeking a seasoned technical professional with an experience of 3-7 years in multiple software technologies and domains.      The candidate should have successful track record of being involved with all facets of software testing in a product-based software development environment.      Experience testing software in an n-tier web-based and data-centric architecture.        Candidate should have excellent verbal and written communication skills and ability to address small and large audiences when required.     Experience of working in Global software organizations engaged in development of large software development.        The position requires strong systems thinking ability, integration test expertise, API testing, DevOps, BDD, ATDD, white and gray box testing, security testing, analytical skills, attention to detail and significant experience working with Databases and SQL to verify data accuracy.     Very strong test case/test scenario development and process oriented for ensuring complete test coverage.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Production/Industrial", "PG": "MCA in Computers"}, "KEY SKILL": ["Automation", "SAS", "RDBMS", "Shell scripting", "Perl", "Test cases", "software quality", "SDLC", "SQL", "Python"]}