{"JOB DESCRIPTION": "    We are looking for a Software Engineer PSL with experience in application development using WPF XAMLGraphics related programminggaming. You will be part of a talented software team that works on mission-critical applications. PSL engineer responsibilities include managing PSL application development while providing expertise in the full software development lifecycle, from concept and design to testing. You must demonstrate a good track record in designing, developing and delivering high-volume, low-latency applications for mission-critical systems.     Key Responsibilities:        You will be responsible for the PSL Support       Design, build and maintain efficient, reusable and reliable code        Ensure the best possible performance, quality and responsiveness of applications        Identify bottlenecks and bugs and devise solutions to mitigate and address those issues       Help maintain code quality and organization     To Lead the team effectively    Key Professional Attributes:      4+ years of application development experience using WPFXAMLGraphics related programminggaming      Sound knowledge of geometrical concepts     Proven object-oriented programming skills, design patterns      Strong understanding of object-oriented programming      Strong knowledge of the .NET frameworkC#      Familiar with various design and architectural patterns       Knowledge in MVVM Framework XAML, MVVM light is a plus        3D Framework Eyeshot or similar experience in helix3d, unity3d will be an added advantage       Good written and verbal communication skills     Qualifications Required:     BEB.TechMCAM.ScGraduate in Science Base     Experience: 4 years   Immediate Joiners Preferred                          ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Graphics", "XAML", "Business transformation", "MVVM", "Software development life cycle", "Programming", "Application development", "WPF", "Gaming", "Object oriented programming"]}