{"JOB DESCRIPTION": " Discovery, Inc. is a global leader in real life entertainment, serving a passionate audience of super-fans around the world with content that inspires, informs and entertains. Discovery delivers over 8,000 hours of original programming each year and has category leadership across deeply loved content genres around the world.Available in 230 countries and territories and 50 languages, Discovery delivers over 8,000 hours of original programming each year and has category leadership across deeply loved content genres around the world, reaching over 3 Billion viewers on all screens including TV, Digital and Mobile. Requirements You write efficient, readable, testable code units to contribute to the overall functionality of the software.• You understand computer science concepts and are passionate about them. You are abreast with the latest in the technology world and are keen to address challenging engineering problems.• You communicate through data, dates and facts, applying them as appropriate to motivate and inspire• You are comfortable with scrum agile methodologies, adapting best engineering practices by showing people, not just telling people• You are a fast learner and comfortable to change and adapt to a fast changing environmentDesirable Proficient in Java 8, including use of Futures and Streams• You are familiar in Reactive programming, asynchronous, non-blocking backend engineering languages like Java, Go, Node JS, etc.• Also familiar with Akka, Play framework (or any other Java frameworks), writing highly scalable engineering backend services and messaging services like Kafka, SQS and others.• Experience with one or more of: PostgreSQL and MySQL, Caching solutions (such as Redis and Guava), Search engine technology (preferably ElasticSearch)• Knowledge of, and professional experience with most AWS services, and deeper knowledge of EC2, S3, Kinesis, CloudFront and CloudWatch• Usage and understanding of Docker and Kubernetes", "ROLE": "Software Developer", "INDUSTRY TYPE": "Media, Entertainment, Internet", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["Java", "Software Development", "Reactive Programming", "Postgresql", "MySQL", "Javascript", "Go", "Redis", "Play Framework", "Akka"]}