{"JOB DESCRIPTION": "      Job Responsibilities        As a Software Engineer, you will work with a world-class team developing and deploying new technologies on a cutting-edge network. The terrestrial network is cutting-edge, requiring you to innovate, design and develop in the world of SDN, NFV and Network Virtualization. You will design, develop and deploy new and innovative technology into a service provider network. Viasat s unique position as a service provider and equipment manufacturer allows you to experience the whole life cycle of networking software development all the way from design to deployment. You will work with senior engineers to aid in design, documentation, testing, analyses, test plans, and test execution, to ensure deployed networks meet client needs.         Required Skills:    - 4+ years of software engineering experience with strong knowledge on Python, Go and Ansible.   - Experience in Test and Automation using Python.   - Knowledge on CI/CD, pipeline, networking, automations, debugging capabilities   - Knowledge on SDN and NFV   - Knowledge of basic OS features like Multi-threading, synchronization and memory management on Linux or Linux-like Operating systems   - Fundamental networking protocols layer 2 experience   - Understanding of routing, switching, and basic network communication protocols   - Possess a DevOps mindset   - Demonstrable problem-solving experience in a work environment   - Bachelor s degree in computer science, computer engineering or electrical engineering or equivalent technical background and experience.   - Up to 10% travel.          Preferred Skills:    - Background in data structures and algorithm design.   - Preferable Coding and debugging skills in C, C++.   - Proficient in software development tools, source code control environment   - Artificial Intelligence experience   - Knowledge on mongo, mysql and rabbitmq.  Additional Requirements and information   Minimum education:   BA/BS or equivalent experience ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Telcom, ISP", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.A in Other Specialization, Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Automation testing", "C++", "Networking", "Linux", "Coding", "Software Development Manager", "MySQL", "Debugging", "Data structures", "Python"]}