{"JOB DESCRIPTION": "About the Software Engineer Role:DISPRZ is looking for a Software Engineer who will deliver individually on features / enhancements under our products, as laid out as per the companys product delivery roadmap and own responsibility for their technical integrity, scalability and trouble-free deployment to the customer.Responsibilities (not exhaustive):Build and ship reliable software practicing robust software design and in-depth code reviews.Build efficient, clean and reusable features / libraries / componentsCollaborate with our design and product teams on defining and delivering new features to ensure a great experience for our users.Analyse and optimize existing UI and Server-side code for security, efficiency and performance.Be a voice in ensuring the team stays true to the technical vision.Write clean, scalable code in Web-based programming languages and/or .NET Write SQL Stored ProceduresTest and deploy applications and systemsCollaborate with technical lead to produce software design and architectureTranslate designs and style guides provided by the UI/UX team into functional user interfaces, while ensuring cross-browser compatibility and performance. Unit-test the code across platforms and browsers, to ensure functional consistency of delivered output. Education / Skill Set:Engineering / MCA degree from a top school with an excellent academic recordObject oriented programming knowledge is a must.High level of Proficiency in Web-based technologies JavaScript, HTML/CSSManage the deployment of the entire software stack of Disprz across our global cloud data centres on Azure / AWS (we are currently 80% Azure, 20% AWS)Knowledge of any one JS framework like Reactjs, React Native, Angular, or the like, is a plus Deep understanding of GIT and other automation tools like JenkinsFormal knowledge in below areas will be an added advantageASP.NET MVCEntity Framework Core/LINQ.Bootstrap frameworkSQL DatabasesExperience:Minimum 3 years experience in front-end development of software products using Web-based technologiesExperience doing Full-stack development is a great plusAbilities and Traits:Excellent planning, organizational, and prioritization skillsExcellent analytical, troubleshooting and communication skillsAbility to work under pressure and meet deadlinesAbility to think ahead and anticipate problems, issues and solutionsWork well as a team player and help the team members to resolve issuesBe committed to quality and be structured in approachExcellent and demonstrable concept formulation, logical and analytical skillsCreate intuitive interfaces with great functionality in a timely manner.Be passionate about writing neat and clean code. Document the work and communicate any issues as and when they arise. Assist in troubleshooting any production issues.Location:Chennai / MumbaiCandidate with shorter notice period or currently serving notice period can earn additional bonuses in this role.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["Azure", "LINQ", "backend engineer", "react native", "Devops", "frontend engineer", "GIT", "Software Engineering", "full stack", "SQL Database", "Bootstrap", ".Net", "software engineer", "Entity Framework", "React.Js", "software developer", "AWS"]}