{"JOB DESCRIPTION": "    Professional Experience:   4-6 years of strong experience in Automation QA or Application development    Work Location  : Ahmedabad or Hyderabad at client location   We currently have opportunities for Software Development Engineers in Test (SDET) who thrive in a fast-paced and challenging team environment. This is a great opportunity to join a dynamic and growing global consulting and product engineering company.    Key Job Responsibilities/Skills     Good experience in all phases of Testing and various environment     Good knowledge of Any Automation Testing tool, Selenium, UFT, SeleniumC     Good knowledge of Database and ETL testing     Good API Automation knowledge using Rest Assured and Ready API Soap UI     Good knowledge of API Automation, Python, Pycharm/Pytest     Good knowledge of any Security Testing tool     Good knowledge in Continuous Integration Jenkins     Strong in Functional and Automation Testing     Strong experience in Agile Testing and adhere to all QA best practices     Perform automation, database and API testing for a wide range of enterprise applications.     Attend and contribute in sprint planning sessions and design approaches to automate user stories within the same sprint.     Analyze product requirements and ensure the automation strategy is aligning a risk-based test approach mitigating risk exposure within all phases of testing utilizing automated testing tools to continuously build an automated regression test suite.     Active co-operation collaboration with the teams at various geographic locations     Collaborate effectively with technical and non-technical stakeholders     Provide prompt response and support in resolving critical issues along with the development team     Investigate new Testing Methodologies, keep abreast with the latest advanced techniques and ramp up the team accordingly  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Automation", "Testing tools", "Enterprise applications", "Software Development Manager", "Consulting", "HTML", "Application development", "Selenium", "Ajax", "Python"]}