{"JOB DESCRIPTION": "Roles and ResponsibilitiesDescription:- To strengthen our Java backend team, we are looking for a senior java developer with strong Architecture and Mentoring skills. - Our backend team is responsible for a high-performance layer between UI and Data and services different subsystems and user groups. With thousands of highly active users each day, our backend layer is critical for our success. - Your primary focus will be on architecting and developing new subsystems and new api's. Besides that, we expect our senior developers to mentor more junior team members and to take primary responsibility for one of our subsystems by assuring code quality and by providing a technical roadmap and architecture for that subsystem for the short- and long term.- Besides strong Java and programming skills, we expect all our senior developers to have strong communication skills and to be solid team players on which the product manager as well as the junior developers can rely.- As a candidate, you are very familiar with all the ins and outs of Java, know and understand all the fundamentals and are able to explain them in different ways to others.Job Responsibilities:- Execute a full software development lifecycle (SDLC)- Develop flowcharts, layouts, and documentation to identify requirements and solutions- Write well-designed, testable, reusable code and libraries for future use- Optimize the application for maximum speed and scalability- Technical leadership over one or more subsystem- Mentor junior developers- Resolve complex performance issue caused by high usage of API- s- Implement security and data protection- Produce specifications and determine operational feasibility- Integrate software components into a fully functional software system- Troubleshoot, debug and upgrade existing systems- Ensure software is updated with latest featuresJob Requirements:- A Bachelor's Degree in Software Engineering- 8+ years hands on experience with Java web services- Experience in architecting and designing high performance web services with Java and Spring- Excellent knowledge and understanding of Java and it's core fundamentals- Excellent knowledge of SQL- Solid Experience with Spring framework and related technologies- Solid Experience with MySQL, PostgreSQL combined with JPA/Hibernate- Experience with SQS Queuing- Experience with DynamoDB- Familiar with AWS Infrastructure and services- Familiar with Elastic Search clusters- Familiar with these tools: Maven,IntelliJ, GithubJob Location: Jaipur", "ROLE": "Team Lead/Technical Lead", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Java", "Maven", "Hibernate", "ElasticSearch", "PostgreSQL", "MySQL", "Java/J2EE Architect", "JPA", "Spring", "AWS", "SQL"]}