{"JOB DESCRIPTION": "Software Development Engineer (Web - Open Source) POSITION DESCRIPTION\n\nSoftware Development Engineer (SDE) for Open Source web platform will work with SARANGSoft's Web Development team to develop websites, web applications, and RESTful web services using \n\n Open Source technologies like Linux, Apache, MySQL, PHP, CakePHP, CodeIginter, MVC, OpenCart, WordPress etc.\n\nand  HTML5, CSS3, JavaScript, AJAX / jQuery, Cloud technologies (AWS Azure)\n\nACADEMIC / EDUCATION\n\nThe candidate must have one of the following educational qualifications / backgrounds.\n\n B.E. / B.Tech in CS / ECE / EE\n\n M.Tech in CS / ECE / EE\n\n MCA\n\n M.Sc. in CS / Math / Stat / Physics\n\n B.Sc along with adequate IT education / training and experience\n\nEXPERIENCE\n\nThis is not an entry level position. The candidate will be placed at a suitable level based on academic background, experience, and actual skills. However, at least two (2) years hands-on experience with software design and development for the Open Source web platform is a must. That means good knowledge of Linux, Apache, MySQL, PHP, CakePHP, CodeIginter, MVC, OpenCart, WordPress, and relevant development tools. The candidate must be able to create test plans (unit test, component test, integration test) as well as build and run test suites to verify software quality as part of the development process.\n\nREQUIRED\n\nThe candidate needs to\n\n Have strong analytical skills\n\n Have thorough knowledge of Open Source tools and technologies\n\n Have ability to clearly think about a scenario and offer ideas / solutions\n\n Have good written and verbal communication\n\n Have attention to details and be thorough in execution\n\n Be independent and self-motivated to take up and resolve problems\n\n Be a team player who respects others, gives a helping hand, asks for help when needed\n\nBack to Career home Apply for Job We are a customer-focused and quality-driven software development and services company. Our commit to provide you with technical challenge, diversity of assignments, and career advancement opportunities. We provide flexibility along with encouragement and support to help realize an individuals true potential.\n\nWe offer competitive salaries, benefits, and an environment conducive to professional growth. \n\nEQUAL OPPORTUNITY EMPLOYER COMMITTED TO A CULTURALLY DIVERSE WORKFORCE.\n\nBased on performance reviews (done yearly), we make pay increases, bonus, promotions etc. Depending on the location (country), the position may have medical insurance, leave travel allowance, retirement benefits etc.\n\nWhat We Are \n\nWe are an innovative and dynamic group of professionals with a zeal to take up challenging problems, create quality products, and strive to \n\nWOW\n\nour customers. We are thoughtful and observant, so we understand more than what we say. And finally, we LOVE what we do and take PRIDE in it.\n\nWhat We Are NOT \n\nWe are not driven by profit motives or short-term goals. We do not have bias to / preference for specific persons or gender. We do not tolerate ill-treatment or disrespect for another person. We do not like the politicking type. We do not accept bad work ethic or unwillingness to learn / improve. We do not entertain / reward habitual job-hoppers. We are not vindictive. If you want to leave for career advancement, go ahead, but don't plan us as your stop-gap arrangement.\n\nWhat You Can / Should Expect From Us \n\nRespect, fairness, encouragement, clear communication, constructive criticism, opportunity to learn-improve-grow, enjoy your work, professional relationship.\n\nWhat We Expect From You \n\nSincerity, honesty, hard work, willingness to learn improve, drive to excel, responsibility, offer to do more, enjoy work, be respectful to all team members, take pride in your work, be a good representative of the company. \n\nUnless you are of / like the above type, it's not going to be a match.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["c++", "development", "C", "technical", "analytical", "software", "wordpress", "level", "integration PHP", "HTML", "it", "ajax", "tools", "quality", "cloud", "Technical product configuration", "web", "design", "MySQL", "JavaScript", "support"]}