{"JOB DESCRIPTION": "Software Development Engineer (SDE) for .NET web platform will work with SARANGSoft's Web Development team to develop websites, web applications, and RESTful web services using \n\n .NET Framework, C#, MVC4+, SQL Server, LINQ, Entity Framework, IIS, WCF etc.\n\nand  HTML5, CSS3, JavaScript, AJAX / jQuery, Cloud technologies (AWS Azure)\n\nACADEMIC / EDUCATION\n\nThe candidate must have one of the following educational qualifications / backgrounds.\n\n B.E. / B.Tech in CS / ECE / EE\n\n M.Tech in CS / ECE / EE\n\n MCA\n\n M.Sc. in CS / Math / Stat / Physics\n\n B.Sc along with adequate IT education / training and experience\n\nEXPERIENCE\n\nThis is not an entry level position. The candidate will be placed at a suitable level based on academic background, experience, and actual skills. However, at least two (2) years hands-on experience with software design and development for the .NET technologies and web platform is a must. That means good knowledge of Windows Server, .NET Framework, C#, MVC4+, SQL Server, LINQ, Entity Framework, IIS, WCF, relevant tools (e.g., Visual Studio) etc. The candidate must be able to create test plans (unit test, component test, integration test) as well as build and run test suites to verify software quality as part of the development process.\n\nREQUIRED\n\nThe candidate needs to\n\n Have strong analytical skills\n\n Have thorough knowledge of Windows tools and technologies\n\n Have ability to clearly think about a scenario and offer ideas / solutions\n\n Have good written and verbal communication\n\n Have attention to details and be thorough in execution\n\n Be independent and self-motivated to take up and resolve problems\n\n Be a team player who respects others, gives a helping hand, asks for help when needed", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["development", "LINQ", "analytical", "software", "level", "Web development", "Windows", "Visual Studio", "it", "tools", "SQL", "quality", "cloud", "IIS", "jQuery", "web", "design", "Javascript", ".net", "WCF", "Ajax"]}