{"JOB DESCRIPTION": " Candidates in this space should have a strong desire to drive innovation by building feature-rich, scalable systems that are conducive to evolution. Our products must handle continual core network traffic from Tier 1 operators, CPaaS companies and large enterprises on a global scale.   Travel for meeting your distributed team and conference events can happen over the course of your tenure at Telestax.  Primary Job Responsibilities    Collaborate with Product Managers, Architects and Engineering leaders to define, architect and build new customer-facing features related to our Applications Services   Help drive the technical requirements, building, upgrade, and maintenance of our applications services   Design, develop, including writing and reviewing code, and maintain our applications backend microservices as well as their REST APIs   Ensure that our applications backend microservices are highly available, stable, secure, performant, fault-tolerant and scalable   Drive quality by writing unit, functional, performance and capacity tests.   Ensure that our applications backend microservices are instrumented and monitored   Develop diagnostic and troubleshooting tools made to our customer support organization   Work closely with Site Reliability Engineers to ensure services are reliable, scalable, manageable, and supportable   Excel as an engineer and be a productive member of the team where leadership is a behavioral trait, not a title   Actively contribute to the adoption of strong software architecture, development best practices, and new technologies. We are always improving the process of building software; we need you to help contribute   Required Skills    Experience Designing and Maintaining REST APIs   Experience architecting, designing and developing testable, fault-tolerant, scalable and highly-available (>= 99.95% uptime etc.) software   Experience with Java JVM and Java Microservices Framework and Application Servers such as Spring, Spring Boot, Akka, Vert.X, Tomcat, JBoss   Experience operating and tuning Java server applications and knowledge about JVM internals (Memory CPU Profiling)   Experience with SQL databases and NoSQL next generation distributed data stores (Cassandra/MongoDB/CouchDB) and database optimizations   Ability to define schemas for various types of data and types of access, setup appropriate data stores (MySQL, Elastic Search) and operate them at scale   Experience with CI/CD practices (Pipelines, graceful shutdown, A/B upgrade, canary upgrades, ) and tools (Jenkins, Spinnaker etc..)   Automated testing experience (Junit/testing, Mockito + Jmeter/Gatling.io)   Container experience Docker   International experience (working in or with multi-cultural distributed environments)    Desirable Skills    Experience with load-balancing, In memory data grid technologies Infinispan, Redis   Experience with exposing Monitoring HTTP Services Metrics through tools such as Datadog, Prometheus, Graphana, APM   Experience with securing HTTP Services as part of DevSecOps   Container Orchestration (Kubernetes, AWS ECS)   Experience with Serverless   Ideally, you have experience in a SaaS production DevOps environment where you ship rapidly and often. AWS experience or similar cloud-based offerings.   Technical writing skills   Remote Experience   You have worked in an Agile development environment.   Ability to work in a fast paced environment with fast moving team and changing requirements   Ability to work with independent thinkers who are highly technical and passionate  ", "ROLE": "Technical Architect", "INDUSTRY TYPE": "Telcom, ISP", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Telecom", "Tomcat", "JBoss", "MySQL", "Workflow", "Application development", "HTTP", "Troubleshooting", "Open source", "SQL"]}