{"JOB DESCRIPTION": " At TomTomYoull move the world forward. Every day, we create the most innovative mapping and location technologies to shape tomorrow’s mobility for the better.We are proud to be one team of more than 5,000 unique, curious, passionate problem-solvers spread across the world. We bring out the best in each other. And together, we help the automotive industry, businesses, developers, drivers, citizens and cities move towards a safe, autonomous world that is free of congestion and emissions.What you’ll doHelp support the goal of building better, faster and cheaper digital mapsAs part of our team, you will be responsible for creating and developing a platform used for the production of digital mapsYour work will improve the experience of key stakeholders of the MCP data capture and reporting systemsExchange knowledge with our talented engineers globally and solve a wide range of challenging, state of the art algorithmic issuesYou will be working in the teams that directly manage their productsWorking within a DevOps team responsible for the design, development and operational support for several key systems.Working with the latest native cloud technology to solve some of the Big Data challengesWhat you’ll need6+ years of experience in Software DevelopmentStrong English written and verbal communication skills, and the ability to communicate effectively in an international environmentProficiency in Java, Python or other relevant object-oriented development languageExperience in DevOps environments and passion for CI/CD tools, and public cloud computingNice to have is experience in Big Data and supporting technologies (Spark, Hive, Hbase and Databricks)Knowledge of SQL databases and NoSQL databasesThe ability to drive issues to resolution through communication, collaboration, and high-quality codeAbility to analyze problems on the abstract level and to decompose them into logical partsPractical knowledge of object-oriented design principles and testing practicesStrong understanding of industry technology (analytics, monitoring, code deployment, system scalability, load balancers, web servers)Ability to work independently and as a member of a team, to implement a shared vision of the end product.Eagerness to learn a lot of new things and continuously improve your skills, open mind for discussionMeet your teamMaps Content Processing (MCP) is where we turn the vision of Product Units into reality.  As a service unit, our team is responsible for all manual editing of the map as well as the running of automation tools.  We have fast-paced operations where productivity is our number one focus.   We have many opportunities to increase productivity, decrease the cost of quality, improve timing and reduce costs for which we need creative engineering solutions.  Besides focusing on current operational goals, Maps Content Processing is also expanding its service offerings which are important for our internal customers and is equally important for MCP to increase its capabilities.  Come join a team where your return on investment is tangible and critical to the teams’ success.Achieve moreWe are self-starters who play well with others. Every day, we solve new problems with creativity, meet new people and learn rapidly at our offices around the world. We will invest in your growth and are committed to supporting you. In everything we do, we’re guided by six values: We care, putting our heart into what we do; we build trust (you can count on us); we create – driven to make a difference; we are confident, but don’t boast; we keep it simple since life is complex enough, and we have fun because life’s too short to be boring.After you applyOur recruitment team will work hard to give you a meaningful experience throughout the process, no matter the outcome. Your application will be screened closely and you can rest assured that all follow-up actions will be thorough, from assessments and interviews through your onboarding.TomTom is an equal opportunity employerWe celebrate diversity, thrive on each other’s differences and are committed to creating an inclusive environment at our offices around the world. Naturally, we do not discriminate against any employee or job applicant because of race, religion, colour, sexual orientation, gender, gender identity or expression, marital status, disability, national origin, genetics, or age.Ready to move the world forward?", "ROLE": "Technical Architect", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["Software Engineering"]}