{"JOB DESCRIPTION": " With a startup spirit and 90,000+ curious and courageous minds, we have the expertise to go deep with the worlds biggest brands—and we have fun doing it. Now, we’re calling all you rule-breakers and risk-takers who see the world differently, and are bold enough to reinvent it. Come, transform with us.Are you the one we are looking for?Inviting applications for the role of Lead Consultant- Power BIIn this role, you would be primary responsible for development and some design applications based on Power BI technology. Work with business people to have a real time understanding of business problem and, design the solution which really fits into customer needs.ResponsibilitiesDeveloping applications from detailed design specificationsWorking with other developers to ensure deadlines are met.Develop automated unit tests and responsibility for testing own code before Systems.Playing an active role in defining standards in coding, system design and architecture.Delivering solutions according to user requirements while meeting development, quality and documentation standards.Revise, refactor, update and debug code Adhere to client coding standardsWorking with the Test Manager in leading the System Test cycleParticipate in Application Modernization programParticipate in Quality Improvement initiatives as requiredMentoring and coaching of graduate staff.Seek and resolve production problems with new ideasRegular interaction (in person, email and over phone) with business and technical partners locally and globally for status update, requirement discussions, discussion around solution/approach etcQualifications we seek in youMinimum qualificationsBE/B Tech/M Tech/MCA/BCAExcellent written and verbal communication skillsPreferred qualificationsExperience in technologies like Power BI, SSRS, SSIS, Azure Proficient in all stages of the Software Development Life Cycle (SDLC), with strong experience in design, analysis and development stages. The ability to communicate, friendly and cultural behavior during customer contact.Willingness and ability to multi-task.Ability to learn the Product/Platform and associated technologies.Ability to be learn and apply new processes and toolsGenpact is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, religion or belief, sex, age, national origin, citizenship status, marital status, military/veteran status, genetic information, sexual orientation, gender identity, physical or mental disability or any other characteristic protected by applicable laws. Genpact is committed to creating a dynamic work environment that values diversity and inclusion, respect and integrity, customer focus, and innovation. For more information, visit www.genpact.com. Follow us on Twitter, Facebook, LinkedIn, and YouTube.", "ROLE": "Database Architect/Designer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["Design Specifications", "Software Development", "Life Cycle", "Design Analysis", "Power Bi", "System Design", "Coding", "SSRS", "Debugging", "SSIS"]}