{"JOB DESCRIPTION": "Business Development Engineer -  Software Sales 1 -  4 Years of any Industrial experience.  Preference will be given to Sales Engineers having experience in selling Engineering or any other Goods or Services.  Pre- Requisite: Candidate exhibiting Solution based approach for solving customers' requirement.  Problem solver with a get it done attitude and strong motivational attributes.  Should be comfortable in selling at the executive as well as engineering levels.  Must have high standards for themselves,  their product and their services.  Proven track record in their career history.  In addition,  the candidate should possess the ability to function in a team atmosphere,  appreciate aggressive goals,  have superior Organizational/ Time Management skills,  Good Communication and Interpersonal skills Job ProfileAs a technical sales professional,  you will be responsible for all aspects of sales cycle which includes cold calling,  prospecting and qualifying.  You will be responsible for building long term relationships as per the principles of ROI and offer solution that ultimately improves the overall business productivity and profitability of engineering and manufacturing environment.  Conduct onsite needs assessment with customers and present suite of Engineering Solutions.  Bring the #1 selling product to manufacturing and design industries Meet or exceed monthly and annual unit and revenue goals Manage the sales activities of the assigned territory and provide detailed,  accurate monthly forecasts Work hand in hand with engineers to demonstrate solutions to fill client needs.  Continue a coordinated effort to ensure client success and ongoing sales opportunities. ", "ROLE": "Client Servicing/Key Account Manager", "INDUSTRY TYPE": "Construction, Engineering, Cement, Metals", "FUNCTIONAL AREA": "Sales, Retail, Business Development", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Corporate Sale", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "MBA/PGDM in Marketing"}, "KEY SKILL": ["Cold calling", "Building", "Interpersonal skills", "Time management", "Business Development Manager", "Software sales", "Technical sales", "Software Engineer", "Prospecting", "Business Executive"]}