{"JOB DESCRIPTION": "    About You    As a Tools & Automation Engineer at Tide.   You ll be an experienced software engineer who is comfortable with a broad selection of languages and tools - including ones you may not have used before. We are looking for an integrator and an Automator, joining systems and tools together in new ways to get amazing results.     Some of the things you ll be doing:      Building and improving tools to make Tide s engineers in Infrastructure, Mobile, Web and API development more efficient       Finding problem areas in Tide s CI/CD pipelines and making them faster       Automating operational work to ensure Tide s systems run smoothly and without human intervention wherever possible.       Working with technical product owners and agile coaches to understand bottlenecks in our engineering processes and find technical solutions.       Building rapid prototypes and gathering quick feedback.       Helping to break down big problems into solvable chunks.       You ll be a great fit if:       You have had demonstrable exposure to infrastructure, cloud or DevOps work.       You are comfortable building basic web-based UIs in using frameworks like React or Angular.       You have experience with languages like Java, Python, Go or NodeJS but you re happy picking up any tool.       You care about making tools that are easy to use, effective and easy to maintain.       You have experience working in agile environments (scrum or kanban)       You are    a self starter who is comfortable reading and understanding documentation, getting stuck into a problem and turning out a quick prototype.        You are able to decompose big problems into solvable chunks, and deliver full solutions incrementally.        You have technical knowledge and experience with API-based products       You are comfortable working in a fast-moving company where priorities can change and processes may need to be created from scratch.     ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Automation", "Web technologies", "Diversity and Inclusion", "Agile", "Infrastructure", "Scrum", "Medical insurance", "Operations", "Business banking", "Python"]}