{"JOB DESCRIPTION": "Job Description D365 CRM and Business CentralNebulaa IT Solutions LLP is looking for resources who will support Nebulaa with Microsoft Dynamics365 CRM and Business Central implementations to provide innovative business solutions usingMicrosoft Dynamics platform and providing client consultation whenever needed.ABOUT NEBULAA IT SOLUTIONS LLPNebulaa IT Solutions LLP is a fast-growing IT organization with expertise in Dynamics 365, Office 365, Azure,Power BI and Microsoft Power Automate/ Power Apps. Founded by a Dynamics 365 expert, the firmexemplifies industry expertise, combined with a decade old experience.Nebulaa is not just about the Dynamics 365. Our endeavor to help businesses transform is poweredby our consulting, ready-to-use, customized and outsourced product development services to SMBorganizations. Being in the industry for nearly a decade, our experts have successfully and diligentlydelivered D365 and various other solutions in manufacturing, technology, finance, healthcare,government, and other sectors.Visit our website for more information: https://nebulaaitsolutions.com/DESIRED SKILLS & EXPERIENCE• 0-2 years of experience working and specifically implementing Microsoft Dynamics 365 CRM andBusiness Central solutions• Online Microsoft Dynamics 365 CRM and Business Central implementation, customization,development, and usage• Excellent communication (oral and written) • Estimate and lead project effortsHIGHLY DESIRED SKILLS:• JavaScript/ HTML/ C#• Strong OOP & Programming concepts• Understanding of Business Central platform• Dynamics 365 CRM and Business Central Customizations & DevelopmentPREFERRED EDUCATIONAL BACKGROUND• Degree in Computer Science, EngineeringEXPERIENCE THE BENEFITS You will get many opportunities to grow and sharpen your Microsoft Dynamics 365 Business Central skills, working on some of the largest and most complex Microsoft Dynamics 365 Business Central implementations. Implementation and delivery could range multiple types of businesses and industries, multiple size project teams, and often dealing with custom development and integrations with the enterprise level applications. Employee rewards & recognition program Job Description  D365 CRM and Business Central Office leisure activities Steep learning curve", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - ERP, CRM", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Diploma in Computers, B.Tech/B.E. in Computers"}, "KEY SKILL": ["C#", "Javascript", "HTML", "Dynamics 365", "OOP", "MS Dynamics CRM", "Software Engineering", "Customization", "Microsoft Dynamics"]}