{"JOB DESCRIPTION": "   If you are someone who aspires to design and implement scalable, distributed and resilient backend systems, we might just have a right position for you.    This position is with the most preferred meter data management system EnergyIP .    You will be working with advanced feature of programming language. Reading and debugging the open source software will be just like another day in the office.   You get to work as part of an awesome, collaborative and talented team that takes pride in building a useful and elegant product.    We partner with Product Management, UX designers, Product Support, Product Implementation, Product Testing and Documentation teams to continuously build a better experience for our customers.   Software Engineer contributes to the design, development, support and maintenance of various components of EnergyIP product.    Works as an independent contributor and actively participates in the design process with the leads and architects. Requires good knowledge in Core Java and related technologies.    Takes full ownership of assigned EnergyIP components/applications.   Design and Development of various components of EnergyIP    Write Unit test cases for the components developed   Integration testing of the components developed with other EnergyIP product components, if required.   Bug fixes / Maintenance of the components developed as well as any other components of EnergyIP assigned.   Design Documentation and customer Facing Documentation      We don t need superheroes, just super minds!      We need a graduate - BE in Computer Science or equivalent with 2 to 4 years of experience in developing software applications using Java and database technologies.   Strong Analytical and Problem-Solving Skills.   Good knowledge in Core Java, Advance Java (JMX, Multithreading, Java Memory Model, Garbage Collection, Class Loading, Generics, Annotations, Advanced JDBC)   Strong knowledge in OOAD   Ability to debug complex Java and database applications, read and debug the open source software   Knowledge and Experience in Web Services (REST, SOAP), Messaging technologies (Kafka), Spring (AOP, Dependency Injection, Transactions, JTA, Spring JDBC)   Good written and oral communication skills   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Product management", "Computer science", "Core Java", "Multithreading", "OOAD", "Debugging", "JDBC", "Test cases", "Open source", "Product support"]}