{"JOB DESCRIPTION": "  We re looking for dedicated people with the skills and vision to build a better tomorrow. Join our Smart Grids and Infrastructure team as a Software Engineer and help us create the technology that will transform entire industries, cities and even countries.   We develop networks that power and heat our cities intelligently. We build next-generation high-speed trains, smart energy networks and support NASA in their explorations of outer space. We need people like you! Experienced researchers, true specialists, and clever minds who like to get to the bottom of things. Help us tackle the most exciting challenges and put into practice what really matters. So what are you waiting forTake your next career step with us.    We make real what matters       If you are someone who aspires to design and implement scalable, distributed and resilient backend systems, we might just have a right position for you.    This position is with the most preferred meter data management system EnergyIP . You will be working with advanced feature of programming language. Reading and debugging the open source software will be just like another day in the office.   You get to work as part of an awesome, collaborative and talented team that takes pride in building a useful and elegant product.    We partner with Product Management, UX designers, Product Support, Product Implementation, Product Testing and Documentation teams to continuously build a better experience for our customers.   A Senior Software Engineer contributes to the design, development, support and maintenance of various components of EnergyIP product.   Works as an independent contributor and actively participates in the design process with the leads and architects.    Requires good knowledge in Core Java and related technologies. Takes full ownership of assigned EnergyIP components/applications.   Write Unit test cases for the components developed   Integration testing of the components developed with other EnergyIP product components, if required.   Bug fixes / Maintenance of the components developed as well as any other components of EnergyIP assigned.     What You Need To Make Real What Matters!       We need a graduate in Computer Science or equivalent with 4 - 8 years of experience in developing software applications using Java and database technologies.   Strong Analytical and Problem-Solving Skills.   Good knowledge in Core Java   Good knowledge in Advance Java (JMX, Multithreading, Java Memory Model, Garbage Collection, Class Loading, Generics, Annotations, Advanced JDBC)   Strong knowledge in OOAD   Ability to debug complex Java and database applications, read and debug the open source software   Astonishing attention to detail and ability to break down tricky topics to simpler pieces for easier understanding, in writing and in person.   Knowledge and Experience in Web Services (REST, SOAP), Messaging technologies (Kafka), Spring (AOP, Dependency Injection, Transactions, JTA, Spring JDBC)   Good written and oral communication skills   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Product management", "Computer science", "Core Java", "Multithreading", "OOAD", "Debugging", "JDBC", "Test cases", "Open source", "Product support"]}