{"JOB DESCRIPTION": "Job Location: Hyderabad - INDIAThe Company:The Candidate: This Full Stack Software Engineer - Trainee will function as an integral member of the team that is building the VOZIQ platform, a breakthrough Analytics platform that can process billions of data records using a cluster of AWS machines. We believe that small, empowered, self-motivated teams can do big things.Your work will touch everything from our databases, business logic, web services, front-end UI/UX, edge services, performance engineering, test automation framework, and Continuous Delivery platform.We place a premium on collaboration and locally-made decisions. We believe in automating all the repetitive, high-risk, and mundane tasks.Key responsibilities: Work with a team of engineers on multiple phases of SDLC. Analyse and understand the requirements from the business owner. Need to estimate and update your tasks on agile board on regular basis. Developing back end features using JAVA / J2EE. Developing front end features using HTML, JQUERY, CSS, Angular JS Need to work independently on your tasks. Need to develop reusable code with high quality.  Need to use with GIT for version control. Working alongside with the team and be able to get the information from the information stakeholders. Seeing through a feature from conception to finished feature. Designing and developing APIs. Study upcoming tools and technologies and use them to improve existing solutions and processes.Required Skills and experience: Core Skill Set: Core Java, J2EE, Multithreading, Collection, Object Oriented Programming, Application Frameworks: Struts 2.x, Spring batch Java Persistence Frameworks: Hibernate/JDBC Templates IDE Application: Eclipse Web Server: Tomcat, Apache  Database: MS SQL, MySQLQualifications: University degree in Computer science or Computer Engineering (B. Tech / B.E) Excellent communication skills. Must be a highly motivated self-starter comfortable working in a fast paced environment andmust have good time-management skills. Team player meeting the tight deadlines and quality deliverables.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["Java", "Core Java", "Hibernate", "Multithreading", "Javascript", "JDBC", "Struts", "HTML", "J2Ee", "Spring Boot", "Apache Tomcat", "Spring Batch"]}