{"JOB DESCRIPTION": "    Experience  : 0-1 year     Job brief:    We are looking for a qualified React Native developer to join our Engineering team to build and implement functional programs. You will work with other developers and product managers throughout the software development life cycle and maintain high quality mobile applications for both platforms as Android and iOS. In this role, you should be a team player with a keen eye for detail and problem-solving skills. If you also have experience in Agile frameworks and popular coding languages (JavaScript), we would like to meet you. Your goal will be to build effective programs and systems that serve user needs.     Responsibilities:   *Design and develop native mobile applications for IOSAndroid  *Build pixel-perfect, buttery smooth UIs across both mobile platforms using React Native technology  *Leverage native APIs for deep integrations with both platforms  *Diagnose and fix bugs and performance bottlenecks for performance that feels native  *Reach out to the open-source community to encourage and help implement mission-critical software fixes- React *Maintain code and write automated tests to ensure the product is of the highest quality  *Transition existing React web apps to React Native  *Assertive, with the confidence to be the voice of authority not afraid to do what is best for the team  *Serves as primary liaison and contact point for the team's communication need.    *Work with developers to design algorithms and flowcharts.  * Produce clean, efficient code based on specifications.  * Integrate software components and third-party programs.  * Troubleshoot, debug and upgrade existing software.  * Create technical documentation for reference and reporting.    Requirements:   * Ability to learn new languages and technologies.  * Excellent communication skills.  * Resourcefulness and troubleshooting aptitude.  * B.Tech MCA in Computer Science, Engineering or a related field.    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "MCA in Computers"}, "KEY SKILL": ["Computer science", "Web technologies", "Coding", "Javascript", "Agile", "Software development life cycle", "Mobile applications", "Open source", "Android", "Technical documentation"]}