{"JOB DESCRIPTION": " We are looking for talented software engineers to join the Freestone Learning Management System development team. In this role, you will work with an Agile development team to implement new clients and build new functionality on our SaaS learning management platform. The Freestone product is used by hundreds of associations and non-profits to deliver Live Webcasts, Webinars, and On-Demand Learning content to their constituents. Your day to day role will involve full stack development on both client portals and core platform functionality with a focus on integrations and client service needs. You will code primarily in PHP, HTML, and JavaScript while interacting with a MySQL database backend. You may also receive exposure and training into various AWS Cloud Services, NodeJS and VUE.js. This position will be located in our Pune Office.   In this role you?ll:    Work with stakeholders in client implementation process to fully configure their user facing websites   Code integrations with client back office systems such as an Association Management System or Salesforce   Work with team to spec and estimate new product functionality   Work with QA to ensure your code is fully tested and working properly   Write clean, documented code within defined coding standards   Participate in code review process with team   We are a continuous deployment platform.    We'd love to chat if you have    At least four years of relevant work experience   Knowledge of HTML, CSS, SASS, GIT   Proficiency in PHP, MYSQL, and at least one MVC framework.   Experience with API web services (SOAP and/or REST) is a must   Experience with Amazon EC2, S3 is a plus   Other pluses consist of NodeJS, GULP, Wowza Media Server, any streaming media experience, integration frameworks/platforms   Excellent communication skills, this role will have some client facing interaction   Desire to work in a fast paced, team environment   Master?s or Bachelors degree in Computer Science or relevant Engineering degree.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Advertising, PR, MR, Event Management", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["PHP"]}