{"JOB DESCRIPTION": "  This role focuses on designing, development & Support of Elluminati Inc Products and various client-based projects. It is a technology position where a candidate will go through the software development lifecycle to develop new projects or support existing projects.   Responsibilities    Develop, Design, Build & Support iOS Apps.   Work with a skilled cross-platform team throughout the complete cycle of development and take it to delivery.   Maintaining code quality for scalability, flexibility, and robustness including test cases.   Work on performance optimization & bug fixes.   Continuously research, discover & implement latest technologies to increase efficiency and reduce development time.   Skills Required    Hands on experience of UIKit & XCode5+.   Excellent skills of Objective-C, Swift & Object Oriented Programming.   Experience in RESTful Web Service Integration JSON & XML Parsing.   Experience in publishing Apps to iTunes.   Knowledge of 3rd Party Library Integration.   Exposure to current mobile trends and emerging technologies.   Version Control (SVN & Git) knowledge is required.   Educational Qualification    BE/B-Tech in Computer Science or Information Technology   Master of Computer Application in Computer Science   BE/B-Tech in Electronics & Communication (Only if candidate has excellent knowledge of Object Oriented Programming.)   Experience    We respect knowledge, talent & logic more than experience, so experience is not a bar if you satisfy above criteria and are excited for Career With Elluminati Inc  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Embedded, EDA, VLSI, ASIC, Chip Design", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "MCA in Computers"}, "KEY SKILL": ["Computer science", "Version control", "Publishing", "GIT", "XML", "Software development life cycle", "JSON", "Test cases", "Information technology", "Object oriented programming"]}