{"JOB DESCRIPTION": "Senior Software Developer Engineer/ Associate Staff Engineer - Data Structure/ Design PatternsSkills & Competencies:- Expertise in C, C++- Good in data structures, design pattern- Hands on coding experience - Good in Linux platformRole : Sr. SDE/ Associate Staff Engineer Experience : 6-9yrsLocation : BangaloreWho are we looking for?- Proficient in C/ C++ development, OS concepts, Data Structures, Distributed Computing and Algorithms - Advanced programming and design skills - Can write good quality modular code that is maintainable and extensible - Ability to pick up new technologies rapidly to convert specs to low level design - Clearly communicate the intent and approach when producing a code design document - Mentor and influence junior developers to adhere to good coding standards and become quality consciousWhat will you be doing?- Create a code design document that captures the scope of the module (or a subset) in terms of what the module will provide by way of APIs, its dependencies, the code organization, data structures and algorithms to be employed - Participate in activities that lead up to the code design - This may include activities such as developing prototypes, proof of concept, compare pros and cons of various implementation choices being considered and recommending the most appropriate one - Bring the team's attention to the coding guidelines to be followed - Review critical pieces of code that are developed as per this code design- Ensure that the code being delivered is of the highest quality, ensure appropriate unit tests and functional tests are considered.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "BCA in Computers, B.Sc in Any Specialization, B.Tech/B.E. in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["C++", "C", "Linux", "Design Patterns", "API", "Distributed Computing", "Distributed Systems", "Algorithm", "Data Structure"]}