{"JOB DESCRIPTION": " Other Openings   Android Developer (Hyderabad, IN)   Python Developer (Hyderabad, IN)   iOS Developer (Hyderabad, IN)   Web Designer (Hyderabad, IN)   Angular JS Developer (Hyderabad, IN)   Front End Web Developer (Hyderabad, IN)   Why Work at Lintel? Lintel helps build the flagship products for tech startups, creating new technologies and new markets in the process. We also partner with more established companies to prototype products, create new online services, and set up server environments to make them all highly available and super scalable. As an Lintel team member, you will constantly be working on a wide variety of projects using a full stack of our favorite technologies. Working at Lintel is never boring. On any given day, an Lintel developer could work on a number of different projects for several different clients. Lintel is a great place for developers to deepen their skills and widen their exposure. If you're a motivated developer who is willing to learn, willing to work hard, and willing to become an integral member of the Lintel team, we want to talk to you.   Applicants must know some Django and enjoy working hard and learning new things. Novice and mid-level developers will work their guts out on internal projects until they're proficient enough to do client work. Nice-To-Haves:  Python: Twisted, Pyside / QML, pip Mobile: Android (Java), iOS (Objective C) Web: Django, AngularJS, HTML, CSS, JavaScript, Bootstrap, jQuery, LESS Linux: Bash, Salt, PostgreSQL, Git Telephony: FreeSWITCH, OpenSIPS  Please reply with your resume, wage requirements, and/or any portfolio materials you might have. If your wage requirements make sense for your level of skill/experience, you're very likely to get an interview.   10 A.M. - 6 P.M. (IST) ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["server", "objective c", "python", "java", "software development", "postgresql", "linux", "android", "javascript", "jquery"]}