{"JOB DESCRIPTION": "Roles and ResponsibilitiesIntroductionAs a Hardware Developer at IBM, you’ll get to work on the systems that are driving the quantum revolution and the AI era. Join an elite team of engineering professionals who enable IBM customers to make better decisions quicker on the most trusted hardware platform in today’s market.Your Role and ResponsibilitiesAs a Senior Software Engineer, you'll be responsible for ensuring that components are expertly designed, developed with high quality, tested and ready for integration into IBM's best-of-breed solutions. This is your chance to develop innovative new technology as well as grow your career. Hone your expertise alongside fellow talented professionals, where you'll develop some of the most exciting software infrastructure and solutions on the market. As a Senior Software Engineer you will be responsible for Designing of OpenShift operators for spectrum scale product portfolio.Developing high quality software solution for Spectrum Scale in OpenShift.Ensuring end to end quality delivery of the component/feature.Co-ordinating and working with geo dispersed teamWorking closely with customers for requirement implementation as well as responding quickly to customer issues.Required Technical and Professional Expertise8-15 years of relevant storage industry experience.Strong background with RedHat OpenShift and KubernetesWorking knowledge of Container Tech: Kubernetes, DockerProven understanding and hands-on experience with Operators.Hands on skills and solid experience on development using programming languages like GO and/or Ansible, Python.Understanding and experience of working in Agile methodology across global teams.Preferred Technical and Professional ExpertisePreferably with prior experience in designing and developing OpenShift Operators.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Software Development", "Container", "Cloud Computing", "Docker", "Artificial Intelligence", "Openshift", "Kubernetes", "Python"]}