{"JOB DESCRIPTION": "Job briefWe are looking for a Software Engineer -Testing  for Test Automation, Continuous Testing and Test Management for UI, Cloud Native Applications and Big Data Continuous Delivery Pipeline.Software Test engineer responsibilities include maintaining best practices of software development, designing and implementing tests, debugging and defining corrective actions. It must be handling functional and Integration Testing with automation and manual, developing and executing exploratory and automated tests to ensure product and solutions qualityThe ideal candidate will be responsible for Test Management and Automation for continuous Testing, Continuous Performance to ensure software runs smoothly. ResponsibilitiesReview requirements, specifications and technical design documents to provide timely and meaningful feedback.Knowledge of Test Driven and Behaviour Driven Development Create detailed, comprehensive and well-structured test plans and test cases.Estimate, prioritize, plan and coordinate testing activities.Design, develop and execute automation scripts using open source tools.Identify, record, document thoroughly and track bugs.Perform thorough regression testing when bugs are resolved.Liaise with internal teams (e.g. developers and product managers) to identify system requirements.Monitor debugging process results.Investigate the causes of non-conforming software and train users to implement solutions.Track quality assurance metrics, like defect densities and open defect counts.Stay up-to-date with new testing tools and test strategies. Creating Test Management and Automation Framework for Big Data and Devops Pipeline RequirementsProven work experience in software development.Proven work experience in software quality assurance.Knowledge of software QA methodologies, tools and processes.Experience in writing clear, concise and comprehensive test plans and test cases. Hands on Experience of  Selenium and Robot Framework Knowledge of Continuous Testing, Devops and Test Management ", "ROLE": "Testing Engineer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - QA & Testing", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["Test Engineering", "Regression Testing", "Software QA", "Software Quality Assurance", "Integration Testing", "Automation Framework", "Robot Framework", "Automation Testing", "Selenium", "Test Cases"]}