{"JOB DESCRIPTION": "About Cybage Software Pvt. Ltd. Founded in 1995, Cybage Software Pvt. Ltd is a technology consulting organization specialized in outsourced product engineering services. As a leader in the Technology and product engineering space, Cybage works with some of the worlds best independent software vendors. Our solutions are focused on modern technologies and are enabled by a scientific, data driven system called Decision Mines for Digital Excellence. This unique model de-risks our approach, provides better predictability, and ensures a better value per unit cost to our clients. An ISO 27001 certified company based in Pune, India that is partnered with more than 200 global software houses of fine repute. The array of services includes Product Engineering (OPD), Enterprise Business Solutions, Value Added Services and Idea Incubation Services. Cybage specializes in the implementation of the Offshore Development Center (ODC) model.You will get an opportunity to be a part of highly skilled talent pool of more than 6,300 employees. Apart from Pune, we have our operations hub in GNR and Hyderabad as well and we have also marked our presence in North America, Canada, UK, Europe, Japan, Australia, and Singapore. We provide seamless services and dependable deliveries to our clients from diverse industry verticals such as Media and Entertainment, Travel and Hospitality, Online Retail, Healthcare, SCM and Technology.Key aspects of this role:         Understand the business requirements and translate the requirements into project specific solution design specifications.         Build Rich Internet application to Join our .NET development team.         Builds software/web applications  Follows coding standards, builds appropriate unit tests, integration tests and deployment scripts          Communicate continually with the client and project teams  Explains progress on the development effortTo be the right fit, you'll need:1.       Good working experience in Asp.Net/Asp.Net Core/.NET, SQL, MVC, Angular, Web API and Entity framework.2.       Should be strong in OOPS concepts3.       Knowledge of Object-Oriented JavaScript libraries.4.       should be able to interpret written requirements and technical specification documents5.       Well-versed in software engineering principles, frameworks and technologies6.       Should be able to communicate with the client independently7.       Should be a team player & an individual contributor Exp: 3.5 to 6 YearsNotice period: Immediate to 30 Days MaxIf interested kindly respond with your updated CV on shubhangir@cybage.com with these details:Total Exp:Rel Exp:Current CTC :Offer in hand :Expected CTC:Notice period :Comfortable to work/relocate in Pune:Current Location: Regards,Shubhangi Rinait", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Any Doctorate in Any Specialization"}, "KEY SKILL": ["Web API", "ASP.Net MVC", "Angular", "c#", ".NET", "ASP.Net", "MVC", "SQL"]}