{"JOB DESCRIPTION": "Roles and ResponsibilitiesWe are looking for an experienced, motivated and innovative individual enthusiastic to work on product development and cutting-edge technologies. Ideally the candidate will have worked on large complex software systems in the role of software developer. Candidate should be a quick and willing learner, one willing to take ownership of areas/modules and deliver against defined time-lines. People should feel they can just approach and feel comfortable to discuss their ideas with him/her. The successful candidate would be one who does not hesitate to challenge conventional thinking and practices. A fresh perspective on how to solve things for the future while at the same time being very accepting of how AVEVA got to its industry leading position is important. A \"can-do\" attitude is a must.Mandatory Knowledge, Skills & Experience• Requires a minimum of 3-5 years of hands on C#.NET experience.• 4 to 6 years of experience with software product design, development and testing for infrastructure software products.• Well versed with Lean/Agile software development and testing principles used for high quality software development.• Working knowledge of object-oriented analysis and design.• Experience reverse engineering, debugging, and profiling large scale real-time control systems.• Environment: Windows desktop environment (mandatory).Non-technical Skills and Experience• Strong communication skills, with an inherent ability to demonstrate calmness and willingness to actively listen and learn• Team player and collaborator• Generate and contribute to a positive work environmentDesirable Knowledge, Skills & Experience• Prior experience with Industrial Automation in Human Machine Interface (HMI) or SCADA is desirable. Preference for knowledge of System Platform family of products.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": [" object-oriented analysis ", "Design Development", " Agile software development", "Product Design", "C#.NET ", " Software Development"]}