{"JOB DESCRIPTION": "Roles and ResponsibilitiesIntroductionSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do. Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide. At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.Your Role and ResponsibilitiesYou are a Full Stack Application Developer, who will Design, develop and/or re-engineer complex application components, and integrate software packages, programs and reusable objects residing on multiple platformsAn ambitious individual who can work under your own direction towards agreed targets and goals, you have the ability to manage change and to work under stress. You are curious to learn as demonstrated by your up-to-date technical knowledge. You are a good team player and you are familiar with Agile methodologies and principles and/or have experience working in an Agile team. We seek an applicant who will thrive in an open, dynamic, flexible, fun, spirited, collaborative environment; an individual who desires creative freedom and the opportunity to work in a high performing team.Responsibilities:As a Full Stack Application Developer, you will: Design, develop and/or re-engineer complex application components, and integrate software packages, programs and reusable objects residing on multiple platformsBuild applications for IBMers around the world, demonstrating agile and dynamic software support capabilities Be responsible for maintenance and improvement of critical IBM internal applicationsPerform application development based on Agile methodologies & participate in requirements / user story analysis, design and executionConduct appropriate unit and module testing; detect, report, investigate and fix defects in the application (production support)Continually focus on improving the applicationWork effectively in collaboration with other team members, partners and other support functions when requiredRequired Technical and Professional ExpertiseProficient in stitch together end to end application starting from front end web development, back end development, middleware integration and persisting data in no SQL or DBMS database 4+ yrs of experience in Backend and Front-end technologies.Experience of working in HTML 5, CSS3, Angular JS or React js or Vue js, Spring MVC, Spring Boot, REST API and middleware (Java, Python, Node.JS, Golang)Working knowledge in Kafka messaging (Usage of Topics)Proven ability in Web Service implementation (RESTful and SOAP)Hands on experience in OOAD and Design Patterns, knowledge of Data Structures and Algorithms, and SQL, XML and JSONKnowledge of OOP languages and MVC framework along with the Component Development in Action ScriptAbility to independently analyze requirements based on a given specification and come up with a sound and balanced algorithmic designPreferred Technical and Professional ExpertiseCertification as a Java Developer Expertise in developing models and builds scalable Microservices components/API (Application Programming Interface).Experience working with Test Driven Development as a Dev Practice.Overall, very good understanding of Cloud Native Application architecture, Docker’s and Microservices.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Java", "Software Development", "Spring Mvc", "Html5", "Javascript", "HTML", "JSON", "Spring Boot", "Microservices", "SQL"]}