{"JOB DESCRIPTION": "Roles and ResponsibilitiesJoin us as a a Software Senior Engineer on our Engineering Development team in Bangalore to do the best work of your career and make a profound social impact.Key Responsibilities:Our Software Engineers create solutions. As a part of the team, you will analyze the customer’s business goals, needs and general business environment to design technical system answers.You will: Contribute to the design and architecture of high-quality, complex systems and software/storage environmentsPrepare, review and evaluate software/storage specifications for products and systemsContribute to the development and implementation of test strategies for complex software products and systems/for storage products and systems.Leading all activities necessary to take a product from concept to production including system architecture definition, PoC,Contribution to behavioral specification, defining engineering functional planDesign, engineering interlocks with vendor/ODMs/partners, prototyping, debug validation, interactions with cross functional teams, factory and customer support.Developing technical specifications, Proof Of Concepts, evaluating prototypes and making recommendations, defining program scope, driving design / engineering reviews are part of the job responsibility.Person should have excellent understanding of Linux OS internals and strong development experience. Server manageability experience will be a major plusFault tolerant systems and high availability is a plus. Person should have strong leadership skills with focus on drive for results. It is an IC roleQualification / Experience : A BE/ME/MS degree in CS, ECE, CEEssential Requirements: • M.Tech with 4+ years of expertise or B.Tech with 6+ years of expertise in C development, debugging with firmware / System development background is mandatory• Strong in Linux programming, OS Internals, memory management, IPC, thread programming and embedded application software development.• Experience/exposure to I2C, SPI, MCTP, NCSI, PLDM, uEFI protocol is essential.• Very good Server system architecture understanding,Desired Skill:• Solid understanding of Networking/Storage protocols like SAS, SCSI, SATA, iSCSI, FCoE, LLDP and power and thermal domain expertise, system power optimizations is added advantage.• Prior experience in Grade Temperature range, analysis of ‘Thermal Design Power’ characterization is added advantage.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - System Programming", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Electronics/Telecommunication, Computers", "PG": "MS/M.Sc(Science) in Computers, Electronics, M.Tech in Computers, Electronics/Telecommunication", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": [" debugging ", " SATA", " SPI", "SAS", " MCTP", "System development ", " iSCSI", "C development", "Server system architecture", "I2C", " NCSI", " SCSI"]}