{"JOB DESCRIPTION": "         About the Role          Senior Software Engineer who will design and develop significant functionalities to an enterprise cross-asset platform.     Role and Responsibility      Develop key features for a Big Data and Distributed platform for data management technologies, using Python / Microservices / Apache Spark (pySpark) / Apache Kafka, NoSQL Database (MongoDB) Technologies.            Role requires an excellent understanding of the concepts, challenges and tradeoffs on Big Data Platform: latency vs. throughput; scalability, resiliency, data ingestion, streaming, batch processing.         Role requires good problem solving skills and ability to troubleshoot complex issues.        Role requires a very good understanding of service oriented architecture, distributed computing and Big Data Eco-system.            Role requires a very good understanding of Microservices Architecture / Flask API/ Apache Spark (pySpark) / NoSQL Database (MongoDB).  To be able to tune Big Data distributed solutions to improve Performance, Reliability, Availability and Scalability (PRAS).            In addition to feature development and bug fixes, investigate and resolve L2/L3 production issues              Essential Qualification           Bachelor Degree with 10+ years of development experience using languages such as Python /        Apache Spark (pySpark) / Apache Kafka / NoSQL Database (MongoDB)       Technologies.            Experience working on Python 3 and related libraries Flask API, Numpy, Pandas, Scikit.            Experience in building distributed systems using microservices architecture.            This includes full life cycle development and understanding of application development methodologies, as well as experience in a 3-tier application environment.  Demonstrated Object-Oriented Design (OOD)/Object-Oriented Programming (OOP) skills;        Expertise in Big Data application development, distributed computing, messaging, streaming, batch processing.            Experience working in Agile Team, Practicing Scrum, having a good understanding of Agile Development methodology.                  Should have good exposure to DevOps tools and CI-CD pipeline.            Analyzes highly complex business requirements, designs and writes technical specifications to design or redesign complex computer platforms and applications.     Desired Qualification               Understanding of Capital Markets and Market Risk and Counterparty Credit Risk products  Demonstrated expertise in end-to-end delivery of significant features in a complex system        Hands on experience with ETL pipeline (AbInitio) and exposure to parallel data processing.            Experience with Relational Database like SQL Server / Oracle       further providing support to the Data and Analytics in database design, data flow and analysis activities      ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Other", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Business services", "Data management", "Fixed income", "Data processing", "MongoDB", "Application development", "Investment banking", "Oracle", "Analytics", "SQL"]}