{"JOB DESCRIPTION": "        About the Role    We are looking for a senior development engineer, with experience in Asset Management Technology focus on building order management, position management platforms. The role requires in depth technical knowledge and analytical ability to engineer and manage a complex ecosystem including server side components, market data delivery, trading desktop, high performance computing infrastructure and data analytics. This role offers opportunity to work on business critical, greenfield/brownfield and high visibility projects. In addition to the primary responsibility of being the lead engineer for resolution of technology issues in the Asset Management platforms, the person will be expected to champion best practices to build a resilient platform. The position will collaborate directly with the US-based engineering teams, business/product managers and business analysts. Specific responsibilities include, but are not limited to:        Role and Responsibility           Design, develop key features for Asset Management business requirements using latest features in Java.        Role requires an excellent understanding of the concepts, challenges and tradeoffs in developing complex java applications.        Troubleshoot complex issues in distributed ecosystem        Evaluate the architecture and identify opportunities for improvement        Ensure that deliverables are on time, within estimates and of high quality and are following expected agile methodology.        Person is supposed to be result oriented and have delivery mindset.       Work with application support teams to ensure timely resolution of issues.            Essential Qualification             5+ years solid server-side development       Solid Java/JEE knowledge (Core Java, Multithreading, JDBC, JMS, Web Services       Frameworks/Tools (Spring Boot / Spring / Hibernate / Maven / Junit)       Data structures/algorithms       Experience with at least one of the mainstream relational databases (SQL Server, Oracle, Postgres, MySQL or Sybase) and advanced knowledge of SQL       Familiarity with Service-oriented architectures Microservices in particular       Familiarity with ETL processing and concepts of dataflow programming       Experience with version control systems (Git/SVN)       Understanding of messaging, concurrent programming and highly distributed software         Desired Qualification         Knowledge of Python and related framework       Experience with Big Data technologies and Hadoop ecosystem (MapReduce, Hive, Hbase)       Basic understanding of containerization technology and Kubernetes in particular       Experience with PCF or one of the mainstream public cloud providers        Documentation and presentation skills    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Hibernate", "Core Java", "Application support", "Multithreading", "MySQL", "JDBC", "Oracle", "SyBase", "SQL", "Python"]}