{"JOB DESCRIPTION": "       About the Role       Capital Market App sys engineer who can interface with business analysts, management, and other technology groups across WFS, Responsibilities include development and maintenance of complex Application and supporting the application as an escalation point        Responsibilities             Participates in discovery, determination & analyzing of the solution requirements; teams up with product owner to align business priorities and release planning               Participates in sprint 0/backlog grooming/sizing/sprint planning/sprint review and retrospective meetings               Remediates data dependencies in collaboration with application owners and designs combinatorial, exhaustive, optimized automation ready test suite               Identifies and implements opportunities to automate test processes using approved tools, to improve efficiency and be more proactive               Designs, codes and executes automation scripts using Selenium and UFT               Identifies discrepancies and defects, validating functionality and compliance to the requirements, documents findings, suggestions and issue details in an exhaustive and informative manner and tracks the defects to resolution               Interacts & collaborates with the various stakeholder teams, to implement and adapt to the Enterprise Agile strategy               Communicates well, maintains professional presence in verbal and written communication. Anticipates potential problems, avoids surprises, and elevates appropriately.               Researches new tools and technologies, develops quality standards and procedures to work towards innovating and continually improving the quality of the process.               Additional responsibilities as directed by the Manager        ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Business services", "Automation", "electronic trading", "Fixed income", "prime brokerage", "Agile", "Capital market", "Investment banking", "Selenium", "Analytics"]}