{"JOB DESCRIPTION": "       About the Role       Individual contributor role for Actimize Development as an Application Engineer; Hands on coding role; develops code for multiple projects/requirements simultaneously. Provides technical support to the co-located teams, design and automation solutions to make the development process better and faster. Takes a lead role in driving the usage of latest technology/Frameworks. Motivates the team to use the tools that improve the quality of the product.           Responsibilities        As a Software Engineer, the resource will be responsible for:                Active participation in scrum team to design/develop product features in collaboration with the US teams                Provide Business value through innovation and continuous improvement                   Demonstrate strong written and oral communication skills; proven ability to work with end users to understand and transform requirements to solutions                   Conducts peer code reviews                   Mentor junior technical team members                   Necessary presentation and documentation for technical artifacts                    Ensure Release software meets all requirements of Security, Quality, Extensibility, Performance, Reusability                   Accountable for the overall development life cycle of the solution and manage multi-release multi-complexity projects from Well Fargo EGS India locations                   Responsible for driving best practices for software development and documentation, assures designs meet requirements, and deliver high-quality work managing the schedules.                   Engage with the Application Architects and CoE Partners (included but not limited to DBA, Infrastructure, Architecture and Application Support teams for the safety and soundness of the assigned applications                    Work on generate ideas for Continuous Process Improvements, and delivering Proof of Concepts                   Review status of system applications and prepare recommendations for improvements/ modernization                   Focus on enhancing self-technical/ domain skillsets                   Work in a matrix environment and build good working relationships with multiple stakeholders                    Build a culture of continuous improvement within team and put together metrics to measure the impact of their efforts          ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Application support", "Automation", "Coding", "Intranet", "Database administration", "Manager Technology", "Scrum", "Continuous improvement", "Technical support", "Analytics"]}