{"JOB DESCRIPTION": "     About the role    As a member of the Automation, Reporting, and Analyst team you would provide horizontal support for all Capital Markets project initiatives as needed. In addition, the candidate will be focusing on the systems, applications, QA, automation needs of trading, portfolio management, settlements and compliance functions.     Roles and Responsibilities:    - Define automation stack and develop framework constructs required to shift left, including analytics driven optimization   - Operate in an agile framework and delivery to the business quickly.   - Good Communication, Analytical and Problem Solving skills.   - Driving for results, conveying a sense of urgency and bringing issues to closure despite obstacles and opposition.   - Demonstrating outstanding flexibility and teamwork.   - Report defects and provide required support information.   - Adherence to timelines and focus on deliverables.     Essential Qualifications:    - 6+ Years of hands on Core Java development with a practical experience in file processing, bulk data comparison, caching and transaction handling   - 2+ years of experience in test automation framework & web services automation   - Demonstrate Object-Oriented Design (OOD)/Object-Oriented Programming (OOP) skills   - Hands on experience in setting up / maintain environments familiar with CI, Jenkins/Git/GitHub and deployment automation   - Experience in tools like Eclipse / Intellij   - Excellent understanding of the SDLC, STLC and Agile Methodology   - Knowledge of any defect tracking tool - HP ALM / Jira / Rally or equivalent   - Should have experience on any version control tool ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["automation framework", "Object oriented design", "Core Java", "Eclipse", "Fixed income", "Investment banking", "JIRA", "Information technology", "SDLC", "Analytics"]}