{"JOB DESCRIPTION": " Job Description     We expect our Staff engineers to do much more than just writing code     Help our client to achieve their real goals by understanding the requirements and how it would help them in their business.      Use technologies including Java, REST, NoSQL and more.      Experience building highly scalable, low latent applications with high TPS      Leverage newer technologies and develop solutions to build next generation of resilient, reliable and scalable services      Lead efforts to architect, design and implement various aspects of our global transaction processing systems.      Comfortable in leading meeting and discussions with non-technical teams.      Excellent interpersonal skills and team player.      Most important qualities for the candidate are:      Academics : Bachelor or Masters degree in Computer Science or related field      Leadership : leading solutions and working with teams to achieve it.      Curiosity : A desire to seek clarity of requirements and why tasks are done a certain way      Creativity : The ability to take a list of needs and insights and come up with other innovative ideas.      Strategic focus : Skill to understand big picture and stay focused on task to achieve goals      Attention to detail : The capability to perform any research systematically and accurately      Strong work ethic : The innate drive to do work extremely well      Enthusiasm : A passion to understand people and deliver better products and services to them     Qualifications     Bachelor / Masters Degree in Engineering with minimum 8-12 years of experience in Software Development building Enterprise products    Extensive experience in design & development of applications on multiple platforms (Linux and Windows), using Open Source products.    Excellent analytical and problem solving skills.    Strong coding experience in Java 8 or higher with good experience in Spring, REST, Microservices, Dockers etc. Understanding of Performance tuning & optimisation.    Experience in Design & Architecture, design patterns with good knowledge in multi-tier enterprise architecture.    Experience in any of the RDBMS / NoSQL databases.    Good written and verbal communication skills. Experience working in a Agile team.    Ability to communicate effectively up, down and across to assure that your ideas are heard    Passion for exceeding expectations and delivering exceptional code  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization, Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Computer science", "Performance tuning", "Backend", "Linux", "RDBMS", "Coding", "Enterprise architecture", "Agile", "Windows", "Open source"]}