{"JOB DESCRIPTION": "       About the Role    Acts as a Sr. Developer, develops highly complex code, and provides application coding and design guidance and consultation by utilizing a thorough understanding of applicable technology, tools and existing designs.     Responsibilities    Implements complex business requirements, designs and writes technical specifications to design or redesign critical computer platforms and applications.   Provides coding direction to less experienced staff or develops highly complex original code.   Acts as an expert technical resource for modeling, simulation and analysis efforts.   Verifies program logic by overseeing the preparation of test data, testing and debugging of programs.   Assures quality, security and compliance requirements are met for supported area.   You will act as a Senior Developer role in a SCRUM setup and contribute in all phases of SCRUM collaborating with other team members   In this role, you will often take up tooling, integrating with other applications, piloting new technology Proof of Concepts and leveraging the outcomes in the ongoing solution initiatives   Participate in design of RESTful APIs in Microservices Architecture for Cloud   You will apply Domain Driven Design, Object Oriented Design and proven Design Patterns   You will develop test automation for the code developed     Essential Qualifications    8+ years of application development and implementation experience   8+ years of Java J2EE development experience.   Excellent working experience and deeper knowledge in Spring Framework and API s.   6+ years of JAX-WS, Axis, SOAP, REST web services development experience   4 + Years of experience in Front End, UI, SPA application development using Angular, ReactJS   2+ Years of Microservices Development Experience   5+ years of Oracle DB and SQL experience   2+ Years of NoSQL Experience   Good understanding and experience in building Cloud Native enterprise applications.   Good Experience implementing Unit Testcases using Junit, Jacoco and leverage SonarQube.   Good Experience with services testing like JMeter, SOAPUI etc   Well-versed with tools like AppDynamics, Splunk and CI/CD tools.     Desired Qualifications    Bachelor s Degree in engineering discipline   Financial services industry experience with Credit Card experience is a plus   Ability to simultaneously lead multiple projects and work with multiple lines of businesses   Proficiency in envisioning and orchestrating End-to-End business solution with right mix of technologies including infrastructure sub-domain   Candidate can demonstrate that they have the self learning capability to ramp up quickly without a lot of instruction, training, or hand-holding.   Candidate can demonstrate that they possess a balance of technical skills with hands-on implementation experience   Iterative and Agile development methodology   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization, B.Tech/B.E. in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Front end", "Simulation", "Coding", "Enterprise applications", "Debugging", "Application development", "Scrum", "Oracle", "Financial services", "SQL"]}