{"JOB DESCRIPTION": "            About Role:           Team member will be working on Application Development work in WIMT.           Responsibilities:             Involve in end end lifecycle of Product/Application development, analyze highly complex business requirements, designs and writes technical specifications to design or redesign complex computer platforms and applications.          Provide coding direction to less experienced staff or develops highly complex original code.          Work independently, analyze requirements and upstream/downstream impact.          Discuss with stakeholders, design solutions and implement          Able to switch between projects in the group.     Individual contributor in the Agile squad and ability to work in a team          Act as an expert technical resource for modeling, simulation and analysis efforts.          Verify program logic by overseeing the preparation of test data, testing and debugging of programs.          Oversee overall systems testing and the migration of platforms and applications to production.          Lead projects, allocates and manages resources and manages the work of less experienced staff.          Assure quality, security and compliance requirements are met for supported area          Take end to end responsibility of the SDLC, from requirements elicitation to deployments.           Essential Qualifications:           7+ years of application design, development and unit test automation          5+ years of JAVA/ .NET development experience, Angular          3+ years of RDBMS integration and development (MS SQL SERVER, ORACLE),        Spring Boot + JPA/Hibernate along with J2EE technologies.          Understanding of SOA concepts and technologies such as WSDL, SOAP,        REST, PCF and micro services.          Experience on web and UI development experience with Angular, HTML5, CSS3, JavaScript/JQUERY and AJAX.          Hands on Experience of Relational Databases, SQL, designing tables efficiently, write DDL scripts, stored procedures, views, Functions and ORM technologies.          Exposure to React, Bootstrap or similar framework strongly preferred.          Experience in Responsive Web Design, UI Debugging and Browser Developer Tools.          DEVOPS - CICD pipeline(jenkins , gradle , sonarcube) exposure          Hands on experience of Multi-threaded approach and Asynchronous development.          Experience in using version control (i.e., GIT and SVN) and Build tools.          Experience with working in Windows Server and RHEL/LINUX Server environments          Strong understanding of the Client - Server Architecture.          Work experience on Servers like Jboss, Apache Tomcat and WAS including configurations.          Exposure to web services, service oriented architecture and messaging concepts is required.          Ability to work well in a team and individually.          Understanding and experience with full software development life cycles - Agile (Scrum )           Desired Qualifications:             Exposure to Java programming          Knowledge of Selenium test automation, BDD using Cucumber          Experience using tools & technologies like uDeploy, SonarQube, Jenkins          Experience in using any of the security tools like FortifyScan, Veracode or Appscan          Angular 8, Bootstrap, ReactJs, NodeJs experience preferred          PCF or Azure Cloud exposure     ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Hibernate", "jQuery", "SOA", "Linux", "Javascript", "J2Ee", "Windows", "Oracle", "SQL", "Ajax"]}