{"JOB DESCRIPTION": "       About the Role          This position will be an integral part of Wholesale digital team within the CCIBT - TMPS technology group. Need to play Software Engineer role that expected to perform front end and back end related design, development and maintenance activities for DRU applications in TMPS. Candidate needs to work with US partner teams and it demands to be available as per the delivery timelines.                 Responsibilities              Develop and support UI features using JavaScript frameworks such as React and Ember JS      Contributes to the back end application design, development, testing and release activities                Ability to do the reviews and follow the process methodologies and documentation                   Be a trusted technology partner for Treasury technology teams and Wells Fargo India stakeholders                   Report status to Technology/Engineering Manager.                      Essential Qualifications              Bachelors/Master s degree in Computer Science or equivalent               9+ yrs. of hands-on IT experience in designing, developing and testing complex, highly integrated, distributed applications using Java/JEE, Selenium, SQL Oracle, web services, Junit/TestNG and other technologies / frameworks.               Design test plans, scenarios, automation scripts and develop testing programs to build automation test suite for large scale applications.               Experience in understanding the requirements, current/future state of enterprise design and architecture.               Good experience in DevOps tools Git, Gradle, Maven, Artifactory, Jenkins and uDeploy               Good to have experience on microservices and cloud               Good to have working experience in banking domain and agile methodology             Desired Qualifications              Need to work as an individual contributor and should lead a team      Good verbal and written communication skills                Good problem solving and analytical skills              Should be detail oriented, able to multi task          Exposure to banking domain is a plus      ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Maven", "Front end", "GIT", "Manager Technology", "Design development", "Agile methodology", "Selenium", "Analytics", "Wholesale"]}