{"JOB DESCRIPTION": "  About the Role    You will work as part of the CLT Architecture & Engineering team to drive consistent implementation of Enterprise Application Secure coding practices in the group. You will interact closely with multiples technology partners inside and outside the Line of Business.     Responsibilities      Conduct secure code review sessions with application teams; guide the Engineers to build secure and robust software    Review applications for adherence to secure coding practices and certify applications for security adherence prior to release    Assist Engineering teams to build Threat Models, fix issues identified during SAST and DAST scans    Keep track of defects and aid towards closure    Disseminate information about the secure coding guidelines to the teams    Stay current on the vulnerabilities and remediation,    Share knowledge to Engineering teams     Essential Qualifications      Minimum of 8 years of overall IT experience    Minimum 6 years of application security experience    3+ years of experience with all or some of the following practices like Security Requirements, Application Threat Modeling, Static Analysis, Application Security Risk Assessments, Security Design requirements.    SAST (Static Analysis Software Testing) experience with tools like Fortify and Checkmarx is a must.    Knowledge and experience in working with various application security tools and systems.    Knowledge and understanding of secure SDLC (System Development Life Cycle) methodologies.    Experience in drafting application security coding standards.    Knowledge and experience in identifying and suggesting mitigations to OWASP top 10, CWE/SANS top 25 to development teams.    Ability to manage multiple priorities in a fast-paced dynamic environment.    Advanced problem solving skills, ability to develop effective long-term solutions to problems.    Excellent verbal and written communication skills    Excellent inter-personal skills contributing to cordial team environment.     Desired Qualifications      Experience of working across one or more geographic territories or regions    Application security experience with banking/financial services applications   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["remediation", "Automation", "Interpersonal skills", "Coding", "OWASP", "Manager Technology", "Application security", "SDLC", "Analytics", "Financial services"]}