{"JOB DESCRIPTION": "   About the TeamSWN teams mission is to build the next generation of Ubers Mobile Networking, Datacenter Ingress, Service Discovery, Load Balancing, Edge termination and RPC solutions. At Uber we have a complex infrastructure spanning both data centers and cloud. SWN technology stack ensure seamless integration and communication of PRIME & ATG services hosted on cloud or data centers.      We engineer long term solutions to these high-impact problem areas that empower every engineering team across the company.Were establishing best practices and helping other teams architect better solutions, and were not afraid to get into the nitty gritty low-level details. Our tools power everything from automatic datacenter failovers, layer-7 load balancing, and the APIs developers use to consume other Uber services. We have a measurable impact on ensuring Uber remains reliable, durable and scalable.   What the Candidate Will Need / Bonus Points   What Youll Do    Provide design, implementing, testing and rolling out the next generations of our infrastructure at Uber.  Collaborate with others, from talented team members within your group, through smart technologists in other functions like machine learning, AI or data science, to responsible leaders across Uber.  Build up relationships with people in the organization, meaningfully collaborating and building trust.  Up the bar on sustainable engineering by improving best practices, producing best in class of code, documentation, testing and monitoring.What Youll Need      2 years of relevant engineering experience.  Experience with Java, Go or C (bonus points for more than one).  \"Mobile Networking Staff role: Deep knowledge of Mobile Network stack (QUIC, gRPC, cronet or equivalence)  Proficiency in Linux.  Full-stack infrastructure knowledge.  You are willing to build great interpersonal skills  Excellent written and verbal communication skills, including the ability to write detailed technical documents.  Undergraduate degree in computer science or equivalent.  You can collaborate well with several product engineering teams to help requirements and system design.     Open, curious, and bold approach to problem-solving and striving for the best solution. ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Product engineering", "Interpersonal skills", "Linux", "Software Engineer II", "Machine learning", "System design", "Load balancing", "Monitoring", "Technical documentation"]}