{"JOB DESCRIPTION": "  About the Role     As a Developer, you will be responsible for hands-on coding to meet the objectives for your project assignments. You will ensure delivery of the project roadmap while producing sustainable, reusable, well-tested code that meets our internal agile software development standards.     Responsibilities      You must effectively manage the engineering function for your assigned project to ensure it is successfully delivery to production.    Must foster strong working relationships with team members and internal business partners to effectively manage priorities and ensure success of your projects.    To be successful at this position, you must be a self-starter with the ability to take ownership and handle multiple tasks simultaneously while keeping a good sense of humor.    Good interpersonal and communication skills    Team-oriented and thrive in a fast-paced environment.     Essential Qualifications      10+ years of professional IT industry experience in software development    Design, build and configure applications using Informatica Power Center to meet business process and application requirements.    Should have hands-on experience in Data Integration(ETL) using PowerCenter.    Should have hands-on experience in Rule point.    Hadoop framework understanding    Should have experience in Abnitio    Experience in Java is added advantage    Knowledge on Unix/Linux environments    Must have strong skills in Data Analysis, Data Mapping for ETL processes and Data Modeling.    Good experience in creating performant design using Mapplets, Mappings, Workflows, Worklets for Data Quality(cleansing) ETL jobs.    Should have interacted with the business analysts in gathering requirements and independently able to design and deliver the Informatica Mappings.    Must conduct root cause analysis and advanced performance tuning.    Contributed to unit testing framework for ETL    Should have hands on experience on developing Oracle PL/SQL and Microsoft SQL server queries.    Should have working experience on UNIX and shell scripting.    Should have working experience on Autosys scheduling tool.    Should be responsible for the creation of automated solutions, including requirements, design, development, testing, and deployment.    Ability to translate business needs into technical solutions and communicate fluently with business users, technical staff and management.    Contribute to new tools which brings in efficiency    Implement and drive best practices on the continuous improvement    Experience developing in an agile software development environment (Scrum) .    Experience with Jenkins and CI/CD tools for build and deployment.     Desired Qualifications     Kafka streaming will be added plus    Python experience is an added advantage   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Unix", "Performance tuning", "Linux", "Data modeling", "Coding", "Shell scripting", "Agile", "Scrum", "Informatica", "Python"]}