{"JOB DESCRIPTION": "      About Role:     Team member will be working on Application Development work in WIMT.       Responsibilities:         Involve in end end lifecycle of Product/Application development, analyze highly complex business requirements, designs and writes technical specifications to design or redesign complex computer platforms and applications.       Provide coding direction to less experienced staff or develops highly complex original code.       Act as an expert technical resource for modeling, simulation and analysis efforts.       Verify program logic by overseeing the preparation of test data, testing and debugging of programs.       Oversee overall systems testing and the migration of platforms and applications to production.       Lead projects, allocates and manages resources and manages the work of less experienced staff.       Assure quality, security and compliance requirements are met for supported area       Mentor less experience technical staff and may be involved in activities for their skills development       Essential Qualifications:       5+ years of application design, development, and implementation experience       5+ years of Java/ .NET development experience       3+ years of experience in Angular       3+ years of creating and /or integrating with RESTful/SOAP web services       3+ Unix , Autosys , Javascript       3+ years of RDBMS integration and development (MS SQL SERVER, ORACLE )       Ability to work collaboratively within team environment       Advanced problem solving and technical troubleshooting capabilities       Experience with delivering projects using Agile software development techniques.       Strong analytical and problem-solving abilities, with quick adaptation to new technologies, methodologies and systems.       Strong leadership skills, ability to lead and drive the team ensuring defect free deliverables and also motivate the team to perform better everyday taking up more ownership and accountability.       Must possess innovative and Out-of-box thinking while developing advanced technical solutions to business problems, and grab opportunities to improve system resiliency.       Ability to coordinate, multitask and meet SLA/deadlines.       Ability to support and function highly in a blended extended team support and distributed development model.        Strong documentation and communication skills and experience with development and implementation of new processes.       Ability to build and maintain collaborative relationships with various technology teams across Wells Fargo.        Ability to work both independently and within a team environment, driving self and the team to achieve technical and functional excellence.       Familiarity and experience operating in an Enterprise environment using formal procedures and policies required for escalation and outage resolution.       Presentation skills, strong interpersonal skills, facilitating conference calls.       Displays initiative, exhibits flexibility and adaptability.        Desired Qualifications:         Banking domain experience       Proficiency with Agile and Devops practices and toolchain.       Proven leadership in delivering Cloud solutions.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Unix", "Automation", "MS SQL", "RDBMS", "Coding", "Javascript", "Agile", "Application development", "Troubleshooting", "Oracle"]}