{"JOB DESCRIPTION": "  Responsibilities     Perform a wide variety of activities pertaining to compliance with applicable regulatory requirements, quality management system (QMS) maintenance, improvement and harmonization, and quality control and assurance.     Produces and completes SW Quality Engineering documents under direct supervision.     Responsible for performing timely, detailed SW Quality Engineering tasks: assessing software design and reviewing tests and other performance data, analyses market feedback, completing or assisting with in the root cause analysis and SW Quality problem solving.     May also provide other SW Quality Engineering support, including assisting organizational units in addressing SW Quality Engineering deficiencies.     Verification of execution of processes and their deliverables in product creation and subcontracting projects and report the findings to upper management.     Review and Approval of designated project documentation in product creation projects.     Advice to product creation projects concerning the definition and implementation of quality assurance activities     Advise upper management with respect to release for delivery of products     Support and represent Q&R discipline in Design Reviews, Hazard Analysis brainstorms, Health Risk Assessments, FMEAs, and other Risk analysis activities     Initiate, stimulate, and support the implementation of process improvements     Execution of audits in all business processes and report the findings to upper management     Support and advise the organization in corrective and preventive actions     Participate in the maintenance, improvement and deployment of the Quality Management System     Translates regulations and standards and bring them to consolidation in the organization and the Quality Management System     Represent the approbation officer in projects and support in the activities to acquire product licenses and approvals     Participation in and verification off changes to DMR and release orders where Q&R involvement is needed.     Qualifications and Know-How     Bachelor or Master degree in relevant knowledge domain, e.g.: Computer Science , electronics, Electrical or information technology.     Knowledge of relevant external standards for Quality Management Systems for medical devices (e.g. ISO13485, ISO 14971, MDD, FDA-QSR)     Knowledge of (software) processes and procedures     Qualified Auditor of Quality Systems ( Preferable)     Good skills in reporting, both in writing and oral     Fluent speaker and writer in English     Project management knowledge and skills.     Sound knowledge of the basic functionality of our products     Knowledge of product creation and (software) development methods & tools     Experience in using problem solving tools     Experience in working with legal documents     Knowledge of external regulations and standards relevant for our products     Ability to translate legal requirements in to procedures and instructions  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Medical, Healthcare, Hospitals", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Change management", "Software design", "ISO", "Project management", "Quality systems", "Software Engineer", "HTML", "Continuous improvement", "Information technology"]}