{"JOB DESCRIPTION": "Hi All,Please find the JD attached below for your reference If Interested, Please share the below mentioned details for your reference to Sathyavelu.Madesh@ge.com Total Experience :CTCExpected CTC :Notice Period :Willing to Relocation to Bangalore : Job Description SummaryResponsible to lead designing, building, delivering and maintaining software applications & services. Responsible for programing a feature and or a small feature set. Contributes to the team and leads by guiding / directing Team Members while partnering with stakeholders and other leads for business outcome and team success.Job DescriptionRoles and ResponsibilitiesIn this role, you will:• Be responsible for defining, developing, and evolving software in a fast paced and agile development environment using the latest software development technologies and infrastructure• Provide technical leadership to an agile team of 5-7• Work with Product Line Leaders (PLLs) to understand product requirements & vision• Translate requirements / vision into prioritized list of user stories and deliver to required timelines and quality standards• Work with product line leaders and architects to develop multi generation software technology plans• Drive increased efficiency across the teams, eliminating duplication, leveraging product and technology reuse• Support process improvements which guide the development, sustaining & support activities• Work cross functionally with other business departments to align activities and deliverables• Drive world-class quality in the development and support of products• Ensure team receives consistent messages and has clear understanding of business direction, strategy and results• Engage subject matter experts in successful transfer of complex domain knowledge• Apply principles of SDLC and methodologies like Lean/Agile/XP, Software and Product Security, Scalability, Documentation Practices, refactoring and Testing Techniques while practicing Dev-Sec-Ops and developing with microservice cloud architecture Write code that meets standards and delivers desired functionality using the technology selected for the project ; full stack developer with expertise in Java / Python / Angular / Polymer / Spring technologies• Understand performance parameters and assess application performance• Work on core data structures and algorithms and implement them using technology chosen• Proactively share information across the team, to the right audience with the appropriate level of detail and timelinessEducation QualificationBachelors Degree in Computer Science or in STEM Majors (Science, Technology, Engineering and Math) A minimum of 5 years of professional experience Skilled in core data structures and algorithms and implements them using Java, Python, Polymer, Angular, Spring technologies. Skilled in cloud technologies - AWS / Azure with good understanding of microservice architecture and principles.Desired Characteristics Strong Ownership - Takes responsibility for assigned deliverables with focus on outcome and customer. Strong Team player with learning & energizing outlook- Shows respect for differences and diversity, utilizes strengths of team members to achieve optimal performance while energizing others around. Strong communication skills to manage stakeholder expectations & lead with transparency & humility. Leads team for continuous improvement as part of an Agile team applying Lean principles", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["Java", "Angularjs", "Polymer", "Spring", "Python"]}