{"JOB DESCRIPTION": "Roles and ResponsibilitiesYour Role and ResponsibilitiesIBM Cloud is currently looking for a Software Developer to join our global development team building the next generation of AI-infused, cloud-native management tools for hybrid and multi-cloud environments. As a Software Developer on the Observability team, you’ll be responsible for developing quality code to collect data from a wide array of systems our clients use. This data feeds our AI systems that extracts meaningful insights our clients can use to increase resiliency, performance, and quality of service. Working in an agile environment, you will be part of a multi-disciplinary squad working on our observability framework. Your work will involve close collaboration with Architects, DevOps Engineers and Offering Managers across our global organization. The successful candidate will have deep technical skills in software development with multiple languages, agile practices, distributed systems, networking, data collection and observability technologies running on Linux and Kubernetes/OpenShift. Responsibilities:Work as part of a development squad to deliver software for data collection and observability.Follow Agile development methodologies/best practices to produce quality code and documentation deliverables.Participate and present at regular playbacks to the broader team, showing the output of the squad.Contribute to and implement functional specs/designs to feed into a larger system architecture.Deliver customer value through innovative solutions that address customer business problemsRequired Technical and Professional Expertise8+ years of software development experience of front-end experiences in React JS, with additional experience including:Working with a design system, working off redlines and prototypes (SketchMeasure, Invision)Component design, Redux, and testing patternsReact Testing Library (RTL) and/or some other testing solutions such as EnzymeJavaScript, JSON, HTML, CSS, as well as CSS per-processors like LESS and SASSREST APIsImplementing responsive designs (including grids)Cross-browser developmentExperience working with Kubernetes/OpenStack or related cloud-native technologiesExperience working with CI/CD processes, DevOps methodologies and tools such as git, Jenkins, Travis.Preferred Technical and Professional ExpertiseTraining and Experience in development and application of Artificial Intelligence models Experience working with observability technologies like open source technologies: Prometheus, Grafana, ELK, Jaegar, fluentd, or commercial products such as Sysdig, Datadog, AppDynamics, New Relic, DynatraceExperience with IBM platforms: Power and System ZExperience with multiple cloud services, including IBM Cloud, AWS, Azure, GoogleMaster’s degree in Computer Science or equivalent", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "MS/M.Sc(Science) in Computers, M.Tech in Computers, MCA in Computers", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["CSS", "Software Development", "Front End", "Open Source", "GIT", "Linux", "Redux", "Javascript", "HTML", "JSON"]}