{"JOB DESCRIPTION": "Roles and ResponsibilitiesPosition summaryNuance has an exciting opportunity for a Software Engineer to join a world-class team maintaining and evolving industry leading IVR platforms. The candidate will work on an Agile Scrum team to design, implement, and maintain robust and scalable solutions, and will have a direct impact on the cloud-native evolution of platforms that millions of users interact with every day.Principal duties and responsibilitiesProduce high quality and well-documented code for components in multiple programming languages.Architect & build next-generation cloud-native IVR administration microservices.Collaborate with development and operations teams to design and implement cloud-native DevOps standards and CI/CD pipelines.Work collaboratively with support teams to analyze and resolve production incidents.Analyze product requirements and customer needs, to write both functional and technical specifications for application components as well as major features/versions.Participate in all phases of the software development cycle as part of a multi-functional Scrum team.Implement and maintain both unit tests and automated functional test coverage in collaboration with quality engineering Scrum team members.Required SkillsBachelors degree in Computer Science or equivalent7+ years experience in Enterprise grade software developmentStrong Core Java development skills with multi-threading Experience with distributed systems programming (protocols: HTTP/REST, WebSockets, SOAP, gRPC)Experience in Frontend programming in pure JavaScript applications.Experience building and deploying cloud native applications using Docker, Kubernetes etc.Experience of distributed CacheExperience of using Jira and confluenceExperience with both Windows and UNIX/Linux operating systemsAbility and comfort to interact with customers during implementation, integration, testing phases; provide post-deployment support.Good written and verbal communication skills; English is the language of business.Preferred SkillsExperience in some of the popular Front End frameworks: React and AngularCloud services experience (AWS, Google, Azure)Experience with Agile Software Development MethodologiesExperience with Project Management tools: JIRA, ConfluenceExperience with build automation tools: maven, JenkinsAdditional Information Nuance offers a compelling and rewarding work environment. We offer market competitive salaries, bonus, equity, benefits, meaningful growth and development opportunities and a casual yet technically challenging work environment. Join our dynamic, entrepreneurial team and become part of our continuing success.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "BCA in Computers, B.Sc in Computers, B.Tech/B.E. in Computers", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Maven", "Core Java", "Rest", "Multithreading", "Software Development Methodologies", " Websockets", "Javascript", "SOAP", "Angular", "Microservices"]}