{"JOB DESCRIPTION": "Design and implement core components of the Vulnerability Assessment/Management ToolSaaS application, able to perform vulnerability checks, security compliance in Cloud Snapshots.Optimize application for high performanceBuilt application bundles that help in auto-provisioning, data pipelines,etcMaintain software quality through coding standards/guidelines and peer reviews.RequirementsHands on experience & Very strong in Golang Programming (at least 2 years practical experience)and Very strong Python (at least 5 years practical experience)Very strong in server-side, multi-threaded programming using Os-Internals.Very strong in data structures and algorithmsGood knowledge in development of Cloud native/containerized solution from ground-upHands on experience in application deployment in Kubernetes(at least 2+ years practical experience)Have good work experience in Vulnerability assessment tools.And understanding on Cyber security compliance standards/policies Asynchronous programming, GRPC, REST APIs and Database design (SQL, PostgreSQL)Familiar with NoSQL Apps, monitoring Apps are deployed and managed  Prometheus, Grafana,Spark, SQL,MongoDB, Thanos, Cassandra, Kafka, ElasticSearch,Fluentd,Kibana etcDesired to have understanding of Helm install/upgrades and DevOps/Configuration Management tools like Terraform/Ansible.Development experience in AWS Cloud with Certification is a plus.Having Cyber Security understanding is an advantage.Overall Software Development experience of 5 to 10 years only.Desired Candidate Profile Wavelabs is seeking a talented software engineer to join our connectivity engineering group. S/he will design and own features within the Software Product lines of valued client.  AWS Cloud Snapshots, image backup, filesystems, OS-Internals, Container (Docker, LxC), Kubernetes, app/user management, Resource allocation, job/task management, template engine, API design/implementation are just few of the areas of focus. Eligible candidates should have experience developing SaaS applications using thread-safe programming, database manipulation and asynchronous programming techniques.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["golang", "Security", "Cloud"]}