{"JOB DESCRIPTION": "Lantronix, Inc. (Lantronix) (NASDAQ: LTRX)Position: Senior Member Technical Staff (Embedded Software Engineer)Job ID: SW_ENGMultiple Locations: Hyderabad INDepartment: EngineeringIf you are looking for an opportunity to work on the most advanced upcoming technology with new and exciting products not yet on the market, with everyday bringing something new and challenging to work on, Lantronix is the place to be. Having recently completed its acquisition of Intrinsyc Technology, Lantronix expanded team of engineers work with the most advanced technology available from the world’s leading technology companies to help leading global brands create the next-generation of intelligent connected devices. Lantronix engineering services team works closely with silicon-vendors to include their cutting-edge processor designs in tablets and embedded applications including; robotics, wearables, automotive, medical, videoconferencing, digital signage, augmented reality, industrial and consumer cameras, and many more.Job Type: Full-Time, PermanentSalary and Benefits:  Lantronix offers an industry standard comprehensive benefits package and competitive salary in accordance with experience.Position Overview:Lantronix is currently seeking a senior embedded software engineer with experience in developing and troubleshooting Android and Linux devices, especially in the Android framework, HAL, and Linux kernel areas.Candidates must have a strong technical background and be capable of coming up to speed with a new team quickly. Strong analytical, problem solving, and communication skills are essential as well as the ability to work collaboratively in a team environment. Four years of industry experience in developing and debugging Linux kernel device drivers is a firm requirement.Prior knowledge of camera drivers and MIPI display technology is useful.Key Responsibilities:Takes technical ownership of projects, develops system specifications and delivers quality software features to ensure schedules and objectives are met.Assist the development of Android and Linux based devices.Quickly ramp up and become a key contributor within a team of experienced embedded software engineers.Works independently to brings up new hardware and develop/integrate Linux kernel drivers.Fixes issues and provides technical guidance on a wide range of Linux Kernel drivers and Android framework HALs from camera to display to USB to Bluetooth to WiFI.Stays abreast of technical area and provides knowledge transfer to fellow team members.Designs or modifies Hardware Abstraction Libraries for Android support of low-level device features.Qualifications: Minimum 4 years Embedded software development experience in Linux kernel drivers. Android experience desirable.Minimum 4 years of C/C++ experience. Java experience useful, but not required.Bachelor’s degree in computer science, electrical/software engineering or equivalent. Advanced technical degree desirable.Requires strong leadership and communication skills (written and verbal).Experience in the integration of a wide range of drivers, including at least one complex driver technology (HDMI/MIPI display, CSI camera, Linux dynamic power management, etc). Multimedia experience desirable.Experience in hardware bringup, familiarity with HW documentation such as schematic and layout drawings.Good working knowledge of embedded or mobile devices.Good problem-solving and diagnostic skills, in a fast-paced environment.Requires a solid understanding of the software development and project management life cycle.Language: Strong written and spoken English required.Company OverviewLantronix’ product development services provide hardware, software, and solutions for next-generation embedded and wireless products. Solutions span the development life cycle from concept to production and help device makers and technology suppliers create compelling differentiated products with faster time-to-market.We deliver superior results for clients with standards of high integrity. Our values and performance have enabled us to partner with the world’s leading OEMs to create award winning new products.Lantronix is a leading provider of embedded solutions for Qualcomm Technologies, Inc.’s Snapdragon technology and developer of the Open-Q System on Module and reference Development Kits. These solutions are being built using the latest 64-bit 8-core ARM highly-integrated SOCs, and customized for exciting new products such as robotics, augmented reality glasses, ultra-high definition 3D televisions, and many more breakthrough products. ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Hardware & Networking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Electronics/Telecommunication, Computers"}, "KEY SKILL": ["Android Framework", "Linux Kernel", "Embedded Software Development", "Java", "C++", "C", "Device Drivers", "Software Engineering", "ARM"]}