{"JOB DESCRIPTION": "The software developer is responsible to look after the development of web platform and mobile applications of Filmboard done on PHP with Codeigniter and BootstrapJob Description – Software DeveloperReports to: Project Manager Years of Experience: 3 - 5 Years Working Days: Mon to Sat Minimum Qualification: BE/BTech/ MCANature of Work: Office Organization: 1 – 2 Developers Filmboard is a new age B2B marketplace set to disrupt the way audio visual content is made in India. At the cutting edge of this disruption is technological innovation and extensive feet-on-street. Filmboard will change the way films are made in India.Why? Well, it's said that we are the largest film, TV series, Web series, Ad films producing country. So the way we produce this content needs to be world class right?So apart from bringing in transparency, project management skills, integrity and professionalism, we also plan to gradually overturn the existing culture in the way work happens.Impossible? No.Arrogant? Maybe. Who cares.If that's arrogance, we want more arrogant people joining us.Because to challenge status quo, they first need to challenge us.But that challenge better have substance, and be backed up by hard work and thought.So if you think you have that in you, write in to us.Read more about us at https://www.filmboardmovies.com/news-and-media.phpWe won’t select you. You need to tell us why it will be incredibly stupid of us not to select you. Here are some details- ... blah blah blah!But if you want to do anything else with us, write to us in any case.Role Summary The software developer is responsible to look after the development of web platform and mobile applications of Filmboard. The incumbent in this role will have to be coding for the open source applications. The current tech stack is PHP with CodeIgniter and My SQL. The person will be responsible to manage the complete project development from scratch as well as bug fixing of the current developed platform. Once created, regular management of the complete platform will also be the responsibility of the incumbent in this position.List of Roles & Responsibilities: 1. Code and develop the Filmboard’s web and mobile platform 2. Follow good coding practices; for eg. proper commenting is being done while coding3. Project Management of the software development including Version control, adherence to timelines, meeting milestones and ensuring that the software is ready to use in the stipulated time. 4. Adhering to daily/weekly coding targets, self-monitoring progress vis--vis timeline set, maintaining a strong control of the project schedule & that the overall team deliver the software on time 5. Optimize the website on an ongoing basis, based on the usage6. Demonstrable knowledge of web technologies like HTML, CSS, Javascript, AJAX etcCritical Job Requirements:Knowledge & Skills Attributes • Conversant on PHP with CodeIgniter• Demonstrable knowledge of web technologies like HTML, CSS, Javascript, AJAX etc.• Good knowledge of relational databases like MySQL.• Competent to work on APIs• Tools for code management, version control, bug/defect tracking. Thorough familiarity with Github, Bitbucket etc.• Project Management exposure • Team player• Should be able to differentiate between a good code and a bad code• Ability to coordinate work with other PHP developers and HTML programmers• Cool and Problem Solver ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Media, Entertainment, Internet", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "MCA in Computers", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["CSS", "Software Development", "Open Source", "Web Technologies", "JavaScript", "MySQL", "PHP", "HTML", "Ajax"]}