{"JOB DESCRIPTION": "Roles and ResponsibilitiesThe position holder will work as part of an agile development team on “full stack”-development activities for the Dragon Medical Server Cloud Platform with an exciting mixture of technologies. The position requires the experience of a principal agile software development engineer to enhance the effectiveness of a motivated agile team.Principal duties and responsibilities:Actively participate as a scrum team member in all phases of the development process.Design, implements, and maintain monitoring tools & mechanism to ensure high availability, latency, and overall system health. Design and implement innovations that improve service reliability, infrastructure resiliency and security, and availability. Serve as subject matter related to the service operations for any issues in the Azure cloud data centers.Develop and automate cloud deployment, post deployment validation, and other operational activities. (i.e. Continuous delivery pipeline). Modelling, programming, testing, test-automation, continuous integration and contribution to software release activities for the Dragon Medical Server Cloud Platform.Design, implement and execute unit tests for code modules or components to ensure high quality code releases.Perform peer design and code reviews.Troubleshoot and resolve application defects.Ability to multi-task and stay organized in a dynamic work environment.Contribution to requirements engineering and top-level design.Produce high quality, scalable enterprise software.Participate in functional and technical reviews/sprint reviews.Effectively work with multiple stakeholders and teams located in different geographical locationsPerform tasks related to securing and keeping the products, tools, and processes that you are responsible for securing.Knowledge, skills and qualifications:Education: Bachelor degree in Computer Science, Engineering, Math or related field. Master degree is a plus.Minimum years of work experience: 9+Required skills:Programming languages: .net languages,Python, C#, Microsoft Operating systems & technologiesExperience with continuous software integration and deployment with Azure.Experience with product development for the Microsoft Azure platform.Experience in software development, automation, infrastructure as code.Experience with agile development methodology (Scrum, TDD)Experience with development of client and server-side enterprise class applications.Excellent English communication skills (written, oral, listening).Excellent technical analytical, debugging and problem-solving skills.Has a reasonable balance between getting the job done vs technical debt.Enjoys producing top quality code in a fast moving environment.Enjoys working in a team; willingness to put the needs of the team over their own.Preferred skills:Experience with Git.Experience with JIRA, Confluence, MS VSTS (Azure DevOps) Bamboo and other Atlassian tools.Experience with development of Healthcare Information technology applications.Familiarity with enterprise-level models of agile development (Scaled Agile Framework)Experience with professional product development in combination with speech recognition technologies and/or artificial intelligence.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers, BCA in Computers, B.Sc in Maths, Computers, B.A in Maths", "PG": "MS/M.Sc(Science) in Computers, Maths, M.Tech in Computers, M.A in Maths, MCA in Computers", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["C#", " C#", "Speech Recognition", " MS VSTS", "Artificial Intelligence", "JIRA", "Software Development", "VSTS", "TDD", ".Net", "Microsoft Azure", " Confluence", " Microsoft Operating systems ", "VS", "Azure Devops", "Python"]}