{"JOB DESCRIPTION": "Roles and ResponsibilitiesPosition summaryPrincipal Software Engineer is responsible for designing, implementing, and deploying new features for our client and internal facing web application. This role is a key technical delivery position working with internal development teams. This individual will also be tasked with determining simpler, more automated ways of deploying and delivering our solution to increase ease of configuration and improve productivity for users. We are looking for an experienced Software Developer with expertise in Mobile application and client/server infrastructure. The position is to help develop mobile SDKs to help customers integrate with our NDEP platform which offers Virtual Agents (AI Bots) and live Agents. The SDK will allow to display a customizable chat interface in a mobile application while managing all the backend connections, communications, and events. Principal duties and responsibilities:Design, implement and deploy new features and initiatives from start to finish Work with product managers and product owner to flush out requirements and designer to finalize user interface and user experience Help define and drive architectural designs and coding guidelinesActively participate as a scrum team member in all phases of the development processMobile SDK development (UI, Framework and unit test)Mobile app development building Sample app to represent use cases and show case features.Perform peer design and code reviewsEffectively work with multiple stakeholders and teams located in different geographical locationsFollow secure coding practices following different security and data processing compliances (PCI, GDPR, PII, )Knowledge, skills and qualifications:Education: Bachelor’s degree in related field is preferred Minimum years of work experience: 9 years Required skills: Architect, develop and maintain complex client facing SPAAbility to oversee and lead the Mobile developmentExperience building Frameworks with simple and intuitive APIs.Experience building polished UIs following the latest trends and UX best practices.Experience writing build scripts with xcode command line.Experience with Backend integration and managing API connections (JSON, HTTP Rest, WebSocket, gRPC). Preferred skills: Mobile app development (Android).Experience with JAVA and Android Studio.Previously published mobile app on AppStore or PlayStoreExperience with security, performance, monitoringExperience with Java or other OOP language", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Mobile", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Java", "Websocket", " HTTP Rest", "Mobile app development", "Mobile Development", "JSON", " gRPC", " WebSocket", "Software Development", "Rest", "Mobile development", "Android Studio", "XCode"]}