{"JOB DESCRIPTION": "Roles and ResponsibilitiesSenior Software EngineerJob Location: Hyderabad, India Verisk IoT/Telematics, is seeking Software Engineers to develop our next generation products. You will have an opportunity work with exciting, cutting-edge technologies that will that enable us to deliver innovative, fast, scalable and reliable products to our customers. You will join the core team responsible for the development of our data exchange for connected cars and home that is one of its kind in the world! In this role, you will be working alongside a diverse group of talented individuals that are responsible for creating and maintaining high traffic, API/web products depended on by top auto manufacturers and insurance companies for their daily business. What you get to do every day:Design and develop high performance software libraries and APIs Implement highly scalable, performant, fault tolerant processing systems with technologies including AWS Be involved in all phases of the agile software development lifecycle Work with our Product teams to gather detailed requirements for new products, services & tools. Proactively seek out and minimize pain points within the infrastructure and code base Keep up to date with the latest technologies and introduce them as needed Create next-gen solutions for unique and challenging use cases. What you bring to the role:Have strong sense of ownership Be focused, passionate, and strive to find simple solutions to complex problems Have previous design/development experience with large-scale production systems and/or data platforms. Strong experience with cloud-based applications Be focused, passionate, and strive to find simple solutions to complex problems Experience interfacing with external groups, product managers, partners, customers Be comfortable working in a dynamic environment Excellent communication skills (written and verbal) QualificationsSkills and Qualifications: You must have demonstrated experience in several of these domains and technologies: Bachelor’s degree in Computer Science, Software Engineering, or related field Minimum of five (5) years full-time work experience with 2 years in an AWS environment Strong ability to build RESTful services Development experience using Python / Scala Good experience in using AWS services like EC2, Lambda, API Gateway, Kinesis, AWS Batch, Athena, Aurora PostgreSQL Preferably certified in AWS skills", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Sc in Computers, BCA in Computers, B.Tech/B.E. in Computers", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Software Development Life Cycle", "Software Engineering", "Artificial Intelligence", "Postgresql", "SCALA", "Machine Learning", "Athena", "AWS", "Python", "IOT"]}