{"JOB DESCRIPTION": "Roles and ResponsibilitiesS&P Dow Jones IndicesThe Role: Sr Software Engineer - Software Development.Grade: 9AThe Location: Hyderabad, Chennai.The Team: The Web platforms team of S&P Dow Jones Indices is responsible building and maintaining the Web based platforms and tools for our clients and internal users.The Impact: Are you looking for an opportunity to advance your career as a technology leader in the financial domain? The Web Platforms team is looking for a technically capable individuals with a hands-on approach who can bring leadership, stakeholder management, expert communication, and coaching experience to a global team. What’s in it for you: As the Senior Software Engineer you will have the opportunity to work closely with partners across the company to deliver technology solutions leveraging some of the latest and greatest technology tools and upgrade the platform capabilities and take them to the next levelResponsibilities: • Implement new functionalities in Java, SQL and PL/SQL.• Enhance existing functionalities• Train and assist the application support team• Respond to technical queries from operations and product management team• Mentor the junior Java back-end and full stack developers and help to resolve any technical issues they are facing to complete their assigned task.What We’re Looking For: Basic Qualifications:• 4 to 7 years of hands on Java development experience. Experience in working with spring framework and java design patterns• Hands on experience in data structure and algorithm. Should be able to estimate time and space complexity• Hands on experience in at least one relational database (Oracle, Sybase, or SQL Server)• Hands on experience in SQL queries and writing stored procedures• Hands on experience in Spring and Hibernate• Hands on experience with multithreaded env is a plus• Experience working with RESTful APIs• Experience working in AWS technologies is a major plus• Experience working with Apache Tomcat• Experience working with source code control systems like GIT• Familiarity with build toll like maven, gradle, Jenkins job configuration and pipeline is a plus• Familiarity with message or stream service JMS , Kafka is plus• Any experience in building financial applications is a plus• Any experience with Big-data technology (ex. Hive, Hadoop, Spark) is a major plusPreferred Qualifications:• Working in Agile/Scrum based project delivery• Experience in the financial services sector preferred but not required• At least Bachelor’s degree in Computer Science or equivalent. MS in Computer Science is preferred.• Candidates without Computer Science or Information Technology degree should have significant work experience.", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Sc in Computers, B.Tech/B.E. in Computers, BCA in Computers", "PG": "MS/M.Sc(Science) in Computers, Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Java", "JMS", "Maven", "Software Development", "Design Patterns", "Software Engineering", "data structure", "Spring Framework", "SQL Server", "Apache Tomcat", "Gradle"]}