{"JOB DESCRIPTION": "Roles and ResponsibilitiesJob PurposeThe Senior Software Engineer will be responsible for implementing high quality software components in accordance with project requirements and overall system architecture following AVEVA’s business and technology strategy.This is a full time role in Asset Information Management team. This role requires a development and architectural experience in cutting edge technologies.Key Accountabilities• Have opportunities to maintain and grow their knowledge in an Agile environment of rapidly changing technologies.• Work on cutting edge of design and development using Amazon Web Services.• The role provides a fantastic opportunity to deliver craftsman code for an enthusiastic, motivated and talented Engineer with a thirst for learning and understanding complex functionality and technologies.• The candidate must be proactive, willing to take responsibility and help drive projects to a successful outcome. Prior experience of working in agile or highly structured development environments would be preferable, as would working in a global multi-site, multi-cultural organization.• Liaising principally with the Team Lead or with the Development Manager, tasks include but are not limited to: Feature design, scope planning, task breakdown and estimation, code development, regular reporting, documentation and delivery of timely quality solutions. These must be consistent and conform to agreed internal quality and technical guidelines.• The role will be based at our office in Hyderabad, though occasional and short duration oversees travel (to United Kingdom or Sweden) may be required as the need arises.Knowledge, Skills & Experience Required• 7+ years of hands on software development experience• At least 3-5 years of relevant experience• Expertise with AWS services for infrastructure, hosting web applications, databases, scalability and end-to-end security• Good knowledge in development and management of scalable APIs• Good knowledge of using RESTful and CLI interfaces for AWS• Experience with AWS Lambdas• Experience with Microservices and server less application development• Good experience with Programming/Scripting languages : one or more of these – Python, NodeJS, .NET core, JavaScript, TypeScript• Experience working on Angular 4/6• Web Services and APIs as in RESTful• Experience of automation using scripting languages like PowerShell.• Exposure to NoSQL databases (like Mongo DB, Dynamo DB)• Advanced Object Oriented Programming concepts• Knowledge on Unit Testing : one or more of these MS TEST, Jasmine, Karma, Mocha Chai• Good written and oral communication skillsAVEVA is an Equal Opportunity Employer and we take pride in the diversity of our employees, valuing the special experience and expertise that people from different backgrounds bring to our business. The ability to develop ground-breaking technologies is one of our key assets and our people make it happen.Come and join AVEVA to create the transformative technology that enables our customers to engineer a better world.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Software Development", "NoSQL", "Typescript", "Jasmine", "Dynamo Db", "Javascript", "AWS", "Web Services", "Karma", "Angular"]}