{"JOB DESCRIPTION": "  The Role:   We are improving our end-client facing solutions with the overall idea to build a set of solutions and capabilities that allow advisers to search for new clients and engage with their existing clients in a better way. The impact we are striving for is a multifold increase in the adviser s client base without compromising on the quality of financial advice.    Since these solutions will be dealing with retail users ease of use and scalability will be the key aspects.    As you will be working on building the product from scratch, and manage its dependency on our existing product lines, you should have:     Natural temperament required for product development which includes a persistent focus on product implementation with a long-term view of iterative product delivery.    Good communication skills - Written and verbal to understand the current application and working with the Product Manager to understand the future functional and scalability needs.    Experience in defining engineering best practices and providing technical mentorship to other members of the engineering team.    The ability to build good working relationships within the team by communicating clearly both verbally and in writing    Experience and understanding of Agile Development methodologies especially Scrum.    Fast learner, open to learning new technologies when needed.         Responsibilities    :      Own the development and technical specifications (including architecture) of the product    Refactor   subsystems/components   of the product along with maintaining the current version    Ensure smooth migration from the older subsystems to the newer ones    Ensure scalability and testability of the product and its subsystems        Requirements  :     Technical abilities showcasing a breadth and depth of technical knowledge:    Good understanding of how modern web apps are architectured with JavaScript driving the application flow and APIs as the backend.    Good knowledge and experience of working on both front-end and back-end technologies.    Deep expertise in either of the following:    Creating APIs - In JavaScript on NodeJS, In C# on .NET core.    Creating JS Apps - Using pure JavaScript, React.js or Vue.js.      Expertise in working with relational and non-relational databases.        Basic Qualifications      Minimum Bachelors Degree in Computer Science or a related field.    Minimum 8+ years of professional experience in software development.    Computer Science fundamentals in object-oriented design, data structures, algorithm design, problem-solving, and complexity analysis.    Proficiency in, at least one modern programming language such as Java, C#, JavaScript, Python.        Preferred Skill Set      Experience building complex software systems that have been successfully delivered to customers.    Knowledge of professional software engineering practices best practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations using cutting edge methodologies.    Ability to take a project from scoping requirements through actual launch of the project.    Experience in communicating with users, other technical teams, and management to collect requirements, describe software product features, and technical designs.    Experience in mentoring other software engineers.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Object oriented design", "Backend", "Front end", "Coding", "Financial planning", "Software development life cycle", "Data structures", "Scrum", "Python"]}