{"JOB DESCRIPTION": "Greetings from Sarathi Softech!We are hiring a Senior Software Engineers / Systems Analyst for an esteemed Telecom Client based in Australia at Pune location.As a Senior software developer, you'll be the brain behind crafting, developing, testing, going live and maintaining the system. You are passionate about understanding the business context for features built to drive better customer experience and adoption.Who is Sarathi Softech?You might not have heard of us. We provide an end to end billing solutions starting from Gap Analysis, Consultation, Licensing, Implementation, and Support to the global telecom sector with leading-edge tools, technologies, software, and services platforms. We have a proud heritage, built over 10 years, and a worldwide reputation for pioneering products and exceptional service. With 35+ people, many of whom are with us for more than 5 to 7 years now, we are growing continuously. Were a great place for you that rewards your worth, gives you challenging work to do, and grow your career.What are the responsibilities involved?Familiar with the software development life cycle (SDLC) from analysis to deployment.Comply with coding standards and technical design.Believes in systematic approach to developing the system through clear documentation (flowcharts, layouts, & etc) of functionality, address every use case through creative solutions.Adapts structured coding styles for easy review, testing and maintainability of the code.Integrate the developed functionality and/or component into a fully functional system.Ensure unit and integration level verification plan are in place and adheres to great quality of code at all time.Active participate in troubleshooting, debugging and updating current live system.Verify user feedback in making system more stable and easy.Work closely with analysts, designers and other peer developers.What do we offer?Well give you everything you need to excel in your role, including ongoing training and lots of responsibility from the start. In return for your exceptional performance and consistent results, youll receive one-to-one career mentoring, as well as exciting opportunities to move around the business.Why should you apply?We have an excellent mix of people, which we believe makes for a more vibrant, more innovative, more productive team. So, if you’ve never worked for telecom, that’s fine with us. Success at Sarathi is down to teamwork and ability, no matter what your background.What you need is?Bachelor’s degree in computer science or equivalent practical experience.6+ years of experience as a Software Engineer or Software Developer or in a relevant role.Understanding of OOPS concepts, Persistence, Threading.Proficient in Java, J2EE, Spring, Hibernate, and WebservicesProficient in database concepts and hands-on with SQL databaseCompetent in developing web apps in popular web frameworks (e.g. Spring MVC).Experience with enterprise-level projects to handle business complexity.Experience in designing interactive applications.A background in Engineering with sound oral and written communication skills.Prior experience with AWS, Azure, Google cloud will be a plus.Sarathi Softech is committed to employing a diverse workforce. Qualified applicants will receive consideration without regard to race, color, religion, sex, national origin, age, sexual orientation, gender identity, gender expression, veteran status, or disability.", "ROLE": "System Analyst", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "MS/M.Sc(Science) in Computers, MCA in Any Specialization"}, "KEY SKILL": ["Java", "Software Development", "Hibernate", "Rest", "Software Engineering", "PLSQL", "J2Ee", "Spring", "Web Services", "SQL"]}