{"JOB DESCRIPTION": "   Job Purpose:    as a one of our senior core members of the RD team and lead in delivering high quality software that meets specified functional and non-functional requirement within the time and resource constraints given.    Main Responsibilities and Deliverables:      Design of software according to agreed standards, architecture and requirements   Implementation of software according to design   Planning and performing testing to ensure fit to standards (e.g. security, scalability, etc.), design as well as functional and non-functional requirements   Supporting customers and the support groups by analyzing and solving product issues   Interface with various RD groups, as well as support and services groups.   Determines methods and procedures on new or special assignments (e.g. adoption of new technologies).   Has full responsibility of the software development lifecycle (Design, development, UT, work with QA and through field introduction).     Qualifications / Experience:      Degree in computer science or equivalent from a reputed institute   Knowledge on Data structures, Algorithms and Multithreading and solid understanding of OOP.   7+ years of recent experience in .Net technologies.   Advanced mastery of the C#.net, ASP.NET, WebAPI and its ecosystem of tools and frameworks; proficient with dot net algorithms and data structures.   Proficiency in JavaScript, jQuery and other client tool and technology. Knowledge of Angular, Typescript, Knockout would be added advantage.   Worked in high performance, highly available and scalable systems a must   Experience in RDBMS database development with SQL Server   Knowledge and experience with software design patterns and how they can be incorporated into software design.   Experience developing server-side enterprise-grade software products that can perform, scale, and integrate into a broad enterprise ecosystem.   Substantial capabilities in the domain, analyses information and deduces conclusions within the professional space, starts to be seen as a professional by his team and peer community. Has high-attention to details and works well in a dynamic and stressful environment.   Experience working in a modified Agile methodology development environment    Excellent interpersonal skills, proven ability and passion to educate and mentor others in engineering best practices and patterns, team player.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Software design", "jQuery", "Multithreading", "RDBMS", "Javascript", "Software development life cycle", "Data structures", "Agile methodology", "SQL"]}