{"JOB DESCRIPTION": "Roles and ResponsibilitiesIntroductionSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do. Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide. At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.Your Role and ResponsibilitiesWe are seeking a software engineer to work on UI development using technologies like ReactJS for runtime client frameworks. You will be responsible for new development, coding fixes for customer reported issues and also producing UI testcase automation for the functionality you develop. Strong familiarity in understanding different document formats (MS Office, pdf, tiff) is essential. We are looking for candidates with strong diagnostic skills using industry standard tools and techniques, strong JavaScript skills, and a background in UI automation. Familiarity with Python and Machine Learning concepts is a plusAs a Senior Developer you willDesign and develop new features and functionality with rich UI content for Digital Business Automation products.As part of a Global Team, collaborate with senior members from partner labs and participate in design discussions.Demonstrate hands on involvement in coding and developmentDemonstrate Leadership qualities towards setting examples for junior team membersMentor and guide junior developers in the team towards understanding the technology, the industry play and the customer storyRequired Technical and Professional Expertise8+ years of IT experience3+ years in UI development using Javascript, ReactJS, NodeJS2+ years experience in building software in the area of Document processing with MS Office, PDF, Tiff etcExposure to Cloud and Container technologies like KubernetesStrong Debugging SkillsFamiliarity with UI Test Case AutomationPreferred Technical and Professional Expertise2-3 years of experience in programming with Java, Python etcExperience with prototyping, extending the architecture and optimizing to leverage cloud deployment patternsStrong understanding of micro-service architecture implications and design of highly scalable SaaS deploymentsExposure to leading teams", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Java", "Software Development", "Front End", "Expect", "Software Engineering", "UI Development", "Javascript", "Machine Learning", "Python", "Kubernetes"]}