{"JOB DESCRIPTION": "Roles and ResponsibilitiesIntroductionSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do. Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide. At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.Your Role and ResponsibilitiesWho you are:We are seeking software engineers to work on Server side development using technologies like Java that run on an application Server. You will be responsible for new development, coding fixes for customer reported issues and also producing testcase automation for the functions you develop. Strong familiarity in understanding different document formats (MS Office, pdf, tiff) is essential. We are looking for candidates with strong diagnostic skills using industry standard tools and techniques, strong java skills and background in developing rich UI based applications.What you’ll do: As a Lead Developer/Architect you willDesign and develop new features and functionality with rich UI content for Digital Business Automation products.As part of a Global Team, collaborate with senior members from partner labs and participate in architctural activitiesDemonstrate extremely hands on ability in coding and developmentLead a team of developers and provide them day to day guidance and direction towards achieving milestonesMentor and guide junior developers in the team towards understanding the technology, the industry play and the customer storyHow we’ll help you grow:You’ll have access to all the technical and management training courses you need, to become the expert you want to be.You’ll learn directly from expert developers in the field; our team leads love to mentor.You will have the opportunity to work in many different areas to figureRequired Technical and Professional Expertise12+ years of IT experience8+ years of experience in Server side development using Java,Eclipse, Maven,Gradle, Websphere app server3+ years in UI development using Javascript, ReactJS, NodeJS2-3 years experience in Web services, REST, JAXB, Swagger / OpenAPI2-3 years experience in Software Architecture5+ years experience in building software in the area of Document processing with MS Office, PDF, Tiff etc2-3 years experience in Leading and Mentoring teamsGood practical understanding of Linux and container technologies - Docker, KubernetesStrong Debugging SkillsPreferred Technical and Professional ExpertiseFamiliarity with Machine learning models and algorithmsExperience with prototyping, extending the architecture and optimizing to leverage cloud deployment patternsStrong understanding of micro-service architecture implications and design of highly scalable SaaS deployments", "ROLE": "Team Lead/Technical Lead", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Rest", "Software Development", "JAXB", "Algorithms", "Eclipse", "Web Technologies", "UI Development", "Javascript", "Gradle", "Web Services"]}