{"JOB DESCRIPTION": "  Job description      Role      Total IT experience more than 6+ years in .NET Development and Support with good communication skills.    Able to do offshore/onsite co-ordination to help setup/guide offshore support team.    2+ years of experience in production support and 6+ years of technical development expertise of .NET, MVC, SQL Server. Basic knowledge in Scrum Agile, DevOps.    Working familiarity with semi-structured data (JSON, XML including XPath). Proactive in nature, identifying problems in advance and looking for continuous service improvement opportunities. Create clear and concise knowledge documents and ensure maintenance of the same.    Perform level2 and level3 support during normal business hours and on-call supports.      Responsibilities      Should possess good understanding of architecture of different enterprise application to enable better in troubleshooting of environment issue    Handling the status calls on daily basis and to track the progress according to the scheduled project plan    Troubleshooting, Application Problem Solving with good communication coordinating with Stakeholders and understanding there requirements    Preparing the analysis document by studying the challenges facing by IT organization    Providing apt solutions to client requirements and implementation in co-ordination with offshore teams    Collect requirements regarding new enhancements and documentation    Solution designing, preparation of low level design and KT to both onsite/offshore development, business analysts and testing teams    Review of low level design, high level design, test plan and results delivered from offshore    Setting up the DEV/QA/UAT environments    Maintain requirements, analysis and design documents for different phases of development activities.    Preparing and Reviewing understanding document with Customer and getting sign off    Ensure close working relationship with Functional, Development and other supporting teams      Requirements      The candidate should have degree in Engineering or equivalent course from a recognized university    Total IT experience more than 6+ years of experience    2+ years of experience in production support / application administrator in any technology    Should have more than 6 years of experience in software development using .Net Framework 4.0/4.5    Should have good experience in C#    The candidate must have experience in writing queries for SQL Server and T-SQL    Experience in ASP.NET MVC 5.0 or ASP.NET Web API is must    Desirable to have experience in Entity Framework 6.0, Unity Framework preferable.    Should have knowledge of JavaScript, jQuery, jQuery-UI, JSON, XML including XPath    Agile frameworks and popular coding languages to fulfill our business needs    Fair knowledge of DevOps or equivalent tools    Desirable exposure to ITIL processes eg. Incident Management, Service Management, Problem Management    Perform Level1 and Level2 support during normal business hours and on-call supports    Good Communication skills   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Production/Industrial", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["jQuery", "Production support", "Coding", "XML", "Javascript", "Agile", "Healthcare", "JSON", "Scrum", "Troubleshooting"]}