{"JOB DESCRIPTION": " Software DeveloperGurgaon, Haryana  Salary: Dependent on Experience + Extensive Benefits Package SSP is a global provider of technology systems and solutions across the entire insurance industry. We provide core technology solutions, distribution and trading capability, advanced analytics and solution delivery.Want to want to work with great people, in modern offices and have the opportunity to progress and develop your career? THE PURPOSE OF THE SOFTWARE DEVELOPER WILL BE: We are growing our Gurgaon office for Software Engineers who can contribute to the programming innovative solutions which will include projects across a variety of solutions in Digital, SaaS/PaaS, DevOps and Cloud in a global team. You will get involved in testing, module development in current and new environments, contribute to development processes, procedures and leading with examples and ideas. As a Software Engineer you will be working with systems that deal with millions of insurance quotes a day and so, by using your knowledge and experience of software engineering, you will help the team continue to provide market leading solutions to our customers.Roles and Responsibilities  THE SOFTWARE DEVELOPER RESPONSIBILITIES INCLUDE:  To work almost independently   in all phases of the development cycle including functional   enhancements/changes, issue fixing, unit testing and integration testing To adhere to prescribed SSP   development processes, procedures and standards To produce quality software   and logical estimates within realistic timescales To be able to quickly   identify risks and issues, report them in a timely manner and update status   reports as needed. Be able to suggest and undertake any mitigating actions To keep the Senior Software   Engineer informed of any events affecting the work allocated for each release   Capable of understanding and   contributing to implementation of technical solution from design through to   code Support LIVE clients within   agreed OLAs Provide out of office hours’   support for LIVE clients Maintain high standards of   software quality by adhering to agreed good coding practices Participate in peer-reviews   of code implementation Quick learner and ready to   learn new technologies like Edge Connect Desired Candidate Profile  WE’D LIKE TO MEET A SOFTWARE DEVELOPER WITH:Full time Bachelor’s degree in Engineering (preferably Electronics, Computer Science, Information Technology)Should have expertise in- At least 2 years in AngularJS, Java Script, XSLT, HTML5/CSS, Ajax/JSON At least 3 years in design and Development of .NET Core 3.0, Azure Dev OpsWorking experience on Razor components is preferred Strong knowledge of development best practices, development methodologies & standards.Experienced with SVN\\GIT version control and continuous integrationSoapUI, XML, SQL, DB2/Oracle, WAS and Apache/IBM HTTP serverAdhere to industry standard coding practices to write secured and optimized code for all aboveThorough understanding of SDLC processes to drive best practices Excellent      verbal, written and interpersonal communication skills to interface with      various teamsDesired skillsKnowledge of Insurance DomainWeb interface designWorked in Web Services and OrchestrationKnowledge and experience of Agile, ScrumThorough understanding of Configuration Management concepts and toolsAbide with defined and agreed OLAs.Perks and Benefits WHAT’S IN IT FOR YOU?A unique, modern working environment Clubs – Crickets and Chess activities, JOSH club for social events, quarterly company Town Hall events Yammer – collaborate on ideas and suggest future business opportunities through our ‘lightbulb’ groups A clear, personal learning and development plan to develop your career further Generous holiday allowance (32 days + Public Holidays), life assurance, Family insurance cover. SSP flexible benefits and Day care Facilities, Maternity pay, Flexible working option BEHAVIOURS:We have a strong, clear vision – to be the leading provider of insurance technology software – and our values describe what makes SSP unique, and capture the SSP spirit that runs through everything we do. Respect – Ownership – Collaboration – Innovation – EnergyA CAREER WITH US:SSP believes the most valuable asset for any business is the people it employs. It is crucial therefore to employ and invest in the best.At SSP we believe that our diversity makes us stronger. As an equal opportunities employer we celebrate and support everyone who works for us. We are committed to providing equal opportunities in our working practices and are proud of our inclusive culture. It goes without saying that we do not discriminate on any basis. Instead we continue to actively promote equality and grow our diverse workforce for the benefit of our customers, products, our business and our people.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["Software Development", "Software Engineering", ".net core", "angu", "XML", "Programming", "Javascript", "HTML", "Ajax"]}