{"JOB DESCRIPTION": "Roles and Responsibilities Position Title: Junior Software Developer• As a Junior Software Developer, you will be part of our elite team of engineers and will be responsible for designing and developing high-volume, low-latency applications for mission-critical systems and delivering high-availability and performance.• Contribute in all phases of the development lifecycle while writing well designed, testable, efficient code and ensure designs are in compliance with specifications.• Prepare and produce releases of software components.• Support continuous improvement by investigating, suggesting alternatives to technologies and presenting these for architectural review.• Experience in Core Java, Spring, Hibernate, Restful Web Services and design patterns.If you have the desire to grow and contribute in a high growth and challenging start-up environment, then pleaseread on!About Company:Freestone Infotech is a global IT solutions company providing innovative best-in-class turnkey solutions to enterprises worldwide.Freestone Infotech addresses the enterprise wide end-to-end needs of organizations with its expertise in Big Data Solutions, Data Analysis, Machine Learning, Business Intelligence, R&D, Product development and Mobile Application development.Job Description:Experience: 2 – 5 yrsPrimary/Technical skills:• Core Java, J2EE, OOPS design, Restful Web Services.• Strong knowledge of frameworks such as Spring, Spring Boot, Hibernate / Eclipse Link• Knowledge of various Design Patterns and their practical application.• Sound knowledge of RDBMS like MySQL/Postgres/Oracle, including schema design. • Comfortable with advanced SQL queries and SQL Tuning.• Proficient in general programming, logic, problem solving, data structures and algorithms.• Good understanding of data structures & algorithms and their space & time complexities. • Basic knowledge of Ajax and JS libraries like Angular/React.js, etc. and CSS will be an added advantage.Secondary Skills:• Exposure to Linux environment would be an added advantage.• Agile / Scrum Development Experience preferred.• Comfortable working with a microservices architecture and familiarly with NoSql solutions.• Experience in Test Driven Development.• Good analytical, grasping and problem-solving skills.• Excellent written and verbal communication skills.• Hands-on skills in configuration of popular build tools, like Maven and Gradle• Good knowledge of testing frameworks such as JUnit.• Good knowledge of coding standards, source code organization and packaging/deploying.• Good knowledge of current and emerging technologies and trends.Job Responsibilities:• Design, Development and Delivery of Java based enterprise-grade applications.• Ensure best practices, quality and consistency within various design and development phases.• Develop, test, implement and maintain application software working with established processes.Education and Experience:• Bachelor’s / Master’s degree in Computer Science or Information Technology or related field.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers, B.Sc in Computers", "PG": "M.Tech in Computers, MS/M.Sc(Science) in Computers", "DOCTORATE": "Other Doctorate"}, "KEY SKILL": ["Java", "Core Java", "Software Development", "Hibernate", "Spring Mvc", "Design Patterns", "Struts", "Spring", "Restful Webservices", "Web Services"]}