{"JOB DESCRIPTION": "About the job :With this position you will become a part of the global Automation Development team, which is responsible for the development of advanced control systems and IoT solutions for all Alfa Laval core products.As our new Software development Engineer you will develop our automation systems in an Agile environment throughout the whole product lifecycle. That includes:SW engineering through breakdown of features, task specification & follow up, programming, testing, documentation, source code management, deployment and issue tracking.Working in Sprints as a part of a self-organizing teamCreating global automation standards for Alfa Laval through cross-site collaborationContributing to a vibrant workspace where knowledge sharing, delivering as a team and face-to-face interaction are vital components.Desired Candidate Profile We are looking for an engineer at bachelor or master level combined with related work experience with following competences and experiences:University degree (e.g. Embedded Systems / Industrial Automation) (MSc, MEng, BSc, BEng);Four or more years of work experience in Software Engineering & Standardizations;Experience in Software Development Models & Methods (OOP, S88, UML);C++, C# programming knowledge;Structured text programming knowledge;Experience in PLC and/or Embedded real-time programming. HMI design experience for such systems are also preferred. Especially PLC systems such as Siemens TiA, Allen Bradley & B&R.Experience in Agile Methods and Tools (SCRUM, DevOps);Fluent in English (spoken and written).Perks and Benefits Participate in the development of exciting and technologically advanced products. The position presents the opportunity to work in a global company, with great career opportunities for the right candidate.", "ROLE": "Software Developer", "INDUSTRY TYPE": "Industrial Products, Heavy Machinery", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Electronics/Telecommunication, Computers"}, "KEY SKILL": ["Software Development"]}