{"JOB DESCRIPTION": "Roles and ResponsibilitiesIntroductionSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do. Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide. At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.Your Role and ResponsibilitiesAs a Full Stack Application Developer, you are responsible to design, develop and/or re-engineer complex application components, and integrate software packages, programs and reusable objects residing on multiple platforms.Responsibilities:Providing Production technical support to applications assignedWorking with Business Analyst and Product Manager/s to ideate software solutionsPartner with Business / UX Design Analyst Build to build the front-end of applications with appealing visual designDevelop and manage well-functioning databases and applicationsWrite effective APIsComply with IT Security Standards, including but not limited to security and data protection settingsTest software to ensure responsiveness and efficiencyTroubleshoot, debug and upgrade softwareWrite technical documentationDemonstrate understanding of requirements definition and validation, as well as transformation to test cases, steps, User Stories, for a deep knowledge in Predictive, Hybrid and Agile development cycles and agile transformation tools ie. Github, Zenhub, RTC, Murally, Trello, slack, webex, etc.Required Technical and Professional ExpertiseProven 5 years’ experience as a Full Stack Developer or similar roleFamiliarity with common stacks along with working knowledge of multiple front-end languages and libraries (e.g. HTML5/ CSS3, JavaScript, Bootstrap, Angular)Hands-on experience of multiple back-end languages JavaScript frameworks (e.g Node.js)Exposure to databases (e.g. QL, DB2) and UI/UX design and Agile tools (Github, Jira)Proven communication skills in English to manage project status at senior management level.Self-starter /Influencer with an ability to communicate and manage requirements with Senior Management, Technical leads and Executives.Preferred Technical and Professional ExpertiseYou love collaborative environments that use agile methodologies to encourage creative design thinking and find innovative ways to develop with cutting edge technologiesAmbitious individual who can work under their own direction towards agreed targets/goals and with creative approach to workIntuitive individual with an ability to manage change and proven time managementProven interpersonal skills while contributing to team effort by accomplishing related results as neededUp-to-date technical knowledge by attending educational workshops, reviewing publications", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Ux Design", "Software Development", "Front End", "Html5", "User Stories", "Bootstrap", "Node.Js", "Agile Development", "Angular", "Javascript Frameworks"]}