{"JOB DESCRIPTION": "     Job Responsibilities    :    Senior Developer.     Lead and manage web based Software Development and QA teams to deliver on product meeting customer requirements along with the project manager      Work effectively with Project Managers and Stake holders to ensure delivery against agreed priorities and timelines      Train, Groom and Mentor the team as required      Focus heavily on the front end part to capture user work flow      Make sure that the UI is appealing and trendy with pleasant UX      Support the project manager on timely delivery meeting expected quality standards throughout the product development cycle      Ensure effective communication at team, product council and customer level      Deployment of the product is important part of the role. The Sr developer will be responsible for deployment of product on cloud platform or based on customer s in house infrastructure. Private or Public clouds like Azure/AWS will be likely to be used for this purpose.       Education / Experience :       Bachelor s or Master s Degree in engineering from reputed Institute      4 to 7 years of experience working in web platforms      Hands-on experience in web front end development with React, Redux, NodeJS, D3.JS, JavaScript, BootStrap, HTML, CSS      Experience in databases like MySQL, MongoDB      Experience of successfully delivering into the market sophisticated software product      Exposure to Python, Django will be preferred      Experience of on-premise and cloud based web app deployment is an added advantage      Focus on engineering products/services will be an added advantage        Remuneration     :        Compensation as per industry standards.      Benefits would be detailed in the final offer.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["CFD", "Front end", "Django", "MySQL", "Web development", "HTML", "MongoDB", "FMCG", "Automotive", "Python"]}