{"JOB DESCRIPTION": "Dell Overview:Dell provides the technology that transforms the way we all work and live. But we are more than a technology company - we are a people company. We inspire, challenge and respect every one of our over 100,000 employees. We also provide them with unparalleled growth and development opportunities. We cant wait for you to discover this for yourself as a  Software Senior Engineer on our IDrac team in Bangalore.About Business Unit:Dell's Infrastructure Solutions Group is looking for a Software Senior Engineer (Java, REST, JS)with a solid understanding of industry standards and best practice development methodologies.  The individual will be contributing to a team responsible for designing, developing, maintaining, and enhancing  systems management software solutions. The individual should be comfortable working in both in a Linux environment, have experience programming in Java as well as expertise in integrating products via Web Services/Rest API. Prior experience in accurately scoping implementation resource requirements and schedule timelines is important. Individuals should also have good communication, mentoring, and leadership skills to work across a global development team environment. Join us to do the best work of your career and make a profound social impact as a Software Senior Engineer in Infrastructure Solutions Group at Bengaluru.Take the first step towards your dream careerEvery Dell Technologies team member brings something unique to the table. Here’s what we are looking for with this role:Essential RequirementsBE/ME/MS degree in CS, ECE, CE or equivalent stream with 4+ years of Software development experience in Java, Object Oriented Analysis & DesignExperience with the design and development of cloud solutions, SaaSExperience in integrating products using Web Services/REST API and HTML/CSS/JS (Angular or comparable framework)Experience with Networking, Server and Storage technologiesDesirable RequirementsKnowledge in Linux/Java DB technologies - PostgreSQL(Schema Definition, Stored Procedures), Hibernate; NoSQL  Databases (Apache Cassandra) is a plusFamiliarity with XML, REST, JSON, Reactive Programming (RxJava/Reactor) and front-end module workflow (ES6, Webpack, Rollup, or comparable tooling) is a plusFamiliarity with NodeJS and NPM/Yarn and Good skills in Linux scripting, RPM Spec file development is a plus", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Electronics/Telecommunication, Computers", "PG": "MS/M.Sc(Science) in Computers, M.Tech in Computers, Electronics/Telecommunication", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Java", "CSS", "Front End", "Javascript", "Es6", "HTML", "JSON", "Rest Api", "Webpack", "Angular"]}