{"JOB DESCRIPTION": "  About the Role      Looking for senior software engineer to develop and enhance fixed income electronic trading application in capital markets domain. He or she would be responsible to code the critical components of the application and understand the end to end flow of the system. This roles has multiple position.      Role and Responsibility      Design, develop key features for a distributed grid compute platform, using akka and advanced concurrency features of Core Java, Multithreading ,collection.     Troubleshoot complex issues (e.g. failed tasks in a grid)     Role requires a very good understanding of distributed databases (e.g. HBase and Apache Ignite)     Develop low latency messaging solutions to provide near-realtime updates to clients     Optimize the performance of grid tasks by optimal use of a single compute node (scale up) and the available resources on the grid (scale out, by appropriate algorithms and distribution strategies)     In addition to feature development and bug fixes, investigate and resolve L2/L3 production issues       Essential Qualification         Bachelor's/Master s degree in Computer Science or equivalent.     7 to 12 years of hands-on IT experience in enterprise applications.     Strong development experience in Core Java, Multithreading, Collection and concurrency, spring, Spring Batch, Hibernate, Messaging (Solace, Active MQ).      This includes full life cycle development and understanding of application development methodologies, as well as experience in a 3-tier application environment.     Demonstrated Object-Oriented Design (OOD)/Object-Oriented Programming (OOP) skills.     Expertise in multithreaded application development, grid computing, messaging.    Understanding of Capital Markets. Expertise in an asset class (e.g. FX, Rates, Bonds, Equities/Electronic trading.)       Desired Qualification         Hands on experience with akka, Ignite   Experience with Oracle Coherence, IBM Symphony or Tibco DataSynapse   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Hibernate", "Core Java", "Multithreading", "Enterprise applications", "TIBCO", "Application development", "Investment banking", "Apache", "Information technology", "Analytics"]}