{"JOB DESCRIPTION": "            About Role:     Team member will be working on Application Development work in WIMT.       Responsibilities:       Planning and assessment of the existing application environments.     Deploy the Applications to development as per requirement and utilizing existing processes.      Tailor the default parameters and routines as per the application requirement.     Create the data sources required as per the applications requirements.     Integration with Admin, Profiles with and integration with other back-end components      Post-install configuration of components and Services as needed.     Application code analysis for identified applications to make it compatible      Code modification for ensuring application code compatibility with upgraded environment including unit testing of changed code.     Issue resolution originating because of applied application code changes.     Support to and collaboration with the Wells Fargo Deployment team for code promotion.         Essential Qualifications:         10 + years of Expertise in Enterprise image captures software Kofax Capture 10/11, KTM 6.x. KIC Import Connector, Export Connectors.     Expertise in distributed installation and configuration of Kofax, setting up central/remote servers, workstations, scan stations, scan profiles, creating batch classes, release scripts (export connectors), bar coded separator sheets, OCR, OMR, Kofax Capture Network Server (KCNS) configuration, Kofax Import Connector (KIC), Kofax Transformation Modules (KTM), Load Balancing and High availability, Backup licensing servers for disaster recovery etc.     Good knowledge to create multiple document classes and setup proper Document separation, Classification and Form type identification logic.     Working knowledge of Text extraction, Table data extraction and OMR value extraction using format locator, table locator, Zone locator etc.     Experience in configuring Kofax import connectors and Kofax export connector ( EG: Email import connector, Folder import connector, XML export connector)     Knowledge of creating projects in the project builder and synchronizing to KC Admin.     Knowledge of creation of Index fields Validation form layouts and custom form layouts. Knowledge of integrating validation forms with .Net services.     Knowledge of the usage of KTM extraction locators and Evaluators and assigning to fields.     Knowledge of usage of Dictionaries, Flat file Data sources and ODBC Data Sources with KTM project builder.     Knowledge creating Knowledge bases in KTM and document training     The ideal candidate for this position has experience in the following:     Programming using .Net (C#,VB), JSON, XML     Kofax Software (Capture, KTM, KSMS, KIC, KAFC)     Developing Kofax Custom Modules, Custom Panels, Export Connectors     FileNet and CM integration with Kofax (export)     Microsoft Visual Studio, Microsoft SQL Server 2008 or above, and Team Foundation Server         Desired Qualifications:       Good to have Content Management, PAC 2000         ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Automation", "Content management", "Filenet", "XML", "Application development", "JSON", "Visual Studio", "VB", "Information technology", "Analytics"]}