{"JOB DESCRIPTION": "  Acts in a lead technical role providing technical guidance and consultation with application teams, clients, and Engineering Managers for their technology domain environments including but not limited to cloud, middleware, operating systems, applications, Software-as-a-Service, and Platform-as-a-Service products.    Designs, codes, tests, debugs and documents programs using Agile development practices.    Provides the strategy and design for projects associated with their technology domain including, upgrades and deployments.    Utilizes advanced technologies and methods to integrate their technology domain with other technology domains, enabling the creation of new or expanded heterogeneous environments.    Develops new documentation and departmental technical procedures.    Directs the gathering of performance statistics to assist in determining hardware and communication tools needed to support projected transaction volumes, response time and system availability targets.    As an escalation point, provides guidance and direction to less experienced staff in resolution of highly complex technical problems.    Leads projects and manages the work of less experienced staff.    Assures quality, security and compliance requirements are met for supported technology domain.    Leads projects and as an escalation point, provides guidance and direction to less experienced staff in resolution of highly complex technical problems.    Assures quality, security and compliance requirements are met for supported technology domain.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Operating systems", "Compliance", "Agile development", "Consulting", "Cloud", "Manager Technology", "Technical Lead", "Hardware", "Middleware", "Statistics"]}