{"JOB DESCRIPTION": "     About Role:    Team member will be working on Application Development work in WIMT.    Responsibilities:        Involve in end end lifecycle of Product/Application development, analyze highly complex business requirements, designs and writes technical specifications to design or redesign complex computer platforms and applications.       Provide coding direction to less experienced staff or develops highly complex original code.       Act as an expert technical resource for modeling, simulation and analysis efforts.       Verify program logic by overseeing the preparation of test data, testing and debugging of programs.       Oversee overall systems testing and the migration of platforms and applications to production.       Lead projects, allocates and manages resources and manages the work of less experienced staff.       Assure quality, security and compliance requirements are met for supported area       Mentor less experience technical staff and may be involved in activities for their skills development      Essential Qualifications:      Strong knowledge in core java, springboot framework        Hands-on experience in any of the distributed clustered systems. Preferred Oracle Coherence.       5+ years of experience in developing responsive web applications using Angular.       5+ years of creating & integrating RESTful web services.       Good understanding and implementation experience of java thread executor framework.       Strong knowledge on python, bash shell scripting & ability to support distributed and grid server architecture applications.       Good knowledge on any of the PubSub EventBroker systems.       Willing to provide the application support & maintaining multiple WebLogic domains & resolving the issues on daily basis.     Desired Qualifications:      Banking domain experience       Proficiency with Agile and Devops practices and toolchain.       Proven leadership in delivering Cloud solutions.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Core Java", "Automation", "Application support", "Coding", "Weblogic", "Shell scripting", "Debugging", "Agile", "Application development", "Python"]}