{"JOB DESCRIPTION": " Job Overview:     18 to 20 years of relevant experience    Hands-on experience designing and developing software for complex real-time embedded platforms, heterogenous and distributed architectures.   Robust understanding of compute architectures and paradigms for CPU, GPU and DSP, various ISAs, cache/memory management, pipelining concepts etc.   Working knowledge of real-time and high-level operating systems and hypervisors like QNX, GreenHills, Linux etc. and ability to realize safe and secure solutions using OS-provided tools and constructs.   Deep knowledge of system-level compute, memory and IO processing, inter-processor communication, performance characterization and optimizations.   Experience designing and implementing complex multi-sensor systems using SDKs for camera/video processing, CV and AI.   Strong programming experience in C/C++ , as well as hands-on experience debugging complex embedded software.   Experience using industry standard development tools for requirements management, architecture/design and configuration management and test engineering.   Demonstrated ability to work with engineers, partners and customers, and across the different geographical sites and technology domains.   Excellent verbal and written communication skills.   Experience designing complex fault-tolerant safety systems in accordance to industry standard specifications (eg. ISO26262, ASPICE).   Advanced knowledge of frameworks and SDKs for Camera/Video, AI and Compute (eg. OpenCV, OpenCL, PyTorch, TensorFlow etc.).  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["C++", "Linux", "Staffing", "Memory management", "Configuration management", "Debugging", "Architectural design", "QNX", "Embedded software", "Recruitment"]}