{"JOB DESCRIPTION": "  About the Role      Responsibilities   :    This Software Engineer role will act as an Automation Test Engineer is a Quality Assurance within the Digital Technology and Transformation team of Wells Fargo to oversee and lead all testing activities on an agile product development team.    This team member will drive and lead testing for several critical applications and define robust testing strategy and implement automation solutions to oversee overall systems testing and the migration of platforms and applications to production.    The team member will be expected to perform development activities included, but not limited to the following listed below :     Champion automation development and design using Selenium and UFT tool(s)    Working within agile development teams with a BDD approach and supporting the developers to assure quality developments early.    Partner closely with the business and testing teams to understand requirements, business functionality and test execution needs from release to release    Creates, prepares and implements systems quality assurance reviews for numerous applications.    Responsible for primary development of testing strategies.    Collaborate with business, development and test teams to identify test automation opportunities.    Play a key role in defining, creating, Implementing and expanding on the Automated Test solution for the application    Provide technical expertise in system architecture, automation architecture, integration, XML, debugging, troubleshooting errors.    Be part of Development in Agile team, able to participate in requirement review, design, Code Review and implementation strategies.    Be part of development in agile team, able to develop and test Unit and Integration automated scripts.    Act as a mentor for other automation team members, provide training as required to other resources on script creation, maintenance, debugging and troubleshooting.    Handling the most complex quality assurance and test environment problems and issues.    Acts as a lead in the creation, preparation, and conduct of quality assurance reviews and the development and execution of test plans and test scripts.    Work with clients to establish and maintain a consistent test methodology and to resolve questions during the testing process.    Serve as a coordinator for testing activities on a project with diversified SCRUM team who works in different time zones.    Analyze, test, and certify application-specific software and perform reviews of business requirements and functional specification documents   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - QA & Testing", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["System architecture", "Automation", "Manager Quality Assurance", "XML", "Debugging", "Agile", "Scrum", "Selenium", "Troubleshooting", "Information technology"]}