{"JOB DESCRIPTION": "   Hands of development in UI, Angular, Web development projects with experience of 2-4 years.        Professional and Technical Expertise       Proficiency in Angular 4, Angular 6 and the latest version etc. and, Bootstrap, Jquery, Node.js/D3 or or similar JS MVC frameworks            Hands on experience on the modules: Angular CLI, Services, Routing, HTTP, Components, Form handling,      Packaging of UI components using Bower, NPM, etc;            Design Tools and Graphics: InDesign, Sketch, Illustrator, Photoshop, Fireworks, Flash, Wire-Frame tools.        Build tools such as Gulp, Grunt, TSLint, etc;            Strong interest in UI design with Hands-on experience in creating wireframes, prototypes, storyboards, user flows, etc.            Strong expertise with writing cross-browser compatible code.            Experience in consuming RESTful webservices, should be well versed with Amazon or Azure or Google Cloud Servers       Role and Responsibilities      The primary focus will be to implement a complete user interface in the form of a mobile and desktop web app, with a focus on performance. Build reusable code and libraries for future use.        Optimize application for maximum speed and scalability            Develop software solutions by studying information needs; conferring with users; studying systems flow, data usage, and work processes; investigating problem areas; following the software development lifecycle.           Determine operational feasibility by evaluating analysis, problem definition, requirements, solution development, and proposed solutions.            Provide technical leadership towards new UI architectures and Ensure the technical feasibility of UI/UX designs.            Collaborating with the back-end developer in the process of building the RESTful API      Document and demonstrate solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code.            Testing of developed software according to the test plans.      Prepare and installs solution by determining and designing system specifications, standards, and programming.          Minimum Qualifications :    Bachelors Degree in Computers (BE / BCS / MCS / MCA)     ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization, B.Sc in Chemistry", "PG": "MCA in Computers"}, "KEY SKILL": ["Graphics", "jQuery", "Illustrator", "Web development", "Packaging", "Software development life cycle", "HTTP", "MVC", "Photoshop", "Fireworks"]}