{"JOB DESCRIPTION": "Senior Software Engineer -  Dot Net We are looking for interested & talented Senior Software Engineers in Dot Net to join our team. Candidates should enjoy working in a challenging environment; have the enthusiasm and ambition to develop & complete projects to the highest standards. Candidates with 3 to 5 years of experience in Dot Net will be considered. What are we looking for Dynamic Engineers /  Graduates & Post Graduates with 3 to 5 years of experience in the IT development section Exposure to object oriented programming & with good analytical skills Good technical knowledge & experience in ASP.NET /  C# .NET frameworks (2.0/ 3.5/ 4.0) ,  SQL Server 2008,  JS & AJAX,  ADO.NET 2.0 Experience in Design Patterns,  MVC frameworks is an added advantage Experience in database design & functional design Experience of the full software development lifecycle -  from business /  systems analysis,  thorough requirements gathering and functional specification authoring,  to development and testing Responsibilities Communicate with the client for requirement analysis Perform a technical analysis of requirements & to prepare detailed technical design Handle the team of developers /  mentoring the juniors by task briefing,  review the tasks & giving feedback Preparation of external documentation such as Requirement Specification,  User Manual,  System Manual,  Technical documentation Developing the internal documentation such as Project Plan,  Database design,  Functional design Summary Position: Sr. ASP DOT NET Developer Location: Pune Experience: 3+ Years Experience in ASP.NET Application Development Qualification: B.E./ B.Tech/ MCA Skills: Data Structure,  OOPs,  ASP.NET 4.0,  JQuery.MySQL Database with Store Procedure Position: 3 Apply Now", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["jQuery", "Database design", "ADO.Net", "MySQL", "Software development life cycle", "Application development", "MVC", "Object oriented programming", "Ajax", "Technical documentation"]}