{"JOB DESCRIPTION": "IoT Cloud Developer KONE Technology and Innovation (KTI) is where the magic happens at KONE. It's where we combine the physical world  escalators and elevators  with smart and connected digital systems. We are changing and improving the way billions of people move within buildings every day. We are on a mission to expand and develop new digital solutions that are based on emerging technologies. KONEs vision is to deliver the Best People Flow experience by providing ease, effectiveness and experiences to our customers and users. In line with our strategy, Winning with Customers, the objective of KONEs service and solution development is to drive differentiation further by putting the needs of customers and users at the center of all development. By closer collaboration with customers and partners, KONE will increase the speed of bringing new services and solutions to the market. Services and Solutions R&D unit is responsible for developing digital services at KONE. Its the development engine for our Digital Services such as KONE 24/7 Connected Services, Residential Flow, Office Flow and Partnership Ecosystem. Currently hundreds of world-class professionals, both internal and external, are working together in Finland, China, US and India to create these Digital Services to our customers. DevOps best practices, continuous integration, continuous delivery and latest tools are used to make sure we can provide most value for our customers. We are now looking for IoT Cloud Developers to join the team of experts at the KONE Services & Solutions R&D. You will work together with other professionals to develop advanced KONE digital solutions that leverage the latest in cloud and connectivity technologies. You are a cloud development expert who is passionate about designing and implementing solutions for our connectivity solutions. You are familiar with the software development patterns and can turn the architectural plans to concrete SW designs. You understand and appreciate the modern SW development practices. You work at your best when you are working with people and you enjoy helping others. You will work in a key role inside our Agile SW development team. Your closest colleagues will be other developers, test professionals and the PO of the team. You will be part of KONE Technology and Innovation units IoT Tribe. Main ResponsibilitiesDeveloping cloud code for our connectivity devicesProducing SW designsDocumenting the deliverablesParticipating in knowledge sharing and demos    To be successful in this role, you have a degree in Engineering / MCA/ Msc (IT) or equivalent with minimum 3 years of relevant working experience combined with programming skills on modern languages (JavaScript, Python, Java, TypeScript). Cloud foundations and services (AWS) are well known to you and you are able to learn new things quickly. Experience on DevOps ways of working and knowledge about embedded software development is a benefit as is understanding basic concepts of testing / frameworks.Job Location:KOSMONE IT PARK,Ambattur Chennai", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Other", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "BCA in Computers, B.Tech/B.E. in Computers, B.Sc in Computers"}, "KEY SKILL": ["Java", "Azure", "restful", "Typescript", "Cloud Development", "AWS", "Embedded Software Development", "springboot", "Python", "IOT", "microservices"]}