{"JOB DESCRIPTION": " You will be responsible for developing complex and critical modules of our enterprise applications with micro-services and best engineering practices. In this role, you will also have an opportunity to create and own the components end to end, from the development to delivery on production with full stack development, automation of various tasks, performance and devOps.       You will have an opportunity to:      Testing and evaluating new features   Identifying areas for modification in existing product and subsequently developing these modifications   Writing and implementing efficient code   Determining operational practicality   Developing quality assurance procedures   Deploying software tools, processes and metrics   Maintaining and upgrading existing systems   Working closely with other developers, UX designers, business and systems analysts        If you have:       4-6 years   of experience in automation, acceptance integration tests   Creation of test automation plans/strategies to deliver end to end solutions   Monitoring of the all the QA activities, test results, defects and root cause analysis for customer bugs.   Experience in building custom automation frameworks in Java, JavaScript and doing code reviews.   Identifying areas of improvement implementing to improve the process.   Experience with frameworks-based on Web Driver(Selenium, CodeCept, Spectron), REST APIs(Rest Assured, Karate)   Deep hands-on technical expertise in all QA practices and processes   Experience and detailed understanding of testing E-commerce sites, WebAPIs, REST, UI and Visual Regression.   Exposure to the concepts around microservices and microsites.   Experience with GIT, bitbucket, Github and the Gitflow branching model.   Experience adhering to an Agile development environment and iterative sprint cycle.   Experience in Continuous Integration/Continuous Development environments, preferably Jenkins   Efficient in working on different os - windows, linux Mac.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Product management", "Automation", "Manager Quality Assurance", "Linux", "Enterprise applications", "Machine learning", "Javascript", "Selenium", "Business solutions", "Monitoring"]}