{"JOB DESCRIPTION": "Key Purpose of the Job (Position Summary)     Experienced Business Analyst who can gather Stakeholder requirements, compile and manage E2E delivery.        Key Functions & Responsibilities       The role requires to build direct communication with all level of business and technical stakeholders to analyze the business requirements, convert the same into Change Requests (CRs), obtain approval from business users on CRs, and provide clarification to application vendors for development. Also ensure quality of all deliverables.   Develop comprehensive E2E test cases at application and enterprise level.   Provide timely support to all India users on core business application on issues, queries, requests etc. as raised by business users.   Help resolve the production Issues as per defined TAT, maintain the Issue log tracker, report & escalate to reporting officer.   Support RCA of critical issues & present to reporting officer.   Identify industry trends, compile and present recommendation to senior management.   Utilizing application data, compile and present analysis reports.       Education:   MCABEMBA IT   Experience:   4 5 years in Financial services industry working in similar role   Language Skills:   English & Hindi      Technical Managerial Competencies Required:     Strong knowledge of NBFC business processes   Knowledge of Software Development Lifecycle   Fair understanding of functional aspect of any Loan management software   Good knowledge of SQL Query language   Basic knowledge of database fundamentals   Strong Knowledge of testing methodology Software testing certification will be a plus   Hands - on Knowledge of office productivity suits such as Word, Excel, PowerPoint etc       Behavioral Competencies Required:     Strong analytical skills   Effective communicator   Good documentation skills   Handling Senior Stakeholders & managing their expectations   Managing vendors   Team player                                       ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["Analytical skills", "Software testing", "RCA", "Business Analyst", "NBFC", "Database Fundamentals", "Software development life cycle", "Test cases", "Financial services", "SQL"]}