{"JOB DESCRIPTION": "   Responsibilities           As a      Senior     Software Engineer on the Fluid      team, you will be responsible for      key areas of the platform that enable developers to build highly collaborative experiences easily and reliably. You will      be empowered to have end-to-end ownership      for your areas including design, code, test and telemetry coverage. You ll partner deeply across disciplines as well as across      partner      teams to      help deliver results that delight our customers. As a technical leader    on   the    team   you will also be responsible for    mentoring   early in career engineers who have a wide range of skills and    experiences   .           As a team we believe in doing all of this while having fun! A core part of our team culture involves supporting an environment where everyone can do their best work. We expect      all our team members to support this culture.         Qualifications           Basic:             8     + years     of experience in building and shipping production grade software and services               Bachelor s or equivalent degree in Computer Science, Math, Engineering, or      related field     .           Demonstrated experience in shipping high-quality products or    services           Exceptional software engineering skills across all phases of software development lifecycle           Ability to understand unfamiliar code bases, debug client and service side    applications           Ability to prioritize and handle multiple tasks completely and    independently           Ability to generate clarity in ambiguous    situations             Additional Qualifications:             Demonstrated experience working on distributed systems and/or high-performance    systems             Strong cross-discipline and cross group collaboration skills            Proven development experience in client-side web development including experience with JavaScript/   Typescript             Strong problem solving, debugging, and troubleshooting    skills             Experience participating in open source    projects     ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "SIDE", "Data modeling", "Web development", "Javascript", "Software development life cycle", "microsoft", "Open source", "Troubleshooting", "Distribution system"]}