{"JOB DESCRIPTION": "  Main Responsibilities and Deliverables:      Work with Architects, Senior Engineers, Managers and Product Managers in the design process for software products and services; contribute to the implementation planning and estimation     Communicate software designs to other software engineering staff members through code and textual and pictorial documentation as needed. This includes interfacing directly with other groups inside and outside of RD as needed.     Lead the end-to-end implementation and support of the software through leading by example to ensure complete quality coverage and high degrees of responsiveness to any issues that come up throughout the complete lifecycle of the software.     Ensure the intended design and quality levels are met through regular code reviews and testing of the software in-development. Mentor and coach peer and junior engineers and champion best practices and encourage software craftsmanship.     Personally contribute high volumes of quality code that is delivered with that of your colleagues in regular releases and deployments.    Qualifications / Education:     10+ years of Software Development in JAVA     Hands on Cloud Application Development (pure SaaS), using AWS     Experience of Developing software in a CI/CD model     Degree in computer science or equivalent from a reputed institute     Deep understanding of the ANGULARJS 1.X language and its APIs Design Patterns     Knowledge experience with Java     Deep Knowledge and experience with software design patterns and how they can be incorporated into software design.     Substantial capabilities in the domain, analyses information and deduces conclusions within the professional space, seen as a professional by his team and peer community. Has high-attention to details and works well in a dynamic and stressful environment.     Experience working in a modified Agile methodology development environment and using work item management tools like JIRA     Excellent interpersonal skills, proven ability and passion to educate and mentor others in engineering best practices and patterns, team player.     Ability to work under high pressure     High attention to details and accuracy     Self-starter, autodidactic     Very strong verbal and written English skills  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Computer science", "Software design", "Interpersonal skills", "Software development", "Engineer Application Development", "Mentor", "Application development", "Agile methodology", "Management", "JIRA"]}