{"JOB DESCRIPTION": "  Acquia is transforming the digital strategies of companies all over the world with our open cloud platform.      We are passionate and relentlessly committed to helping our clients create digital experiences that are more relevant, personalized, and built for a fast-changing, always-connected, mobile-first world. Headquartered in the US, we have been named as one of North America s fastest-growing software companies as reported by Deloitte and Inc. Magazine, and have been    by the analyst community and named one of the Best Places to Work by the Boston Business Journal.      We are Acquia. We are building for the future of the web, and we want you to be a part of it.     In this role you will:      Participate in all aspects of the software development life-cycle, turning functional requirements into working application components that meet specifications and follow Acquia best practices.     Participate in client meetings and workshops.     Estimate the amount of work required to deliver requirements.     Report on blockers and collaborate with team members to reach a resolution.     Track time and expenses using project and organizational standards.     Accountable for active contributions to UI / UX architecture decisions.     Accountable for front end and theme layer development for web applications.     Ad Hoc duties as assigned      Key Skills and Attributes:      3-6 yrs experience and interest in web standards and technologies: HTML, JavaScript, CSS, etc.     Experience in CSS preprocessors like Sass and LESS     Experience in JavaScript frameworks like Angular, React, Vue etc.,      Strong knowledge of JS-based build tools like Grunt, Gulp, and Webpack    Experience and interest in converting UX mockups into UI components.     Desire to learn and adapt to new applications and frameworks, and eager to work with new technologies.     Commitment to delivering high-quality software on time.     Strong interpersonal and communication skills.     Strong troubleshooting and problem-solving capabilities.     Skilled at collaborating with team members and partners in a matrixed environment.     Flexible and able to deal with frequently shifting priorities.     Excellent written and verbal English communication skills, with an ability to collaborate asynchronously in a multi-time zone environment.     Experience and interest in automated testing and continuous integration a plus.     Experience and interest in Agile methodologies including Scrum or Kanban a plus.     Bachelor's or higher degree in Computer Science or related discipline, or equivalent work experience.     ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - eCommerce, Internet Technologies", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "continuous integration", "CSS", "Automation testing", "Web technologies", "Javascript", "Agile", "Software development life cycle", "Scrum", "Troubleshooting"]}