{"JOB DESCRIPTION": "JOB FAMILY SUMMARY:                  Software Engineers work in the MINDBODY software development life cycle, including specification, design, and implementation and testing of new features and bug fixing. Software Engineers are responsible for their own code and bugs.              JOB SUMMARY:                 The Software Engineer I     V d     esigns, develops, troubleshoots and debugs software applications for our core product. This includes developing software components including Frameworks, APIs, Websites, Utilities, Databases and Internet - related tools. Determines hardware compatibility and/or influences hardware design when applicable.              PRINCIPAL     DUTIES AND RESPONSIBILITIES:                Develops software solutions by studying information needs, conferring with users, studying systems flow, data usage, and work processes, investigating problem areas, following the software development lifecycle             Conducts systems analysis and makes recommendations to improve the system to achieve an outcome                   Promotes internal best practices and coding conventions to write and execute tests for your own code, including creating comprehensive unit tests             Contributes to Technical Requirements Documents             Requests constructive feedback for designs early in the process             Communicates successfully with large teams and many personalities             Provides mentorship for Software Engineers and participates in interview panels to hire new Software Engineers                   Assists in removing obstacles for the team to yield successful sprints             Performs peer code reviews to ensure quality of the codebase             Ability to decompose and delegate work to junior engineers             Updates job knowledge by studying state - of - the - art development tools, programming techniques, and computing equipment; participating in educational opportunities; reading professional publications; maintaining personal networks; participating in professional organizations             Works effectively with multiple projects and departments                   All other duties as assigned                        WORK ENVIRONMENT AND PHYSICAL DEMANDS:                Dexterity of hands and fingers to operate a computer keyboard.             This position is mostly stationary and will be required to remain stationary for extended periods of time.                   Specific vision abilities required by this position include close vision, color vision, and the ability to adjust focus.              The noise level in the work environment is usually moderately quiet.                        SCOPE OF SUPERVISION/AUTHORITY:         Duties are performed under limited supervision. Often responsible for planning and organizing their own work, which may or may not be directly related to general business operations of the company or its customers. Will receive training and guidance from manager as needed. Individual contributors may be required to regularly exercise discretion and independent judgment with respect to matters of significance depending on the nature of the position. No direct management responsibility.      ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Software development", "Coding", "Software Engineer II", "Hardware design", "Software development life cycle", "Management", "Application software", "Software solutions", "Supervision", "Business operations"]}