{"JOB DESCRIPTION": " We are looking for interested talented Senior Software Engineer JAVA to join our team. Candidates should enjoy working in a challenging environment, have the enthusiasm and ambition to develop complete projects to the highest standard and want to be part of an organization that puts technology at the heart of everything it does. Candidates with 4-7 years of experience in will be considered.    What We are looking for     Dynamic Engineers / Graduates Post Graduates with 3 to 5 years of experience in the IT development section    Exposure to Java8, AspectJ, Spring Boot Framework, Sockets, Maven, Grunt, Jasper Reports, Thyme Leaf, MySQL, Mongo DB, AngularJS, NodeJS with good analytical skills    Knowledge on web services, Specific on Restful, Messaging experience (Rabbit MQ), Micro services and API based development    Good technical knowledge experience    Experience of the full software development lifecycle from business / systems analysis, thorough requirements gathering and functional specification authoring to development     Roles Responsibilities:     Communicate with the client for requirement analysis    Frequent status updates through client and internal communication    Perform a technical analysis of requirements to prepare detailed technical design    Handle the team of developers / mentoring the juniors by task briefing, review the tasks giving feedback    Developing the internal documentation such as Project Plan, Database design, Functional design   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Analytical skills", "Maven", "spring boot", "Technical analysis", "Web services", "Database design", "Technical design", "MySQL", "Software development life cycle", "Project planning"]}