{"JOB DESCRIPTION": "           Overview:   This position is responsible for providing senior application development and architectural support within Digital Consumer Solutions. Specifically, this person will provide exceptional application development to all digital projects.   This is a career opportunity to be a senior application engineer providing global digital solutions for one of the most well-known brands in the world. Passion, rigor, and drive are required.    Role:   Responsible for leading design & development of microservices built using Springboot on Cloud.   Responsible for programming, testing, implementing, documenting, maintaining and supporting applications in adherence with standards, processes and industry best practices.   Develop high quality, secure, scalable solutions based on technical requirements specifications and design artifacts within expected time and budget.   Develop enterprise solutions (standalone applications, services & SDK) using J2EE, JDBC (SQL & NoSQL) related technologies like Spring & Spring Framework.   Integrate content feeds via API, JSON, XML, and RSS from both internal and external sources.   Hands-on design & development experience on Cloud. Exposure to Pivotal Cloud Foundry will be an added advantage.   Communicate directly with team and project leaders to ensure scheduled due dates are met, while identifying emerging issues and recommending solutions for problems and independently perform assigned tasks.   Support internal and external users of the web content management system. Perform production incident management and participate in on-call escalation pager support rotation.   Document application components for support and training materials for Quality Assurance and Quality Control processes.    All About You   Strong communication skills both verbal and written with strong relationship building, collaborative skills and organizational skills.   Ability to work as a member of a matrix-based, diverse and geographically distributed project team.   Demonstrate ethics and values to generate high team trust.   Experience in Agile framework,, code management tool (Git), deployment tools (Jenkins)   Good understanding of algorithms and data structures.               ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["XML", "Agile", "JDBC", "Data structures", "J2Ee", "Application development", "JSON", "SDK", "Manager Quality Control", "SQL"]}