{"JOB DESCRIPTION": " Job Location : BangaloreExp : 5+ YearsProfile : Lead/ Sr. Software EngineerCompany Profile :- It was founded to deliver on the promise of high performance digital marketing?. -  We differentiate ourselves through cutting edge analytics, a robust  proprietary tool-set and a strong record of delivering results. - Our enterprise SEO tool ALPS was \"Highly Commended\"? at the Drum Search Awards USA 2018. -  We were ranked on the Inc.500 list of fastest growing companies in the  US four years in a row. We work with several Fortune 500 clients  including American Express, Avis, Allstate and Wyndham. - In  addition to digital marketing, 90% of our employees also have data or  engineering backgrounds. We have several hundred employees across our  offices in New York, London, Toronto, Mexico City and Bangalore. -  Our digital marketing programs include Digital Marketing Strategy,  Enterprise SEO, Paid Search, Display, Conversion Optimization, Digital  Analytics, Website Design and Development services.Job Description : Senior Software EngineerKey responsibilities :-  Develop, design and build scalable product and solutions to collect,  process and analyze very large amounts of data (structured and  unstructured), including stream and real- time data.-  Implementation of full lifecycle of a product/application including  requirement analysis, platform selection, technical architecture,  design, development, testing, and CI.- Develops and design complex modules of Application using agile software development.-  Work as part of sprint team and collaborate with Product managers and  data scientists in implementing best architecture to support their  needs.- Responsible for analysis of current programs including  performance, diagnosis and troubleshooting of problem programs and  designing solutions to fix.- Documents and demonstrates  solutions by developing documentation, flowcharts, layouts, diagrams,  charts, code comments and clear code.- Provide technical leadership, mentoring and guide teams on / help resolve technical challenges.Skill Requirements :- Minimum 5 years of professional experience developing product, solutions and web/data oriented component.- Minimum 5 year of strong full life-cycle development experience either with Python, Java.- Strong knowledge of AWS (Amazon web services) and REST API Development.- SQL/No SQL programming experience on RDBMS (Oracle, MySQL, PGSQL, etc...) OR No SQL (Mongo DB, CassandraDB, etc...).- Good knowledge of Micro service base development.- Good Experience in building solution on big data technology to handle large amount of data.- Experience in building scalable and high performance driven application and solutions.-  Should possess a fundamental understanding of basic areas of Computer  Science such as Algorithms, design pattern, data Structures and Object  Oriented Design.- If any products/solutions done with regards to data and enterprise will be preferred.Personal Attributes :- Candidate must possess good written and oral communication skills- Ability to multi-task under pressure and work independently with minimal supervision.- Dedicated, Hardworking and person who lives up to his commitment.- Must exhibit strong problem solving skills- Should be able to collaborate with teams on various decisionsDesired profile :- Years of experience: 5-8 years- B.E/B.Tech or M.Tech with CS/ITIf you are interested please apply with below required details in order to proceed further.Current CTC :Expected CTC :Notice Period :Total Ex : ", "ROLE": "Team Lead/Technical Lead", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Java", "Software Development", "Algorithms", "RDBMS", "Web Technologies", "Conversion Optimization", "Rest Api", "SEO", "Web Services", "PGSQL"]}