{"JOB DESCRIPTION": " Infiswift Technologies is looking for a strong backend/platform engineer for the team that is developing an exciting IoT+AI platform for all customers. The IoT+AI platform is currently being used by multi-billion-dollar customers in Solar, Manufacturing, Oil and Gas industries. The core features of the IoT + AI platform include real time and historic IoT message processing, horizontally scalable data storage and analytics/AI on the ingested IoT data. Key strengths of the platform are its scalability, low footprint and ability to be deployed anywhere (any cloud, on-prem and edge).   Qualifications   Please note we are open to candidates who have completed or are completing non-traditional education paths, with a focus on demonstrated knowledge and ability based on the qualifications below.    Minimum qualifications:     Ability to write solid code in C++/Go/Python with minimal supervision   Ability to develop and troubleshoot distributed system components including MySQL-compliant databases   Solid foundation of data structures and algorithms   Solid understanding of multi-threading, asynchronous I/O and networking   5 years of relevant work experience.   Bachelor s Degree or equivalent experience in Computer Science, Computer Engineering, Electrical Engineering, or Mathematics.    Preferred qualifications:   Master s Degree or equivalent experience in Computer Science, Electrical Engineering, Mathematics, or Statistics.   10 years of relevant work experience. ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "CA in CA, Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Computer science", "Electrical engineering", "C++", "Backend", "Networking", "MySQL", "Data structures", "Mathematics", "Analytics", "Python"]}