{"JOB DESCRIPTION": "      JOB SUMMARY      Software Engineers work in the MINDBODY software development life cycle,  including specification,  design,  and implementation and testing of new features and bug fixing. Software Engineers are responsible for their own code and bugs.     The   Software Engineer   designs,  develops,  troubleshoots and debugs software applications for our core product. This includes developing software components including Frameworks,  APIs,  Websites,  Utilities,  Databases and Internet- related tools. They also determine hardware compatibility and/or influence hardware design when applicable.     PRINCIPAL DUTIES AND RESPONSIBILITIES:      Serves as a self- directed,  key contributor to code development on features and bugs to produce successful team sprints       Makes implementation design decisions around new feature components       Produces contingency plans for critical projects       Analyzes technical requirements with the team to gauge level of effort       Breaks down complex projects and delegates work to junior engineers       Carefully analyzes design specifications before coding to understand effort levels required       Creates technical documentation for new features that can be easily understood by peers       Writes and executes tests,  including creating comprehensive unit tests       Performs peer code reviews to ensure quality of the codebase       Keeps abreast of new technologies       Ensures designs and projects created comply with design library guidelines,  internal best practices,  and coding conventions when applicable      All other duties as assigned      SCOPE OF SUPERVISION/AUTHORITY:       Duties for this position are performed under limited supervision       You will be responsible for planning and organizing their own work,  which may or may not be directly related to general business operations of the company or its customers       You will receive training and guidance from manager as needed       Individual contributors may be required to regularly exercise discretion and independent judgment with respect to matters of significance depending on the nature of the position       There is no direct management responsibility for the position        QUALIFICATIONS AND REQUIREMENTS:        QUALIFICATIONS AND REQUIREMENTS:       Bachelor s Degree in Computer Science or equivalent       At least 1+ years of experience on React       At least 2+ years of experience in working with Javascript       At least 3+ years of experience working as a software engineer       Worked with a Javascript unit testing framework such as Mocha/Jasmine/Jest for at least 3 years       Past experience of being a project or team lead that mentored other junior engineers       Experience with SaSS       Experience with / basic knowledge of NPM       Experience working within a micro- service environment       Worked with a distributed team       Worked in an agile environment       Excellent English communication skills (edited)       Detailed oriented,  professional and possesses a positive work attitude       Communicate professionally both verbally and in writing      Effective time management skills      WORK ENVIRONMENT AND PHYSICAL DEMANDS:       You will need dexterity of hands and fingers to operate a computer keyboard       This position is mostly stationary and will be required to remain stationary for extended periods of time       Specific vision abilities required by this position include close vision,  color vision,  and the ability to adjust focus       The noise level in the work environment is usually moderately quiet   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Coding", "Hardware design", "Javascript", "Agile", "Software development life cycle", "Wellness", "Unit testing", "Business operations", "Technical documentation"]}