{"JOB DESCRIPTION": "Software Front End Developer:Location: Bavdhan, Pune (Maharashtra)Who we are what we do? 2020 founded in 1987, headquartered in Laval, Quebec, Canada, 2020 employs over 800+ people, and operates in 11 Countries. We develop and sells software and content used worldwide by consumers, professional designers, retailers and manufacturers in the interior design and furniture industries. We provide Software solutions that assist our clients with making ideal spaces come to life. Working with us will boost your career that expands your mind and your horizons. Peers, who will inspire you, drive you and support you.  By joining 2020 you will be part of an organization that has its employees best interest at heart and who offers global exposure, challenging and meaningful work, innovative software tools and a highly collaborative work environment. Position Description: You will be working on development, maintenance and migration of a website and web based 2D design software specialized in furniture design.Ability to analyze and design developments that fit the sales / product management requirements You need to be autonomous and be able to organize your work depending on the priorities Ability to plan, execute, measure results and drive improvement on a continuing basis;Strategic thinking and ability to communicate on every level;Collaborate with team to brainstorm and create new productsWork collaboratively with others to achieve goalsStay on the leading edge of development practicesEssential Skills  apply only if you possess:2 years of WEB application development.A clever understanding of how to implement front-end applications based on web services REST/SOAP; Experience with client-side technologies such as JavaScript, HTML5, CSS; Experience with Angular 6.0 and above is must;  Experience with SOAP Web Services;Great knowledge of Object Oriented Programs;Web development using a multi-tier architecture and Service Oriented Architecture;Experience working on a modern web application that uses a model-view system would be plus;  Remote Debugging, Basics of SQL Server is plus; Our ideal candidate profile: Strong analytical, technical and problem solving skills who can work independently Creative, energetic and wants to get involved in exciting web development projects. Great outgoing communicator in English A College or University degree in computer science or the equivalent Knowledge of Agile development or other development methodology;  What we offer: Competitive salary and benefits package.Flexible work schedule.Professional business environment and the opportunity for exposition to cultural diversity      through the international flavor of our global company.With our flat structured organization, you can expect lots of responsibility and accountability for your work, which will be meaningful and impactful both locally and internationally.A complete and all-encompassing medical insurance package.Please visit http://www.2020spaces.com for more information.", "ROLE": "Database Architect/Designer", "INDUSTRY TYPE": "BPO, Call Centre, ITeS", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Other Graduate, B.Sc in Computers, B.Tech/B.E. in Electronics/Telecommunication, Computers, BCA in Computers"}, "KEY SKILL": ["Html5", "Web Technologies", "Angular", "CSS", "Front End", "Furniture Design", "Javascript", "Web Application Development", "Interior Designing", "Web Services"]}