{"JOB DESCRIPTION": "  Role Description    Digital Banking is seeking an experienced manager with 10+ years of experience. In this role, this seasoned manager will own and drive transformational change in complex initiatives and offerings. The manager will manage people, projects and processes to deliver products and features on time with high quality. This is a fantastic opportunity to build a team and deliver awesome products and services to a growing customer base.    The Responsibilities Include: -     Attracting great talent and building a high-performing organization through high employee engagement will be a core responsibility and will serve an anchor to other responsibilities as stated below.   Must have experience leading a large technology team in a dynamic, high-growth company with multiple, diverse offerings   Provides leadership, coaching, motivation and assistance to team members to ensure teamwork, and laying out development and career paths for team members growth.   Timely and quality delivery of stated offerings, as defined by a roadmap co-developed by product and engineering owners.   It is expected that this role will not only drive engineering initiatives directly but also be responsible for executing the same through other managers reporting to this role.   Establish and grow relationships with key decision-makers to drive strategic business initiatives   Working closely with other PD teams to leverage help when needed and appropriate.   Communicate effectively to appropriate levels of the organization to provide transparency and accountability for initiatives and their progress.   Performs a variety of tasks leads and directs the work of direct reports   A wide degree of creativity and latitude is expected      Qualifications:     We are looking for a manager who has the following experience.   Working with remote India and US based product development teams. Past working experience in USA preferred.   BE in Computer Science or related field   8+ years of total experience in the software industry.   Experience in a SaaS driven organization that has a focus on operational excellence   Experience with leading and managing Agile-based commercial software development projects.   Ability to develop and grow a strong development team of full-time employees and contractors. Experience hiring, mentoring Software Engineers, performance management, and career planning.   Excellent coaching and people development skills   Experience in the end-to-end development lifecycle and post-launch Production support   Strong oral and written communication skills to both technical and non-technical audiences   Intellectual curiosity to learn about products, customers and emerging technologies - Must enjoy coaching the team in Agile practices.   Minimum of 4 years hands-on, delivery management experience.    Technical, Functional and Leadership Skills     Understand the connections and drive results across organizational boundaries. Will be comfortable and experienced in a matrix managed environment.   Develop and apply highly effective team operating mechanisms to achieve business objectives.   Energize the organization to maintain continuous improvement programs and explore creative ideas to significantly improving repeatability, sustainability, scalability, and productivity.   Apply sound judgment - pragmatic, bottom-line oriented, budget-conscious, metric/measurement driven, naturally strategic, and hands-on.   Will be customer oriented and skilled in developing a strong understanding of customer needs and marrying those with technological potential.   Continuously assess individual and team performance and provide timely, constructive feedback relative to both.   A leader teacher: continuously lead through teaching. Create a virtuous learning cycle and teach others to have a clear point of view.   Continuously use multiple sources to gather VOE input, analyze it to identify root causes and /or organizational trends and address any issues or opportunities identified.   Mobilize senior management to support proposed changes.   Influence and communicate effectively with technical and non-technical audiences including senior product and business management. ", "ROLE": "Project Manager-IT/Software", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Embedded, EDA, VLSI, ASIC, Chip Design", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Project Managemen", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Hospitality", "Operational excellence", "People development", "Performance management", "Production support", "Employee engagement", "Agile", "Continuous improvement", "Recruitment"]}