{"JOB DESCRIPTION": "ABOUT IRIS SOFTWARE  IRIS Software Inc is a professional software services organization offering high-quality, cost-effective solutions to businesses. It has helped meet the IT requirements of companies ranging from those among the Fortune 100 to medium-sized firms by utilizing best-of-breed technologies, rapidly deployable solutions and flexible engagement models. With offices in India, USA and Canada, we employ 1700+ highly talented professionals and domain experts. We are strategic partners to over 25 Fortune 100 companies and our consistent striving for high customer satisfaction has translated into long-standing relationships and a preferred-partner status with many of our partners. Over 90% of the customers we have worked with have chosen to re-engage with us. IRIS is a quality and security conscious organization and has maintained steady progress in its quality management and information security management programs over the years. Namely Software Process Maturity: Certified to ISO 9001:2008 since 2002 | CMMI ML 5 | ISO 27001:2013   Visit us at www.irissoftware.com Position: UI Developers (Angular 2 or above)Experience: 6-9 yearsLocation: Sector 142, Noida Job Description:We are looking for a Front-End Engineer who is responsible for the complex development Applications.Must have excellent communication and technical skills and solid experience working with JavaScript, HTML5, and other frontend framework.You should have an understanding of back-end SQL.Should have knowledge of associated open-source solutions including an understanding of Linux operating systems.Excellent knowledge and hands-on Angular 2 or above is a must.React Forms basic knowledge is required.Develop best practice strategy for managing websites globally Skills: Angular 2 or aboveJavaScriptHTML5CSS3Reactive Forms (good to have)Communication Skills Education: B. Tech /B.E./MCA Interested candidates please share your cv @pooja.giri@irissoftware.com", "ROLE": "Technical Architect", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["Front End", "Javascript", "Information Security Management", "Software Services", "ISO 9001", "Html5", "ISO 27001", "SQL", "Operating Systems"]}