{"JOB DESCRIPTION": "  The Role   We are seeking software engineers experienced in analyzing, debugging and diagnosing complex software systems to join our growing team. In this role, you will play a key role in architecting, designing and building large components of the product. You will help drive process improvements, help adopt best practices, and constantly help to improve the customer's experience.      Responsibilities  Architect, design and implement large components of the product Lead a team of engineers to deliver complex projects by defining structure in areas of uncertainty, identifying and expressing discrete deliverables, and managing interactions between different teams Respond to time-sensitive issues within multiple familiar software modules or subsystems, root cause issues, and proactively improve robustness of individual features Proactively help the team by establishing best practices, architecture, and mentoring others against them Assess the impact of issues to identify and drive systematic improvements within an area Work with engineering teams, product management, sales, and customers to understand requirements and develop solutions Work with support, the field, and customers to collect relevant data to come up with solutions and/or workarounds on complex, critical customer problems   Requirements 816 years of experience building and architecting enterprise productsExperience working with DB Internals (RAC, RMAN, Backup/Recovery, ASM, Oracle Golden Gate, Dataguard, etc.)Experience in analyzing, debugging and diagnosing complex software systems - considering complexities like Performance, Scale, Interaction with Operating Systems, Multi-threaded interactions, etc.Strong coding and architecture background in C++/Java, with hand-on experience with industry best practicesA desire to build great products, learn new technical areas, and dive in wherever there is a needExcellent analytical and problem-solving skillsAbility to handle critical situations involving high priority customer issues, manage multiple priorities and meet deadlinesAbility and desire to work in a test-driven, agile, collaborative, and iterative programming environmentExcellent written, verbal communication, and interpersonal skills.  Ability to engage effectively with internal/external stakeholders to meet business objectives. Prior experience of working with teams in the US or other countries.Minimum undergraduate college/university degree in computer scienceAn obsession for providing good experience to customers   Great, but not required  Experience with large/complex relational databases and data warehouses like Oracle, SQL Server, DB2, Azure, Amazon RDS, Teradata, etc. Perks and Benefits Best in Industry", "ROLE": "Team Lead/Technical Lead", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "Any Postgraduate in Any Specialization, Post Graduation Not Required", "DOCTORATE": "Doctorate Not Required, Any Doctorate in Any Specialization"}, "KEY SKILL": ["database internals", "clusterware", "db internals", "algorithms", "coding", "db device driver", "rac", "linux", "data structures", "asm", "solaris", "programming"]}