{"JOB DESCRIPTION": "*    Description     A Software Engineer s skills, qualifications, and responsibilities include testing of software applications, creation of automated test scripts, test documentation, along with analysis, design, coding, documentation, and debugging of tools for Fisher FIELDVUE instrument products and technologies. The successful candidate will also help design User Interface applications based on Human Centered Design concepts and work with FIELDVUE instrument products connected to Industrial Control Systems via HART/Fieldbus communications protocols.       Responsibilities       Participate in a team environment using best practices on an Agile team        Participate in product definition activities including features, project and project scope analysis        Test software in accordance with FIELDVUE engineering processes and standards using manual test techniques and developing automated test software and scripts        Review product documentation including manuals and brochures for technical accuracy        Develop, enhance, and maintain tools and software for FIELDVUE instrument products and technologies        Perform technical support activities as assigned        Maintaining Systems and Software Integration Lab        Assist with other project activities as assigned by management   *    Requirements       Hands on experience with programming languages (e.g. C , C#, Java, etc.)        Working knowledge of version control (e.g. Microsoft Team Foundation Server)        Strong understanding of object-oriented programming, analysis, and design        Excellent software test skills (manual and automated)        Experience with the complete software development life cycle and QA processes in an Agile environment        Strong analytical, problem solving, and decision-making skills        Excellent oral and written communication skills        Strong organizational skills        Ability to prioritize work and assess risk        Strong mechanical skills        The ability to contribute in a team environment     ", "ROLE": "Testing Engineer", "INDUSTRY TYPE": "Construction, Engineering, Cement, Metals", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Version control", "Test scripts", "Coding", "Analytical", "Debugging", "Agile", "Software development life cycle", "microsoft", "Object oriented programming", "Technical support"]}