{"JOB DESCRIPTION": "About DelphixDelphix is the industry leader in DataOps and provides an intelligent data platform that accelerates digital transformation for leading companies around the world. The Delphix DataOps Platform supports a broad spectrum of systems-from mainframes to Oracle databases, ERP applications, and Kubernetes containers. Delphix supports a comprehensive range of data operations to enable modern CI/CD workflows and automates data compliance for privacy regulations, including GDPR, CCPA, and the New York Privacy Act.In addition, Delphix helps companies sync data from private to public clouds, accelerating the journey to the cloud and the adoption of disruptive AI technologies. In a world where every company is becoming a data company, Delphix provides a critical platform to enable data-driven transformation.The RoleAs an Architect for Delphix India, you will be responsible for establishing the technical vision and championing the architectural integrity, consistency, and long term design of solution for our product. You will work with other engineering leaders in India and US, to actively foster a high energy, highly productive engineering organization and culture.You will assist senior management in charting the future product and technology strategy-considering both technical and business trends and factors. You will coordinate and drive the evaluation, conceptualization, design, and integration of new capabilities into the product line with the product teams, ensuring that product design and technology choices anticipate future needs.Success in this role requires the ability to work effectively at multiple levels ranging from in the trenches with individual engineers, to the white board with designers and engineering managers and customer stakeholders. This means that you need to be comfortable and effective communicating in many different ways and advancing an agenda through personal credibility and influence.ResponsibilitiesBuilding complex systems with high quality, with repeatable success for on-time deliveryLeading a team of developers, providing technical guidance to the teamWork closely with QA, Product Management and SupportEnsuring employees are meeting all development standards by conducting reviews of all the deliverables/artifactsUnderstanding of how changes impact work upstream and downstreamIndependently estimating and re-estimating projects while recognizing and communicating dependencies in cross-functional workManaging the flow of information to internal and external clients as well as leadershipAssisting with the on-boarding new team members including content development and trainingSolving complex problems; applying new perspectives to existing solutionsWorking independently with minimal guidanceRequirementsStrong coding skills in Python, Shell-ScriptingGood understanding of databases (Oracle, Postgres, DB2, HANA preferred)At least an undergraduate degree in computer scienceExperience working with UnixStrong debugging, problem solving skillsAbility to work a flexible schedule to accommodate business needsExcellent verbal and written communication skills with the ability to adjust to meet the needs of the audienceDetail-oriented, with the ability to work with time constraints and guide others to meet deadlinesUnderstanding of Branching, Versioning, Source Control, Release ManagementGreat, but not requiredExperience working with enterprise software with complex dependenciesIn-depth understanding of DB operations/DBA experienceExperience working directly with customers on requirements as well as debugging and customizationSystem Administration experiencePrevious experience in an architect roleUnderstanding of file systems and operating systemsPerks and Benefits Best in Industry", "ROLE": "Team Lead/Technical Lead", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "Any Postgraduate in Any Specialization, Post Graduation Not Required", "DOCTORATE": "Any Doctorate in Any Specialization, Doctorate Not Required"}, "KEY SKILL": ["python", "django"]}