{"JOB DESCRIPTION": "About DelphixDelphix is the industry leader in DataOps and provides an intelligent data platform that accelerates digital transformation for leading companies around the world. The Delphix DataOps Platform supports a broad spectrum of systems from mainframes to Oracle databases, ERP applications, and Kubernetes containers. Delphix supports a comprehensive range of data operations to enable modern CI/CD workflows and automates data compliance for privacy regulations, including GDPR, CCPA, and the New York Privacy Act.In addition, Delphix helps companies sync data from private to public clouds, accelerating the journey to the cloud and the adoption of disruptive AI technologies. In a world where every company is becoming a data company, Delphix provides a critical platform to enable data-driven transformation.The Delphix team is seeking engineers with a passion for data security to join our data masking engineering team. In this position, you will propel innovative new features for data security and delivery. Delphix Masking provides a single platform to secure and deliver data across the enterprise, ensuring that sensitive information is protected and allowing data operators to centrally manage security policies and compliance requirements. Intelligent profiling automatically identifies sensitive data in source systems and algorithmic masking secures the data. Data can be irreversibly masked in accordance with internal standards and privacy regulations such as GDPR, CCPA, and HIPAA. Delphix provides the ability to define and broadly apply a consistent set of masking policies to mitigate privacy and security risks across non-production environments where the vast majority of sensitive data copies reside.Organizations around the world use our software to protect their sensitive information while rapidly and efficiently provisioning data.Key ResponsibilitiesArchitect, design and implement large components of the productLead a team of engineers to deliver complex projects by defining structure in areas of uncertainty, identifying and expressing discrete deliverables, and managing interactions between different teamsFind opportunities to integrate data security and data delivery that unlock unique value for our platformThink broadly about the Delphix product by working with engineering teams, product management, sales, and customers to understand requirements and develop solutionsAid the development of teammates and enable others through code reviews, mentorship and guidanceRequirements7-12+ years of experience building and architecting enterprise applications deployed on-prem and/or in the cloudExcellent analytical and problem-solving skillsAbility and desire to work in a fast-paced, test-driven, agile, collaborative, and iterative programming environmentAbility to think clearly and articulate your vision with the appropriate technical depthA desire to build great products, learn new technical areas, and dive in wherever there is a needBonus if you have...Experience architecting and implementing enterprise Java applicationsExperience in front end technologies (JavaScript, JSP)Experience designing and implementing software for Data Security, Cryptography, Data Loss Prevention (DLP), or other security toolsExperience designing, developing, testing and maintaining ETL processes in Pentaho Kettle, Informatica, DataStage, Ab Initio, or custom ETL implementationsExperience with large/complex relational databases, data warehouses (Oracle, SQL Server, DB2, Azure, Amazon RDS, Teradata, etc.) and other business data formats (XML, ASC X12, etc.)", "ROLE": "Team Lead/Technical Lead", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - System Programming", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["Multithreading", "Core Java"]}