{"JOB DESCRIPTION": "    Technical skills and competencies        Strong proficiency in JavaScript, HTML5, including DOM manipulation and the JavaScript object model, is a must.        Experience with High charts or D3 is good to have.        Thorough understanding of React 16.3X OR Angular and its core principles and workflows (such as Flux or Redux), Angular2, or Backbone is a must.        Experience with data structure libraries (e.g. Immutable.js) is good to have.        Experience with common front-end development tools such as Babel, Web pack, NPM, or any such tool is a must.        Strong understanding of browser compatibility and web standards is good to have.       Familiarity with server-side web technologies such as Nodejs / .NET / Java / Python is good to have.       Familiarity with RESTful APIs is good to have.        Ability to understand business requirements and translate them into technical requirements is a must.         Hands on skills with code versioning and configuration tools (such as Git, Bitbucket) is a must.         Extensive and applicable experience as a hands-on architect and/or senior-level programmer is a must.        Experience working with architecture and design patterns on software products is good to have.       Proven success in improving software architecture on desktop and web applications is good to have.       Strong, functional competency in full-stack web development is good to have.       Experience with Front-end performance optimization techniques is good to have.        Strong skills in communication, critical thinking, decision making, problem-solving, and attention to detail are a must.        Responsibilities   :      Developing new user-facing features using the latest front-end technologies       Building reusable components and front-end libraries for future use       Translating designs and wireframes into high-quality code       Optimizing components for maximum performance across a vast array of web-capable devices and browsers       Develop Components in React OR Angular and unit test the same.       Design Solutions and suggest technology choices for clients.       Own the implementation of the solution and deliver in designated timelines.       Interface with customers for requirement gathering, analysis and technology discussions.       Perform Code Reviews of the team members and mentor the team on technology best practices.       Evaluate new technologies, frameworks, and conduct POCs.       We promote a DevOps culture, so you will need to look beyond pure programming and get involved with the deployment and operation of the code we build.       Provide timely status updates and raise flags as needed.       Up skill and learn new technology as per the project demands   ", "ROLE": "Associate/Senior Associate -(Technical)", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "ITES, BPO, KPO, LPO, Customer Service, Operations", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Voic", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["software architecture", "Front end", "DOM", "GIT", "Web technologies", "Web development", "Javascript", "Performance optimization", "Unit testing", "Python"]}