{"JOB DESCRIPTION": "  About the Role    Figure is excited to be growing our businesses and creating new teams. We are looking for curious, innovative and collaborative team members. Engineering is at the heart of the action, building out our blockchain protocol and direct to consumer products that will transform the financial services industry. Everything is from scratch development and every engineer has a big impact on the team and the growth of the company.   Provenance is our Blockchain Team that powers Figure's products and services. We're looking for a Software Engineer with expertise in distributed computing and an entrepreneurial spirit.    What You ll Do     Drive innovative tech solutions adhering to iterative principles     Originate, champion and execute on new ideas for projects     Collaborate with project leads and other software engineers across multiple teams     Work on software solutions that will transform the consumer lending and blockchain space     Be a leader, use your voice, apply your tech skills to solve real world problems     What We Look For     BS/BA degree, Computer Science major preferred     2+ years engineering / development experience in a fast paced, agile environment     Proficiency in Java or Kotlin, JVM based programming     Team player with a positive attitude     Ability to succeed in a startup environment     Ability to drive a project from concept to release     Proficiency in Continuous Integration (CI) and Continuous Deployment (CD)     Familiarity with Iterative Software Development  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization, B.A in Other Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "continuous integration", "Compliance", "Agile", "Programming", "Deployment", "Individual Contributor", "Software solutions", "Financial services"]}