{"JOB DESCRIPTION": "Job Location: Hyderabad - INDIAThe Company:The Candidate: This Full Stack Software Engineer - Trainee will function as an integral member of the team that is building the VOZIQ platform, a breakthrough Analytics platform that can process billions of data records using a cluster of AWS machines. We believe that small, empowered, self-motivated teams can do big things.Your work will touch everything from our databases, business logic, web services, front-end UI/UX, edge services, performance engineering, test automation framework, and Continuous Delivery platform.We place a premium on collaboration and locally-made decisions. We believe in automating all the repetitive, high-risk, and mundane tasks.Key responsibilities: Developing and implementing highly-responsive user interface components using react. Analyse and understand the requirements from the business owner. Need to estimate and update your tasks on agile board on regular basis. Thorough understanding of React JS and its core principles.  Make design and technical decisions for Angular JS projects. Build reusable code and libraries for future use.  Need to develop reusable code with high quality. Need to use with GIT for version control.  Designing and developing APIs Proficiency in using code analysis and debugging tools. Should be able to understand business requirements and translate to technical design. Use responsive web design to create applications that automatically conform to multiple screen  sizes/devices.Required Skills and experience: Good to have working experience on Java, Java EE (preferred full stack developer). In-depth knowledge of JavaScript, CSS, HTML and front-end development tools such as Webpack, NPM. Hands on experience on web development with UI expertise. Should be strong at JavaScript design patterns, JQuery, Angular JS, React JS. Hands on experience on Web Services and RESTful APIs. Familiarity with code versioning tool  GIT.Qualifications: University degree in Computer science or Computer Engineering (B. Tech / B.E) Excellent communication skills. Must be a highly motivated self-starter comfortable working in a fast paced environment andmust have good time-management skills. Team player meeting the tight deadlines and quality deliverables.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["Angularjs", "CSS", "Front End", "Responsive Web Design", "Javascript", "HTML", "Npm", "Node.Js", "JQuery", "React.Js", "Webpack", "Web Development"]}