{"JOB DESCRIPTION": "  Roles & Responsibilities    Identify, analyze and develop interfaces and integration flows  Be responsible for programming and software development using various programming languages and related tools and frameworks, reviewing code written by other programmers, requirement gathering, bug fixing, testing, documenting and implementation.  Explain complex technical issues to project managers, developers, application leads and architects in an easy to understand manner, and recommend clearly thought out solutions.  Knowledge of Integration Design patterns for building middleware systems from the ground up  Knowledge of Web Services Interoperability, standards and ability to suggest, criticize and formulate solutions in a multi-vendor and architecture discussions.  Develop solutions by designing system specifications, standards and programming  Troubleshoot issues and provide bug fixes  Good knowledge of SOA architecture and fluency in web service standards such as WSSE and technologies (XML, SOAP, WSDL, XSD, UDDI, REST) is a must  Good understanding of relational databases  Some implementation experience with framework-based J2EE solutions is preferred Secondary Responsibilities - List the deliverables other than primary, but essential for the role Knowledge of Security, Logging, Auditing, Policy Management and Performance Monitoring and KPI for end-to-end process execution  Provide status updates and reporting metrics to the program leadership and contribute towards on-time and on-budget delivery    Job Requirements -     Minimum Number of Years- 0-3 yrs Industry FinTech,    Banking is preferred    Functional Area : The desired candidate must have worked on :-     Java / JavaScript / Node.js /Angular.js Level / Capacity Individual Contributor          Qualifications            Graduate/Postgraduate - Computer Science, Information Technology Engineers      ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "UDDI", "SOA", "XML", "Javascript", "Programming", "J2Ee", "Middleware", "Information technology", "Performance monitoring"]}