{"JOB DESCRIPTION": "PMorgan Chase & Co. (NYSE: JPM) is a leading global financial services firm with assets of $2 trillion and operations in more than 60 countries. The firm is a leader in investment banking,  financial services for consumers,  small business and commercial banking,  financial transaction processing,  asset management,  and private equity. The Corporate Technology (CT) organization develops applications and provides technology support for corporate functions across JPMorgan Chase,  including Global Finance,  Corporate Treasury,  Risk Management,  Human Resources,  Compliance,  Legal,  and all functions within the Corporate Administrative Office (CAO).\n\nCT teams are aligned with corporate partners evolving technology needs and the firm s ever expanding technology controls agenda. A top CT priority is building scalable corporate systems. Teams focus on:Responding to the evolving regulatory environment and helping to meet the firm s regulatory commitments by addressing internal and external commitments \n\nSalary\n\nNegotiable\n\nIndustry\n\nIT Software\n\nSubIndustry\n\nSoftware Development\n\nFunctional Area\n\nIT Software Development\n\nSpecialization\n\nIT/ Technical Content Developer\n\nRole\n\nExecutive /  Officer LevelPlease see job details section for all requirements                                 Education                                     \t Highest Qualification                                     \t Graduation                                         \tB.E/ B.Tech", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Administration", "Commercial banking", "Investment banking", "Asset management", "Transaction processing", "Risk management", "Financial services", "Private equity", "SQL"]}