{"JOB DESCRIPTION": "       We make real what matters       As a Senior Software Engineer (Ruby and DevOps), you will contribute to the design, development, support and maintenance of various CI/CD pipelines and hardware/services provisioning components of EnergyIP product. The individual will Works as an independent contributor and actively participates in the design process with the leads and architects. Requires good knowledge in Ruby, Terraform, Ansible and related technologies. Takes full ownership of assigned EnergyIP components.    You are passionate about automation. Even before the DevOps word, you had been using scripting languages shell, ruby etc to automate most of your tasks. Repeating yourself even once seems like a bad idea to you. You are not afraid to lose your servers as you know you can create and destroy them at will.    You love Linux and have a hacker mindset. You love discussions on Linux boot loaders, embedded Linux, infrastructure as code and on related/unrelated topics. But we actually want to ship things too! You can balance those demands without getting overwhelmed and keep the needle moving forward.    Write Unit test cases for the components developed    Integration testing of the components developed with other EnergyIP product components, if required.    Bug fixes / Maintenance of the components developed as well as any other components of EnergyIP assigned.    Design Documentation and Customer Facing Documentation    Develop and improve operational practices and procedures      Use your skills to move the world forward!       We need a B.E/B. Tech graduate with 5 to 7 years of experience in deploying and managing CI/CD pipelines using Terraform, Ansible etc    Strong knowledge of Ruby language    Experience with managing infrastructure in AWS    Good understanding of Unix/Linux based operating system    You should be comfortable working in a fast-paced environment while continuously evaluating emerging technologies    Adapt to prioritizing multiple issues in a high pressure environment.    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Unix", "Automation", "Linux", "devops", "Embedded Linux", "Integration testing", "Manager Technology", "Test cases", "Ruby", "Operations"]}