{"JOB DESCRIPTION": "We are always on the lookout for talent,  especially if it comes with enthusiasm to learn and excitement for innovation in any way shape or form. At the moment,  we re on the lookout for full- time software developers to join our amazing team to become an excellent developer who can work with us happily for a long time! We love to skill- share and are passionate about career progression,  if you are looking to kick- start your career as a software developer,  we have positions that will suit you.\n\n\n\nResponsibilities:\n\nImplement the requirements in a short period without compromising on the quality Work as a team to deliver world- class products Produce clean and efficient code Do a proof of concept and convert the prototype into a feature that people use Integrate software components and third- party programs Collaborate with other team members and stakeholders\n\nRequirements:\n\n0 - 1 years of working experience with good attitude to learn new technologies Candidates who can join immediately is preferred Good level of problem- solving skills Proficient in the basic understanding of programming principles Self- motivated individual who can adapt to a rapidly changing environment Quick to grasp new developments in technologies Basic understanding of C#,  JavaScript,  JQuery,  web markup,  including HTML5,  CSS3 Proficient knowledge of cross- browser compatibility issues and ways to work around them as an added bonus Basic understanding of asynchronous request handling,  partial page updates,  and AJAX etc. Experience with Visual Studio IDE Knowledge of code versioning tools,  such as SVN or Git is a plus", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["code", "software", "html5", "level", "Software Associate", "SVN", "Visual Studio", "it", "prototype", "CSS3", "quality", "jQuery", "GIT", "web", "Javascript", "developer", "programming", "Ajax"]}