{"JOB DESCRIPTION": " Software Developer Job Description    Assist in planning, design and execution of SOA backend platforms. Mostly around REST based Web Frameworks using JAVA (Spark,Spring, ORM)   High level and Low level design of the highly scalable components   Works collaboratively in a multi-disciplinary team environment   Assist key technical advisors to define the roadmap of project   Automating JSON requests handling on websites   Reporting immediately in case you are facing any issues   Research, evaluate and synthesize technical information to design, develop and test computer-based systems including mobile applications   Work with developers to design algorithms and flowcharts   Produce clean, efficient code based on specifications   Integrate software components and third-party programs   Verify and deploy programs and systems   Troubleshoot, debug and upgrade existing software   Gather and evaluate user feedback   Recommend and execute improvements   Create technical documentation for reference and reporting  Software Developer Qualifications    Educated as a Software Developer, Software Engineer or similar role   Familiarity with Agile development methodologies   Experience with software design and development in a test-driven environment   Knowledge of coding languages (e.g. C++, Java, JavaScript) and frameworks/systems (e.g. AngularJS, Git)   Experience with databases and Object-Relational Mapping (ORM) frameworks (e.g. Hibernate)   Ability to learn new languages and technologies   Excellent communication skills   Resourcefulness and troubleshooting aptitude   Attention to detail   Ability to use one or more development language (C++, PHP, HTML, etc.)   Strong communication skills   Ability to work in a team   Eye for detail and identifying problems   An understanding of business   Ability to develop unit testing of code components or complete applications. ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Hibernate", "Software design", "SOA", "Coding", "Javascript", "Flex", "PHP", "HTML", "JSON", "Unit testing"]}