{"JOB DESCRIPTION": "  DESCRIPTION    Clearwater Analytics is looking for talented Software Developers who thrive on solving problems and developing new skills. Clearwater offers a competitive compensation package, exposure to cutting-edge Financial Market issues information, business casual workplace, and work-life balance.   Clearwater operates several dynamic project teams within our development organization. Each team is capable of extending our software in ways that solve real problems for our customers. Our fast-moving project teams are capable of producing tremendous feature enhancements and reacting quickly to emerging technologies. All this in a motivating environment that encourages collaboration and stimulates creativity.    What you ll be doing:     Working on a team alongside other talented developers creating quality software that is used by some of the world s largest technology firms, fixed income asset managers, and security traders on Wall Street     Participating in Agile meetings to contribute with development strategies and product roadmap     Owning critical processes that are highly available and scalable     Producing tremendous feature enhancements and reacting quickly to emerging technologies     Encouraging collaboration and stimulating creativity     Contributing to design and architectural decisions     REQUIREMENTS     5+ Years professional experience in software development     Strong knowledge in Computer Science fundamentals in object-oriented design, data structures, algorithm design and problem solving     Fluent in at least one modern programming language such as JavaScript, C#, C++, Java     Strong problem-solving skills     Desired experience and skills:     Bachelor s degree in Computer Science or related field     Experience in implementing and consuming large-scale web services     Relational database experience (e.g. MSSQL, Oracle, MySQL)     Proficiency using modern web development technologies and techniques, including (HTML5, CSS, JavaScript)     Experience in full system design and architecture     Experience with database scaling and design  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Fixed income", "MySQL", "Web development", "Javascript", "Agile", "Data structures", "System design", "Oracle", "Analytics"]}