{"JOB DESCRIPTION": "       The individual in this role will be a part of our Core Development team which is responsible for designing, developing and maintaining Dolat s Algorithmic Trading Infrastructure. They will be focused on C++ functionality.   You will be responsible for creating and optimizing scalable, multi-tiered applications and infrastructure. We are looking for someone who will be able to solve difficult technical problems in a fast-paced and energetic trading environment. Technically, we re a Linux shop; our core trading infrastructure is written in C++.   We offer a dynamic, fast-paced, meritocratic environment with a flat hierarchy. You ll learn all the intricacies of how trading and technology intersect within the financial marketplace.     Skills you ll need:      Strong Computer programming skills using C++ in a Linux environment with expertise using STL and boost   Strong understanding of computer systems e.g. operating systems, networks, performance optimization, etc   Experience in Object-Oriented design and multi-threaded programming   Experience in creating/supporting cross-platform multi-threaded applications   Strong analytical and problem-solving skills   Optimize cache lines like a wizard   Can code up a multi-threaded UDP server/client easily   Understands the complexity involved with threads and lock-free semantics      Your Profile:      Has a Bachelor s, Master s or PhD degree in Computer Science, Engineering or related field   Can work independently   Can analyze and fix problems quickly   Can look at code; figure out how it works, and how to make it better          ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Object oriented design", "C++", "Financial markets", "Linux", "Operating systems", "Analytical", "Manager Technology", "Programming", "Performance optimization"]}