{"JOB DESCRIPTION": "       Our software engineering team is looking for a passionate C++ Software Developer to develop new, and improve Dolat s existing low latency Algorithmic Trading Platform. You will be integral in the interaction between research and quantitative trading teams and you will have the opportunity to work with cutting-edge technologies.    You will be responsible for creating and optimizing scalable, multi-tiered applications and infrastructure. We are looking for someone who will be able to solve difficult technical problems in a fast-paced and energetic quantitative trading environment.    Technically, we re a Linux shop, our core trading infrastructure is written in C++. We offer a dynamic, fast-paced, meritocratic environment with a flat hierarchy.      Skills:       Have significant experience developing high-availability systems in C++ with very tight latency constraints    Strong computer programming skills using C++ in a Linux environment with expertise using STL and boost    Have strong knowledge in parallel computing and Network programming    Have a strong understanding of software development principles (OO design, TDD, etc)    Can code up a multi-threaded UDP server/client easily    Understands the complexity involved with threads and lock-free semantics    Assisting in the development of a tick by tick backtesting research platform    Optimizing the computational efficiency of existing learning-based algorithms to drive higher performance and faster learning rates    Developing systems that provide easy access to historical market data and trading simulations    Creating tools to analyze data    Have strong interpersonal skills and ability to work in a collaborative environment with cross-functional teams    Possess self-motivation, curiosity and passion for technology       Profile:       Has a Bachelor s, Master s or PhD degree in Computer Science, Engineering or related field    Exchange Connectivity experience a plus    Knowledge and experience in Python    Experience working in the trading industry or other ultra-low latency-sensitive business that involves solving remarkably complex problems    Low level performance / cache optimization / profiling    Knowledge and experience in network protocols (TCP, UDP, )    Experience of full life-cycle software development utilizing exotic hardware/software architectures for ultra-low latency trading systems           ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["TCP", "Computer science", "C++", "Network programming", "Financial markets", "Linux", "TDD", "Manager Technology", "market data", "Python"]}