{"JOB DESCRIPTION": "Trainee Software Engineer - Web Application Trainee Software Engineer - Web Application Pelican is a leading provider of payment and compliance solutions to corporates and financial institutions of all types and sizes in the Americas,  Europe,  the Middle East and Asia-Pacific. Pelican puts intelligent automation,  compliance and control firmly at the heart of payments and other transactions processing. Financial institutions and corporates worldwide rely on Pelican to manage and control their payments securely,  improve operational efficiencies and lower risk and IT costs.\n The Trainee Software Engineer - Web Application ensures that development activities are done efficiently without any bugs.\n   Key Responsibilities \n Module programming,  unit testing and integration testing\n Quality management of own work\n Review of code,  documents and test cases\n\n   Essential Skills \nMandatory Skills: WebService(Restful api) ,  Spring,  hibernate/ Mybatis\nWorking experience in REST Web Services with JSON/ XML\nFrontend technologies like HTML5,  JSF,  JavaScript,  JQuery,  AngularJS,  BootStrap Framework,  Sencha Framework,  D3 Charts Core Java\nGood understanding of WebSphere Application Server,  Oracle\nProblem solving and debugging skills\nProactive in solvingissues\n Proactive in learning new skills\n Process Adherence\n Good communication (email/ oral) skills\n\n  Additional Skills \nSWING\nUML,  IBM Rational Application Developer,  Design Patterns\nGood presentation skills\n No. of Position", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Sc in Chemistry", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["rest", "Hibernate", "Automation", "development", "software", "testing", "it", "bootstrap", "quality", "Core Java", "jQuery", "application", "UML", "web", "Web application", "XML", "design", "Javascript", "debugging", "Oracle", "JSF"]}