{"JOB DESCRIPTION": "  We are looking for a Developer Support Engineer to join our Developer Support Core team. Reporting to the Manager of Support, you ll be responsible for connecting customers from around the world with the resources needed to enable them to fully utilize our platform and advocating for their needs.      As a Developer Support Engineer focused on providing exceptional support for our Core (Compute, Storage, and Network) offering, and through engagement and collaboration with our Core, Product, and Engineering teams, you ll have the opportunity to connect with and directly impact each customers' experience and journey on our platform.      What You ll Be Doing:        Responding to a high volume of technical tickets generated by our customers in a timely manner      Troubleshooting common Linux issues (CentOS, Fedora, Ubuntu, Debian), application stacks (LAMP, LEMP) and applications (WordPress, Ghost)      Providing exceptional support for a growing number of products (Droplets, Load Balancers, Block Storage, Spaces)      Working both collaboratively and independently with our support, product, and engineering teams      Identifying, communicating, and documenting process and policy improvements       What We ll Expect From You:        Excellent written and verbal communication skills      Successful track record in providing exceptional support to tech-savvy customers      Unrivaled passion for customer advocacy and technology      Strongly identify with our products, brand, and team culture      Strong analytical and pattern recognition skills      Bonus    : Programming/Scripting languages (Bash, PHP, Go, Python, NodeJS)      Bonus    : Configuration Management (Ansible, Salt, Chef, Puppet)      Bonus    : Virtualization (KVM, Xen)      Bonus    : Knowledge of, and contribution to Open Source projects    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "BPO, Call Centre, ITeS", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Linux", "Configuration management", "Wordpress", "Manager Technology", "PHP", "Customer support", "Troubleshooting", "Open source", "Virtualization", "Python"]}