{"JOB DESCRIPTION": "Hi All,Greeting from concentrix. We are seeking an experienced, motivated, .Net core developer to join the development team to build web applications.  Primary responsibility is to design, develop, enhance, and implement .Net solutions. A commitment to collaborative problem solving, sophisticated design, and delivering quality product(s) is essential  Key Duties and ResponsibilitiesUnderstanding business requirements and developing/ enhancing applications using .Net Core technologies.Participate in requirements analysis and provide estimates.Collaborate with internal teams to produce software design and architecture.Write clean, scalable code Transform non-technical, business requirements into technical requirements Develop and maintain code quality, organization, and automatization.Proactively contribute to and shape quality deliverables, particularly during the design phase.Anticipate and participate in code reviews to ensure quality deliverables. Practice and encourage knowledge sharing with a focus on establishing best practices Ready to work in flexible time zone as per client requirement(s).Qualifications and Experience RequiredProven experience in developing applications using .Net Core framework.Experience developing micro services and knowledge of deploying applications to Kubernetes environment.Experience working with REST APIs, Jason objects.Experience working with any of the messaging queues like RabbitMQ.Experience working on any database such as Oracle. SQL Server, MySQL.Understanding of Agile methodologies.Excellent troubleshooting and communication skills.Experience working with tools like Jira and GitLab.Knowledge of working with cache database such as Redis.Mandatory Skills are .Net , .Net Core, Angular ( 6/7/8), Web APIWe are looking for candidates who can join us in immediate- 40 days NP .Please share your profile with CTCECTCNP ", "ROLE": "Team Lead/Technical Lead", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Other", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": [".Net Core", "Web API", "Angular"]}