{"JOB DESCRIPTION": "Software Engineer \n\nZiplr is looking for techies in PHP to join our development team. \n\n•Are you the best programmer in your batch or office?\n\n•Do you lose your sleep till you have solved a technical problem?\n\n•Can you stay up the whole night just to write a beautiful piece of code which runs flawlessly?\n\nNote - If you answered yes to all above asked questions only then,  read the below text. \n\nLocation:  Bhubaneswar\n\nBrief:  \n\nAs a Software Engineer in the team,  you will build new enterprise applications and consumers products.  You will work with other developers,  project manager,  and business owners to create applications and services to solve a wide variety of business problems. \n\nResponsibilities and Role:  \n\n•Work on variety of software tasks and projects. \n\n•Researches new technologies and incorporates them into new systems and products. \n\n•Takes initiative in leading projects and collaborating with others. \n\n•Tests,  integrates,  writes,  troubleshoots,  and debugs software applications. \n\n•Responsible for the architecture and implementation of critical software components. \n\n•Work to improve the efficiency and functionality of current systems and products. \n\n•Update current products and develop new ones to product specifications. \n\nRequired Qualifications:  \n\n•0-2 year of software development  (php) . \n\n•Programming skills in core PHP,  JavaScript frameworks\n\n•Object-oriented Design and Analysis experience\n\n•Any bachelor s degree\n\n•Minimum 75% in 10 th and 12 th \n\n•Fluent English  (strongly preferred) \n\n•Experience in an Internet environment strongly preferred\n\n•Knowledge of Linux server environment preferred\n\n•Knowledge of mongoDB preferred\n\n•Programming skills in Python,  Shell preferred\n\nPackage:  \n\nWe make compensation irrelevant for our mates. \n\nBut just to give you an idea your package would fall in the range of 5 lakhs - 9 lakhs per annum.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Object oriented design", "server", "development", "code", "Architecture", "technical", "software", "Programming", "Application software", "Linux", "Enterprise applications", "design", "Javascript", "php", "MongoDB", "Core PHP", "Python", "applications"]}