{"JOB DESCRIPTION": "SHIFT DETAILS- Night Shift for an international client. Prime time would be 8pm to 5am.The role would require some technical support as well.On the Job Training would be provided.Roles and Responsibilities Design and develop mission critical applications developed using AngularJS and Angular, .Net / C#, JavaScript, jQuery, HTML5, CSS3, Web API etc.Understand the data model and its mapping to the various business processes.Develop high usability web interfaces to manage complex interactions with non-technical users. Work in all stages of website development and maintenance - from conception and design through testing and deployment.Create simple, well-documented code to solve complex business problems.Work closely with other team members, project managers and customers to ensure that all requirements are met and work as per specification.Develop automation test cases with Selenium Web Driver and maintenance.Responsible for the company's automated test management and the integration in the development lifecycle.Desired Candidate Profile  We are seeking self-motivated and highly productive Software Engineers to work with our development team. You will join a multidisciplinary team that designs and creates the user experience for all our products and clients across the globe.As a Software Engineer you will have the opportunity to participate in the full life cycle development of a multi-tier web application and to push the design envelope with new interactions and technologies.Skills-Communication, C#, AngularJS, JavaScript, HTML, CSS, JQuery, Bootstrap, ASP.Net MVC", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "BCA in Computers, B.Tech/B.E. in Electrical, Electronics/Telecommunication, Computers, B.Sc in Computers"}, "KEY SKILL": ["Software Engineering", "Night Shift", "Technical Support"]}