{"JOB DESCRIPTION": "  The Opportunity     IoT Platform Software is expanding to Hyderabad and is looking for a Software Engineer to help drive this expansion. In this role, you will be joining a new team of talented software engineers to deliver new features for our EFR/EFM product lines.    IoT Platform Software is responsible for delivering all MCU drivers and services, RTOS support, radio APIs, and embedded security features for Silicon Labs ICs. We work closely with the Silicon IC Design team to define the new features and functionality in our IoT ICs. We work with the Silicon Labs wireless protocol teams to enable our end customers to build amazing new IoT products.     What you will do      Deliver software components to support new features.      Minimum Qualifications      0-5 years of hands-on embedded software development      Strong C programming knowledge      Exposure to highly resource-constrained, real-time, embedded environments.      Experience with Assembly Language for at least one MCU (ARM, RISC-V, AVR, MSP430, 8051 or HC08)      Experience writing and optimizing device drivers for MCU peripherals (UART, SPI, GPIO, i2c, RTC, DMA, Watchdog, etc.)      Experience with one or more RTOS Free RTOS, uc/OS, Zephyr preferred      Proficiency with electronics bench test equipment such as oscilloscopes, logic analyzers, etc.      Experience working within a global organization      Excellent communication skills      Qualifications Considered a Plus      Experience working at a semiconductor company      Basic understanding of hardware IP architecture, development and verification      Radio firmware experience at the PHY / MAC layers      Zigbee, Bluetooth, Z-Wave, WiSun protocol stack experience      Benefits & Perks      Equity Rewards (RSUs)      Insurance plans      PF and NPS   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - Embedded, EDA, VLSI, ASIC, Chip Design", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["RTOS", "Wireless", "Bluetooth", "Semiconductor", "Assembly language", "Mixed signal", "Protocol stack", "Firmware", "SPI", "Automotive"]}