{"JOB DESCRIPTION": " Roles and Responsibilities Write extensive, efficient code to address complex modules, handling interaction between multiple components. To move to the next role, we expect you to independently own modules ranging from requirement analysis, design, development to its maintenance and support.Understand the product specification, raise questions,  gather information and further share  feedback building a well rounded solution. Be involved in product and design discussions.Work on adding new functionalities and solving complex problems with intuitive solutions. Solve Production Issues Learn and Deep dive into new technologies on the job,especially around modern data storage and streaming open source systems(Cassandra, Kafka, Spark, Elastic) and machine learning/deep learning (CNNs, sci-kit learn, Conventional Machine Learning techniques)Knowledge and Skills  Solid understanding of CS fundamentals - Operating Systems, Databases and Data Structures.Proficient in at least one or more programming languages including but not limited to Java, Python, or C++.Knowledge of Big Data Systems (Cassandra, Elastic, Kafka, Kubernetes, Docker), Distributed Systems, High Performance (throughput and latency) middle wares, Android, iOS, Machine Learning, and Deep Learning.Solid product design sense.B.Tech/B.E from Tier I/II colleges preferred What do we have in-store for you?A chance to work with extremely rich pedigree - Our team consists of seasoned professionals from Goldman Sachs, Walmart Labs, Microsoft, Yahoo.You will get to work with :Nipun Bhatia - https://www.linkedin.com/in/nipunbhatia/Abhishek Awasthi - https://www.linkedin.com/in/awasthiabhishek/We operate at the intersection of high throughput, low latency micro-service architecture, big data, ML and Deep Learning. We process close to 10M+ events every day and leverage a number of open source technologies. Our architecture is based on event streaming using Kafka, and Elastic, Cassandra, and Redis as the data layer. Our high through-put, low latency app facing APIs are built in Golang and Rust. The machine learning stack contains Spark, Keras and PyTorch and is used in a number of applications like query categorization, fraud detection, extracting text from images, NER and image quality and classification.Freedom and Opportunities to introduce and evaluate new tools, libraries and coding standards. Massive growth opportunities and engage in faster iterations and deployments. ", "ROLE": "Testing Engineer", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - eCommerce, Internet Technologies", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers"}, "KEY SKILL": ["Java", "C++", "Artificial Intelligence", "Cassandra", "Kafka", "IT", "Machine Learning", "Freshers", "CS Fundamentals", "PyTorch", "Software Engineering", "Technology", "Django", "Computer Science", "MySQL", "Javascript", "Keras", "MongoDB", "Spark", "Startup", "Python"]}