{"JOB DESCRIPTION": "\n\nWe have opportunities that can help you take your ideas and your passion to the next level.\n\nYou'll gain experience that will last you a lifetime ? and have fun while you're at it.\n\nMake college even more rewarding.\n\nYou should apply if\n\nYou enjoy solving problems (and are good at it!).\n\nYou are passionate about programming and delivering clean,  test- covered,  well- designed,  scalable code.\n\nYou are not rigid with respect to choice of technology.\n\nYou have sharp reasoning and a logical bent.\n\nYou have a good grasp on programming fundamentals including OOPs,  design patterns,  algorithms,  data structures,  networking etc.\n\nYou have the makings of an ace developer.\n\nWhat is the Job like\n\nAs a Software Engineer intern,  you will help build web- based tools and applications to enhance our internal & external products and do more for our customers. You would be given opportunity to understand and shape the direction of our products by considering the architecture,  performance,  testing,  design,  and implementation. Engineers here work on both UI level and lower- level implementation details. You would get to do the same. You would work on open source technologies.\n\nThe successful candidate should be comfortable working in a fast- paced,  collaborative environment. Developing and fostering partnerships with cross- functional teams is key to success. The person filling this position must be a hands- on,  pro- active,  self- motivated developer with strong initiative and a desire to succeed in a challenging environment. The ideal candidate will have a passion for great user experiences and an eye for detail.\n\nResponsibilities\n\nCreate complex business applications as a member of high energy teams.\n\nUse MVC frameworks and OOPs concepts to build scalable modular applications.\n\nParticipate in the entire lifecycle of the Product -  design,  documentation,  coding,  testing and deployment.\n\nApply SOA concepts and use SOAP to build loosely coupled applications.\n\nImbibe usability engineering concepts and contribute to UI design processes.\n\nRequirements\n\nAge:\n\n28 or lesser.\n\nEducational Qualifications:\n\nPreferably from an software engineering /  technical background.\n\nPHP Certification will be considered as an advantage.\n\nDetailed Requirements:\n\nStrong attention to detail.\n\nGood oral /  written communication skills in English.\n\nExcellent grasp /  understanding of OOPs.\n\nGeneral experience in designing and using RDBMs.\n\nKnowledge of MVC frameworks.\n\nBasic Unix /  Linux commands knowledge.\n\nStrong HTTP and session handling concepts.\n\nStrong internet concepts knowledge.\n\nStrong knowledge and working experience with HTML 5,  CSS and Javascript.\n\nProcess oriented : Demonstrable commitment to following processes,  commenting,  documentation,  testing etc.\n\nHighly motivated and energetic team player,  with excellent interpersonal skills.\n\nSkills /  Technologies to possess /  develop:\n\nPHP 5.0 +\n\nMySQL\n\nHTML 5,  CSS\n\nJavascript\n\nXML\n\nSOAP & Service oriented architectures\n\nView all Technologies and Tools\n\nBelow is a work- in- progress document of the skills that developers at Dquip are expected to possess /  develop.\n\nGranted that all developers at Dquip do not possess all the skills listed herein. This document serves as a \"skills- to- acquire\" list for our existing team,  as well as a reference list for aspiring applicants.\n\nAs someone who wants to join our organization,  you should have several of these mastered,  and be prepared to tackle the rest. We recommend you to read it.\n\nDownload Now\n\nOur weapons of choice\n\nJIRA (Track,  Plan,  Analyze)\n\nConfluence (Team collaboration)\n\nBonfire (Exploratory testing for agile teams)\n\nGreen Hoper (Agile project management)\n\nLucid Chart (For UI. From static wireframes to rapid prototypes)\n\nWe expect you to know about these tools.\n\nTime period for Interns : Min 2 and Max 6 months. \n\nBenefits & Perks\n\nNo dress code. T shirts,  shorts,  jeans,  flip flops are just fine.\n\nFlexible work hours. We have flexible work hours and flexible holidays,  which means that teams pick their own work hours.\n\nWe devote 10% of our work time to learn new things.\n\nFlexibility to choose between a Windows or Mac for getting things done. We personally love Macs ;)\n\nFree around the day snacks & beverages.\n\nCarrom & other gaming sessions for unwinding after a hard day's work.\n\nOur workspaces are comfortable and fun.\n\nWe go out for picnics,  treks,  adventure sports,  leisure trips & play : cricket,  football,  chess,  pool,  kite flying and much more.\n\nPurchase of books.\n\nLove what we do Then come help us do it.\n\n", "ROLE": "Training Manager", "INDUSTRY TYPE": "BPO, Call Centre, ITeS", "FUNCTIONAL AREA": "HR, Recruitment, Administration, IR", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "HR/ Recruitment / I", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Unix", "Linux", "Networking", "SOA", "XML", "MySQL", "Javascript", "Performance testing", "PHP", "Windows"]}