{"JOB DESCRIPTION": "DL 55,  Sector II,  Salt Lake Kolkata 700091 West Bengal \n\nJOB DESCRIPTION \n\nConfidential & Restricted Use only (2010) \n\nJob Description \n\nDepartment: Product /  Project Job Code: \n\nLocation: Kolkata Travel Required: Yes \n\nSalary Range: -  Position Type: Permanent \n\nSkills: \n\nJob Description: \n\nDuties and Responsibilities: \n\nResponsible for handling customer requirements and managing them to finalize and close \n\ntheir requirements (for Projects). \n\nPreparing functional specs from customer requirement for Projects. Preparing ERDs to normalize the table structure for the project. Integration of the existing product components into the Project and customization of those \n\nDevelopment of the new features for the Project. Development of software and integration of different hardware devices with the actual \n\nDevelopment of product feature as a standard scalable component. Responsible for Testing and assuring quality. Should be able to perform multi- tasking in case of project delivery and/ or crisis. Preparation of Project documents. \n\nExperience,  Education and Skills: \n\nBachelor Degree in Engineering from a reputed college or institute. 0- 3 years experience in Software Development Ability to understand new functional concepts and business processes. Good knowledge in ERD and Process diagram. Good knowledge in Database,  Java,  J2EE,  HTML,  JavaScript,  Web Server. Ability to understand and build skills fast in new and other Technologies like Midlet,  Dot Net,  \n\nJob Description: \n\nCreate designs,  concepts and sample layouts Develop graphics and layouts for product illustrations,  corporate websites and other \n\nDesign brochures,  handouts,  banners,  user guides,  training guides,  product packaging. Thinking creatively and contributing new ideas and designs and implementing those ideas. Design,  enhance and maintain company website. \n\nGood understanding of Operating Systems namely Windows Server 2003,  Windows Server 2008 and Linux. \n\nGood knowledge in MS Office. Excellent problem resolution ability. Must possess good documentation skills. Must be capable of working in a team environment effectively Enthusiastic and self motivated. \n\nGraduate and/ or Diploma from a reputed institute or college in graphic designing,  animation,  multimedia etc. \n\n0- 3 years experience in graphic designing,  multimedia,  animation. Ability to think creatively and produce new ideas and design. Good knowledge in Photoshop or Corel Draw or Illustrator or Flash. Knowledge in Action scripting and HTML would be an advantage. Good in freehand drawing. Enthusiastic and self motivated. Ability to handle pressure and tight deadlines. \n\n", "ROLE": "Graphic/Web Designer", "INDUSTRY TYPE": "BPO, Call Centre, ITeS", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Graphics", "Graphic designing", "Linux", "Illustrator", "Database administration", "Corel Draw", "HTML", "Windows", "Photoshop", "microsoft"]}