{"JOB DESCRIPTION": "  Job Summary     We are looking for a React Native developer interested in building performant mobile apps on both the iOS and Android platforms.   he candidate will be responsible for architecting and building these applications, as well as coordinating with the teams responsible for other layers of the product infrastructure.   With this highly challenging and responsible role, you will get an opportunity to build cutting-edge and customized technology solutions that help influential global enterprises to redefine their position in the global market space.    If you love solving problems, believe in collaboration, and are committed to quality product development - this role is perfect for you.    Experience    : 2- 6   years    Responsibilities     Perform well in a fast-paced environment, and contribute to optimal flow in a rapidly changing design/technology environment     Identify, diagnose, and fix bugs/issues for optimum performance.     Work as part of a team that will include other developers, a product manager, QA professional, and a designer.     Working on native APIs for integrations with both platforms.     Ensure the best possible performance, quality, and responsiveness of the application     Coordinate with co-developers and keeps project manager well informed of the status of development effort and serves as a liaison between development staff and project manager     Ideal Candidate should have     Build pixel-perfect, buttery smooth UIs across both mobile platforms. Leverage native APIs for deep integrations with both platforms      Excellent skill in React and React Native     Good command on Javascript coding and ES6 standards.      Ability to write well-documented, consistent clean Javascript code     Good knowledge of using RESTful and/or GraphQL     Must be familiar with state management tools like Redux     Good to have familiarity with SQL/NoSQL databases and their declarative query languages  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Product quality", "NoSQL", "Coding", "QA Professional", "Machine learning", "Javascript", "Manager Technology", "Technology solutions", "SQL", "Android"]}