{"JOB DESCRIPTION": "Roles and ResponsibilitiesJob PurposeAs a Senior Software  Development Engineer in Test (SDET2), you will work closely with the development  and test team over our overall quality strategy by building the right test  infrastructure and tools, and spearhead the best practices that enable a quality  product.Roles & ResponsibilitiesDevelop and drive automation test planning,  cases, and strategy across several functional teams, to both insure product  quality and to contribute to Continuous Integration and Delivery  efforts.Build and maintain an automated test infrastructure and automation  test harnesses for a multi-platform product that will be used to validate all  aspects of the product operation.Integrate with existing/new infrastructure  to establish a continuous build and test cycle.Establish processes and tool  sets to maintain automation scripts and generate regular test reports,  contributing ongoing streamlined data to our engineering dashboards. Desired Candidate profile:- 4+ yrs of applicable experience with major  time designing and building automation framework.- Proficient with least one  modern programming or scripting language such as C, C++, Java,JavaScript,  Python or PERL.- Sound Knowledge of Framework like selenium, Appium  etc.- Knowledge of communication protocols, architecture, or platforms.-  Knowledge of industry standard test automation tools and experience in  developing product test harnesses and instrumenting products to gather test  result.- Knowledge of professional software engineering practices & best  practices for the full software development life cycle, including coding  standards, code reviews, source control management, build processes, testing,  security and operations.- Experience with test driven development and  establishing unit test infrastructures, automating the validation of modern user  interfaces.- Experience with evaluating and integrating open source and in  house developed toolsets.- Expert in software quality and testing  methodologies / patterns.Comfortable working in a fast paced, highly  collaborative, dynamic work environment.- Experienced in interacting and  coordinating test activities amongst multiple teams. Holds a Bachelor's or a  Master's degree in Computer science, Software engineering or a related  field.- Experience in communicating with users, other technical teams, and  management to collectrequirements, evaluate alternatives and develop  processes and tools as needed to support the organization.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - QA & Testing", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers, B.Sc in Computers, BCA in Computers", "PG": "M.Tech in Computers, MCA in Computers, MS/M.Sc(Science) in Computers", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Java", "C++", "C", "test automation", "SDET", "JavaScript", "test planning", "Automation Testing", "Appium", "Selenium", "Python"]}