{"JOB DESCRIPTION": "Job Description :We Are Hiring User Interface Software Engineer (Immediate joiner) for Various IT Client}Location : BangaloreDuties & Responsibilities :- Developing UI Software for medical devices using Qt/QML/C++ targeted for hardware running Yocto Linux.- Testing/Validating and documenting as part of development process.- Meeting with the design team to discuss application features and design ideas.- Researching similar application designs and user interface modules.- Creating application design mock-ups with enhanced UI features.- Presenting updated front-end designs for final sign-off.- Writing the front-end code and building the user interface.- Debugging code errors and troubleshooting software issues.- Conducting live application tests and tweaks.Skills Expected :- Strong proficiency in Qt/QML/C++, with fair knowledge of the language specification- Must have knowledge in Linux environment (Experience iis added advantage)- Good logical thinking and problem-solving skills is a must.- Good knowledge in cross compilers and must have debugging skills.- Must be proactive and good in communication (written/verbal and interpersonal skills).- Advanced problem-solving skills.Profile Required :- B.E/B.Tech in Electronics or Computer Science stream with hands on experience of 2-3 years in UI Software development using Qt/QML- Prior experience in medical device development is added advantage.- Medical device experience preferred- Devices Directive 93/42/EEC- Prior start-up company experience highly desired.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Electronics/Telecommunication, Computers", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Qml", "C++", "Software Development", "QT", "Linux", "Software Engineering", "Debugging", "Computer Science", "Application Design", "Compilers"]}