{"JOB DESCRIPTION": "   Role Overview:       As a Software Engineer, you will be an important contributor to the Data Protection Group in India, developing cross-platform endpoint applications for Windows, MacOS, and Linux. You should have Technical skills, project management skills with multiple years of designing Enterprise class products along with ability to work toward achieving organizational goals. You will be involved in all aspects of product development lifecycle - requirements discussion/analysis, design estimation, planning, implementation, code reviews and unit testing, documentation, POCs, deployment and engineering. You will also be responsible for release deployment and supporting customers using the products in production. You will foster a culture of innovation while displaying technical expertise, ownership, and delivering high-quality endpoint security solutions on a variety of desktop and mobile clients. For you to be successful in his role, you need excellent debugging and development skills in C++/C, understanding of Windows OS (Nice to have MacOS) system internals and experience building lean agents.     About the Role     Design and development of creative multiplatform software for securing endpoints on a variety of desktop and mobile platforms   Gather technical requirements and specifications from customers and partners and develop technical specifications according to which solutions are defined and delivered.   Provide solutions that meet the timeline, quality and costs for the projects and deliverable elements. Solutions must meet the preset goals for quality, security and performance.   Mentor juniors members   Guide and meet tight customer commitments and attend escalation meetings.       About You     You have 8+ years of software engineering experience, with emphasis in Microsoft Windows and MacOS-based enterprise applications development and basic knowledge in Networking and OS fundamentals.   You have Windows (Nice to have : MacOS internals), API/UI development skills using C++ technologies.   Driver development experience on Windows.   Security/End point/ Data Protection domain background.   Exposure to cloud technologies like AWS/Azure.   You have Windows/MacOS desktop application or driver development experience with deep knowledge on tools like Visual Studio, XCode, WinDBG , Wireshark, fiddler and equivalent.   You have excellent oral and written communication skills and having the ability to deal with interoperability issues is a big plus.   Any patents would be appreciated.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["UI development", "C++", "Windows OS", "Linux", "Networking", "Enterprise applications", "Debugging", "Visual Studio", "Unit testing", "WindBG"]}