{"JOB DESCRIPTION": "   Role Overview:       We are looking for new team members who are passionate about software testing and building automation, interest in cybersecurity and data protection, and want to join our collaborative team as Software Engineer to help guide the enterprise product team.     About the Role:     This is an individual contribution role.   Oversee the all the QA activities for product releases and defect management   Manage end-to-end testing   Test the product on Non-Windows platforms.   Oversee technically guide the team to guide high-quality testing by adopting best practices.   Create Test strategy, plan, scripts and documentation.   Work with other team member on best practices.   Drive testing and automation on cloud platforms       About You:     7+ years of experience in software testing and automation   Experience using an object-oriented environment   Exposure to MAC OS.   Experience in software test strategy, plan and QA methodologies   Experience in Functional testing, Regression Testing, Security testing   Experience in Rest Api.   Experience in Cloud, Preferably AWS.   Excellent partnership and to work with all parties including Dev and QA teams, Programme / Product managers, Technical Publications and other Project Partners.   A keen interest / experience improving efficiency in software testing.   Understanding of risk-based testing or other approaches to increase efficiency.   Experience in Security Domain or Network Security would be a Plus.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - QA & Testing", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Software testing", "Automation", "Test strategy", "HP data protector", "Functional testing", "Diversity and Inclusion", "Network security", "Security testing", "Regression testing", "Windows"]}