{"JOB DESCRIPTION": "   Role Overview:       Lead Software Engineering projects with exceptional Technical skills , communication and project management skills      About the Role:      Design solutions for your team and oversee code reviews.   Work with product managers, partners, and business groups to   categorize   and describe solutions for business and technical requirements.   Stay on track with latest technologies for the domain and apply the experience to improve the product features.   Develop features/escalations and ensure the product aligns with the business, clients and partners strategies and requirement.   Explain the status and value of proposed design/Solution to partners.    Analyze   and articulate current technological solutions and proposed valued alternatives wherever required.   Gather technical requirements and specifications from customers and partners.    Deliver   solutions that meet the timeline, quality and costs for the projects and deliverable elements. Solutions must meet the preset goals for quality, security and performance.       About You:     You have   12+ Years of technical experience   in product development.   You have professional experience working as a software engineer   designing and developing   software solutions for large enterprises.   You have experience designing Endpoint products for Enterprise with a focus on security, quality and performance.   Experience developing mid to large-scale software commercial products using C/C++ on Mac OS.   You are hands-on with multiple programming and scripting languages including C++, Java, Python, PHP, and Node.   Excellent knowledge of Mac Windows/Linux, with an understanding of the OS architecture, and Networking.   Experience in designing applications that will be migrated to cloud and understanding of the concept of elasticity and scalability.   Any patents would be appreciated.   Excellent technical   skills and knowledge   of creative technologies, skills in communication   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["C++", "Linux", "Networking", "Lead Software", "Project management", "Diversity and Inclusion", "Engineering projects", "PHP", "Windows", "Python"]}