{"JOB DESCRIPTION": "  Responsibilities     Design, implement and develop world-class software for Cloud components. Marshall industry coding standards , design patterns and practices within Visa     Take   ownership   of key   micro-services   and deliver a quality product end to end     Architect and develop world-class software for Cloud components by auto provisioning systems, host to storage integration and zero touch installation of software components.     Design and build tools to improve operational efficiency of cloud infrastructure in all areas of Infrastructure Automation i.e. Provisioning, Scaling, Availability, Upgrade, Maintenance, Security and Governance     Coding for auto provisioning and administration of applications on IaaS.     Work within a highly-skilled team along with Engineering Managers, Technical Product Managers and Program management to determine methods and procedures on new automation assignments.     Evaluate Proof of Concepts based on   Long Term Architecture   and pilot new tools & technologies.     Provide guidance and mentorship to junior team members. Review and evaluate code developed by junior members to ensure we develop only highest-quality code.    Qualifications     Bachelor Degree/Masters Degree with   minimum 7+ years of experience   in Software Development     Extensive experience in   design & development of applications on multiple platforms (Linux and Windows), using Open Source products      Good understanding and technical expertise in   Microservices  ,   Docker   and   Kubernetes      Experience with   cloud platforms   (e.g. AWS, Azure or Google Cloud) and building automation around their APIs     Amazon   AWS   or Microsoft   Azure   or   Kubernetes   certification preferred     Experience and understanding of Infrastructure as Code, Automation, and Orchestration     Working knowledge of at least one configuration management tool, such as   Ansible  ,   Chef  , and/or   Terraform      Experience building service-oriented solutions and   RESTful   microservices and a strong understanding of Java multithreading, concurrency, and memory management     Strong understanding of   Spring framework   internals     Strong Software Engineering background is required with development knowledge in   multi-tier enterprise architecture.      Understanding of Infrastructure components like Systems, Virtual Machines, Database, Middleware, Storage etc. is preferred.     Working knowledge of infrastructure, ensuring high-availability, scaling, service discovery, logging, monitoring and alerting.     Experience of building software/frameworks for infrastructure automation and orchestration     Excellent coding practices including a proven understanding of design patterns and unit testing     Good written and verbal communication skills. Ability to effectively communicate the logic and implementation plan to team members & managers.     Ability to work in a fast paced and highly agile environment     Showcase   excellent debugging   and   problem-solving skills  .     Have a mindset for   continuous improvement   and   innovation      ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Automation", "Multithreading", "Linux", "Configuration management", "Agile", "Workflow", "Windows", "microsoft", "Open source", "Middleware"]}