{"JOB DESCRIPTION": " Job Description     Conduct component level performance engineering activities, including code and data flow review.     Contribute for creating application and infrastructure performance plans/models for a highly scalable, low-latency, highly-available and high-throughput payment processing system     Design and Develop Data generation tools that simulate production like transaction mix.     Execute load and performance tests to validate system performance and stability; and troubleshoot and identify issues.     Design and conduct tests with complex workloads and data shapes to expose potential bottlenecks and failure points.     Perform root cause analysis for the issues identified.     Analyze metrics and trends to glean opportunities for performance improvements of the application.     Experiment with ways to eliminate issues and present corrective actions, conduct session with developers and architects on the corrections/techniques suggested.     Oversee system performance lifecycle and identify key metrics for performance improvements.     Generate periodic performance engineering reports for architects, developers and PMs to review.     Contribute for internal publishing of design tradeoffs, code best practices and lessons learned      Support in triaging and troubleshooting of highly distributed services in production environment     Performance Modelling capability based on Performance Test Numbers for a predefined application Non Functional Requirement     Understanding of Microservices/CGROUP and Namespaces in Linux     Deep Understanding of Linux Memory management     Deep Understanding of IO Subsystem (IO subsystem layers, Type of IOs, Caching, Filesystems, RAID)     Understanding of Compute subsystem with in-depth knowledge of scheduling of process, thread and goroutines/LWT     Understanding of process state, context switches, system calls     Knowledge of at least one language - GoLang, Python or Java. Should be able to code independently     Ability to build Cost Profile for Application based on test results[CPU, Memory, IO and Network]     Ability to profile CPU and Memory consumptions or raw dumps. Familiarity with traces, thread dumps, debug log    Qualifications     Extraordinary software engineering talent     Minimum of 3 years hands-on experience in performance engineering     Effective verbal and written communication skills     BS or MS in Computer Science or related degree from recognized university     Previous experience with financial services or payments processing domain is a big plus     Deep understanding of Docker and Kubernetes is a plus     Deep understanding of Kafka is a plus     Deep understanding of Relational Database is a plus     Deep understanding of any NoSQL Database is a plus     ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - QA & Testing", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Publishing", "NoSQL", "Payment processing", "Linux", "Memory management", "Performance engineering", "Scheduling", "Financial services", "Python"]}