{"JOB DESCRIPTION": " Job Description      Lead and participate in the design and implementation of our Analytics infrastructure to align with the vision of Visa Data Platform Infrastructure.      Design and implement technical solutions to support the ecosystem of Analytics Infrastructure.      Responsible for the implementation of ongoing Hadoop infrastructure including monitoring, tuning and troubleshooting.      Design, implement and maintain security, data capacity, node forecasting and planning.      Provide hardware architectural guidance, plan and estimate cluster capacity, and create roadmaps for the Hadoop cluster deployment.      Closely work with the Hadoop development, infrastructure, network, database, and business intelligence teams.      Work closely with engineering managers and development teams to ensure that applications are designed with scale and operability in mind      Ensure excellent operational support for live site and responding to outages and triaging cases escalated by clients/internal teams      Participate in a 24x7 rotation for production issue escalations.      Communicate effectively with people at all levels of the organization.     Qualifications      Bachelors degree in Computer Science, or related technical discipline.      7+ years of Technical Solution engineering and development experience.      3+ years of experience in Python & Shell.      Experience in deploying/configuring core Apache Hadoop and related infrastructure.      Experience in tools integration, automation, configuration management systems.      Experience in Bigdata Technologies (Hadoop / Spark / Hive / Presto / HBase...) , streaming platforms (Kafka), containers and Kubernetes      Good knowledge of Unix system, web technologies, databases and public cloud systems like AWS, Networking, Systems      Good to have experience in Agile methodology and CICD - tool Integration, automation, configuration management in GIT      Excellent verbal and written communication and presentation skills, analytical and problem solving skills      Appreciation of diverse LOBs(Line of business) and their platform needs combined with deep technical expertise are required for the role.    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Unix", "Computer science", "Automation", "Configuration management", "Apache", "Business intelligence", "Troubleshooting", "Analytics", "Monitoring", "Python"]}