{"JOB DESCRIPTION": "        As a Software Engineer, you will be an integral part of the Data Protection Group in India, developing cross-platform endpoint applications for Windows, MacOS, and Linux and will be reporting into Engineering Manager.    To be successful in this role you should have exceptional Technical skills, communication with multiple years of designing and implementing Enterprise class products along with developing the skills and talents of others.    This is a technical position, you will be involved in all aspects of product development lifecycle - requirements discussion/analysis, design, scope estimation, planning, implementation, code reviews and unit testing, documentation, POCs, deployment and continuous engineering.    Ideal candidate will foster a culture of innovation while displaying exemplary technical expertise, ownership, and commitment to delivering high quality software solutions, while staying abreast of Industry trends, competitive positioning of the product in the market and ideating for leapfrogging ahead in the market.    For you to be successful in his role, you need a deep technical knowledge of web scale low latency Enterprise Product Development using Mac, Cyber security experience from endpoint/Network protect/detection perspectives etc     About the role:     Design solutions for your team and oversee code reviews.   Collaborate with product managers, partners, and business groups to categorize and describe solutions for business and technical requirements.   Stay on track with latest technologies for the domain and apply the experience to improve the product features.   Develop and own features/escalations and ensure the product aligns with the business, clients and partners strategies and requirement.   Explain the status and value of proposed design/Solution to partners.   Analyze and articulate current technological solutions and proposed valued alternatives wherever required.   Gather technical requirements and specifications from customers and partners.   Deliver solutions that meet the timeline, quality and costs for the projects and deliverable elements. Solutions must meet the preset goals for quality, security and performance.     About you    You have 4+ Years of technical experience in product development.   You have professional experience working as a software engineer designing and developing software solutions for large enterprises.   You have experience designing Endpoint products for Enterprise with a focus on security, quality and performance.   Hands-on experience developing mid to large-scale software commercial products using C/C++ on Mac OS.   You are hands-on with multiple programming and scripting languages including C++, Java, Python, PHP, Node.   Excellent knowledge of Mac & Windows/Linux, with good understanding of the OS architecture, and Networking.   Experience in designing applications that will be migrated to cloud and understanding of the concept of elasticity and scalability.   Any patents would be appreciated.   Proven, excellent technical skills and knowledge of leading-edge technologies, skills in communication, business acumen.              ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["C++", "Linux", "Networking", "HP data protector", "cyber security", "PHP", "Windows", "Unit testing", "Software solutions", "Python"]}