{"JOB DESCRIPTION": "  Job description     Mandatory Skills:      Basics of processor architecture, Multicore/Multiprocessor with SMP/heterogenous cores.   C language expertise for low level programming, Assembly language for any processor, C-assembly interworking   Operating systems/RTOS/Linux kernel internals, scheduling policies, locking mechanism, MMU/paging etc   Exposure to working on emulation/pre-si environment is added advantage   Using JTAG based debuggers, compilers/linkers   Should have good exposure to software development life cycle       Desired Skills      Exposure to SoC architecture paradigms - interconnects, power management,   Software development for silicon enablement, silicon validation   Bring-up of hardware-software solution on FPGA/emulation platforms and on fresh SOC designs   Software for power/performance KPIs   Good knowledge of ARM Cortex-A7) / x86 / PowerPC CPU and memory system architecture   Weakly ordered memory model/pipelining of memory systems/memory barriers   Software development towards higher performance of multi threaded applications using lower power   Top level of ASIC design methodology is an added skill       Responsibilities      Understand the IP architecture, work with IP validation teams and Systems validation Lead/system content engineer to understand the validation requirements, develop/port/enhance the validation software content and bringup.   Use silicon debug hooks to measure power/performance/coverage and other KPI metrics   Senior engineers are expected to work with very minimal supervision and mentoring junior engineers     Minimum Qualifications     Bachelor's degree in Engineering, Information Systems, Computer Science, or related field.   2 - 8 years of Hardware Engineering experience or related work experience.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - Embedded, EDA, VLSI, ASIC, Chip Design", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Production/Industrial", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["RTOS", "Computer science", "System architecture", "JTAG", "Assembly language", "FPGA", "SOC", "Linux kernel", "X86"]}