{"JOB DESCRIPTION": "  What s it all about?     The successful candidate will work as part of a global Enterprise Service Management team in support of all aspects of Visa s global CMDB lifecycle using the ServiceNow product.   The candidate will work on issues & challenges encountered by the global organisation plus support the development of working prototypes of solutions to remediate these issues.   The role would ideally suit a graduate candidate educated to degree level with experience and a keen interest in software development.    What we expect of you, day to day.      Gather, review and prioritise customer requirements then develop and implement solutions which satisfy customer expectations.     Identify requirement gaps to maintain a high degree of quality in the solution build and provide configuration options to meet specific requirements identifying respective pros and cons for each option.     Analyse System log files and recommend changes and enhancements to applications and system configurations.     Develop, System Test, Debug, Implement, and Document complex programs.     Support project personnel in resolving program problems. Provides technical advice on alternatives / solutions relative to requirements.      Analyse and create proof of concepts, designing, developing and customising business applications.     Designing and implement software that is simple, intuitive and easy to use that will allow customers to extend and customize the functionality to meet their specific business needs.     Ensure best-practices are utilized for all configurations and customisations.     Support the documentation of technical requirements / as built documentation.     Support of multiple platform instances including Development, QA, and Production.     Participate in project meetings/daily scrums and communicate development status.    Qualifications     What we re after      Bachelors degree in Computer Science or Software Engineering or related discipline     3 -5 years ServiceNow development experience on ServiceNow Platform at a minimum with Jakarta NewYork     Experience of ServiceNow security features, catalog workflows, business rules, transform maps, scripting and reconciliation processes and capabilities.     Working knowledge of precedence-based job schedules, data imports, and building / testing external data sources.     Mid-level experience with     JavaScript, .Net, Jelly scripting or Glide API     Frameworks such as AngularJS, NodeJS, Business Rules, Workflows, Client Scripts, UI Policy, UI Actions such as administering Users, Roles, Groups, ACLs.     Complex SQL queries with multi table joins, APIs, web services and standard relational database concepts     Understanding of Application Architectures, Network Topologies, and System Platforms including Physical, Virtualisation, Storage, and Containers.      Experience writing JavaScript, Powershell and C+ scripts.     Working experience developing or integrating with API s and interpreting output for consumption including SOAP or XML.     Ability to work with business users and clients and develop and document requirements.     Good communication skills to work effectively with team members, support personnel, management and customers in geographically dispersed locations and ability to work as part of a team as well as independently.     Effective writing skills with the ability to document application configurations, system design and architecture.     Understanding of requirements gathering,     Desirable   Qualifications     A working knowledge of CMDB including class structures and hierarchies.      ServiceNow certification: ServiceNow System Administration or Service Now Developer     An understanding of Predictive Analytics or other BI tools like Tableau, Power BI.     Understanding of auto discovery concepts including development, managing and creating custom discovery patterns.     ITIL v3/4 certified to Foundation level.     Familiar with Prince 2, PPM, Lean, Agile, Six Sigma methodologies.     ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Service management", "Powershell", "XML", "Javascript", "Agile", "System design", "System administration", "Six sigma", "Prince2"]}