{"JOB DESCRIPTION": " Job Description    The role is a self organised Sr Software Engineer with hands on mobile development experience. In this position, you are first and foremost a passionate and talented developer that can work in a dynamic environment as a member of Agile Scrum teams. Your strong technical leadership, problem-solving abilities, coding, testing and debugging skills is just a start. You must be dedicated to filling product backlog and delivering production-ready code. You must be willing to go beyond the routine and prepared to do a little bit of everything.   This position is based in Bangalore, India.    Responsibilities    In this role, you will work closely with UX designers, software engineers and product owners to build pixel perfect layouts, user interface components, and single page applications for a variety of websites and applications. You will work on a very agile team and be expected to context shift quickly between projects.   - Build engaging, usable, and accessible UI applications/components/code libraries for Mobile - in the form of Android classes and technical notes  - Analyze existing software for Usability and Accessibility issues and provide recommendations for improvement  - Work with a diverse team of product owners, UX designers, and developers in a fast paced environment, with quick iterative cycles  - Keep up to date with the latest trends in web engineering and introduce them into projects when appropriate evangelising Android app best practices and Accessibility for mobile  - Fielding inquiries and requests for support from stakeholders  - Execute POCs for visionary initiatives. Work independently and provide guidance to junior developers.     Qualifications     Bachelors/ Masters degree in Computer Science/Computer Engineering or other related fields with a minimum of 3 to 5 years of experience in Android application development (required).  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Computer science", "Core Java", "MVVM", "android application development", "Coding", "Debugging", "Agile", "MVC", "Customer service", "Android"]}