{"JOB DESCRIPTION": "Roles and Responsibilities Sr. Software Developers with 5-6  years of experience in developing products using  C#, ASP.NET/MVC, MS SQL, MVC Web API. Should have strong managerial skills, extensive experience with Microsoft Frameworks, and advanced problem-solving skills. Ensures the software development team produces scalable and functional applications that meet our specifications.Responsibilities:Connect with the product team to understand business requirements, design and develop applicationsDevelop the technical specifications documents.Adhere to the software development processesAnalyzing system requirements and delegating development tasks.Plan and work flexibly to deadlinesUnderstand our applications/systems existing functionalityParticipate in team discussions on issues and provide solutionsProviding support for junior developers and train them to next levelProvide support and troubleshooting for any production issues and fixesCoordinate with development team on producing highly optimized, highly scalable and high performing codeDesired Candidate Profile  Strong hands-on experience with OOPS, WinForms, Web Applications, Web services, Windows Services, Dot Net 4.0/ Dot Net 4.5+, ASP.NET/MVC, MS SQL Proficient with front-end development languages including Angular 6+, JavaScript, HTML5, and CSS.          B.E, B.Tech, MCA in Computer Science or equivalent experience        Strong analytical & logical skills Excellent problem solving and troubleshooting skills Good verbal and written communication skills. Proficient understanding of code versioning tools (GIT) Strong Object Oriented Programming Skills Ability to project manage.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Temporary/Contractua", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "BCA in Any Specialization, B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["C#", "Software Development", "MS SQL", "Web api", "Javascript", "ASP.Net", ".Net", "developer", "MVC", "SQL Server"]}