{"JOB DESCRIPTION": "Nature of Job -Remote Job description   LIV is looking for an experienced   desktop front-end   engineer to help us build, maintain and scale our desktop application(s).     LIVs main quest line is to empower VR content creators and game developers to connect with, and interact with their audiences in real-time.     Our solution has the biggest creator user base in VR behind it, so your work will be impacting end-users in the   rawest sense - you'll be part of their workflow! We'll expect you to take pride in your work here; keenly learn and   grow along with us.    If you feel like you'd be a great team fit, but don't meet 100% of the requirements, please apply anyways! :)     Job requirements    Your Quest     Build and maintain modern Windows desktop application(s).      Take on LIVs existing desktop app and evolve it into something that will last     Create a slick, well-integrated application experience that crosses the pancake (non-VR) barrier.     Support both power users and \"the common rabble\" whilst maintaining ease-of-use.     Quest Prerequisites     Excellent written & verbal communication skills.     (You need to be able to both give, and take critical feedback without ego.)     Commitment to ongoing code quality maintenance & documentation.    (If it's broken, let's throw it out and do better!)       (If it's broken, let's throw it out and do better!)     Two or more years of professional working experience.     Two or more experience developing for Windows in desktop languages.     To be highly self-disciplined & directed.     Proficiency with source control.     (May your commits be small, and frequent.)     Intimate knowledge of Windows & the desktop ecosystem.     Be passionate about virtual reality.     Buffs     Understand web technologies and the intricacies of making them talk to desktop land.     Experience working with MSBuild projects.     Experience implementing and maintaining internationalized UI.      Experience developing with the OpenVR or Oculus APIs.     Experience with DirectX, OpenGL, Vulkan or similar graphics APIs.      Have a degree related to computer science.     Have experience working with remote teams.      Come from a background of streaming, bulletin boards/forums or watch live streams.     Play lots of any kind of games. Board games, VR games, tabletop RPGs, PC games.. any kind of games really!   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Animation, Gaming", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Graphics", "Computer science", "C++", "Front end", "Web technologies", "Opengl", "Workflow", "Windows", "Quest"]}