{"JOB DESCRIPTION": "   Role Overview:        We are looking for a talented and motivated Software Development Engineer to join our growing Global Security Data Services team at McAfee s India engineering center in Bengaluru.   The Global Security Data Services team develops systems that provide real time threat information that allows McAfee to protect its customers against real world security threats. These mission critical systems are central to McAfee s success and have a direct impact on the safety of our customers.   Our teams work on cutting edge cloud technology and are challenged daily to think outside the box and push themselves to achieve breakthroughs in design, programming skill and most of all engineering excellence.     About the Role :     You will be part of an engineering SCRUM team that is responsible for the cloud-based services.   The scope of the position may involve developing new services or sustaining and adding to existing services.   You will be expected to ramp up quickly and become a productive member of the assigned SCRUM team relevant training and support will be provided during the ramp-up process.   You will monitor your daily progress against the projects backlog and will actively participate in the project meetings.   You will be responsible for assisting in the creation of project backlogs and estimating project tasks, and for inputting to discussion around the overall system design.     You will input into the project plan from a technical standpoint.   You will have ownership and responsibilities for working on components within the systems under development and will collaborate with senior engineers to ensure your assigned tasks are completed.   You will have responsibility for ensuring that the code you deliver is compliant with the project quality goals set out by the management team.   You will be expected to follow all relevant internal processes during projects as set-out by the management team.   You will participate as part of the team in the technical discussions and whiteboard sessions.   You will report to the management team on overall progress for assigned tasks, communicating any issue or blockers that may impede progress as soon as they arise.   You will collaborate with other team members on best practices, code reviews and process improvements to help the team stay productive in delivery of features.       About You :     6+ years experience of programming in a C/C++, Java or Python environment (  similar experience in other relevant languages will also be considered  ).   Ability to work independently and with guidance when required from senior engineers within the team.   Completion of a bachelor s degree in Computer Science, Engineering, or equivalent.   Excellent verbal and written communication skills. You can clearly communicate your needs, goals, and can explain your decisions articulately.   Commitment to learning and maintaining high software engineering standards.   Commitment to continued learning and development.       Good to Have      An active interest in software engineering and keeping up with the latest trends.   Interest in high availability systems and scalable architectures.   Knowledge of network protocols including IP, TCP, HTTP, DNS, SSL.   Experience of public cloud providers such as Amazon Web Services or Microsoft Azure. Particularly AWS based services e.g. EC2, S3, DynamoDB, AWS Lambda etc.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["TCP", "Computer science", "C++", "Cloud", "DNS", "System design", "HTTP", "Scrum", "SSL", "Python"]}