{"JOB DESCRIPTION": "   Role Overview:       For our Global Cloud Operations team, we are looking for a Software Engineer / Cloud Engineer to strengthen our team at Bangalore. As a member of our team you will manage platform development and the supporting efforts that improve operational performance and availability of the McAfee Cloud Platform including measurement and high availability of the production environments.      About the Role     You will manage the security of the platform, document and enforce necessary security controls to be compliant to the security standards (like ISO 270xx and SOC) and   will   support security audits.   You will design, development, deployment and operation of, services and solutions in the (private public) cloud, including network design, security design and operation.   You will work with other team members around the world to provide best possible customer experience for our cloud products    You will work with Engineering teams across the world You will work with the Engineering and Operations teams to review infrastructure and architecture.    You will create systems architecture diagrams and documentation If you are passionate about running and continuously improving excellent Cloud Platform Services, we are offering you a unique and great opportunity to build your career with us and gain experience working with high performance Cloud systems.    You will report to the engineering manager.     About You      You have experience in   deploy, testing and troubleshooting systems.   Are happy to coordinate and organize work across a team.   You are energised by addressing technical challenges.   You have coding/scripting skills (Python, Bash, Ansible ) with Linux background.   You have an idea on what cybersecurity means and what it means to make a system secure   You have a understanding of the principles of the internet.   Youve the proven ability to work independently, deploying, testing and troubleshooting system   Experience with Private Cloud and/or Public Cloud   Experience regarding virtualization, container (Docker) technologies, Kubernetes   Know how about IP networks / network protocols   Data processing pipeline knowledge (Kafka, Logstash, Elasticsearch )   Experience with databases (nosql and / or sql) Automation, Continuous Integration / Continuous Deployment (TeamCity, Jenkins, Ansible, ) experience  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Automation", "Network design", "ISO", "Linux", "Coding", "SOC", "Troubleshooting", "Virtualization", "SQL", "Python"]}