{"JOB DESCRIPTION": " Job Description     Responsibilities    System Integration Quality and Client Centric Test coverage.   Establish quality process measurements to ensure software quality in a continuous integration environment. Identify, record, document thoroughly, and track bugs. Maintain and/or update documentation that communicates the standards and procedures. Champion Shift Left Processes.    Collaborate with product and software developer teams to establish Qualification for production release, Identification Automation of End to End use cases, and develop collaboration tools/reporting to improve Quality.   Develop and/or Maintain automation tools/frameworks to cover Web and Mobile applications and services.   Execute and confirm automated/Manual test during certification cycles. Adhere to Data Driven approach to support Reporting and Metric driven Test Iterations   Participate in a Kanban Team process as Team contributor to deliver features and increase the feature test coverage   Provide guidance to less-experienced team members. Review and evaluate codes developed by junior members to ensure we develop only highest-quality code.   Work within a highly skilled team along with Engineering Managers to determine methods and procedures on new automation assignments.   Qualifications     Required skills    Extensive experience in design development of applications on multiple platforms (Linux and Windows), using Open Source products and cloud technologies.   Excellent analytical and problem solving skills. Good written and verbal communication skills. Ability to communicate effectively the logic and implementation plan to team members managers.   Strong Software Engineering background is required with development and test automation knowledge in multi-tier enterprise architecture.   Strong coding experience in two or more programming languages Java scripts, Java, Angular.js, Node.js etc.   Accomplished with Open Source Automation Framework tools (Java, Javascript Eclipse, IntelliJ, SOAPUI, TestNG, Selenium, Jmeter and similar tools). Ability to write clear and concise automation scripts.   Experienced Debugger by reviewing log file validation on a LINUX/UNIX server, Splunk   Understanding of Infrastructure components like Systems, Virtual Machines, Database, Middleware, Storage etc.   Developing comprehensive test and quality plans, debugging and testing scripts and tools.   Bachelor Degree with minimum 8+ years of experience in Software Development or Equivalent Test automation engineering.      ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Unix", "Linux", "Coding", "Eclipse", "Debugging", "System integration", "Windows", "Selenium", "Open source", "Middleware"]}