{"JOB DESCRIPTION": " Job Description    The Site Reliability Engineering (SRE) is a critical part of our Visa Cloud platform strategy. As an Site Reliability Engineer, you have a mindset to maximize system availability through both proactive and reactive means: you build robust technical support and automation to eliminate or minimize incidents, as well as investigate and resolve issues in response to live incidents. You are comfortable working with software engineering teams and supporting their demanding needs to ensure the security, availability and performance of the platform. You will join an established Cloudview - Site Reliability Engineering team.    Responsibilities:     As a Staff Site Reliability Engineer:     You will identify and support all request performed via Visa Cloud Platform services (IaaS/PaaS/Kubernetes as a service)     You will respond and resolve incidents, problem and user queries through proper analysis     Rotating weekly SOW responsibilities, that involves daily troubleshooting of incidents to ensure SLAs and SLOs are met     Partner with software and systems engineers across the organization to produce and roll out fixes     Provide guidance to other team members on managing end-to-end availability and performance of mission critical services     To tackle assignments with minimal supervision     Strong communication skills with a strong sense of urgency and attention to details     Minimum Qualifications:     Have strong experience in Linux and Windows systems to troubleshoot issues     Working knowledge and experience with OpenShift or Docker or Open Source Kubernetes     Working knowledge and experience with Istio     Expert knowledge in CI/CD and related tools      Ability to script/debug in Shell/PowerShell and basic coding experience in Golang     Knowledge of relational and non-relational databases, including creating and running queries [MySQL and NOSQL]     Experience with configuration management tools such as Chef/Ansible     Experience with monitoring tools and handle application/system alerts      Have an urge to document all the things so you dont need to learn the same thing twice     Have an enthusiastic, go-for-it attitude. When you see something broken, you cant help but fix it!!     Preferred Qualifications:     B.S. or higher in Computer Science or other technical discipline, or related practical experience     7+ years experience in Site Reliability or Production Engineering group for high availability/critical platforms/applications     Certified Kubernetes Administrator (CKA)     Experience of working with ITIL disciplines (Event, Incident, Problem, Change CSI)      ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Automation", "Linux", "Coding", "Configuration management", "MySQL", "Windows", "Troubleshooting", "Open source", "Technical support"]}