{"JOB DESCRIPTION": "            The Core Switch Group (CSG) at Broadcom is the industry leading provider of networking switch ASICs. CSG team focuses on developing network switch chips and software that power the largest mega scale data centers and cloud operator networks. Development effort includes definition, architecture, design and verification tasks on CSG cutting edge products.     This position focuses on the development of system infrastructure software for a networking operating system (NOS) software. This job entails development of embedded software components for port management, control path packet buffering and processing, Quality of Service (QoS) features, debugging infrastructure, and error handling infrastructure, amongst other features to serve the system infrastructure needs for a NOS.          Some example Expectations from this Role:         Must have thorough knowledge of system-level features for Network Operating Systems (NOS).       Work with ASIC Hardware Adaptation Layer and develop platform-dependent and platform-independent features.     Review and understand standards for data networking protocols, customer application requirements and how they map to Broadcom network switch solutions.     Work with Software, Hardware, Marketing, Architecture and Design teams to define requirements and architecture for new generations of switch systems.     Read and analyze HW functional specifications, architectural specifications, HW models, register files and implement SW control plane drivers based on thorough understanding of the requirements.     Create detailed SW design specifications, presentations, and internal training materials.     Research and introduce new tools and technologies for the Network Operating System.     Port and validate switch software and firmware components across various control plane CPUs and CPU architectures, various HW platform architectures and various ASIC architectures.     Work closely with SQA team to develop, run and troubleshoot unit and functional tests.     Support Applications Engineering team on customer engagements, field failure analysis, debugging and patching.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Embedded, EDA, VLSI, ASIC, Chip Design", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["ASIC", "SQA", "Networking protocols", "QOS", "Networking", "Failure analysis", "Debugging", "Firmware", "System software", "Embedded software"]}