{"JOB DESCRIPTION": " What you'll do    Work closely with our product and design teams to build intuitive experiences. Play an active role in shaping up the roadmap and vision for the team.   Implement native user interfaces with the latest iOS technologies. Contribute to the iOS monorepo on core Uber flows enabling a variety of new experiences related to micromobility use cases.   Ship efficient, reliable, crash-free code that reaches millions of users.   Ensure your mobile applications perform and scale in production.   Champion best software engineering practices such as continuous integration, delivery, and deployment.   Take a lead role in the team's technical design choices.   Write quality code and documentation which can be used as the example for your company.   Coach and mentor junior or new engineers joining the micromobility team.     What the Candidate Will Need / Bonus Points    What You'll Need    5+ years of full-time iOS engineering experience with strong expertise in Swift and Objective-C and deep understanding of iOS SDK. Proficient in object oriented programming, multithreading, networking, memory management and source control management (git).   Strong focus on building high-quality mobile UI experiences. Passion about delivering software that delights our end users. Proficiency with UI/UX paradigms to build elegant user experiences.   Experience working with product management and design teams.   Strong written, verbal communication skills; ability to influence others within your team and outside your team.   Experience in testing and deploying scalable mobile applications. Experience analyzing a feature in production using analytics and experiments.   Attention to detail, particularly around software engineering fundamentals, testing methodologies and quality.   Fast learner: We're looking for software engineers who thrive on learning new technologies and don't believe in one-size-fits-all solutions. Should be able to adapt easily to meet the needs of our extensive growth and constantly evolving business environment.   A great teammate: Believe that you can achieve more on a team -- that the whole is greater than the sum of its parts. You rely on others' candid feedback for continuous improvement.   Design and entrepreneurial acumen: Understand requirements and business use cases beyond the written word.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Product management", "Computer science", "Multithreading", "GIT", "Networking", "Memory management", "SDK", "Continuous improvement", "Analytics", "Business operations"]}