{"JOB DESCRIPTION": "   Role Overview:         As a Software Developer role The person will be an integral part of CORE Group. To be successful in this role you should have exceptional Technical, l and communication skills with multiple years of relevant experience in software development.     About the Role:     Drive innovation Research in the area of cloud operations and software engineering .   Work with peers to develop practices which lead to the highest quality products process and drive transformation change.   Develop systems to invest, analyze, and take automated action across real-time feeds of high-volume data   Evaluate technology being used in the environment and work with architect teams to ensure the best tools for the job are being used    Work with compliance/security to ensure that cloud adoption is managed / governed in line with industry standards     Well versed and experience with lambda, Batch, EMR , Athena etc    Proficient understanding of distributed computing principles   Good knowledge of Big Data querying tools.   Experience with integration of data from multiple data sources   Experience with SQL and NoSQL databases   Software design, architecture and development in multiple languages (C/C++, JavaScript , python , Scala))   Experience with AWS will be added advantage   Testing and Operations   Documentation         About You:     Strong business acumen and agility within a large, matrixed organization   Ability to listen, adopt and influence are essentials   3+ years of related software engineering experience   Proficient knowledge with public cloud services AWS preferred   Experience with various coding languages including, but not limited to: C/C++, C#, Python and Java.   Experience with technology infrastructure, storage, and virtualization   Bachelors/Master s in engineering (preferably in IT or CS)   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["C++", "Software design", "cyber security", "Coding", "Javascript", "Network security", "System software", "Virtualization", "SQL", "Python"]}