{"JOB DESCRIPTION": "   PROFESSIONAL TRAITS NECESSARY FOR SUCCESS     Enthusiastic and versatile with a great attitude.    Team player and collaborative problem solver.    Extreme ownership and strong sense of personal responsibility.    Customer obsession in driving to successful outcomes.    Self-learner that enjoys experimenting with new technologies.     PRIMARY ROLE RESPONSIBILITIES     Lead and contribute to the design and development of new features sets.    Prototype new solutions and evaluate technical feasibility.    Overcome complex technical challenges demonstrating technical flexibility and creativity in problem solving.    Lead and participate in design reviews with cross-functional team members to better understand requirements.    Troubleshoot and resolve complex customer problems escalated to engineering.    Provide estimates and timelines for the development of features sets and delivering fixes.    Close interaction with other Development, Architecture, and QA team members as well as Customer Support and Professional Services teams across the globe.    Lead and conduct hands-on testing with other team members as necessary to complete feature sets.      REQUIRED EXPERIENCE SKILLS     BS or higher in Computer Science or similar discipline    5+ years of software development experience    2+ years of experience working in Cloud platforms like AWS/Azure/Google Cloud    Proven experience as a Full Stack Developer or similar role    Knowledge of multiple front-end languages and libraries (e.g. HTML/ CSS, JavaScript, XML, jQuery)    Knowledge of multiple back-end languages (e.g. C#, Java, Python) and JavaScript frameworks (e.g. Angular, React, Node.js)    Familiarity with databases (e.g. SQL, PostGreSQL), web servers (e.g. Apache) and UI/UX design    Experience in Rest APIs and heavy load distributed systems    Passion for cloud computing and experience building SaaS products for auto-scaling, performance, and fault tolerance.    Ability to communicate complex technical information to internal audiences.     SPECIALIZED EXPERIENCE SKILLS     Expertise in AWS with industry experience using AWS services (EC2, S3, Lambda, Kinesis, SNS, SQS, etc.)    Experience with Continuous Integration/Continuous Deployment best practices    Experience working in an Agile/Scrum environment    Experience with Terraform    Strong command of SQL and SQL server tools, PostGreSQL    Microservice and related frameworks (Spring frameworks)    Strong mathematical and statistical knowledge    Experience building complex systems with high performance, scalability and reliability    Strong experience of Linux system and modern container technology such as docker and Kubernetes    Experience with throughput batch processing and/or streaming systems (Kafka)    Experience with distributed data processing system and data pipelines    Exposure to data engineering    Cloud application API design and implementation Git source control    Jira for Agile project management      ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Cloud computing", "jQuery", "Linux", "XML", "Postgresql", "SMS", "HTML", "Apache", "SQL", "Python"]}