{"JOB DESCRIPTION": "      What You'll Do     You will invent cutting edge technology that supports the scale and real-time demands of Uber's business, for example an event prediction system (engineering ).    As a Sr. Software Engineer, you will:     Lead cross-functional initiatives working with multiple internal customers.    Design, develop and support a world-class search platform serving a wide variety of use cases.    Help build infrastructure for the next wave of growth, including building customized components to solve Uber specific problems and evolve the technology for hyper growth.    Produce high quality code that is robust, efficient and maintainable; our primary languages are Java and Go.    Work at the core of Elasticsearch and Apache Lucene open source software with opportunities to contribute to open source.    Work on challenging problems in areas such as relevance ranking, data ingestion, data storage, query optimization, JVM performance optimization, security, machine learning and more.    Continually challenge what exists and explore what should be changed to best meet our business needs.    Possess expert knowledge in large scale distributed system design and engineering best practices.    Participate in setting a vision and objectives for a search platform in alignment with market opportunities.    Drive and work on algorithm and architecture design, execute and deliver fault-tolerant systems.      What You'll Need      7 plus years experience producing high qulity large-scale software    BS or MS in Computer/Information Science or Engineering    Expertise in one or more object oriented programming language (e.g. Java, Go, Python, C++)    Experience with building scalable production services with strict SLAs    Experience with developing complex software systems scaling to millions of users with production quality deployment, monitoring and reliability.    Experience with large-scale distributed search and storage systems (e.g. Elasticsearch, Apache Lucene, Apache Solr, Kafka)    Ability to decompose complex business problems    Experience implementing API and microservices    Experience shipping high-quality features on schedule    Experience building large scale distributed systems    Experience implementing projects with multiple dependencies      Bonus Points      Experience with Search, Information retrieval, and Ranking    Experience with Machine Learning   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["query optimization", "Machine learning", "System design", "Information retrieval", "Apache", "Open source", "Distribution system", "Monitoring", "Freight", "Python"]}