{"JOB DESCRIPTION": "   Software Engineer (BI Analytics)     Keysight Technologies is 100% focused on helping companies tackle the toughest electronic design, test and measurement challenges through a combination of trusted hardware, innovative software and our own global team of industry experts. The result Insights that lead to innovation. From home entertainment to network reliability to communicating wirelessly, Keysight provides the measurement capabilities that make our world more productive and a safer place to live.   Keysight IT department is looking for strong candidates having in-depth knowledge of Business Intelligence platforms. The role will involve identifying opportunities for improvements throughout the system, particularly around data, configuration and reporting using cutting edge tools such as MicroStrategy, Incorta, OneStream, and Spotfire. You will also be involved in the support, enhancement, design and implementation of changes required within the BI platforms. Business teams will look to you for advice on technology, functionality and direction BI platforms are taking. If you have experience and like to learn to work alongside a world class team, in a very fast paced environment, this role is for you!   Responsibilities:    Participate and contribute in software development from the feasibility phase through to concept, design, development and testing/defect resolution phases, being a partner with business, vendors and other stakeholders to understand their needs;     Analyze new business requirements and determine tasks required for implementation     Develop new reports / visualizations / dashboards using tools such as MicroStrategy, Spotfire, and Incorta     Optimize and enhance existing reports / visualizations / dashboards based on evolving business requirements     Maintain the reporting tools up-to-date with latest product releases and patches     Design and implement reporting data models including the design and creation of visual analytics;     Develop and test software packages or modules in a rigorous and timely manner     Analyze system incident reports, perform root-cause analysis, assess alternatives, and implement solutions.     Analyze and test the software product performance and capability.     Monitor product performance, quality and reliability, identifies problem or unfavorable deviations, recommends and executes corrective actions     System Administration, Develop/review technical documents to ensure consistency, accuracy and compliance with BI reference architecture     Analyze, synthesize, and interpret data from a variety of data sources using reporting tools     Work in small teams, collaborate well with global customers, and take ownership of your work      Job Qualifications            Bachelor s or Master s degree preferably in computer science or related field                    2+ years of relevant experience in front-end on BI reporting tools such as: MicroStrategy, Incorta, OneStream, Spotfire                   Strong SQL experience                 Strong proficiency in scripting for example: Python, PERL, PL/SQL               Experience translating business requirements into design               Good understanding of ETL/Datawarehouse concepts (marts, ETL, Kimball methodology, etc.);                 Self-motivated, excellent attention to detail, and problem-solving skills                   Excellent communication and presentation skills                   Thrive in a fast-paced environment          ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - System Programming", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Microstrategy", "Computer science", "Technology management", "Front end", "Perl", "Business intelligence", "Analytics", "Reporting tools", "Python", "System administration"]}