{"JOB DESCRIPTION": "  About the Role    Data Platform engineering at Uber is looking for a strong Technical Lead (Level 5a Engineer) who has built high quality platforms and services that can operate at scale. 5a Engineer at Uber exhibits following qualities:   Demonstrate tech expertise > Demonstrate technical skills to go very deep or broad in solving classes of problems or creating broadly leverageable solutions.  Execute large scale projects > Define, plan and execute complex and impactful projects. You communicate the vision to peers and stakeholders.  Collaborate across teams > Domain resource to engineers outside your team and help them leverage the right solutions. Facilitate technical discussions and drive to a consensus.  Coach engineers > Coach and mentor less experienced engineers and deeply invest in their learning and success. You give and solicit feedback, both positive and negative, to others you work with to help improve the entire team.  Tech leadership > Lead the effort to define the best practices in your immediate team, and help the broader organization establish better technical or business processes.   What You'll Do    Build a scalable, reliable, operable and performant data analytics platform for Uber's engineers, data scientists, products and operations teams.  Work alongside the pioneers of big data systems such as Hive, Yarn, Spark, Presto, Kafka, Flink to build out a highly reliable, performant, easy to use software system for Uber's planet scale of data.  Become proficient of multi-tenancy, resource isolation, abuse prevention, self-serve debuggability aspects of a high performant, large scale, service while building these capabilities for Uber's engineers and operation folks.   What You'll Need    7+ years experience in building large scale products, data platforms, distributed systems in a high caliber environment.  Architecture: Identify and solve major architectural problems by going deep in your field or broad across different teams. Extend, improve, or, when needed, build solutions to address architectural gaps or technical debt.  Software Engineering/Programming: Create frameworks and abstractions that are reliable and reusable. advanced knowledge of at least one programming language, and are happy to learn more. Our core languages are Java, Python, Go, and Scala.  Data Engineering: Expertise in one of the big data analytics technologies we currently use such as Apache Hadoop (HDFS and YARN), Apache Hive, Impala, Drill, Spark, Tez, Presto, Calcite, Parquet, Arrow etc. Under the hood experience with similar systems such as Vertica, Apache Impala, Drill, Google Borg, Google BigQuery, Amazon EMR, Amazon RedShift, Docker, Kubernetes, Mesos etc.  Execution & Results: You tackle large technical projects/problems that are not clearly defined. You anticipate roadblocks and have strategies to de-risk timelines. You orchestrate work that spans multiple teams and keep your stakeholders informed.  A team player: You believe that you can achieve more on a team that the whole is greater than the sum of its parts. You rely on others' candid feedback for continuous improvement.  Business acumen: You understand requirements beyond the written word. Whether you're working on an API used by other developers, an internal tool consumed by our operation teams, or a feature used by millions of customers, your attention to details leads to a delightful user experience. ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Travel , Hotels , Restaurants , Airlines , Railways", "FUNCTIONAL AREA": "IT Software - DBA, Datawarehousing", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Neural networks", "big data analytics", "Analytical", "SCALA", "Apache", "Continuous improvement", "Distribution system", "Forecasting", "YARN", "Python"]}