{"JOB DESCRIPTION": "   Role Overview:       We are looking for a developer with experience building web-services using REST-based API frameworks. Our mission is to build a REST-based API to help connect the Mobile systems to the home gateway. You will also build back-end servers to grow across millions of users and geographies     About the Role:     You will develop software in AWS.   You will write reusable, testable and efficient code using Python/Go using some of the opensource framework.   You will develop RESTful services that will be consumed across Mobile devices and gateway platforms.   Implement back-end architecture that can scale to handle large number of concurrent users.   Design efficient caching systems and algorithms using a known method e.g. MemCached .   You will report to the Engineering Manager.   Participate in an Agile Scrum environment building the web-services platform for the home gateway product.     About You:     Min. 8+ years of software development experience.   5+ years of cloud/AWS development experience.   You have experience on AWS architecture, development and deployment.   You have experience in programming skills in Go and Python.   Understanding of the threading limitations of Python, and multi-process architecture   Experience with web frameworks such as Django, Tornado   Familiarity with event-driven programming in Go   Experience Caching Implementation and relational database system such as MySQL or SQL Server is required.   Experience working with a NOSQL system such as Cassandra or Dynamo is desirable.   Experience working with Amazon Web Services (AWS) is desirable.   Experience with front-end technologies, such as JavaScript, HTML5, and CSS3   Understanding of accessibility and security compliance.   Knowledge of user authentication and authorization between multiple systems, servers, and environments   Understanding of fundamental design principles behind a scalable application   Knowledge in unit test and debugging skills.   Experience with code versioning tools e.g. Git, Mercurial. We use Git/Geritt-based systems   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Front end", "GIT", "NoSQL", "Django", "MySQL", "Debugging", "Javascript", "SQL", "Python", "CSS3"]}