{"JOB DESCRIPTION": "   Role Overview:       McAfee combines both experience along with innovation and performance to make security an essential ingredient in every architecture and on every computing platform.The McAfee Web Gateway Unit within McAfee is chartered with the mission of ensuring the leadership position in the Cloud Security market. The end-to-end software engineering team based in Bangalore is focused on designing the excellent network security products for use by enterprise customers. The team provides security software solutions that is integrated with the entire security threat life cycle for McAfee's enterprise customers. This excellent engineering team is renowned for developing optimized system software solutions with high reliability.     You will write code per product requirements and create new products   You will create automated tests, contribute in system testing , follow agile mode of development   You will manage and maintain high-quality code for the cloud console that provisions, reports and orchestrates security in cloud   You will work intensely with a team of engineers working on software ground up   Be aware of current technology trends factoring this into current design and implementation.   Fix bugs quickly wherever required.   Review code changes from other developers on parts of a product source code   Demonstrate your code is complete by finding creative ways to develop test automation   Work in Agile development   You will report to the engineering manager.     About You :     4+ years of experience in Networking, Cloud Technologies   Experience developing cloud-based solutions in networking domain/appliances, cloud orchestration including Docker, AWS/GCP/MS Azure concepts.   Full stack developer who is well versed with design of different tiers of software product.   Experience with UI development   Experience creating backend software for policy, orchestration and incorporating networking technologies.   Programming skills in C++, Python, Java and web-based technologies   Familiarity in web technologies such as JEE, REST, Spring, Angular, JS.   Demonstrable skills in database concepts, algorithms and design patterns   Have excellent debugging, troubleshooting, analytical and problem solving skills.   Good to have knowledge of computer networking, protocols and software security   Preferable to have experience in continuous delivery environment using test driven development and Agile   Prior experience working on software security products is a plus   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["UI development", "System testing", "C++", "Networking protocols", "Debugging", "Agile", "Network security", "System software", "Troubleshooting", "Python"]}