{"JOB DESCRIPTION": "   Role Overview:       We're looking for a senior software engineer to join our Engineering team. Reporting to the Director of Engineering, you will help build a world class digital marketing platform to acquire and retain existing customers using an omni-channel strategy via emails, push notifications, and landing pages by an integration of 3rd party technologies and home grown platforms. You can expect to lead major features and projects on the platform while working with an open and collaborative team.     About the Role:     You will build products that support scaling our customer acquisition and retention efforts and user data pipeline   Develop multi-tier scalable, high-volume performing, and reliable user-centric applications that operate 24x7   Develop micro-services and build applications in the cloud (AWS)   Partner with Product Managers, Interaction Designers and Growth engineers to build software in an agile development environment using Scrum best practices   Produce high-quality software that is unit tested, code reviewed   Promote and perform best engineering practices; help mentor other engineers   Identify leverage and promote opportunities to improve engineering productivity and guide velocity towards outcomes         About You:     7+ years experience building user facing web applications in languages like C#, C++, Python, Java, Microsoft .NET framework.   Experience working with RESTful APIs and general service oriented architectures   5+ years design / implementation / consulting experience building cloud solutions using cloud computing platforms such as AWS, Azure or GCP   Have familiarity with Marketing Technology products (Salesforce cloud, marketing cloud, Adobe cloud), analytics products, CRM products, social media   Take ownership of their work and is a true team-player; someone that looks for opportunities to collaborate and mentor other engineers in the team   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Cloud computing", "C++", "Consulting", "Scrum", "microsoft", "Adobe", "Analytics", "CRM", "Python", "Salesforce"]}