{"JOB DESCRIPTION": "   Role Overview:        As a Software Engineer, you will be an integral part of the McAfee, India developing cross-platform endpoint applications for Windows, MacOS, and Linux.    To be successful in this role you should have exceptional Technical skills , communication and project management skills with multiple years of designing and implementing Enterprise class products along with ability to work in a team toward achieving organizational goals.    In this position, you will be involved in all aspects of product development lifecycle - requirements discussion/analysis, design, scope estimation, planning, implementation, code reviews and unit testing, documentation, POCs, deployment and continuous engineering.    You will also be responsible for release deployment and supporting customers using the products in production.   Ideal candidate will foster a culture of innovation while displaying exemplary technical expertise, ownership, and commitment to delivering high quality endpoint security solutions on a variety of desktop and mobile clients.    For you to be successful in his role, you need excellent debugging and development skills in C/C++, understanding of either Windows, MacOS system internals and experience in building lean agents.     About the Role:       Design and development of breakthrough multiplatform software for securing endpoints on a variety of desktop and mobile platforms   Gather technical requirements and specifications from customers and business stakeholders and develop technical specifications according to which solutions are defined and delivered.   Deliver solutions that meet the timeline, quality and costs for the projects and deliverable elements. Solutions must meet the preset goals for quality, security and performance.       About You:       You have 5+ years of software engineering experience, with emphasis in Microsoft Windows or MacOS based enterprise applications development and basic knowledge in Networking and OS fundamentals   You have Strong Windows/MacOS internals, API/UI development skills using C/C++ technologies   You have Windows/MacOS desktop application or driver development experience with deep knowledge on tools like Visual Studio, XCode, WinDBG , Wireshark, fiddler and equivalent   You have excellent oral and written communication skills and having the ability to deal with interoperability issues is a big plus  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["UI development", "C++", "Linux", "Networking", "Enterprise applications", "Debugging", "Visual Studio", "Unit testing", "WindBG", "WireShark"]}