{"JOB DESCRIPTION": "   Role Overview:       McAfee combines both experience along with innovation and performance to make security an ingredient in every architecture and on every computing platform.The McAfee Web Gateway Unit within McAfee is chartered with the mission of ensuring the leadership position in the Cloud Security market. The end-to-end software engineering team based in Bangalore is focused on designing the outstanding network security products for use by enterprise customers. The team provides security software solutions that is fully integrated with the entire security threat life cycle for McAfee's enterprise customers. This excellent engineering team is renowned for developing optimised system software solutions with high availability and reliability.     About the Role :     You will write code per product requirements and create new products.   You will create automated tests, contribute in system testing , follow agile mode of development.   You will Oversee and maintain high-quality code for the cloud console that provisions, reports and orchestrates security in cloud   You will work intensely with a team of engineers working on software ground up.   Being aware of current technology trends factoring this into current design and implementation   Fix bugs quickly whenever required.   Review code changes from other developers on parts of a product source code   Demonstrate your code is complete by finding creative ways to develop test automation   You will report to the engineering manager.     About You :     6+ years of experience in Networking, Cloud Technologies   Experience developing cloud based solutions in networking domain/appliances, cloud orchestration including Docker, AWS/GCP/MS Azure concepts   Understanding of CI/CD processes   Expertise in Python, Cloud tools like Ansible, Chef/Puppet, Cloud formation template   Knowledge of Docker Swarm, Kubernetes, Network overlays   Development Frameworks: Jenkins, Git integration   Experience with scaling appliances in Cloud   Working knowledge AWS/Azure/GCP   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["System testing", "GIT", "orchestration", "Networking", "Appliances", "GCP", "Agile", "Network security", "System software", "Python"]}