{"JOB DESCRIPTION": "   Role Overview:       We're looking for a Senior software engineer to join our Engineering team. Reporting to the Director of Engineering, you will help build an excellent digital marketing platform to acquire and retain existing customers using an omni-channel strategy by emails, push notifications, and landing pages by an integration of 3rd party technologies and home grown platforms. You can expect to be an important member of the team contributing to major features and projects on the platform while working in a collaborative environment     About the Role:     You will build products that support scaling our customer acquisition and retention efforts and user data pipeline   Develop multi-tier scalable, high-volume performing, and reliable user-centric web applications that operate 24x7   Develop micro-services and build applications in the cloud (AWS)   Partner with Product Managers, Interaction Designers and Growth engineers to build software in an agile development environment using Scrum best practices   Produce high-quality software that is unit tested, code reviewed     About You:     6+ years experience building Consumer-facing scalable web application solutions in languages like C#, C++, Python, or Java   Experience working with RESTful APIs and general service oriented architectures   2+ years design / implementation / consulting experience building cloud solutions on any cloud   You have experience in object-oriented design skills, coupled with a deep knowledge of data structures and algorithms   Experience in frontend development, using JS Frameworks such as: JavaScript, Vuejs, Angular, React,   Build Web platform optimized for performance with Personalization and A/B testing capability   Take ownership of their work and is a true team-player; someone that looks for opportunities to collaborate.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Object oriented design", "Customer acquisition", "C++", "cyber security", "Diversity and Inclusion", "Consulting", "Data structures", "Scrum", "Digital marketing", "Python"]}