{"JOB DESCRIPTION": "  In this role,  you have the opportunity to    The Application Security Engineer is a critical member of the secure application development team and responsible for verifying the required security controls are integrated in product/Service. The Application Security Analysts is responsible for ensuring that application developers have closed security vulnerability gaps found in the applications and have built mitigating controls into products,  services and operations.    You are responsible for    The Application Security Engineer -     Should be able to understand the Application security risks that as a part of security risk assessments and Threat modeling of applications     Create and execute the corresponding security test cases to verify that the mitigations are properly implemented in the application.     Understand and analyze the application code.     Able to perform Static and Dynamic code analysis     Able to guide and support development teams to fix the security vulnerabilities in the code.     To succeed in this role,  you should have the following skills and experience    Preferred Experience:    2- 5 years of work experience in Application Security     Understanding and familiarity with common code review methods and standards     Experience with static analysis tools (e.g.,  IBM Appscan Source,  HP Fortify)     Application development experience     Experience in a wide variety of languages,  which includes C/C++,  Java,  .Net,  Perl,  Python and etc.     Research and pilot new services / technologies to support secure software development     Knowledge of standard SDLC practices     Experience in application security penetration testing     Experience in tools like HP Webinspect/IBM Appscan/Acunetix and open source tools like burp,  OWASP ZAP,  CSRF tester etc,  Burp Suite     Experience with Open Web Application Security Project (OWASP) standards,  Open Source Security Testing Methodology Manual (OSSTMM) methodologies     Knowledge in cloud & Big data application security testing     Sufficient understanding or exposure to testing application on below technology will be helpful     REST API     Cloud Foundry     Encryption     Data storage for SQL,  Oracle etc.     Big Data / Analytics / Cloud    Educational Qualifications:    Bachelor degree required     Degree or concentration in Computer Science,  Information Systems,  Information Security or similar preferred.    Preferred Security certifications   Security certifications like    CEH     ECSA LPT     OSCP  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Medical, Healthcare, Hospitals", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["Computer science", "C++", "Information security", "HTML", "Perl", "Application development", "Test cases", "Open source", "SDLC", "Python"]}