{"JOB DESCRIPTION": "        About the role:   The successful candidate will play a critical role as Software Developer who is defining, designing, and implementing applications mainly to monitor and proactively manage the compliant state of Wells Fargo Technology Infrastructure Core Engineering asset classes including Distributed Servers, Storage, Mainframe, Midrange, Database, Network and Data Center. The candidate will bring in previous hands-on experience in application development to deliver innovative yet practical solutions to the organization with a heavy focus on automating, integrating, and augmenting current tools to enable a fully-integrated, real-time collection and enrichment of data through APIs and web services to support this mission allowing the enterprise to effectively manage safety and soundness compliance variables and controls throughout the end-to-end asset lifecycle including patch compliance, vulnerability management, configuration drift management, data attribute quality, asset configuration accuracy and lifecycle currency.       The candidate must exhibit the ability to communicate ideas to all levels of the organization and must be capable of mentoring and overseeing junior developers. Candidate should be able to demonstrate the ability to apply core development principles, practices, and procedures to the development of various type of applications. The ideal candidate will be a forward thinker, passionate technologist and expert in modern software automation technologies, APIs and web services, and must be comfortable being at the forefront of a rapidly innovative software automation landscape and have the experience to operate across the enterprise technology infrastructure thorough understanding of available technology, tools, and existing designs; and working on complex problems.      Key Responsibilities:           Providing technical consultation/coaching while actively design & develop end-to-end automated software solutions capable of interfacing and integrating with in-house developed and vendor developed solutions and plug-ins via APIs and web services               Successful execution and delivery within time lines of software development projects utilizing agile methodologies and DevOps/CICD tools.                Automating asset (servers, databases, routers, switches etc) monitoring & remediation processes                  Gathering & t  ranslating requirements into end-to-end automated software code for new or existing solutions and projects                  Participating in system and unit testing tasks as assigned                   Assuring quality, security, and compliance requirements are met                     Required Qualifications               7+ years of application development and implementation experience                  5+ years of experience with scripting languages such as Bash, PowerShell, Python, Shell, VBScript, Perl or JavaScript                   3+ years of business (or test) process automation experience                   3+ years of experience with Agile methodologies                   3+ years of experience with DevOps/CICD tools like Jenkins, Artifactory, Ansible, uDeploy                   1+ years of API / Web Services programming experience                   Ability to solve complex issues/problems and negotiate solutions within a geographically dispersed organization          ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Process automation", "VB SCRIPT", "Powershell", "Javascript", "Agile", "Perl", "Application development", "Unit testing", "Analytics", "Python"]}