{"JOB DESCRIPTION": "  About the Role    This position is in the India Maps team. Maps plays a foundational role in Uber; many of the core Uber product functions are built on top of or leverage Maps functionality directly or indirectly. India Maps team develops high-priority, critical pieces of functionality for the Maps organization, working on a variety of things from Routing observability, diagnostics, algorithmic map error detection, experiment simulation platform, basemap data platform to Uber Places platform, Legoland, etc.   This position falls in the Algorithmic Map Error Detection team within Maps organization. The Maps Routing stack in Uber is a set of technologies that produces the best route from point A to point B and estimates time (ETAs) for all Uber. This includes modeling traffic on roads from GPS locations, sophisticated routing algorithms with a variety of cost functions, turn-by-turn navigation experience, and machine-learned ETAs predictions. This also requires building big data pipelines -- both batch and real-time -- to process and ingest map data, computing ETAs, traffic, etc. Our routing solutions powers many Uber products ranging from pickup ETAs, driver-rider matching (Uber Pool and others), fare estimation, EATs, Freight, Bicycles and more to come!   This role is critical to our Maps product as a whole -- when map data does not reflect the real world accurately, all the services built on top of it are adversely affected causing degradation of customer experience and safety issues. As the real world keeps changing, any map, regardless of initial quality, will always have errors; and the ability to apply ML and algorithms to detect and fix map errors is one of the most scalable ways for us to keep the maps accurate.    What You'll Do    For this job position, we are looking for a strong ML engineer who can solve challenges in Maps domain by applying ML techniques. The particular problem that this engineer will work on is to automatically detect many kinds of errors in our global map data by leveraging the huge amount of signals that is available at Uber (ex: terabytes of GPS traces, re-routes, traffic patterns, customer tickets, satellite/streetside imagery, etc). This problem is made even more challenging given that we need to detect these errors with high precision (to minimize costs of manual review) and high recall (to detect most of the significant errors present in the map).    A successful Maps ML engineer would have    6 years of experience with Machine Learning, Software Engineering in a highly competitive environment  Ability to translate a real-life problem into a ML model (deep learning, decision trees, bayesian models, etc)  Practical knowledge of feature engineering, model training, model tuning, model evaluation, etc.  Experience with designing a scalable ML System including feature store, training pipeline, model serving, model deployment, experimentation framework  Demonstrated application of ML techniques in the industry for a problem at scale with fruitful results.  Experience using machine learning libraries or platforms such as Tensorflow, Caffe, Theano, Scikit-Learn, Spark ML, etc.  Some knowledge of backend software engineering including coding and working with scalable software services and systems.  Bonus points for Geospatial experience: Familiarity with geospatial datasets and services, such as maps, local search, points of interest and business listings data, mobile device location and GPS traces would be a plus but is not required. ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Travel , Hotels , Restaurants , Airlines , Railways", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["deep learning", "Backend", "Simulation", "Coding", "Machine learning", "Customer experience", "big data", "Distribution system", "Software services", "Freight"]}