{"JOB DESCRIPTION": "  About the Role    Uber for Business(U4B) is one of the fastest-growing key business at Uber. As a senior architect on U4B platform team, you will be leading on architecting the B2B platform that supports various products (e.g., U4B, Uber Health, Vouchers, E4B, Freight, ATG), managing hundreds of millions of transactions over 300K organizations and solving high business impact yet challenging problems along with a great team. Come and join us!    Team-specific focus areas    Support hyper growth/new products in U4B from the platform perspective. Design and build extensible new features in organization/employee management, money movement, billing and reporting  Enhance and modernize the existing systems to be more reliable and efficient  High performance systems - Experience with building high performance distributed systems that can scale to 100,000s QPS.  Core Infrastructure - Experience with developing and running large scale distributed storage systems, service oriented architectures, and reliable monitoring and deployment infrastructure.  Data Processing - experience with building and maintaining large scale and/or real-time complex data processing pipelines using Kafka, Hadoop, Hive, Storm, and Zookeeper   What You'll Do    Lead the architecture design on building a true B2B platform within Uber  Scale U4B backend services that support hundreds of millions of business money movements with 100% accuracy  Architect U4B platform systems to be more generic in order to support various fast-growing products (e.g., U4B, Uber Health, Vouchers, E4B, Freight, ATG)  Develop creative ways to increase organization's engagement from platform's perspective. E.g., apply machine learning to predict organization's spending, credit limit and gain more business insights using the existing data  Adapt and optimize key pieces of Uber's evolving infrastructure to U4B platform systems  Set best engineering practices and mentor junior team members   What You'll Need    8+ years of engineering experience.  Expertise in one or more object-oriented programming language (e.g. Python, Go, Java, C++) and the eagerness to learn more  Experience with developing complex software systems scaling to millions of users with production quality deployment, monitoring, and reliability.  Experience with large-scale distributed storage and database systems (SQL or NoSQL, e.g. MySQL, Cassandra)  Ability to decompose complex business problems and lead a team in solving them ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Travel , Hotels , Restaurants , Airlines , Railways", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Backend", "NoSQL", "MySQL", "Billing", "Machine learning", "Data processing", "Distribution system", "Monitoring", "SQL", "Python"]}