{"JOB DESCRIPTION": "   JOB SUMMARY    As a Software Development Engineer III, you will be required to solve real-life complex problems and create compelling systems using the latest technologies to help grow our rapidly evolving business.      We are a bunch of highly skilled & highly motivated tech buffs with a culture of creative problem solving, intellectual design, fast-paced development, and passionate product delivery. The pace of our growth is incredible. If you want to tackle hard, interesting and UNIQUE problems, and create an impact within an entrepreneurial environment, join us!       RESPONSIBILITIES    Take complete ownership of projects and their development cycle   Architecture, design, and implementation of highly scalable and highly available systems   Continuously drive to explore, improve, enhance, automate, and optimize systems and tools to best meet evolving business and market needs   Focus on scalability, quality, performance, service robustness, and cost trade-offs.   Create prototypes and proof-of-concepts for iterative development   Mentor and conduct code-reviews       SKILLS    Hands on experience in developing roadmaps, writing user stories, grooming product backlogs and coordinating/prioritizing conflicting requirements in a fast paced, ever changing environment   Expert understanding of HLD & LLD   Hands on language agnostic developer with proficiency in the latest technologies   Have hands on experience with systems that are asynchronous, RESTful and demand concurrency   Proficiency in design patterns, data structures and algorithms and building efficient RESTful APIs etc.   Experience in production deployments with an ability to identify and resolve performance bottlenecks   Knowledge of best software engineering practices for all stages of software development life cycle, including coding standards, code reviews, testing and deployment   Working knowledge with Linux is a must   Ability to conduct scrums/sprints       QUALIFICATIONS    Bachelors in Computer Science and related fields from a reputed institute   4-6 years of experience working in product based companies or startups (preferably E-commerce)   Minimum 2 years of DevOps experience   Ideally suited for 2013 / 2014 / 2015 batch graduates     ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Media, Entertainment, Internet", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Aix", "C++", "Linux", "Db2", "Software Development Manager", "Perl", "Windows", "Oracle", "SQL", "RESTful"]}