{"JOB DESCRIPTION": " Location: Noida / Remote The work hours would 4:30 PM to 12:30 AM.Job Description: We seeking a senior backend software developer who is smart, curious, and loves the challenge of solving problems that can make a big impact. Were looking for someone who enjoys working with a small, globally distributed team and can manage working independently on crucial tasks. You'll be a critical part of taking our.ai and its technology to the next level as part of our development team. We are highly collaborative and move fast.Responsibilities:Our Backend Developer is responsible for: Committing tested, documented, and reviewed code on a frequent basis Working with our Product Management team to settle on requirements Estimating scope prior to coding features Understanding the full scope of a feature and how it will be realized in our UI and used by our customers Understanding performance and security consideration for the code we write Supporting our products and customers in production Actively supporting our continuous journey of applying good architecture and design patterns so that we can do our best work every day. Strong opinions are encouraged.Skills: Experience building production software, ideally in a commercial environment. Experience building on AWS and with DevOps. 2 or more years of recent experience with Python. Direct experience building RESTful services. Experience with a current ML framework such as Tensorflow or PyTorch is a strong positive. Experience with Python unit and integration test frameworks. Experience with Python web development and frameworks, ideally Flask. Experience working with, and developing Machine learning/AI algorithms is highly preferred. Good working experience in databases. Experience of a frontend web framework like ReactJS would be a plus. Effective communicator at a highly technical level. Highly detail-oriented. Experience using Jira, Bitbucket, and other similar tools. Strong English skills.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["Pytorch", "Flask", "Python", "Tensorflow", "Software Development", "Algorithms", "Front End", "Design Patterns", "Artificial Intelligence", "Machine Learning"]}