{"JOB DESCRIPTION": " GlobalSign is developing the Atlas identity platform, forming the core of GlobalSign's current and future products. Our platform is designed to scale to the needs of IoE and major cloud deployments, being capable of issuing billions of identities, with industry leading performance. Built to meet existing and future web standards and compliance rules, it is capable of servicing any scenario where strong identity is required. The Atlas platform meets our customers needs through APIs and integrates with many external services to verify identities and offer secure and compliant utilization of PKI-based services, such as publicly trusted X509 certificate trust services, digital signing and timestamping. ResponsibilitiesDevelopment. You take ownership for the feature full software development life cycle - design, coding, testing, deploymentQuality. You care about the quality of the code and ensure quality is good, taking corrective measures when needed and always looking for improvements. Agile. You understand and promote an agile development methodology designed to boost team effectiveness and performance, whilst maintaining quality.Required Qualifications7+ years experience software development in JavaBachelor's degree in Computer Science or related discipline, or equivalent experience Led the technical design of systems and servicesConducted code reviews to maintain quality of codeManaged multiple concurrent projects with aggressive schedulesHelped to adapt SCRUM/agile methodologies for team needsAdopted Continuous Integration methodsIdentified opportunities to optimize development process, defined tools and requirementDefined and led execution of experiments designed to identify performance bottlenecksBonus points for PKI experience", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "BCA in Any Specialization, B.Sc in Any Specialization, B.Tech/B.E. in Any Specialization", "PG": "MBA/PGDM in Any Specialization, M.Tech in Any Specialization, MS/M.Sc(Science) in Any Specialization, MCA in Any Specialization"}, "KEY SKILL": ["Java", "Web Technologies", "Deployment", "Distribution System", "Software Development Life Cycle", "Agile Methodology", "Software Development", "Life Cycle", "Software Engineering", "Boost", "Coding", "Scrum Master", "Testing"]}