{"JOB DESCRIPTION": "           PROFILE & KEY RESPONSIBILITIES :      An experienced and passionate Senior Software EngineerTech Lead to technically lead a young team of engineers in the development of technologies that support Tier 1 mobile telecommunication operators across the globe.    You will be expected to provide clear technical leadership on projects and make a significant contribution to the design, implementation and testing of new functionality in high performance event processing products. You will also be required to provide 3rd line support for issues reported to our global customer support teams.    The successful candidate will be an excellent all-round software developer with experience of designing, building and testing complex software systems, ideally with strong C++ and Java in an enterprise environment.        Technical Skills:       Strong and up-to-date development skills in C++Java       Strong analyticalproblem solving skills    Ability to mentor and teach junior team members       Knowledge of source control systems, e.g. Git.       Ability to work and communicate well with a geographically distributed team.       Good written and oral communications        Other Essential Skills:       Knowledgeunderstanding of mobile telecommunications networks       Ability to self-teach new technologies.       Knowledge of continuous integration systems such as Jenkins.       Knowledge of virtualization and cloud infrastructure technologies, e.g. Docker, Kubernetes, VMware, AWS          ", "ROLE": "Team Lead/Technical Lead", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["VMware", "C++", "Core Java", "GIT", "Linux", "Analytical", "Telecommunication", "Software product development", "Customer support", "Virtualization"]}