{"JOB DESCRIPTION": "  The Role     As a Staff Software Engineer, you will work in one of the hottest wireless networking domains along with likeminded subject matter experts and technologists. As member of the larger Wi-Fi software team, you will be able to make an impact with design, implementation and delivery of key features for Silicon Labs IoT product-line. You will work on diverse problems like building high performance Wi-Fi BT/BLE combo solutions using 802.11ax to building extremely low power Wi-Fi for IoT applications. As a subject matter expert, you will provide technical leadership to the team while being an integral part of the larger engineering team.     Your responsibilities will include:     Design and Development of Wi-Fi software & firmware for Silicon Labs connectivity products    Collaborating effectively with architects and technical leaders in requirements capture, analysis, technical feasibility study and algorithm development    Being hands-on, work on embedded system software and firmware (RTOS and bare metal)    Be a technical champion, innovate, own and deliver complex features and components    Stay focused on engineering excellence with emphasis on high quality code while balancing the needs of time-to-market    Collaborate with cross-functional teams, contribute to all stage of software development life cycle      Minimum Qualifications     E. / B.Tech in Computer Science, Electronics, or Communications. Master?s Degree (M.E. / M.Tech preferred)    10 years of overall experience in firmware development with 8 years of hands-on experience in Wi-Fi LMAC and UMAC firmware development    Hands-on experience with 802.11n/ac/ax wireless standards. Prior work experience with 802.11ax preferred    Expert in C/C programming skills with proven track record of writing efficient code for low power, memory constrained embedded systems with or without an RTOS    Experience with features like CSMA-CA, EDCA, Aggregation, Block Ack, MIMO, Beamforming, MU-MIMO, OFDMA, Scheduling Algorithms and Rate Adaptation    Must have experience in FPGA based hardware/software co-development, chip bring-up and the related PreSi / PostSi development activities    Deep knowledge of Network and IP Layer protocols like TCP/UDP/IPv4/IPv6    Familiarity with embedded development tools, debuggers, protocol analyzers (OmniPeek, Wireshark), JTAG, Logic analyzers etc.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "Any Postgraduate in Any Specialization, M.Tech in Electronics/Telecommunication"}, "KEY SKILL": ["TCP", "RTOS", "Wireless", "Computer science", "JTAG", "Semiconductor", "RF", "FPGA", "IPV6", "Automotive"]}