{"JOB DESCRIPTION": "Roles and Responsibilities The Role:  We are looking for an iOS developer responsible for the development and  maintenance of applications aimed at a range of iOS devices including mobile  phones and tablet computers. Your primary focus will be development of iOS  applications and their integration with back-end services. You will be working  alongside other engineers and developers working on different layers of the  infrastructure. Therefore, a commitment to collaborative problem solving,  sophisticated design, and the creation of quality products is essential.Responsibilities Design and build advanced applications for the ios platform  Ensure the performance, quality, and responsiveness of applications Identify and correct bottlenecks and fix bugs  Help maintain code quality, organization, and automatization  Collaborate with cross-functional teams to define, design, and ship new  features Work with outside data sources and APIs  Unit-test code for robustness, including edge cases, usability, and general  reliability  Continuously discover, evaluate, and implement new technologies to  maximize development efficiencySkills : Proficient with Objective-C or Swift , and Cocoa Touch  Experience with iOS frameworks such as Core Data, Core Animation, etc. Experience with offline storage, threading, and performance tuning  Familiarity with RESTful APIs to connect iOS applications to back-end  services  Knowledge of other web technologies and UI/UX standards  Understanding of Apple’s design principles and interface guidelines  Knowledge of low-level C-based libraries is preferred  Experience with performance and memory tuning with tools such as  Instruments and Shark Familiarity with cloud message APIs and push notifications  Knack for benchmarking and optimization  Proficient understanding of code versioning tools such as Git, Mercurial or  SVN  Familiarity with continuous integration  Should have 4+ years of experience in working on ios apps  BS/MS degree in Computer Science, Engineering or a related subject Proven ability to architect solutions from scratch as well as a jump in and  refactor the existing code base  Have an eye for elegant mobile UX and how the underlying architecture and  design provides for it Solid understanding of the full mobile development life cycle. Start-up Experience will be an add-on ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Graduation Not Required"}, "KEY SKILL": ["Software Development", "objectivec", "swift"]}