{"JOB DESCRIPTION": "Java script,  Type script,  HTML5 /  CSS Experience in developing Single Page Applications Expertise in connective with the Back end RESTFUL API.  Automated Java script Unit Testing framework e. g.  Jasmine,  wallaby. js,  JS Unit etc.  . NET Skills is plus Theoretical knowledge of Angular2 is a big plus Demonstrate knowledge on Software Development Life Cycle  (SDLC) ,  design patterns,  frameworks and concepts Bachelors  (or Associates)  degree in Computer Science,  Management Information Systems,  or related area Senior Software Engineer  (PHP)  ANDHERI  (EAST) ,  MUMBAI,  INDIA Job role:  You need to manage all aspects of the development processes to design,  customize,  maintain develop new solutions for existing platform as well as new undertakings. \n\nIf you have passion for innovation and fresh thinking,  if you like to pursue a career which is challenging,  interesting,  if you are willing to work on new ground breaking ideas,  we would like to welcome you in the Domit Kamel Telco team. \n\nYou will have the opportunity to: Develop your idea design on cutting edge technologies Be on a fast track career path for growth and advancement Build your consulting,  client management and project management skills Employ the most cutting edge tools,  and work with top talent in the industry Work in a dynamic,  fast paced and high growth environment Performance based Employee Stock Options Technical Requirements: \n\nCore  PHP  experience mandatory Experience in Symphony Framework is mandatory Experience in Doctrine ORM both 1. x and 2. x is mandatory", "ROLE": "Software Developer", "INDUSTRY TYPE": "Other", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Backend", "telco", "Project management", "Consulting", "Software development life cycle", "PHP", "Unit testing", "SDLC", "Client management"]}