{"JOB DESCRIPTION": "Principal Software Engineer at Noetic Ideas | Noetic Ideas Senior Software Engineer -  Java About this job We are looking for Java developer for building the next generation product on Play Framework. We are hiring a self- motivated Software Developer with experience designing and developing Java based applications.  You are a bright,  energetic,  and innovative individual who has participated in all phases of software development life cycle and possesses superior analytical and problem solving skills.  You will also be a key contributor,  working closely with architects and other team members in a fast- paced environment.  What you get to do in this role:   Opportunity to get involved in designing the architecture of the product  Learn and impliment new technology stack Desired Skills and Experience:  In order to be successful in this role,  we need someone who is competent with the following:   5- 8 years of solid Java back- end experience  Strong knowledge of design patterns,  OOPS principles and data structures  Experience developing highly optimized database applications based on Postgres Experience building RESTful APIs  Experience in Playframework would be a big plus  Experience profiling,  debugging and troubleshooting CPU,  Memory and logic issues  At least one Application Server Hands on expertise ie; JBOSS,  Weblogic,  etc Educational Qualifications:   Have a Bachelors or Masters degree in Computer Science.  Lack of a degree may besubstituted by equivalent professional experience  Strong understanding of Data Structures,  Algorithms,  Time/ Space Complexity  Working knowledge of Design Patterns  Experience in a high paced agile development environment.  Top reasons to work with us:  Competitive salary. Salary no bar for right candidate Great company culture.   Freedom to be creative and opportunity to implement your innovative ideas", "ROLE": "Outside Technical Consultant", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "System Design/Implementation/ERP/CR", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Algorithms", "JBoss", "Weblogic", "Analytical", "Debugging", "Software development life cycle", "Data structures", "Troubleshooting", "Business Executive", "Ideas"]}