{"JOB DESCRIPTION": "Client of Forstaffing Java Developer (Backend)  Forstaffing Java Developer (Backend) November 16,  2017  Filed under:  Published: November 16,  2017 Description About the company: Company Name : Sigfig India Pvt. Ltd.Location:  - Noida Team Strength: 10+ peopleAbout the Company:SigFig is tearing down the barriers to investing. They've raised $60 million to support our growth as the #1 Online Investment Advisor for large Financial Institutions.They have recently set -up a development center in India. Come join a fast growing San Francisco based -company and help build SigFig Indias team. Founded in 2007,  SigFig is backed by leading financial institutions including Eaton Vance,  Comerica Bank,  New York Life,  Santander InnoVentures,  and UBS,  as well as top -tier venture capital firms,  including Bain Capital Ventures,  DCM Ventures,  Nyca Partners,  and Union Square Ventures. The company is headquartered in San Francisco,  California.About the position: Designation:Software Development Engineer (backend)Experience required -3 -5 yearsReporting To:Director of EngineeringVacancy:2Cab -NoWorking Days:5Shift:Day shift jobJob Location: Noida Skills: Java,  Scala,  Data Structure and Algorithms,  Big data,  Angular.js.Looking for people who have participated in coding/ programmingcompetitions (e.g. ACM,  Google Code Jam,  HackerRank,  CodeChef etc, ),  hackathons etc.Roles and Responsibility : As a Software Engineer at SigFig,  you will work with a team of brilliant developers to build solutions that analyze billions in investor assets,  running complex algorithms and recommendations software to helppeople make better investment decisions. Youll help us Platformize (yes thats a word) our code,  build high -impact features and make it more easily configurable and customizable for a diverse set of needs.What youll be doing: Design,  develop,  test,  deploy and maintain services around SigFigs Wealth Management Platform. Integrate SigFigs Wealth Management systems into a diverse set of third -party enterprise systems. Interact with engineering members across the organization to ensure consistency in engineering practices and foster active exchange of ideas. We have development centers in San Francisco,  Tucson,  Singapore and India and the ability to work with distributed teams is a key skill.Perform peer code reviews. Review performance,  security and flexibility of the code. Participating in SigFigs agile ceremonies (e.g. daily standup,  release and sprint planning,  demos,  scrum of scrums). Were looking for someone with: You possess a BTech/ BE in Computer Science,  Engineering,  or a related technical field or equivalent practical experience. Strong Computer Science fundamentals  - you understand data structures,  algorithms and software design practices.Good experience with JVM languages (Scala,  Java) and relational databases (ability to design,  query,  transform and optimize). Great Communication Skills You have excellent communication skills and are able to clearly articulate your thoughts during verbal and written communications. The work we do here is very collaborative (and globally distributed),  so team players and an experience with fast moving projects is a big plus as well.Self starters with the interest and ability to learn other coding languages as needed. Knowledge of modern web technologies including Javascript,  AngularJS is a plus. Familiarity working with SSO solutions (SAML,  OAuth,  OpenID),  CRM vendors,  email systems,  e -signature providers,  or financial data (FIX,  OFX),  web infrastructure (firewalls,  VPNs,  proxies) and hosting is a plus.Domain Experience is a plus You understand the financial services domain and have executed projects involving implementation and integration of software solutions with other systems in financial institutions. You understand the need for strong security,  audits and performance criterias that are associated with the banking and financial services industry.Passion for finance and investing is a plus. Perks Benefits Competitive compensation packages Medical insurance for employees and their dependents Flexible working hours Catered lunches and a kitchen stocked full of snacks and refreshments Fitness subsidy Smartphone allowanceDrop files here January 14,  2018 December 22,  2017 December 18,  2017 New Delhi,  India November 7,  2017 October 31,  2017 Are you sure you want to delete this file", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["Computer science", "SAN", "Backend", "Software design", "Algorithms", "Coding", "Java J2Ee Developer", "Agile", "Scrum", "CRM"]}