{"JOB DESCRIPTION": " Job Description:You will be part of a strong development team in the area of System Level Modeling for Architecture exploration and Software Development. You will develop simulation models for architectural components like Processors, Interconnect & Peripheral models or even complete SoC platforms using C / C++ / SystemC . These models either may be modeled from scratch or will involve integration of models from third party vendors into our tool environment. You will help make customers successful by designing and improving flows of our product, improving software quality and by working closely with customer support. We offer an international work environment that is characterized by flexibility, an informal atmosphere, a fast pace and an opportunity to impact the way the industry develops new systems and embedded software. You will work with highly professional and motivated colleagues who value and support your contribution. Synopsys is a dynamic international workplace with opportunities for personal and professional growth. The position carries an attractive compensation and benefits package commensurate with a competitive global company. Technical attributes: Mandatory: - Bachelors/Masters in ECE/CS with 4+ years of experience - Excellent in C/C++ - Knowledge of Hardware and Software Interfacing -Technical Leadership of multi-member team projects - Excellent in problem solving and analytical skills. - Excellent communication, team work and networking skills Preferred: -Knowledge of SystemC, TLM and experience creating system level models -Knowledge of Embedded Software -Understanding of Processors architecture from ARM / Tensilica / CEVA or  Peripheral model internals or Interconnects like AXI / AHB -Experience with EDA Tools", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Electronics/Telecommunication, Computers", "PG": "M.Tech in Computers, Electronics/Telecommunication", "DOCTORATE": "Doctorate Not Required, Any Doctorate in Any Specialization"}, "KEY SKILL": ["algorithms", "c++", "python", "c", "software development", "OOPS", "Modeling", "TLM", "linux", "data structures", "software engineering", "Hardware", "Embedded"]}