{"JOB DESCRIPTION": " Hi,ABOUT NOUSNous Infosystems is a CMMI Level 5 and ISO 9001:2000 certified global information Technology Company with expertise in providing quality software solutions and IT-enabled support services to a wide range of industries. Nous was incorporated in 1996 with the mission of providing the highest quality software development services to clients around the world. Over the years, we have successfully broadened our service offerings to include consultancy services, software and hardware testing services, and a comprehensive range of IT enabled services. To know more about the company pls. visit our website www.nousinfosystems.comPlease find the below JD.Position: -Java developer/Sr Java developerEducation: - BE/MCA/MSc/BCAExperience: - 3-6years                                         Location: - BangaloreRoles & Responsibilities:1. Java/J2EE, Spring, Spring Boot, REST, JSON, Micro Services, Apache, 2. Strong understanding of microservice architecture 3. Ability to design, develop and implement scalable, elastic microservice based platforms.4. Core development experience in large scale enterprise Java applications using Spring Framework.5. Experience in SQL (Oracle / SQL. MariaDB/ My SQL databases) 6. Demonstrates strong understanding of the business needs driving the projects If you feel, you match the criteria above then please send in your updated profile to chaithramd@nousinfo.com Contact :6361759276 and do share following details.Current Salary: -Expected Salary: -Minimum Notice Period (Candidates with shorter notice period are preferred): -Only Immediate Joiners  are Preferred Current Location/Willingness to relocate to BangaloreRegardsChaithra", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Java", "IT Enabled Services", "Rest", "Software Development", "Microservice", "Oracle SQL", "Spring Framework", "Mariadb", "J2Ee", "Spring Boot", "JSON"]}