{"JOB DESCRIPTION": "Hi,Ixia Solutions LLP.We provide software solution in Education technology domain.We develop enterprise level platform for US schools and colleges like ERP systems, CRM systems, learning management systems, student information system.Designation: Software EngineerSalary: Best as Per Industry Standards Location : Ghansoli, Navi Mumbai5 days workingSat/Sun off & Day ShiftRoles and Responsibilities:- Deliver quality code that meets the business requirements in a timely manner (in line with the project schedule) - Participate in, and contribute to, technical discussions for development framework strategies - Understand and follow standards, guidelines, and best practices adopted in the project - Technical demonstration of self developed components - Contribute to the successful implementation of the project. - Work with the team to learn the processes and business and mentor fellow team members if neededSkills Required:- Comprehensive understanding of the .NET Framework.- Understanding of Object-Oriented Development-Knowledge in Angular JS will be an added advantage-Good Concept in Jquery, oops-Comprehensive understanding of developing scalable applications with NET 3.5/4.0 Framework, including Visual Studio 2010/2008, C#, ASP.NET, WCF Web Services, and Entity Framework. -Understand UML notations (class diagrams, sequence diagrams, entity relationship diagrams, activity diagrams, etc.) -Experience in building multi-tier, transactional web applications with n-tier architectures (UI, Business Logic Layer, Data Access Layer) along with some experience with service-oriented architectures (SOA).-Experience in design and optimize LinqToEntity / LinqToObejct / LinqToXML / SQL queries.-Experience of Unit test tools like (N-Unit/Ms Unit) for code quality metrics. -An understanding of Design Patterns (GOF) concepts is preferred. -Working knowledge of Enterprise Architect and TFS is highly desirable. -Understanding of Agile/Iterative development methodologies is highly desirable. Eligibility Criteria:-Should be a Graduate-Should have minimum 2+ years of Experience. -Should Have Good Knowledge and Experience of MVC, C#, LinQ, Jquery, oops , Entity Framework, Angular, Javascript,.If you are interested then kindly call on 9773307354 or can drop your CV to vivek.gopal@ixiasolutions.comThe interviews will be conducted via online facility and WFH is currently carried out.Thanks,Vivek GopalHR-IXIA9773307354/7039907354", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["C#", "TFS", "LinQ", "ADO", "Angular", "SQL", "Software Developer", "ASP.NET Developer", "Junior .NET Developer", "Junior software Engineer", ".NET", "Software Engineer", ".NET Developer", "MVC"]}