{"JOB DESCRIPTION": "      About the Role   This is an individual contributor full-stack software developer position for application development, maintenance and enhancements. Key responsibilities involve analysis, design, hands on coding/development, unit testing and maintain applications to meet both functional and technical requirements by following agile software development practices.    Responsibilities   Design, develop, test, implement new/enhance existing features/functionalities in enterprise web applications using Java/J2EE  Perform build & implementation, functional, integration and unit/performance testing, test automation  Assures quality, security and compliance requirements are met as part of projects delivery  Performance tuning of the Web application  Troubleshoot applications and work directly with various application and support team partners  Adhere to Agile development methodologies and best practices    Essential Qualifications   University graduate in engineering or post graduate in computer applications  7+ years of web application development using Java/J2EE  Strong knowledge of Java, Spring, Hibernate, JQuery, Angular JS, HTML, JSON, XML, WebLogic/Tomcat and Web Services  Proficient in Angular 9+ web development framework  Hands on working experience in cloud technology platforms like Amazon Web Services or Pivotal Cloud Foundry  Should have strong knowledge of Microservices and associated design patterns and Spring Boot  Knowledge of Junit, Mockito and other testing frameworks  Strong hands on experience in OOAD, Multi-threaded application development, design and implementation of web applications, data structures and design patterns.  Strong working experience in Test Driven Development (TDD) practices  Working experience of development ecosystem of applications like Jira, Confluence, ALM etc.  Experience in working with globally distributed teams following Agile methodology and Scrum  Experience in working with RDBMS and noSQL databases.  Experience in working with modern CI/CD tools and related ecosystem of applications - Bamboo, uDeploy, Jenkins, Artifactory, Maven etc.  Experience using source control tools like Git, SVN etc.  Proficiency in using code analysis and debugging tools  Should have strong communication and presentation skills    Desired Qualifications   Exposure to Splunk dashboards and App dynamics  Knowledge of Event Driven Architecture  Experience in Behavioral Driven Development (BDD) & Domain Driven Development (DDD)  Prior experience in development of enterprise scale banking applications will be a plus.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Hibernate", "Tomcat", "jQuery", "RDBMS", "XML", "Weblogic", "OOAD", "Performance testing", "Data structures", "HTML"]}