{"JOB DESCRIPTION": "      About Role:      Team member will be working on Application Development work in WIMT.      Responsibilities:       Involve in end end lifecycle of Product/Application development, analyze highly complex business requirements, designs and writes technical specifications to design or redesign complex computer platforms and applications.     Provide coding direction to less experienced staff or develops highly complex original code.     Act as an expert technical resource for modeling, simulation and analysis efforts.     Verify program logic by overseeing the preparation of test data, testing and debugging of programs.     Oversee overall systems testing and the migration of platforms and applications to production.     Lead projects, allocates and manages resources and manages the work of less experienced staff.     Assure quality, security and compliance requirements are met for supported area     Mentor less experience technical staff and may be involved in activities for their skills development       Essential Qualifications:       7+ years of experience on application development and implementation experience.     7+ years of .NET and WebApi development     5+ Years UI development using HTML 5, CSS, Angular 5 above/Angular CLI, Typescript, Material and/or Bootstrap, LESS and Javascript libraries.     Good experience on Oracle/SQL Server and DB2 interactions     Possess advanced knowledge of object oriented design and development (OOA/OOD) and the .NET / JAVA patterns and practices     Experience with delivering projects using Agile software development techniques.     Strong analytical and problem-solving abilities, with quick adaptation to new technologies, methodologies and systems.     Strong leadership skills, ability to lead and drive the team ensuring defect free deliverables and also motivate the team to perform better everyday taking up more ownership and accountability.     Must possess innovative and Out-of-box thinking while developing advanced technical solutions to business problems, and grab opportunities to improve system resiliency.       Desired Qualifications:       Brokerage domain experience     Proficiency with Agile and Devops practices and toolchain.     Proven leadership in delivering Cloud solutions.    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["UI development", "Object oriented design", "Simulation", "Db2", "Coding", "Debugging", "Javascript", "Agile", "Application development", "Information technology"]}