{"JOB DESCRIPTION": "  About the Role      We are seeking to hire a Salesforce QA for CRM - Customer Relationship View (CRV) initiative as part of Enterprise Core Services group. CRV is an application built on CRM platform to address the needs of Community Banking and Virtual Channels.    CRV application is one of the most critical initiatives in the bank. The application is built on the Salesforce financial service cloud (FSC) platform using lightning components.    The application will be used by multiple LOB's with over 100,000+ users. This will be one of the largest Salesforce FSC implementations in North America. You will be part of DevOps team performing QA and development with your automation skills.    Working closely with the onsite counterparts and offshore team as a complete techno-functional consultant with Knowledge and understanding of creating test plans, test cases, test procedures, test scripts, and expected results    Strong analytical skills with high attention to detail and accuracy Test planning and executing experience in systems such as: Test Tool, Quality Center, or ClearQuest    Excellent verbal, written, and interpersonal communication skills.      Responsibilities      Creates, prepares and implements systems quality assurance reviews for numerous applications.    Responsible for primary development of testing strategies.    Consults with users, providing advice and direction.    Uses independent judgment to perform complex analysis of business requirements and technical system specifications.    Leads and prioritizes testing activities for projects involving onshore and offshore teams.    Executes test plans and scripts to facilitate complex testing activities.    Provides specific technical guidance on defects to developers.    Gives direction to less experienced analysts.      Essential Qualifications       University degree in Engineering or related discipline.    Experience of more 5+ years of information technology quality assurance and systems/application testing experience.    Automation Testing experience (in Selenium or similar tools)    Hand-on in writing automation scripts (using Java/ C#/Python etc.).    API based testing experience using automation.    4+ years of HP ALM experience    2+ years of Agile experience    2+ years of JIRA experience      Strong analytical skills.    Fluency in English.     Desired Qualifications      Experience of Salesforce Financial Cloud.    Experience in working on Informatica/ Mulesoft.    Salesforce certified Administrator.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Production/Industrial", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Automation", "Manager Quality Assurance", "Agile", "Informatica", "Selenium", "Test cases", "Information technology", "CRM", "Python", "Salesforce"]}