{"JOB DESCRIPTION": "    About the Role    This position will be an integral part of Wholesale digital team within the CCIBT - TMPS technology group. Need to play Senior Developer role that expected to perform scalable design, development and maintenance activities for applications in TMPS. Candidate needs to work with US partner teams and it demands to be available as per the delivery timelines.     Responsibilities      Works with diverse group of developers, business subject matter experts, project management from multiple teams with assertiveness and tact    Contributes to design and development of solution from scratch with very minimal intervention from leads    Understand the features and projects end to end including downstream and upstream systems, suggest the short comings with intuitive technical solutions and implement the same    Ability to do the reviews and follow the process methodologies and documentation, Guide the junior team members    Be a trusted technology partner for Treasury technology teams and Wells Fargo India stakeholders    Report status to Technology/Engineering Manager.      Essential Qualifications        Bachelor's/Master s    degree in Computer Science or equivalent.      8-12 yrs.     of hands-on IT experience   in developing complex data transformations, Parser and Mappers (webMethods, Java & Informatica) and worked in Agile teams.    Mapping requirements to design to data transformation mapping.    Experience of working with Flow Service, java services, JEE web Application, JDBC adapters, restful and soap webservices, document types    Experience of working with Trading Networks, MWS.    Good understanding and experience in webMethods Administration.    Strong skills in design and debugging required.    Good understanding of different file format like EDI, XML, Flat files, ISO 20022.    Good understanding of working with XSD.    Experience in Unix, GIT, Jenkins, jfrog, sonar, fortify, blackduck, etc.    Good understanding of writing shell scripts.    Creating unit test cases, performing unit/integration testing.    Understand principles of agile methodology    Good communication skills.    Appetite & willingness to learn new technologies/methods and suggest process improvements.     Desired Qualifications      Should be able work with minimal supervision and be a point of contact for the team    Good verbal and written communication skills    Good problem solving and analytical skills    Should be detail oriented, able to multi task    Exposure to banking domain is a plus  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Other", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Unix", "Automation", "Webmethods", "Web services", "XML", "Project management", "Debugging", "JDBC", "Informatica", "Analytics"]}