{"JOB DESCRIPTION": "   Job Description     The NCR DigitaI Banking team in Bangalore, India is looking for a STAR Senior Performance Engineer for the development of Digital Banking Platform services, which is mission critical backend service layer built on a SOA framework, to provide capabilities for web banking, mobile banking, payments, account transactions and other online banking features. This role and gives a unique opportunity to own and deliver the roadmap of a world class SaaS offerings in the financial domain.      Roles and Responsibilities:     Our products are used by millions of active users already and this number is growing quickly. We need to ensure we maintain and improve our service performance and scalability for all the current and future use cases   As a Performance Engineer you are responsible for analyzing the product performance and scalability against the customer requirements and projected use cases. You will work closely with the Product Managers to understand the requirements, with development teams to understand the product implementation and with the functional QE team to leverage the tools, setups and processes they already have in place. Based on the requirements you will design and develop performance test automation framework, test cases and datasets using required tools.   Passion for getting to done - helping your team get a quality product out the door no matter what it takes - development, test automation, documentation, etc.   Conduct rigorous and comprehensive benchmarks to showcase product strength and publish results and best practice whitepapers.   Diagnose and resolve performance issues in all stages of product cycle.   Provide capacity planning and hardware sizing new products.   Proven experience in performance analysis, knowledge of systems software and internals of JRE and understand the impact of locking, caching and I/O on software performance   Provide performance testing, methodology, tuning guidance and best practices to customers, partners and internal organizations     Qualifications and Skills required:      BE/B.Tech Computer Science/MCA/MS or Equivalent.   10+ years of experience with a proven track record of Performance tuning on JRE based applications.   Familiar with End to End software performance testing and Engineering concepts.   Should be aware of all DB tolls like sql profiler, AWR analysis, tkprof, etc.    Must be aware of different tools and analysis part of JVM and code Tuning .    Must have extensive Java, Java EE, REST, XML, Messaging development experience with any Application Servers.   Experience with Distributed Systems Performance such as NoSQL/HBase/HDFS, Kafka, or ELK stack technologies.   Likes to invent, create, but happy improving on and contributing to what's been already built   Strong written and oral communication skills, ability to produce readable, accurate, and comprehensive reports.   Ability to work independently and efficiently.   Broad knowledge of software - including software architecture, principles, tools. Understanding of efficiency aspects, such as data caching, process parallelization, multi threading, etc.   Ability to understand and isolate performance issues in large programs by reading code (and using static analysis tools/ techniques) and/or profiling   Strong experience in testing methodology including test design, implementation, execution, monitoring, analysis and reporting   Familiarity with standard tooling in different environments, and experience in developing tools for use by development and testing teams   Self-motivated, proactive and result-oriented  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "MCA in Computers"}, "KEY SKILL": ["Computer science", "automation framework", "Performance tuning", "SOA", "XML", "Test cases", "Distribution system", "Monitoring", "SQL", "Recruitment"]}