{"JOB DESCRIPTION": "  About the Role     We are looking for an experienced technologist who can architect, build, and scale our platform and core systems that power mission-critical user experiences including customer support, frictionless experiences personalization.   The Customer Obsession (CO) team provides an end-to-end customer engagement platform for all Uber products: Ride sharing, UberEats, Uber for Business, UberHealth, UberFreight.    We strive to provide world class customer support to our end-users: riders, driver-partners, restaurants, eaters, freight carriers, truckers, Uber business partners and hospitals, by building and integrating a bespoke suite of tools for our Customer Service representatives.    While Uber strives to design defect free products, the physical realities of the environment we operate in such as traffic patterns, delays in food preparation, and credit card fraud introduce unforseen defects in our products.    The Customer Obsession team builds, owns, and operates the software stack used by Uber's customers, employees, and partners that helps us effectively address these defects both proactively or in response to an issue raised by a customer ultimately resulting in customer delight!In essence, we build the entire customer support infrastructure for the fastest growing companies in the world.    From the moment you access the Support Center in the app, to when a customer service agent solves your problem, and everything in between; our team provides all engineering for a magical support experience.    We are looking for a backend Architect/Software engineer who can help build intelligent systems that help power CO.      Expertise     We're looking for engineers with at least 12 years of relevant experience building highly-scalable distributed systems.    You have advanced knowledge of at least one programming language (Java, Go, C ) and one scripting language (e.g. Python or JavaScript) and at least basic knowledge of the following: MySQL, Redis, Kafka, Node and React/Flux.    Fast learner.   We're looking for software engineers who thrive on learning new technologies and don't believe in one-size-fits-all solutions. You should be able to adapt easily to meet the needs of our massive growth and rapidly evolving business environment.    Fearlessness   You think a working proof-of-concept is the best way to make a point. You strive on proving that speed and quality are not conflicting; that you can achieve both at the same time.    In addition to having an intimate knowledge of the whole web stack, you understand how all the pieces fit together (front-end, database, network layer, etc.) and how they impact the performance of your application.    Strong architecture chops   You know how to build highly scalable, robust, and fault-tolerant services that support our unique rate-of-growth requirements. You stay up-to-date with the latest architectural trends.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Backend", "Front end", "MySQL", "Javascript", "Customer support", "Continuous improvement", "Customer engagement", "Distribution system", "Monitoring", "Python"]}