{"JOB DESCRIPTION": " JOB Responsibilities     Develops, modifies and maintains complex JAVA and J2EE based software programs. Monitors the operation of assigned programs and responds to problems by diagnosing and correcting errors in logic and coding.    Reviews user requirements and needs for new software and performs analysis, design, implementation, installation and training related to new software developed and/or acquired.   Analyzes and plans systems based on consultations with Gantec management and/or staff. Document system plan and establishes an implementation schedule.   Designs and documents systems based on analysis results and further consultation with Gantec management and staff.   Creating new code to satisfy user stories (requirements) for Web based applications   Tests system fully to determine its operational reliability.   Assists user and operating areas in implementing and supporting systems including system installation, training and troubleshooting.   Carries out fact finding and program analysis of problems determines most appropriate procedures to resolve.   Provides technical advice and support to users. This includes creating adhoc reports, data analysis and correction, training and problem solving.     Must Have Skills to perform the job    The ideal candidate should have the following skills to perform the job    Bachelors degree in Computer Science   Should have at least 7 years of experience in Software industry   Should have excellent knowledge of Java, J2EE ( Servlets, JSP and EJB) or .Net development framework 4.0 or above   Should have knowledge of C+   Should have experience in developing Web Applications using MVC, Struts, Spring, Hibernate   Should have experience in handling Apache, Tomcat, JBoss and Web Logic Internet servers   Must have strong knowledge in Databases such as Oracle, Sybase, MySQL etc   Should have experience in using JIRA Web based Issue management /defect management and Project Tracking tool   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Publishing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Computer science", "Data analysis", "French", "Publishing", "Coding", "MySQL", "Troubleshooting", "Oracle", "Operations", "Information technology"]}