{"JOB DESCRIPTION": "   Role Overview:       We are looking to hire Software Development Engineer for our Enterprise Endpoint Engineering Organization based out of McAfee India Center, Bangalore.     About Role     Break down complex software systems with experience in performance and interoperability testing of software products in a production scenario.   Excellent programming and technical skills in following programming languages: C++, Python Behave, Behavior-driven development, PowerShell, JavaScript, and C#   7+ years of experience doing code review, defect analysis, writing test tools and identifying automation opportunities   Excellent experience driving quality programs like coding guidelines, best practices within the development teams   Is passionate and committed to software quality   Have architectural, design, programming, and debugging experience   Proven track record of delivering high-quality, scalable software with a cohesive user experience   Have good knowledge of Continuous development methodology and experience delivering software using CD principles   Expertise on Microsoft Windows operating systems.       About You     Experience developing/shipping high-quality, scalable software on Windows platforms   Have programming, debugging experience,. knowledge of debugging using tools like windbg.   Expertise in C++, C, Win32 API ,Multithreading, IPC, System Programming, Memory management and understanding of basic CS concepts is must.   Experience in Unit Tests.   Knowledge of Windows internals.   Exposure to Kernel level will be an added plus   Good Knowledge on installers like InstallShield   Familiar with Test-driven Development concepts.   Work within a team and cross-group to promote identification and resolution of issues to ship along with being able to promote features into the product.   Exposure to Scripting language like Perl / Python / Ruby would be desirable   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["C++", "Automation", "Multithreading", "Coding", "Debugging", "System programming", "Javascript", "Perl", "Ruby", "Python"]}