{"JOB DESCRIPTION": "   Role Overview:       .NET Core and AWS (Cloud) technologies developer required for NGM platform to work on primary technologies and improvise the Growth Retention segments by allowing NGM platform as Omni channel communication. Develop, debugs and tests complex software in any field e.g., systems software, software development tools, applications, drivers, numerical methods, UI's, web. May work directly with companies developing and optimising compilers, operating systems, and other software technologies. Skills sets required are .NET (framework Core), SQL, Angular JS, web technologies, AWS cloud technologies.    About the Role:     Exposure to developing Web-based applications with 5+ years of experience   Experience in .Net, NET Core 3.1 and above, C#, ASP.Net, T-SQL, SQL Server 2008/2016.   Experience Development experience in MVC and WebAPI   Exposure to writing SQL and SQL optimization for high-volume databases   Good experience working with Relational/ NoSQL databases   Experience in JavaScript, HTML5, CSS, Angular, or Node.JS   Have understanding of AWS services and expertise in deploying, and debugging cloud-based applications using AWS   Good to have understanding of machine learning with familiarity of statistical algorithms and their applications   Have the passion to work with technology and complex systems   Show enthusiasm in analyzing requirements, able to understand impact on existing systems and come up with an all-encompassing solution   Passion to work with demanding customers   You will reporting to the Engineering Manager   Document, user stories/use cases, functional specification and design       About You:       Experience to convert a problem statement to a design and implementation.   Interpret architecture and provide implementation documents.   You have experience documenting details of functionality, design and architecture of a component.   participate in weekly code reviews with engineers.   Can understand impact of code changes- both programmable and logical changes.   Can piece together relevant existing functionality and quickly come up with a prototype or solution.   Encourage or host reviews on Application source code and technical documentation.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Prototype", "NoSQL", "Diversity and Inclusion", "Debugging", "Machine learning", "Cloud", "Javascript", "MVC", "SQL", "Technical documentation"]}