{"JOB DESCRIPTION": "Dear CandidatesWe have a Immediate requirement of Senior Software Engineer for one of our client at Hyderabad Location.SummaryLocation: Bangalore Experience: 5 years experience level is required.Position: Senior Software EngineerImmediate joiners proffered within 15 days joiners acceptable.JD for Senior Software Engineer:Detailed Job Description: Associate should have strong knowledge of OSGi Online formcreation and integration with API layer. Associate should have strong knowledge on AEM designer and.xdp Associate should have worked on Adaptive Forms,OSGI Bundles, JCR's, HTML, CSS, Slings Framework, Java andJava script. Associate should have strong analytical skill, so that associate cananalyze the requirement and provide the solution. Associate should able to design forms in designer and apply rulesusing JavaScript and test them. Associate should able to develop custom java components as perapplication requirement.Mandatory Skills:1. Strong knowledge of Online AEM Forms Adaptive Forms and AEMWorkflows.2. Depth knowledge AEM Designer.3. Good knowledge of Java, JavaScript, HTML and CSS.4. Good Knowledge of XSD (Schema) and XML.5. Good Knowledge on Sling frame work.6. Good Communication and Interpretation Skills.7. Hands on and knowledge of AMS.Optional Skills:1. Strong knowledge of SDCL.2. Good knowledge Oracle and SQL.3. Knowledge of Quality center.4. Knowledge of AWSRegardsNaveen Kumar NMail id: naveen_k@trigent.comContact no: 9108228912 (Call between 9:30 Am to 6:30 Pm on Weekdays only)", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["AEM workflows", "Java", "AEM Forms", "CSS", "AMS", "XSD", "HTML", "SDLC", "Sling Frame work", "AEM Developer", "Software Engineering", "XML", "JavaScript", "AEM Designer"]}