{"JOB DESCRIPTION": "  Primary Skills:     Experience in CI/ CD platform design and implementation.   Experience in implementing automation tools and frameworks for CI/CD pipelines.   Experience in IAC (Infrastructure as Code) with Azure DevOps pipelines, ARM (Azure Resource Manager) templates and Terraform.   Experience with GitHub Enterprise and Azure Repos.   Experience with managing Azure Artifacts, Private Package Repos (e.g. Nuget, NPM).   Experience in Azure Pipelines build and releases for the following technologies:    Containerized microservices on Azure Kubernetes Service (AKS) Serverless microservices based on Azure Functions Managed PaaS Services (e.g. Azure App service, Database (Cosmos/ PostgreSQL, etc...))    Experience in network, server, and application-status monitoring   Experience in scaling(auto/manual) the Azure resources.   Strong communication skills, problem solving skills   Work independently and as part of a team.     Additional Skills Required:     Should have experience of working with Jira, Confluence,   Possess a strong command of software-automation production systems.   Give inputs to optimize the project s computing architecture.     Key Responsibilities:     Implement the CI/CD build and release pipelines and maintenance.   Conduct systems tests for security, performance, and availability.   Troubleshoot deployment issues and coordinate with the development team to streamline code deployment.   Configuring scale up and scale down Azure compute resources   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Automation", "Architecture", "Postgresql", "devops", "Automation tools", "Deployment", "Cosmos", "JIRA", "Troubleshooting", "Monitoring"]}