{"JOB DESCRIPTION": "Roles and Responsibilities  - We are looking for motivated software engineers who will solve  challenging technical problems and developing products end-to-end. You  will be building highly distributed, reliable, scalable, performant  microservices/API to handle big data using AWS.Key responsibilities :-  Develops complex modules of Application using agile software development (Scrum).-  Develops product and solutions by gathering information required, studying systems flow, data usage and work processes.-  Implementation of full lifecycle of a product development including requirement analysis, development, testing, and CI.-  Work as part of sprint team and collaborate with Product managers and data scientists to develop feature of application.-   Responsible for analysis of current programs including performance,  diagnosis and troubleshooting of problem programs and designing  solutions to fix.-  Documents and demonstrates solutions by  developing documentation, flowcharts, layouts, diagrams, charts, code  comments and clear code. Desired Candidate Profile  Skill Requirements :-  Experience in building highly scalable, distributed and performance driven product and solutions.-  Minimum 1 year of full life-cycle development experience either with Python OR Java.-  SQL/No SQL programming experience on RDBMS (Oracle, MySQL, PGSQL, etc...) OR No SQL (Mongo DB, Cassandra DB, etc...).-  Good knowledge of Micro services-based architecture and server less development.-  Good knowledge in AWS (Amazon web services) and REST API Development.-   Should possess a fundamental understanding of basic areas of Computer  Science such as Algorithms, design pattern, data Structures and  Object-Oriented Design. Personal Attributes :-  Candidate must possess good written and oral communication skills-  Ability to multi-task under pressure and work independently with minimal supervision.-  Dedicated, Hardworking and person who lives up to his commitment.-  Must exhibit strong problem-solving skills-  Should be able to collaborate with teams on various decisionsDesired profile :-  Years of experience: 1-4 years-  B.E/B.Tech or M.Tech with CS/IT", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Java", "Software Development", "Software Engineering", "Object-Oriented Design", "CI", "Big Data", "Agile", "REST API Development", "AWS", "Microservices", "Python"]}