{"JOB DESCRIPTION": "  Job description       The Software Developer on the Engineering team is responsible for the implementation, design, architecture, and quality control of business integrations/general development within the customer-facing product application and internal tools used by development technical operations.    This includes troubleshooting bugs and implementing new features as required in existing backend applications; even building new components as needed.    A successful Software Developer will produce all required functionality in a timely manner and will communicate and work with colleagues to solve problems and improve the systems they work with.     Here's a closer look at this key role:     Prioritize and plan for deliverables in an iterative development strategy   Design, document, code, and test technical solution for new systems or enhancements to existing systems   Follow agile software development methodologies for implementation   Work with various teams in LogicMonitor to deliver software products that support LogicMonitor's business growth   Envision system features and functionalities by analyzing business requirements   Troubleshoot and resolve product/application issues for escalated support cases   Collaborate with a diverse, distributed development organization. Our development team spans multiple cities in the US and Asia   3+ years of software development experience in commercial or enterprise application   2+ years of full-time experience as a Java developer on Linux platform   Bachelor's degree or above in computer science or related field   Familiar with latest Java development framework and open-source tools   Strong understanding of web application architectures   Familiar with AWS services, other cloud platforms   Ability to quickly develop competencies in numerous technologies (i.e. you can learn quickly!)   Ability to work with a development team and develop strong, reliable, and effective relationships with team members   Familiar with Test frameworks (Junit, wiremock)   Excellent in communication (written and verbal) and collaboration with other functional teams (Support Engineering, Tools, Product, etc.)   Familiar with Atlassian Suite (JIRA, Confluence, Bamboo, BitBucket)    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Backend", "Software development methodologies", "Linux", "Agile", "Troubleshooting", "Open source", "JIRA", "Ruby", "Python"]}