{"JOB DESCRIPTION": "Roles and ResponsibilitiesWe are looking for a senior developer and architect with 7+ years of experience to work on both the design and development of new and existing systems. You will get to take ownership of the components of the software and take it from design to production.What you will be doing- Designing and implementing solutions while writing clean, high-quality, high-performance, maintainable, and scalable code- Participating in code reviews and collaborating with the team- Managing individual project priorities, deadlines, and deliverablesWhat We Need To See- Proficiency in Python(5+ years)- Full stack development experience in developing web applications, RESTful APIs, Front-end: HTML, CSS, AJAX, JQuery, JavaScript- Proficiency in SQLAlchemy- Proficiency in Git- Experience with one or more database technologies like Postgres, Redis, MongoDB, etc.- Familiarity with Bash and developing software on Linux- Experience with container orchestration, clustering, scaling- Experience with Docker- Experience with Kubernetes- Keen sense of urgency, highly motivated, and ability to learn quickly- Experience with Flask or DjangoWays To Stand Out From The Crowd- Experience with database replication and synchronization- Experience with load balancing- Experience with FastAPI- Public git projects- Experience with build systems such as Buildroot or Yocto- Experience with client-side data visualization librariesWhy us?- Opportunity to work on cutting edge open-source technologies- Flexible timings- Casual work environment- Health insuranceOur dynamic work environment provides the optimal setting to take your career to the next level. From our supportive culture, diverse workforce, and competitive compensation, to our flexible work schedules and fun social events, it's everything you- ll need for an exciting, challenging, and rewarding career.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Sc in Any Specialization, BCA in Computers, B.Tech/B.E. in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["RESTful API", "Yocto", "jQuery", "Docker", "Django", "Full Stack", "Python", "Kubernetes", "Flask"]}