{"JOB DESCRIPTION": "  Must have Skills Requirements:    5 - 15 Years relevant software development experience with a fairly Full Stack profile (experience in front-end, back-end, cloud automation and orchestration) Proficient in .NET and .NET Core (Web, API, Windows, Services) with Azure Platform Development (Serverless Computing, Azure Functions, Azure Services, Azure Storage, Logic Apps).    Deep experience in Data Development (T-SQL /Oracle Pl/SQL /Azure Cosmos/ Azure SQL/ Mongo etc.)    Experience using Cloud Native CI/CD tools is highly desirable.    Experience of C , Python, Golang and other programming frameworks and paradigm is desirable.    Experience developing applications based on microservices architecture is highly desirable.    Demonstrated application of the best patterns practices in the software development life cycle.    Experience working in agile teams with demonstrated application of the principles.    Knowledge of Power Trading Value Chain and Wholesale Energy Markets is highly desirable and would be a key differentiator between technically equivalent candidates.    Knowledge of other Cloud (AWS Lambda etc), and Integration (MuleSoft, Logic Apps, BizTalk etc) technologies is highly desirable.    Knowledge of containers and functions is highly desirable.    Deployment experience with Kubernetes (K8s) or Functions is a plus.     Good to have Skills Requirements:    Data Engineering experience blended along with core software engineering experience (not looking for a pure play data engineer) ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Automation", "Front end", "orchestration", "Agile", "Software development life cycle", "Biztalk", "SQL Azure", "Cosmos", "Wholesale", "Python"]}