{"JOB DESCRIPTION": "Job Title : Software Senior Engineer - India R&DJoin us as a Software Senior Engineer on our Engineering Development team in Bangalore to do the best work of your career and make a profound social impact.Key Responsibilities Lead projects related to enablement of multiple flavors of VMware ESXi on Dell Enterprise Hardware.Develop/Maintain Test Strategy/Test Plans for Platform Enablement as needed for the projects.Perform as Issue Manager on the identified defects and take them to closure by working with the relevant stakeholders (internal teams as well as OS vendors).Troubleshoot system/component issues (HW/SW). Characterize, contain and assist in Root Cause Analysis of the defects of reasonable to high complexity on multiple ESXi versions. Provide adequate technical details to the internal and external teams to substantiate the findings and drive issue resolution.Keep track of developments in VMware ESXi, other Hypervisors and Container Technologies. Use the knowledge to improve internal engineering processes.Present Engineering Status update for the projects in relevant meetings as needed.Build rapport with the vendors and the teams at Dell. Work in coordination with the teams to achieve engineering objectives. Assist other Dell teams, as and when needed to resolve OS/Hypervisor related issues.Essential Requirements Should have 6-8 years of relevant experience in OS internals/OS root cause analysis with understanding of OS, Hypervisors, Container Technologies, Networking and Storage subsystems.Must have good analytical skills to trouble shoot technical issues .Should have a good understanding in computer hardware, especially CISC architecture.Educational Qualification : Engineering/Masters graduate in Electronics/Computer Science.Desirable Requirements Experience in embedded / real-time systems, software defined network functions will be a plus. Experience in leading teams on validation / defect resolution and experience in Vendor interaction will be a plus ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Sc in Electronics, Computers, B.Tech/B.E. in Electronics/Telecommunication, Computers, BCA in Computers", "PG": "MS/M.Sc(Science) in Computers, Electronics, MCA in Computers, M.Tech in Computers, Electronics/Telecommunication", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Networking", "D", "Hypervisor", "Software Engineering", "Computer Science", "OS Internals", "Server OS", "Test Strategy", "ESXI", "Operating Systems"]}