{"JOB DESCRIPTION": "Roles and ResponsibilitiesThe RoleAt least 10+ years of overall experience with 5+ years of experience in leading large scale projects on .NETEducational Qualification  BE / BTech / ME / Mtech / MCA / MSc. Comp. ScienceMandatory Skills - Hands on knowledge of .NET platforms [.Net Core, .NET Framework 4 or later, Asp.net, C#, WCF, Web API, Entity Framework, SQL Server 2008 or above, azure concepts, service bus.]Strong object-oriented programming(OOPS) design skills, SOLID principles and proficiency in software design patternsKnowledge on best practices for the software development life cycle, including coding standards, code refactor, code reviews, source control, build and deployment, testing.Knowledge on JavaScript frameworks, CSS 3, HTML5Superior strategic planning and technology skills with a hands-on execution styleDeep knowledge of Web Application developmentResponsibilitiesWork with engineers to grow their technical skills, and ensure they have the right challenges and necessary context to make use of themLead a team(s) of .NET developers focused on building scalable Web Applications to cater to Shell businessParticipate in discussions about software architectureAdvocate and advance modern software development practices within the teamWork closely with teams, product owners, agile coaches and other stakeholders to ensure we deliver world-class applicationsStakeholder ManagementRequirements**GFN knowledge** is added advantageExperience in leading and mentoring software developersExperience in handling geographically distributed teamsKnowledge of .NET SQL Server, C#, VSTSKnowledge of CI /CD & Test automationExcellent communication skillsExcellent stakeholder management.", "ROLE": "Software Developer", "INDUSTRY TYPE": "Chemicals, PetroChemical, Plastic, Rubber", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "MS/M.Sc(Science) in Computers, M.Tech in Any Specialization, MCA in Computers", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["C#", "Web API", ".Net Core", "OOPS", "Javascript", "ASP.Net", "Entity Framework", "SQL Server", "WCF", ".NET Framework"]}