{"JOB DESCRIPTION": "As a Senior Back End Developer you will be expected to have advanced knowledge of back end   technologies. You will be tasked with development activities in mentioned technologies that are performant and work across different platforms. You will also need to collaborate tightly with the frontend developers and senior members of the team to ensure development is done in the agreed timeline.Location of posting - Mangalagiri, Guntur, Andhra Pradesh(Need to work from office) Responsibilities:Implement new features of medium to high complexityImplement integrations with other companies and technologiesPerform code reviews for your team and give constructive feedbackShare technical knowledge across the team during meetings, code reviews, standups and 1 to 1sPerform appraisals of team members according to the company policy Deploy new features to production using Bitbucket Pipelines and DeployBotWrite unit tests for the produced code to validate the functionalityWrite documentation for new and existing codeCollaborate with other team members and stakeholdersWrite clean and secure code and adhere to security and information standards of the company and best practices of the technologies usedDesired Candidate Profile:Candidate should have 3 - 6 years of commercial experienceShould have 3 years of Core Java experience Good leadership skillsHas a keen attention to detailHas excellent verbal and written English communication skillsIs well organised and able to report on progress conciselyBachelor Degree in Computer Science Required skill set:Excellent Java knowledgeExcellent Spring Boot knowledgeAdvance Git knowledgeGeneral knowledge of AWS,Angular , Redis, CSS, HTML is needed", "ROLE": "Software Developer", "INDUSTRY TYPE": "Other", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers"}, "KEY SKILL": ["Application Programming", "Java", "Angularjs", "CSS", "Hibernate", "Redis", "HTML", "J2Ee", "Spring Boot", "Spring", "Angular", "Core Java", "Software Development", "Front End", "GIT", "Software Engineering", "Bitbucket", "AWS"]}