{"JOB DESCRIPTION": " Job Summary    Join us as a Software Development Engineer II in Test in Data Connectivity Products team This team builds DataDirect Connectors that provide high-performing JDBC, ODBC, ADO.NET and, OData data connectivity solutions for Relational, Big Data, and SaaS data sources    SDET (Software Development Engineer in Test)will be responsible for the day to day testing of builds and major releases of DataDirect products through manual and automated test procedures. They will work closely with the Engineering Manager, Program Manager, Development Engineers, to develop test strategies, test plans and new tests for new and existing product features. Major responsibilities include:  -Developing, maintaining and expanding the automated tests  -Adding new tests for each new feature or bug fix.  -Tests automation will be written in .Net (C#), Java, CC++.  -Test cases could be written in SQL, XQuery, etc. based on the product they are working on.  -Configuring applications to use the DataDirect ADO.NET or ADO, ODBC, JDBC drivers  -Assisting support in reproducing customer s issues  -This will also include daily triage of failed tests and creating reproducible test cases for development engineers.  -The team will be working on multiple platforms, which include Windows, UNIX, and Linux, and will be responsible for setup, configuration, and testing of DataDirect products on all supported platforms.     Required Skills for the role:    - DegreeMajor: B TechM TechMCAother CS degree or equivalent.  - Minimum of 3-year experience in Quality Assurance andor Software Development  - Experience with developing test automation framework, performance testing, and tuning.  - Knowledge, of the software development process, including Quality Assurance.  - Experienced in 1 or more programming language (CC++, Java, .Net (C#)).  - Hands on experience on multiple OS like Windows, Unix, Linux, AIX etc.  - Hands on experience on Databases like Oracle, DB2, SQL Server.  - Ability to create Test Plans, estimate, schedule and prioritize tasks.  - Excellent communication skills - Ability to interface with engineers, architects and managers in order to accomplish objectives.    Desired Skills (Good to have)    - Knowledge of scripting language (VBScriptPerlUNIX shell scripting)  - Experience with automated GUI testing.  - Experience with Internationalisation testing.  - Understanding of Multi-platform issues for UNIX and Windows environments.  - Understanding of ODBC concepts and configuration of ODBC drivers on various platforms.  - Understating installation tools like InstallShield  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "MCA in Computers"}, "KEY SKILL": ["Aix", "C++", "Linux", "Db2", "Software Development Manager", "JDBC", "Perl", "Windows", "Oracle", "SQL"]}