{"JOB DESCRIPTION": "Senior Software Development Engineer - Web Applications - React.js / AngularJS / Backbone.jsJob Description:-We are seeking a highly motivated (Sr) Software Development Engineer with expertise in building scalable, extensible and user-friendly web applications. You will work with fast paced Product Engineering team to build efficient and reusable web applications for mobile and fixed devices.Role & Responsibilities:-- Architect, Design, Code reviews and build scalable applications.- You will be engaged in identifying and addressing performance bottlenecks, collaborate with other team members to innovate currentnew products.- Identify, communicate and implement best practices for application engineering. - Ensure high scalability and performance- You will advocate for good, clean, well-documented and performing code; define and follow standards and best practices for front-end development.Desired Candidate Profile:-- Experience: 3-5 yrs recent experience of working in a scalable web product firm- Excellent software development skills in developing web applications over client-side frameworks - Backbone (preferred), React andor angular frameworks; and server-side frameworks- Excellent programming skills in object-oriented, modularised JavaScript, Typescript (preferred)- Strong knowledge and working experience in server-side Event-driven programming using Node.js- Excellent programming skills in Javascript, jQuery, AJAX, YUI.- Passion for writing optimized code using JS best practices and design patterns- Experience with JS or Java-based Unit Integration Testing using Selenium, Appium, Selendroid- Hands-on experience in building scalable web applications- Excellent problem solving and debugging skills- Good Knowledge of version control - GIT (preferred)- Experience with the full software development lifecycle, design, develop, debug, document, and deliver (especially in a multiple site organization)- Strong verbal and written communication skills- Ability to deliver great results in an agile development- Good to have: Working knowledge of web standards (i.e., REST) and OOPS- Good to have: Experience in Data Structures, Algorithms and their optimization.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "BCA in Computers, B.Tech/B.E. in Any Specialization, B.Sc in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["TypeScript", "Java", "AngularJS", "Software Development", "jQuery", "Design Patterns", "Javascript", "Node.js", "Backbone.js", "React.js", "YUI", "AJAX"]}