{"JOB DESCRIPTION": "   JOB SUMMARY    As a Software Development Engineer II, you will be required to solve real-life complex problems and create compelling systems using the latest technologies to help grow our rapidly evolving business.      We are a bunch of highly skilled & highly motivated tech buffs with a culture of creative problem solving, intellectual design, fast-paced development, and passionate product delivery. The pace of our growth is incredible. If you want to tackle hard, interesting and UNIQUE problems, and create an impact within an entrepreneurial environment, join us!       RESPONSIBILITIES    Ability to implement end to end clean manageable code.   Understand project specifications and deliver appropriate solutions.   Continuously drive to explore, improve, enhance, automate, and optimize systems and tools to best meet evolving business and market needs.   Focus on scalability, quality, performance, service robustness, and cost trade-offs.   Create prototypes and proof-of-concepts for iterative development.   Strictly follow and enforce code quality guidelines.       SKILLS    Language agnostic and have experience in programming languages like JAVA, Python, PHP etc.   Expert understanding of HLD & LLD   Proficiency in design patterns, data structures and algorithms and building efficient RESTful APIs etc.   Strong knowledge of the databases like MySQL, NoSQL, PostgreSQL, etc.   Strong debugging skills   First-hand experience with stacks and technologies appropriate for large-scale systems   Ability to conduct peer code reviews, manage technical debts and enforce best coding practices   Working knowledge with Linux is highly desirable       QUALIFICATIONS    Bachelors in Computer Science and related fields from a reputed institute   2-4 years of experience working in product based companies or startups (preferably E-commerce)   DevOps experience is an added extra   Ideally suited for 2015 / 2016 / 2017 batch graduates   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Media, Entertainment, Internet", "FUNCTIONAL AREA": "IT Software - eCommerce, Internet Technologies", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["NoSQL", "PostgreSQL", "MySQL", "Software Development Engineer"]}