{"JOB DESCRIPTION": "Job Title Sr. Software Engineer \n\nLocation(s) Kerala Thattil Nadakalan \n\nSummary: \n\nCandidates will be responsible for helping to build of the quality,  performance,  resiliency,  and security of PerkinElmer Automation Liquid Handling products. Duties include designing and implementing large scale,  quality,  high performance,  resiliency,  and security ALH platform.\n\nThe successful candidate will have significant software design and build/ release experience,  as well as excellent interpersonal written and oral communication and collaboration skills.\n\nDuties and Responsibilities: \n\nDevelop and deploy build and release automation workflow utilizing Term Foundation Server (TFS) \n\nPro-  actively look for ways to improve and automate build processes. \n\nTrace complex build problems,  release issues and environment issues in a multi-  component environment. \n\nDevelop,  maintain and enhance key parts of the release procedures and processes. Coordinate release activities with Project Manager,  Q&A Lead and Development team to ensure a smooth and trouble-  free roll out of releases. \n\nActively participate in our daily scrums and help establish best design practices to influence architectural decisions and build various performance interfaces for our platform. \n\nJob Requirements: \n\nB.S. in Computer Science or equivalent \n\n5 years of experience as a Build and Release Engineer \n\n2 years of experience in building continuous integration pipelines \n\nStrong experience with automated builds,  automated test runs,  and commercial installers \n\nExtremely familiar with various Branching strategies,  pull request concept and GIT commands \n\nSolid understanding and practical experience of software development life cycle,  with particular emphasis on release engineering functions \n\nVery familiar with C#/ C programming language and .NET and Visual Studio development tools \n\nVery familiar with Agile development methodologies \n\nVery familiar with version control,  bug tracking systems and procedures \n\nStrong sense of ownership,  passionate,  fast learner,  detail-  oriented,  analytical mindset,  perfection seeker,  self-  starter able to operate with minimal supervision to achieve objectives", "ROLE": "Software Developer", "INDUSTRY TYPE": "Pharma, Biotech, Clinical Research", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["server", "Automation", "development", "interfaces", "c", "Architecture", "software", "functions", "Workflow", "Visual Studio", "tools", "tracking", "Computer science", "Software design", "Version control", "GIT", "Analytical", "design", "Software development life cycle", ".net", "agile", "programming"]}