{"JOB DESCRIPTION": "\n\nJob Title Sr Software Engineer \n\nLocation(s) Kerala Thattil Nadakalan \n\nSummary \n\nThe ideal candidate will have experience developing software for electromechanical systems such as multi axis robots,  hydrodynamics,  and a variety of sensors including optical and ultrasonic.  You will use your development and troubleshooting skills in building and maintaining integrated software- hardware solutions.  You will work on a team that is responsible for the design,  development and delivery of new and existing software platforms that drive all of our laboratory automation and Microfluidic solutions.  You will have the opportunity to work closely with electrical and mechanical engineers,  physicists,  biochemists and molecular biologists.  Experience developing software for to control instruments is a plus.  \n\nResponsibilities: \n\nInvolved in the design,  development,  testing and delivery of new features and enhancements to our Automation and Microfluidic products.  \n\nWork on projects with a distributed team of software engineers and testers both at our Hopkinton facility and with our offshoring partner in India.  \n\nLearn and follow the Product Life Cycle process,  ECO release and documentation and manage the release of software into production \n\nSupport other departments as required including technical support,  field service,  and Integrated Systems \n\nMaintain professional and technical knowledge at leading edge potential by attending educational workshops,  reviewing the technical literature and participating in professional societies.  \n\nQualifications: \n\nBS degree required /  MS preferred plus,  with 5 to 10 years experience in developing instrument control software in medical,  scientific or other relevant field.  \n\nExperience with Agile Scrum,  TDD or other current software development methodologies.  \n\nMicrosoft Development Stack,  C#,  C .  VB. NET,  MS Test,  TFS \n\nExperience with one of more of WCF,  WP,  Prism and COM architectures desired \n\nExperience developing mobile applications using native or cross platform libraries \n\nEnergetic,  results- driven with excellent organizational and prioritization skills.  \n\nExcellent written and verbal communication skills.  \n\nAptitude to learn new systems and retain technical information.  \n\nCommitment to customer excellence with demonstrated ethics and integrity.  \n\nAbility to operate independently and as part of a team \n\nCommitment to continuous improvement principles.  \n\n", "ROLE": "Software Developer", "INDUSTRY TYPE": "Pharma, Biotech, Clinical Research", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Sc in Computers", "PG": "MS/M.Sc(Science) in Computers"}, "KEY SKILL": ["Automation", "Software development methodologies", "TDD", "Design development", "WCF", "Sensors", "microsoft", "Troubleshooting", "Continuous improvement", "Technical support"]}