{"JOB DESCRIPTION": "Job Description\n\n The Core Network software stack ( Core ) team at Azcom s India Development Center owns the design,  development and delivery of the 4G,  5G and IoT Core Network protocol stacks and applications for Azcom s own products as well as for Azcom s design services customers. The team prides itself on successful high- quality product delivery to extremely demanding customers,  including those in the aerospace domain. Core networks are becoming increasingly critical in virtualised environments,  where new feature delivery and customer value addition is preferably cloud- based. NFV and SDN are key to success in the networks of tomorrow.\n\n As part of the Core team,  you will participate in all phases of the software development life cycle and be responsible for delivering high quality,  optimized software components and subsystems for Core Network,  such as S1AP,  NAS,  GTP,  MME,  Gateways,  HSS,  etc. You are expected to handle technical interactions with Azcom s global customers off- site and on- site.\n\n You should have a solid grip on software architecture and design best practices,  and possess in- depth knowledge of the 4G,  5G and IoT domains and applicable technical standards.\n\n Location: Gurgaon (India)\n\n Work Experience Required\n\n Senior Software Engineers should possess 2- 4 years of relevant work experience,  i.e. implementation of one or more core network functional nodes in server- based or cloud environments.\n\n Technical Skills Required\n\n Strong in C/ C++,  data structures,  algorithms,  design patterns Strong in OS,  networking (TCP/ UDP/ SCTP),  IPC,  multi- threading Work experience in one or more communication protocol stacks e.g. LTE,  IoT,  5G Work experience in any of Core Network interfaces e.g. S1,  S11,  S5,  S8,  S6a,  SGi,  etc. Project execution in an agile environment Experience of working in state of art software development environment,  including IDE,  development automation tools,  version control and artefact management Additional Technical Skills\n\n Exposure to eMTC and NBIoT protocol specifications,  design and development Experience in Network Function Virtualization (NFV) and Software Defined Network (SDN) will be a big plus Behavioural Skills Required\n\n Excellent analytical skills and problem- solving ability Excellent writing and verbal communication skills", "ROLE": "Software Developer", "INDUSTRY TYPE": "Telcom, ISP", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["TCP", "C++", "Version control", "PDF", "Networking", "Agile", "Data structures", "core network", "SCTP", "Virtualization"]}