{"JOB DESCRIPTION": "  Primary Responsibility: \n\n Acting as Software/ Application developer \n Coding, Coding and Coding. Please dont apply if you are not interested in extreme coding. \nDeliver across the entire app life cycle -concept, design, build, deploy, test, release to app stores and support\nWorking directly with developers and product managers to conceptualize, build, test and realize products\nGather requirements around functionality and translate those requirements into elegant functional solutions\nBuild prototypes at tech scoping stage of projects\nWorking along the web developers to create and maintain a robust framework to support the apps\nCreate compelling device specific user interfaces and experience\nStandardize the platform and in some cases apps to deliver across multiple brands with minimal duplication of effort\nOptimize performance for the apps\nKeep up to date on the latest industry trends in the mobile technologies.\n\n \n  Desired Skills and Experience  \n\nCoding on all tiers of the application\nUnderstanding of Algorithms, Data Structures, Object-Oriented design and Systems Architecture\nAbility to use analytic data and user testing to inform design decision\nUnderstanding of XHTML / HTML, JavaScript, CSS, XML, or other Web technologies \nAbility to multi task and good time management skills\nAbility to work on their own and as a part of the team\nExcellent testing/ QA skills\nExcellent communication skills (verbal and written) to liaise with various departments locally and internationally\n\n \n  Software Application Developer requirements  \n\n Experience/ Knowledge on web service integration (SOAP, REST, JSON, XML) \nExperience/ knowledge of development using web technologies\nGood understanding of HTML5, JavaScript, jQuery, Ajax and PHP \nGood understanding of OO programming and design patterns \nExperience building web and native apps\nExperience using social media APIs\nUsing GIT version control Excellent debugging and optimization skills\nPHP frameworks (e.g. Zend, code Ignitor), PHP template engines (e.g. Smarty)\nKnowledge of WordPress\nMobile development experience bonus.\n \n\n", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["development", "interfaces", "code", "wordpress", "stores", "testing", "mobile", "ajax", "javascript", "coding", "git", "application", "optimization", "web", "xml", "service", "design", "php", "debugging", "html", "developer", "social media", "support", "programming"]}