{"JOB DESCRIPTION": "Develops information systems by studying operations,  designing,  developing,  and installing software solutions in A S P.N E T,  supports and develops software team. Provides information by collecting,  analyzing,  and summarizing development and service issues.\n Job Description   Must have rich experience in developing solutions using A S P.Net,  C#,  Ajax and M S S Q L. . Minimum 4 years of hands-on experience in designing and developing .Net based solutions using .N E T 3.5,  4.0,  4.5 and Visual Studio2010/ 2012/ 2013 . Must have good exposure to Java Script and J Query . Development and implement supporting database systems using Microsoft S Q L Server 2008 R2 and/ or 2012 would be prefered . Architect,  develop,  and implement M S S Q L Server business intelligence/ data warehouse solutions using S S R S.  Have extensive hands on experience of A P I and Web Services development and integration .. Strong in O O P S and R D B M S . Understanding of various Microsoft technologies and it's integration aspects . Exposure to Software Development Life Cycle processes . Experience working with Agile (S C R U M) team. . Must possess excellent written and verbal Skills . Must be proactive,  creative and enthusiastic team player . Capability to communicate directly with the clients. Should take responsibility for Quality Standards of the Project Developed,  and Timely updation of activity in project management tool.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - System Programming", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["server", "development", "c", "software", "Project management", "SSRS", "developing", "Business intelligence", "microsoft", "quality", "Sql Server 2008", "database", "jQuery", "java", "RDBMS", "web", "service", "Javascript", "Software development life cycle", "ASP.Net", ".net", "agile", "Ajax"]}