{"JOB DESCRIPTION": "Bachelor s degree in computer science, or equivalent     60% and above throughout academics   2-5 years Demandware developers with strong JQuery, JavaScript, Strong Demandware skills, CSS SASS, Aware of Bitbucket Agile process Software Engineer Senior Software Engineer   Job Description   Contributing in all phases of the development life cycle  Writing well designed, testable, efficient code.    Good to have knowledge of Angular or Knockout JS.   Skill Set Required   Strong experience in C# .net, MVC, Angular JS, JQuery, Linq, Entity Frameworks, My SQL, Micro Services.   Immediately available or 2 months notice period Any Other Relevant Requirement Excellent Communication Skills     Extensive development experience in Demandware E-Commerce Platform.    Good understanding of object oriented programming and relational databases.    Comprehensive knowledge base in E-Commerce domains.    Expertise in working with large teams and functioning in the Onsite-    Offshore delivery model following the Software development lifecycle models like Agile.    Mastery of ecommerce implementation specifically on Demandware platform, MVC Pattern and Eclipse.    Deep understanding of the deployment considerations specific to SaaS based cloud server.    Knowledge of SiteGensis Searchcategory landing, PDP pages code flow and pipeline structure.    Hands on experience in executing all phases of software productproject development lifecycle like requirement analysis, estimation, design, coding, testing, production deployment and warranty support.    Comprehensive problem solving abilities, leadership qualities, analytical skills, excellent verbal and written communication skills, willingness to learn, perseverance, process-oriented, adaptive to new technologies.    Ready to learn and explore new technologies and skills.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "demandware", "jQuery", "LINQ", "Coding", "Eclipse", "Agile", "Software development life cycle", "E-commerce", "MVC"]}