{"JOB DESCRIPTION": "    Nature of Job : Remote   We're looking for a Staff Software Engineer to join our core infrastructure group to drive innovation and architectural evolution.         As a Staff Software Engineer, Infrastructure here at PagerDuty, you ll be part of a team that s intensely focused on our internal, external customers and the overall engineering community.         Key Responsibilities       Ingrain yourself into our core product and take the first few months to really learn our product, tech stack and people.    Help set the future technical course for our production systems, technology stack, and architecture.    Be prepared to make technical recommendations across the business and use your past experiences to make key decisions that will have immediate and long term impact at PagerDuty.    Write code, debug issues, and participate in the service and infrastructure design process.    Design for resilient and scalable systems while maintaining consistent delivery of value.    Provide guidance, technical leadership, and mentoring.       About You: Skills and Attributes      Experience with complex web applications    Experience working in microservices or service oriented architecture.    Expert in cloud-based technologies, especially AWS.    Excellent communication and collaboration skills.    Experience in some or all of the following: Elixir, Ruby on Rails, MySQL, Kafka and React.      Minimum Requirements      15 years of experience in software product development.    Extensive experience and contributions in a high growth environment.    Experience with full, long-term service ownership.    Experience with agile, (scrum, lean, kanban) delivery methodologies.    Well rounded, vast and broad experience in different technical environments.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "KPO, Research, Analytics", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["elixir", "Architecture", "MySQL", "Equity", "Infrastructure", "Software product development", "Open source", "Ruby on rails", "Recruitment"]}