{"JOB DESCRIPTION": "Skill - ZOHO developerExperience - 3-6 YrsLocation - ChennaiAbout Kaspon :Kaspon Techworks is a 8 year young emerging software company based in Chennai, India. Incorporated in the year 2012, Kaspon Techworks is in the business of providing services to client to build Smart Technology Solutions with specific focus on Mobility, Chatbot, RPA & IIoT. With a team of over 75 specialized developers, Kaspon provides software development services to its clients for building enterprise applications that add significant value to their businesses.At Kaspon, we have three business units :- Customized Software Development (Projects)- Product Development (SAAS based Products for global clients)- Professional Services (Skills augmentation services for clients)Our team expertise spans multiple technology domains including, Native Platform Mobile App (Android, iOS), Cross Platform Mobile Apps (Xamarin, React Native), ASP.Net, LAMP, J2EE, MEAN Stack etc. At Kaspon, you would experience a professional environment that provides humongous opportunity to learn and freedom to innovate.Skills Required :- Candidate should have good working experience in Zoho CRM / Creator /Zoho product development- Very good experience with ZOHO CRM platforms in configuration, customization, administration and reporting.- Experience in creating and testing application development, using Zoho Creator (HTML, Java and Deluge).- Experienced in development using Zoho Creator and workflow.- Working knowledge on Zoho CRM, Zoho desk, Zoho Creator, Zoho App, Zoho mail and Other Zoho Products, Integration, REST, SOAP APIs- Solid Experience In Zoho Creator tool,Create custom Zoho apps to automate processes- Good understanding of front-end technologies, such as HTML5, CSS3, jQuery and Javascript.- Excellent English verbal communication and written communication.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - ERP, CRM", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Sc in Any Specialization, B.Tech/B.E. in Any Specialization, BCA in Computers", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Java", "Rest", "Software Development", "Front End", "Mean Stack", "Html5", "Javascript", "HTML", "LAMP", "JQuery"]}