{"JOB DESCRIPTION": "      Job Overview:     Reporting to the Test Manager, the Software Engineer in Test works in a small team of testers within the Quality Assurance Team on all stages of the software development lifecycle. Software Engineer in Test works closely with Test Manager, Product and Project Managers, Development and Business Stakeholders to deliver product and project releases.       Responsibilities:     Candidate is responsible for developing Java automation framework for several financial products using Java and Selenium   Troubleshoot, maintain and fix the existing / newly created frameworks   Design, Prepare, Execute and Maintain test cases to perform Manual testing for several applications   Candidate is expected to participate in Scrum meetings and act as QA advocate   Candidate is responsible to build and maintain QA environment including managing CI/CD pipelines   Candidate is responsible for creating test data using SQL and create mock services to test APIs   Candidate should be willing to contribute towards Manual / Functional / any other type of Testing. This will form approx. 20 -30 % of the overall profile.   Flexible to learn new process / technologies as per the team needs & expansion       Qualifications:     Candidates need to have good knowledge on Java and Selenium   Prior experience working on Java development will be preferred   Bachelors Degree in Computer Science or related discipline required   Candidates should have good RDBMS and SQL knowledge   Knowledge on Jenkins or similar CI/CD tools required   Experience of 1 -3 years working in Agile/Scrum setup   Excellent verbal and written communication skills and problem-solving attitude   Candidates with more experience will be considered on a per case basis   Preferably based in Mumbai or willing to relocate to Mumbai      ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "automation framework", "Manual testing", "Manager Quality Assurance", "RDBMS", "ISS", "Software development life cycle", "Selenium", "Test cases", "SQL"]}