{"JOB DESCRIPTION": " Market Intelligence (MI) provides critical data and insight to global asset managers, insurance companies and distributors to help them make informed, strategic decisions to manage and grow their business. Through its combination of proprietary and integrated datasets, in-depth global research and trusted executive engagement, ISS MI delivers solutions for market sizing, competitor benchmarking, product strategy and opportunity identification across a wide range of financial products including funds, annuities, insurance, mortgages, and other instruments. The ISS MI solutions include the industry-leading data platforms Simfund, BrightScope, Local Market Share, and Financial Clarity, as well a full collection of global research and analytics services including Investor Economics, Market Metrics, and Plan for Life.Institutional Shareholder Services  Market Intelligence The ISS Market Intelligence (MI) business provides critical data, insight, and workflow solutions to global asset managers, insurance companies and distributors. Through its combination of proprietary integrated datasets, in-depth global research and trusted executive engagement, ISS MI delivers solutions that drive strategy and data-driven decision making across a wide range of financial products. Overview  This position is part of a development group responsible for developing and maintaining a SaaS platform delivering insights to retirement-focused asset managers. As part of this group, we are looking to hire a python software engineers. You will work primarily in python and will be exposed to various python libraries, python web frameworks, and cloud-based technologies. Responsibilities  Work with experienced team members to conduct root cause analysis of issues and review code Closely collaborate with development and product teams to ensure accuracy and reliability of tools and data Resolve complex technical design issues Participate in software deployment and release management Promote an environment that fosters collaboration, knowledge sharing, and learning Qualifications  Bachelor’s degree in Computer Science or equivalent 2-5 years overall experience working in software development 2+ years of hands-on Python development experience 1-2 years of experience working with some implementation of SQL Experience with git source control Experience developing or working with REST APIs. Experience with cloud hosting services (AWS, Azure, Google Cloud) Ability to effectively communicate and collaborate with global business and technical teams Good to have: Experience with python-based web frameworks (Django, Flask) Experience working with containerization and container orchestration patterns Familiarity with capital markets and mutual industry / data ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["Django", "AWS", "Python", "Software Development", "GIT", "Software Engineering", "Analytics", "Flask", "SQL", "Google Cloud"]}