{"JOB DESCRIPTION": "At least 5+ years of development experience in .Net technologies (C#, ASP.Net, MVC, MVVM, SQL Server). At least 2+ years of Angular development experience Experience in JQuery, HTML5, CSS3, Knockout js, JSON, AJAX, XAML, Razor, Mocking Frameworks Strong Experience in ASP.Net MVCPrior ATM/banking/financial services experience is a plus.Knowledge of the .NET technologies, including Visual Studio, C#, ASP.NET, LINQ, ASMX, IIS, WCF Web Services, and ADO.NET. Ability to work in a collaborative team environment with project managers, developers, designers and IS to develop, implement, and maintain corporate web sites and applications that adhere to brand standards and strategiesFamiliarity of database driven environments. Capable of working with tight deadlines. Understanding in working with third party APIs. Proven ability to successfully deliver high-quality, complex systems using Software development methods, independently as well as in a team environment. Must demonstrate strong analytical skills with the ability to identify problems and generate practical solutions in a logical manner. Experience with TFS and source control. Experience in Mobile implementationExperience in cross-browser compatibility, accessibility and web standards. Good understanding of mobile and tablet site development and testing. Solid understanding of object-oriented programming (OOP) Ability to multi-task and manage multiple projects simultaneouslyExperience with.Net framework version of 4.x plus preferred Ability to work in team in diverse/multiple stakeholder environment Experience and desire to work in a Global delivery environment Analytical and communication skills ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Other", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["C#", "XAML", "LINQ", "MVVM", "SQL Server", "ASP.Net MVC", "JQuery", "Angular", "Angular js", "ADO.Net", "Javascript", "WCF", "MVC", "Ajax"]}