{"JOB DESCRIPTION": "Senior Software Engineer Java  /  J2EE  /   Backend Technologies Development   /   QA\n\nApptarix is looking out for high quality hands    -    on Development and QA professionals in Java  /  J2EE  /  Backend technologies.\n\nSenior Software Engineer     -     Development: Responsibilities: Work with product owners day to day in an agile team    ,     understanding and transforming requirements and backlog items into design and code. Create Unit test cases and implement Unit test code. Design and implement new and existing components at rapid pace. Ability to understand 3rd part REST services API and establish contant integrity and alignment with the product. Work at startup pace    ,     learn cotinuously and add value to the scrum team. Senior Software Engineer     -     QA  /  Testing: Generate test cases from SRS    ,     product backlog and sprint backlog Prepare test plans and perform functional testing    ,     system testing    ,     load testing    ,     performance testing    ,     etc. Document all test cases and results of testing. Automate test cases on a conitunous basis. Requirements & Qualifications: \n\nEducation: \n\nBE  /  BTech  /  MTech in Computer Science and Engg from a good school. Experience and skills: \n\n4    -    5 years of experience on Java  /  J2EE  /  Webservices Development and Testing Strong experience and knowledge of RESTful Web Services. Strong experience  /  competency using the following technologies and tools: JAVA    ,     JPA    ,     EJB 3.0    ,     RESTEasy    ,     Hibernate    ,     Maven    ,     JUnit    ,     SVN    ,     JIRA    ,     Eclipse IDE. Strong experience  /  competency using the following technologies and tools: HTML5    ,     CSS3    ,     JavaScript and JS frameworks like JQuery    ,     AJAX    ,     JSP    ,     JAVA    ,     Spring MVC    ,     REST services API    ,     JSON    ,     Maven    ,     JUnit    ,     SVN    ,     JIRA    ,     Eclipse IDE. Experience working with web servers like Tomcat    ,     JBoss    ,     Apache is desirable. Excellent communication skills. Exposure to different testing methodologies. Exposure to testing tools like Selenium    ,     QTP etc. Good to have Performance testing exposure using JMeter or LoadRunner. Familiarity with rational software tools will be an advantage. Innovative approach to work    ,     constantly looking for upgrading the system to more efficient and effective new technologies.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["Tomcat", "software", "html5", "QTP", "tools", "spring", "java", "selenium", "web", "design", "j2ee", "json", "backend", "mvc", "api", "Ajax", "jira", "rest", "Hibernate", "development", "btech", "JBoss", "JSP", "maven", "testing", "Apache", "javascript", "quality", "eclipse", "Web services", "jQuery", "scrum", "agile", "EJB", "css3"]}