{"JOB DESCRIPTION": "   Your Role     A Software Development Engineer in Test (SDET) is a developer with the primary responsibility of writing frameworks and tools to test products. It is a very unique and challenging role and provides immense opportunity to design and develop wide-reaching tools. It combines the \"building\" aspect of software design engineering with the \"breaking\" aspect of software test engineering. You ll be writing code that automatically verifies the quality of the product. That means that you potentially write more code than the developers.    SDETs are able to understand software internals, debug code, automate repetitive tasks, and implement new tools and frameworks needed to streamline our quality process. In the Loginradius SDETs works directly with both Software Development Engineers and Quality Assurance Engineers to understand project features, review technical designs, and implement automated test tools that help deliver quality features with efficiency. Our SDETs understand customer usage models and are able to develop test plans and test cases that approximate real-world environments and scenarios.      Job Responsibilities      Min 2+ years of experience in automating Web application which is development driven.      Must be Expert in web automation framework: Selenium      Should possess Strong Programming Fundamentals.      Expert in Automating web applications using selenium with Java and Node JS.      Experience in API Test Automation.      Performed Automation Testing of Rest API using RestAssured Framework.      Tested REST API's of application and automated using Selenium.      Should be able to conduct code review, able to pinpoint logical issues in code under test, should be able to create test case scripts and their execution should be able to do Unit Level testing as per the need of the Project/ Product development.      Detail-oriented with strong analytical, communication, problem-solving, and organizational skills.      Developed, documented, and maintained detailed test cases, user scenarios, and test artifacts.      Should have worked in BDD environment as SDET.      Educational Qualifications:      A Bachelor's or Master's degree in Computer Science and 2+ years of experience as a Developer or SDET.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "automation framework", "Software design", "Automation testing", "Manager Quality Assurance", "Analytical", "Agile", "Selenium", "Test cases"]}