{"JOB DESCRIPTION": " The appointee will work on a number of financial modelling and software development projects as and when the projects are assigned to this person. An initial list of such projects is set out below. The appointee will also carry out client facing marketing and support activities (listed under Other Projects).  Modelling Analysis and (Software) Product Development   Tasks include the following points, which is an indicative but not complete list:   The appointee will be working directly with the Managing Director and also interact with the rest of OptiRisk?s development and support team.  From time to time the appointed person will be required to work at the offices of the client with the technical team.  During the first two months of employment,the new appointee will be given training.  Other Projects:  The appointee will give technical support to the company?s client in New Delhi ? one of the largest investment and wealth management service providers in India.  Similarly, for a second client based in Gurgaon, the appointed person will provide support to their team and company, who are a well established Hedge Fund.  The appointee will provide support for online or offline training sessions (with our sister company UNICOM Seminars).  The appointee will also work closely with a small team of developers who are based in the UK, India, Italy, Germany and Brazil. Responsibilities can include development, testing and analysis of financial trading products.  The appointee will be required to work to tight deadlines and report on progress and deliverables on a regular basis.  Skills/Requirements:  Must have knowledge or interest in the Finance and Investment industry.  Bachelor or equivalent degree in Economics, Statistics, Mathematics, Computing, Engineering or a science degree. Masters qualification is preferred.  Experience with programming languages such as Python and R. Additional knowledge of other programming languages is desirable.  Ability to work independently and take initiative on assigned tasks.  Ideal Candidate  The ideal candidate will have a postgraduate degree in computing, mathematics or economics from a Tier 1 Higher Educational Institutions (HEI) in India. He or she would have 1 ? 3 years? work experience, preferably with industry experience in Financial Services. Graduates of other quantitative disciplines but looking for an early career move to computational finance may also apply. The candidate is also expected to possess ability and passion for problem solving, abstract reasoning and commitment to achieve results and career development. ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Career development", "Project development", "Wealth management", "Programming", "Software product development", "Research Analyst", "Financial modelling", "Technical support", "Financial services", "Python"]}