{"JOB DESCRIPTION": "  Nature of Job:   Remote    Job Description     Amplified IT us looking for an experienced   Senior Software Engineer.   This will be reporting to the Software Engineering Lead and working closely with the rest of the Product Development team to deliver products and services that have an impact on Education. You will work across a full stack of modern web technologies such as web applications, G Suite add-ons, and Chrome extensions. We integrate tightly with Google s G Suite tools and the full range of APIs available, using Apps Script, Angular, Node.js, Express and a wide range of Google Cloud Platform services.        Role & Responsibilities:       Collaborate closely with our distributed/remote Product Development team, in particular, the Edinburgh-based Lead Software Engineer    Analyse, develop, test and release products features, enhancements and improvements, working across the full technology stack.    Work within a agile/scrum-inspired team on a range of software product development projects    Facilitate innovative design and delivery of solutions to challenging technical issues through information gathering and collaboration    Participate in conversations about product roadmap, the technology stack and product development process    Assist in guiding and mentoring software engineers on technology best practices       Ideal Qualifications:       You have 5 years of experience on a production web application development team, including exposure to APIs, with attention to performance    You have a strong grasp of web development fundamentals and patterns that allow you to produce clean, maintainable code; delivering new features and enhancements while improving product scalability and general performance    You are able to analyse bugs, even without looking at the code, using your intuition and experience    You communicate well and have creative problem solving skills    You have strong technical knowledge in current fullstack technologies including but not limited to Javascript, CSS and HTML5, serverless computing, relational and NoSQL databases, Node, Express    You have a solid understanding of Angular (or other MV* frameworks) and ability to write clean, concise, and maintainable code    You have experience using deployment workflow and task automation processes       Nice to have:        Experience building product integrations with Google APIs and/or Google Apps Script    Visualisation frameworks (e.g. d3.js)    Experience working with geographically distributed teams    Experience working within a CI/CD process    Experience with broad range of testing technologies and solutions   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Web application development", "Automation", "NoSQL", "google apps", "Web development", "Javascript", "Manager Technology", "Workflow", "Healthcare", "Software product development"]}