{"JOB DESCRIPTION": "Sr.  Software Engineer (. NET MVC) B. E. / B. Tech. / M. E. / M. Tech/ MCA\nKey Skills:  \n. Net Entity Framework,  MVC4/ 5,  jQuery,  JavaScript,  SQL server -  2012, 2014\nDescription:  \nSuccessful candidate will be responsible for the design and implementation of projects with n- tier application architecture.  Candidate should have experience of software development lifecycle,  including the analysis,  design,  test,  implementation,  and maintenance of software systems.  \nThe right candidate will be able to clearly demonstrate their ability to deliver complete product solutions.  This engineer must be able to demonstrate an ability to organize and establish feature and functional direction and ultimately deliver solid,  reliable product features and components to market.  \nQualified candidate needs to possess excellent skills in oral,  presentation,  and written communication,  the ability to solve complex system designs with innovative and elegant designs and solutions and the ability to think outside of the box within a dynamic and fast paced work environment.  \nCandidates must be willing to work at odd hours,  suitable to client's time- zones whenever required.  \nJob Summary:  \n Must have very sharp knowledge of MVC 4, 5 \n Must have sound knowledge on Sql server 2012/ 2014.  \n Should have knowledge about Entity framework,  JQuery,  JavaScript,  WCF,  WebAPI.  \n AngularJs and KnokoutJs experience prefered.  but not required.  \n Should be able to communicate with client.  \n The person should be very sharp in communication and proactive.  \n The person should be flexible to work with team as team player", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Senior Design Engineer", "server", "development", "software", "Entity framework", "application architecture", "Business Executive", "SQL", "jQuery", "application", "design", "Javascript", "Software development life cycle", "MVC", "WCF", "net", "angularjs"]}