{"JOB DESCRIPTION": "            A LITTLE BIT ABOUT YOU                  You will be part of the Video Platform Team which is responsible for building and maintaining various video products.                  QUALIFICATIONS:                   Strong computer science fundamentals: data structures, algorithms, design patterns, distributed systems and OO analysis & design.                  In - depth expertise on Core Java & Java EE conceptual and programming skills.                  Experience working with Java 8 Streams API and Functional Interfaces.                  Must have in - depth experience with test driven development processes using frameworks like JUnit/TestNG and Mockito.                  Experience in working on RESTful web services development & with frameworks like Spring Boot / Dropwizard, etc.                  Experience in working with RDBMS like Oracle / MySQL / MS - SQL.                  Working expertise on any NoSQL data stores viz. Key - Value stores (Redis, AWS Dynamo DB) / Document DBs (Mongo DB / Couch base).                  Ability to build configuration scripts using tools like Ant / Maven.                  B.E / B.Tech / BCA/ MCA in Computer Science, Engineering or a related subject.                  Ensure that development progress is within expected guidelines and is completed on time.                  Smart + Exceptional written and verbal communication skills                  Ability to maintain an upbeat and positive attitude at all times                 Ability to work in self - directed, fast - paced (nimble) environment                  Bonus Qualifications                   Experience with Big Data technologies like Spark, Hive, Hadoop.                  Experience with Scala, Reactive Programming.                  Experience in working with search platforms like Lucene / Solr / Elastic Search.                  Experience in working on public cloud environments like AWS, Azure w.r.t. solutions development,                  deployment & adoption of cloud based technology components like IaaS /PaaS offerings         ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Core Java", "MS SQL", "Software development methodologies", "Concept development", "PAAS", "MySQL", "Data structures", "test driven development", "Oracle"]}