{"JOB DESCRIPTION": "Job Title/Designation:Java Cloud developer (IB Technology) Information Technology (IT)Job Reference # 213756BRCity-PuneJob Type-Full Time Your role :\"Been out of the workforce for two or more years and ready to come back? Already built a career in financial services (or in a transferable role) and want to take the next step on your career path? We recognize the added value that experienced talent brings into our workplace. And we also know that its not always easy to find the right work opportunity after a career break. Thats where UBS Career Comeback comes in to help make the transition back to work a success. Find out more about the program under ubs.com/careercomeback.\"Do you want to design and build next generation business applications using the latest technologies?Are you confident at iteratively refining user requirements and removing any ambiguity? Do you like to be challenged and encouraged to learn and grow professionally? Were looking for software engineers to: • provide technology solutions that will solve business problems and strengthen our position as digital leaders in financial services • analyze business requirements for the IB Derivatives and Solution group, sales and trading applications• design, plan and deliver sustainable solutions using modern programming languages • providing technical expertise and recommendations in assessing new software projects and initiatives to support and enhance our existing applications• conduct code reviews and test software as needed, along with participating in application architecture and design and other phases of SDLC• see that proper operational controls and procedures are implemented to process move from test to production.Your team :You'll be working as part of Derivatives & Solutions team based in Pune. This team is one of a community globally, so collaboration is essential and is actively managed. We are responsible for systems used by the Derivatives & Solutions business. There are a number of applications in this area which are used on the trading floors in London, New York and Hong Kong. Your team delivers change and third line support on one or more of these systems which manage OTC and ETD trades and products both Equities & FX.Your expertise :• 9+ years hands-on experience in the development, design, maintenance and integration of software solutions • proficiency in core Java programming, Spring framework• provide complex cloud based solutions• familiar with automated testing, acceptance testing, TDD, BDD• good understanding and usage of DBMS'• experience working with complex applications with multiple stakeholders in a fast paced environment globally • strong analytical and problem-solving skills, you like to figure out how things work• the ability to resolve production issues escalated to you• experience with the full software development life cycle predominantly with agile methodologies • experience improving older code bases as well as in using modern design patterns• strong written and verbal communication skills in English, and the desire to work together with stakeholders• excellent research, investigation and evaluation skills • experience in the financial services industry desirable but not essential.", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["Group Sales", "Core Java", "Software Development", "Bdd", "Design Patterns", "TDD", "Programming", "Spring Framework", "Automation Testing", "DBMS"]}