{"JOB DESCRIPTION": "  Job Description:        The resource will be trained across various automation platforms to acquire skills of an automation engineer whose automation and programming skills can be leveraged in projects. Experience: 4-6 years    Job Location: Trivandrum Willing to travel and relocate to Dubai if required. Responsibilities:    Manage and drive a small team of development, testing and support resources   Design, build, and maintain efficient, reusable and reliable code   Ensure the best possible performance, quality and responsiveness of applications    Identify bottlenecks and bugs, and devise solutions to mitigate and address these issues   Technical Skills:    Strong knowledge of .NET framework   Proficient in C# and/or VB.NET   Strong understanding of object-oriented programming   Skill for writing reusable libraries   Familiarity with Microsoft SQL Server   Experience with popular web application frameworks PHP, jscript   Knack for writing clean, readable, and easily maintainable code   Understanding of fundamental design principles for building a scalable application   Experience in agile development practice   Personal Skills:    Works independently under limited supervision and applies knowledge of subject matter in Applications Development.   Possess sufficient knowledge and skills to effectively deal with issues, challenges within field of specialization.   Ability and drive to take complete ownership of project through the software development lifecycle.    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Automation", "MS SQL", "VB.NET", "development testing", "Agile development", "Web application", "Software development life cycle", "Programming", "PHP", "Object oriented programming"]}