{"JOB DESCRIPTION": "  Job Title: Senior Software Engineer     Department: Infinity Team     Location: Hyderabad, India   Position Summary   Do you want to be a part of the Infinity brigade which is powering Temenos growth Do you want to build V1 products which are driving the Fintech revolution in banks and credit unions across the world   Come join the Infinity Engineering Team and help solve complex technical problems and deliver next generation banking experience in products which are used by millions of consumers.  Skills    Required     3 - 7 years of experience in software industry   BTech/MTech/MS/MCA equivalent in Computer Science/Electronics from a reputed university   Strong coding skills in any high - level language is a must.   Experience in shipping enterprise products, cloud services or web/mobile UI applications to a large customer base   Should have excellent analytical and problem - solving skills with an ability to learn new technologies quickly   Good communication skills         Nice to have     Experience of working on Mobile technologies, including native development (iOS/Android is a big plus).   Knowledge of REST, XML, JSON services   Breadth of experience across various web server and web/mobile UI technologies such as JavaScript, JavaScript MVC Frameworks, Java/Spring Web Services and Java MVC Frameworks.   Prior knowledge of Kony framework - Kony Visualizer and Kony Mobile Fabric.   Experience on scalable and highly available multi - tenant web services is highly desirable.   Responsibilities    Own the design, development, testing and shipping of features in the banking space.   Collaborate with other members on the team to effectively deliver high quality features.   Ability to hold a high bar on quality of everything which we release.   Mentor junior members. Do design and code reviews for peers.   Continually look for ways to improve our engineering systems and processes  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["Computer science", "Web services", "development testing", "Coding", "XML", "Analytical", "Javascript", "JSON", "MVC", "Android"]}