{"JOB DESCRIPTION": "  JOB DESCRIPTION    As a Sr. Software Development Engineer in Test, you will be instrumental in Vertafore s ongoing success within the insurance industry. Our SDETs work with our development teams, focusing on the providing the best products for our valued customers. This is a fast paced, ever changing environment. We continually challenge ourselves to exceed objectives, remove barriers, meet crucial deadlines, and maintain multiple projects, all while pioneering ways for efficiency with a team player attitude. If you have a passion for product quality, love technology, and enjoy thinking outside the box, you are who we are looking for.    Core Requirements and Responsibilities:     Essential job functions included but are not limited to the following:   Create testing and automation strategies and approaches in alignment with overall organizational goals   Write test cases   Establishes overall test infrastructure, creates and coordinates test systems   Coordinates testing across products and establishes best practices   Reviews testing documentation provided by others on the team, providing feedback and integrating documentation  Skills/Requirements    Knowledge, Skills and Abilities:     Genuine hands on Coding experience with 2+ years of experience.   Good Experience with Java 8 or above.   Experience with SQL Server.   Experience with Cucumber.   Experience with JMeter is a plus.   Experience with Version Control, Code Collaboration, and Continuous Integration and Continuous Deployment Pipelines.   Good Knowledge of API testing tools.   Experience using various bug tracking tools such as Rally, and test management tools such as qTest.   Experience with Agile software development.   Bachelor s degree in Computer Science (or related technical field) or equivalent practical experience   Test automation experience   Design and architecture knowledge   Experience with Agile software development    Qualifications:     Bachelor s degree in Computer Science (or related technical field) or equivalent practical experience.   2 to 4 years professional experience as SDET or Developer.   Ability to define problems, collect data, analyze data, establish facts, and draw valid conclusions.   Ability to manage a broad range of deliverables in an ever-changing environment.   Ability to communicate and work effectively with cross-functional teams.   Ability to comprehend documentation clearly and effectively.   Excellent verbal and written communication skills.   Working knowledge of OOP coding concepts.   Strong time management and organizational skills.   Detail oriented; demonstrated ability to handle multiple strategic projects and priorities with efficiency and accuracy.   An inherent drive to solve problems, collaborate with others and mentor team members.    Strong presentation, verbal and written skills as proven with well-written technical, project, client and related communications and presentations.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Insurance", "FUNCTIONAL AREA": "IT Software - QA & Testing", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Product quality", "Automation", "Product innovation", "Manager Technology", "Infrastructure", "Test cases", "Management", "Testing"]}