{"JOB DESCRIPTION": " As a Staff Software Engineer you will develop high performing, scaling and innovative end-to-end applications. You will collaborate extensively with system engineers, product owners, subject matter experts and various product stakeholders to create unique products. You will implement solutions that are aligned with our future and extend shared platforms and solutions.      As a Staff Software Engineer, you will be responsible for:            Developing high performing, scaling and innovative end-to-end applications to create exceptional products for our business          Collaborating with cross-functional technical teams to implement solutions that extend shared platforms          Applying software development life-cycle principles and methodologies such as Agile and Kanban, to continuously improve our code and processes          Writing solid code to meet our standards and to deliver functionality and enhancements          Building features such as services and queries on existing tables to improve availability          Implementing core data structures and algorithms through effective and robust coding        To be successful in this role you will:            Have a Bachelor's Degree in a related field and demonstrate good, relevant, professional experience          Have good knowledge of .NET technology stack in C#          Demonstrate experience in writing code that meets standards and delivers improved functionality          Be a self-starter, proactively taking the initiative to solving problems and providing resolutions          Show experience of driving code reviews with your team          Be able to take the initiative to analyse and explore alternate design ideas and approaches to creating solutions          Be skilled in core data structures and algorithms and implementing them          Show experience in developing Object-Oriented software with excellent OOP concepts    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Oil and Gas, Energy, Power, Infrastructure", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Training", "Coding", "Finance", "Agile", "Software development life cycle", "Manager Technology", "Data structures", "Monitoring"]}