{"JOB DESCRIPTION": "  Job Description    Summary   Perform all kinds of software testing. Create high-quality QA deliverables. Work in Scrum environment. High collaboration with cross-functional teams with to ensure high quality release and with in committed schedule.       Job Description   Educational Qualification : B.E./B.Tech/M.Tech/MCA   Experience : 4-8 Years    Active participation in testing cycle of the software development lifecycle (requirements gathering, prototyping, design review, test case reviews) using Agile Methodology.   Working closely with Product Management, Program Manager, Development Team and Support teams to create and deliver a quality-focused QA deliverable.   Develop & execute functional, integration and E2E test cases to validate business, system and operational requirements.   Work closely with different functional groups to resolve issues, ensure thorough testing from a business perspective, understand support issues and release high quality products to customers   Interprets product design and requirements to engineer test approach and generates test plans and test cases/scripts along with its review.    Executes complex test cases/scripts and interprets/analyses results to report, communicate, and work through issues with software engineers.     Experience in Advance level database testing using MSSQL Server 2008.      Excellent verbal and written communications skills, and able to communicate very technical subject matter to non-technical users.      Experience in writing quality bug reports.      Experience in creating Quality Management System (QMS) documentation as per organization quality standards.      Strong Troubleshooting skills for reaching to root cause of customer reported issues.      Experience in HL7/healthcare domain will be advantageous.       ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Medical, Healthcare, Hospitals", "FUNCTIONAL AREA": "IT Software - QA & Testing", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Product management", "Design review", "Software development life cycle", "Healthcare", "Scrum", "Product design", "Agile methodology", "Test cases", "software quality", "Troubleshooting"]}