{"JOB DESCRIPTION": "Jobs for Hardware Engineer | Openings for Software Engineer |    Urgently required embedded hardware/software engineer for Borivali (W), Mumbai. Candidate should have BS degree in related engineering field with 1-2 plus years experience, Shown keen interest in embedded systems by taking part in competitions, developing prototypes, products, or projects as a personal hobby design, development, testing, and support of low-level embedded software and hardware, pcb layout and design good at embedded C Linux software development and interface with hardware very comfortable with micro controllers, microprocessors, embedded systems, and architectures like ARM, AVR, STM32, etc. good at communication protocols like MODBUS, Ethernet, UART, RS232, SPI, etc. programming skills in some languages like C/C++, Linux, Java but definitely an expert in one programming language knowledge and previous implementation with actuators and motors demonstrated knowledge with oscilloscope, lab view, and other electronic equipment and basics Familiar with open source tools, PC, and Mac Enjoys working in teams and good communication skills Plus A MS degree in related field of engineering signal processing, pattern recognition, MATLAB, simulink control theory and algorithms. Candidate should have experience in any specific industry robotics, embedded hardware/software solutions, mechanical, aerospace, electronics/electrical, sensors etc. Salary as per industry standard.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - Embedded, EDA, VLSI, ASIC, Chip Design", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["algorithms", "development", "software development", "c", "information technology", "software", "developing", "spi", "mac", "layout", "ethernet", "java", "embedded software", "sensors", "linux", "embedded c", "design", "support", "embedded", "programming", "hardware"]}