{"JOB DESCRIPTION": "  The Role        We are seeking Java / Bigdata Engineer     Responsibilities     Hitachi is looking for a talented Software Engineer to develop and maintain all parts of the Pentaho Community and Enterprise software suite. Qualified individuals must have a solid background in the fundamentals of computer science,  and some background in distributed computing,  large scale data processing,  performance tuning and user interface design. The successful candidate will work with architects,  product management,  usability,  quality,  documentation,  and the open source community to enhance and advance all portions of the Pentaho software suite.     REQUIRED SKILLS     Professional experience in troubleshooting,  maintaining,  or developing data-driven applications connected to relations databases,  XML sources,  web services,  flat file,  and big data driven backend system.   5+ Years experience in Java Object Oriented Software Development   Experience with multi-threaded / multi-user server-side software development   Experience analyzing code performance and implementing performance improvement.   Experience with software development best practices and design patterns   Experience with web service technologies (REST,  JAX-WS,  etc.)   Experience with scalability analysis and performance monitoring and measuring techniques   Experience with Windows and Unix/Linux   Experience with build related tools such as Maven,  Ant,  and/or Ivy   Experience with testing frameworks such as JUnit and Mockito   Must be able to quickly understand technical and business requirements and be able to translate into technical implementation   4-year University degree or equivalent in Computer Science or related field   Reliable,  self-motivated,  and focused on high quality delivery of work products   Skilled in navigating the dynamics of working as part of a team   Excellent written and verbal communication skills in a team environment     DUTIES     Develop and test Java software components and classes as part of the Engineering Team using the Scrum development process   Assist the technical support team in the isolation and resolution of customer issues   Author developer documentation and participate in the development of end-user documentation   Mentor and advise junior team members   Communicate effectively with technical and non-technical members of the project team   Support consultants,  partners,  and the open source community   Simultaneously handle multiple tasks and projects     DESIRED SKILLS     Experience with modular software and services management frameworks such as OSGi and Spring   Experience working with Data Integration / ETL and Big Data concepts   Knowledge of Business Intelligence concepts including ETL,  OLAP,  and Reporting   Experience with JavaScript MVC frameworks (Backbone,  Angular,  Ember,  Knockout)   Experience with RDBMS systems such as MySQL,  PostgreSQL,  H2,  HSQLDB,  Oracle,  SQL Server   Understanding of agile or other iterative software development methodologies     Qualifications     Any Engineering Graduate     We are an equal opportunity employer. All applicants will be considered for employment without attention to age,  race,  color,  religion,  sex,  sexual orientation,  gender identity,  national origin,  veteran or disability status. ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Consumer Electronics, Appliances, Durables", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Unix", "Linux", "XML", "MySQL", "Javascript", "Windows", "MVC", "Business intelligence", "Troubleshooting", "Technical support"]}