{"JOB DESCRIPTION": "     Responsibilities include:       Understand / apply reusable code design, leverage application architecture/ framework capabilities and functionality, and design/ develop solutions that are highly reliable, scalable, and perform to meet business-defined service levels      Work with Product owners to help shape the direction of the product based on a combined knowledge of what's technically feasible and what is desired by the end user.      Contribute to the technical code using Progress Programming Standards and design documentation.       Software Development Experience 3 - 6 years:       Very strong in Basic progress 4 GL and Hands-on Progress 4GL experience with versions 10.x. or 11.6      Experience in developing and debugging application using progress ADM2      Experience in Appserver, technology would be an advantage.      Thorough knowledge of Progress architectures      Mature design, coding, testing and debugging skills       Tools & development methodologies:       Experience with Confluence / JIRA / Mercurial      Experience with agile development processes, specifically SCRUM      Understanding of Object Orientated Analysis and Design and Component analysis      Working knowledge of software development methodologies      Have an open attitude towards sharing ideas and knowledge.      A proactive approach to problem solving, taking ownership of issues and having the determination to follow things through.      An ability to balance multiple time-critical tasks at the same time.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Printing", "Software development methodologies", "Coding", "Agile development", "Mercurial", "Debugging", "Scrum", "application architecture", "JIRA", "Progress 4GL"]}