{"JOB DESCRIPTION": "We are looking for interested & talented PHP Senior Software Engineers to join our team. Candidates should enjoy working in a challenging environment; have the enthusiasm and ambition to develop & complete projects to the highest standard and want to be part of an organization that puts technology at the heart of everything it does. Candidates with 2 to 3 years of experience in PHP software development will be considered.   What are we looking for ?    Dynamic Engineers /   Graduates & Post Graduates with 2 to 3 years of experience in the IT development section  Exposure to object oriented programming & with good analytical skills  Good technical knowledge & experience in PHP,  MySQL,  JQuery,  JS & AJAX  Experience in any of the opensource frameworks /   CMS such as WordPress,  Joomla,  Drupal,  Magento (or) MVC frameworks is an added advantage  Experience in database design & functional design  Experience of the full software development lifecycle from business  Systems analysis,  thorough requirements gathering and functional specification authoring,  to development and testing.    Responsibilities    Communicate with the client for requirement analysis  Perform a technical analysis of requirements & to prepare detailed technical design  Handle the team of developers /   mentoring the juniors by task briefing,  review the tasks & giving feedback  Preparation of external documentation such as Requirement Specification,  User Manual,  System Manual,  Technical documentation  Developing the internal documentation such as Project Plan,  Database design,  Functional design     Essential personal characteristics:    Teamwork,  Planning & Organizing,  Quality.  Able to Communication with Individuals at various levels.", "ROLE": "Software Developer", "INDUSTRY TYPE": "Oil and Gas, Energy, Power, Infrastructure", "FUNCTIONAL AREA": "IT Software - System Programming", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Drupal", "jQuery", "Database design", "MySQL", "Software development life cycle", "PHP", "MVC", "Joomla", "Ajax", "Technical documentation"]}