{"JOB DESCRIPTION": "At AMD,  we push the boundaries of what is possible. We believe in changing the world for the better by driving innovation in high- performance computing,  graphics,  and visualization technologies building blocks for gaming,  immersive platforms,  and the data center. \n\nDeveloping great technology takes more than talent: it takes amazing people who understand collaboration,  respect,  and who will go the extra mile to achieve unthinkable results. It takes people who have the passion and desire to disrupt the status quo,  push boundaries,  deliver innovation,  and change the world. If you have this type of passion,  we invite you to take a look at the opportunities available to come join our team.\n\nResponsibilities Demonstrate flexibility,  strong motivation and a proven record of meeting aggressive deadlines as well as the ability to work as part of a team\n\nMust have proven abilities to solve critical software problems,  and will be working with innovative managers and engineers to engineering the cutting- edge AMD software solutio.\n\nAs a senior member of the team,  you will also be responsible for code reviews,  creating unit tests,  authoring detailed documentation related to your work,  and working with on- site and off- shore teams to deliver the software solution on schedule.\n\nWill also be required a role in all phases of the software development as senior member that include system requirement analysis and coordinating feature design and developments with other departments.\n\nJob Description \n\nPrior experience with MATLAB modeling Mandatory.\n\nThorough with Audio/ Video Signal processing details.\n\nStrong skill on C programming is mandatory.\n\nPrior experince with TI or Cadence DSPs and debug tools is necessary\n\nStrong analysis and problem solving skills required\n\nProven interpersonal skill,  technical leadership and teamwork required.\n\nSolid knowledge of the software development lifecycle required.\n\nMust be fluent in both written and spoken English.\n\nPrior leadership responsibilities preferred.\n\nExperience working with off- shore teams necessary\n\n#LI- GM1\n\nRequisition Number: Job Function: Software Engineering", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Graphics", "Signal processing", "Software development life cycle", "Technical leadership", "Programming", "high performance computing", "Windows", "MATLAB", "Gaming"]}