{"JOB DESCRIPTION": "  What part will you play!      Engage in continuous automated and manual testing activity throughout agile development iterations to ensure zero defects   Participate in iteration planning, providing input on required testing tasks, process, and associated effort for the selected user stories   Create and manage bug reports, ensuring they are clearly communicated to the team and addressed in a timely, thorough, and satisfactory manner   Design and develop automation framework   Ensure quality of design and code through design reviews/code reviews and help in building TDD/BDD culture in the team   Be updated on the latest testing techniques, strategies, testing tools/ test frameworks   Design the required test strategy in line with the scope and organization standards     Use your skills to move the world forward!      We need a professional with 4 to 6 years of experience in Software Development and Test Automation   Expertise in programming with C#, java script, Angular, NodeJS, WPF and OOPS, API Testing Tools - Postman, Newman, Katalon, SOAPUI and UI testing Tools - Ranorex.   Knowledge on Industrial Automation Domain, Test Automation, Library creation and Test Automation Framework design for system test and integration test would be preferable.   Exposure to Testing Methodologies and awareness of the Test Execution Process would be good to have.   Requirement analysis, design and delivery of the Test.   Developing and providing inputs for Test Planning, Automation Test Framework Development, Test Case Execution, Test Report generation and distribution.   Coordinate and set up the test environments for different types of tests, which involves configuration the product under test.    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["automation framework", "Framework design", "Automation", "Automation testing", "Manual testing", "Test strategy", "Testing tools", "TDD", "Test execution", "WPF"]}