{"JOB DESCRIPTION": "  About the Role:    The position is for a senior engineer with solid experiences in big data related technologies. A successful candidate for this role will have a service-oriented mentality and possess a strong sense of ownership of the problems/requests assigned. The role will focus on evaluating technology solutions; building up and enhancing the platform; and offering solutions and to our business users.     Roles Responsibilities:     The new team member will focus on closely working with application teams in understanding their requirements, review application design, and   provide best practices/ infrastructure solution   as well as application integration with MapR cluster.    Provides and reviews application   performance tuning  , and   capacity planning   as well as storage management. Ensuring application teams leveraging the right tool set and using them effectively.    Responsible for   POCs   including enablement of brand new tool or services into the lake.    Performs root cause analysis, preparation of test data, testing, and remediation efforts.    Support existing application teams with monthly new releases, issue resolution all the way, until they go to production.    Application Migrations from legacy clusters to brand to clusters.     Qualifications:       Deep understanding of Big Data and Hadoop architecture.    Strong experience in Hadoop and its related technologies like   Map Reduce  ,   HDFS  ,   Spark  ,   Kafka  ,   MapR Streams   and   Hive    At least seven+ year hands on development experience and expertise in a combination of   Java, Scala, Perl, Python, and Unix Shell Script    Solid experience in NoSQL databases like   HBase, MapR DB MongoDB    Experience in   designing and developing technical solutions   with big data technologies    Proven track record of strong verbal/written communication and presentation skills, abilities to articulate technical solutions to both technical and business audiences    Excellent planning, project management, leadership and time management skills    Abilities to work independently    Delivery focus and willingness to work in a fast-paced, mission-critical production environment     Hadoop Certification   is preferred.    Experience with Private and public cloud technologies (  AWS, Google cloud  ) Optional great to have.    Exposure to banking domain is a plus   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Unix", "Performance tuning", "NoSQL", "Storage management", "Project management", "Perl", "MongoDB", "Python", "Capacity planning", "HBase"]}