{"JOB DESCRIPTION": "  Position summary     Evolent Health is looking for a Software Engineer to be a key member of the technology leadership team. This individual will play a critical role in executing Evolent Health s mission by architecting, developing and maintaining technical processes around the .Net platform assets to ensure success in terms of both revenue and timely release of current and next generation products and capabilities.     Resource should have 3-6 years of experience need at software engineer level   Resource should be good at C#, .Net core , Entity framework.   Resource should able to write complex LinQ queries.   Resource should understand and write basic SQL queries.   Develop software using known best practices such as Unit Testing, Continuous Integration   Microservices and basic Azure knowledge will be added advantage.          Essential functions        Be a part of an application development IT shop through the requirement, design, development, QA SDLC cycles with a focus on C#, ASP.NET, associated web technologies, and relational database technologies   Lead aspects of our services based solutions and internal applications to ensure consistency, quality, architectural integrity, scalability, and availability   Hands-on engineer who will support client implementation during design, development and maintenance of Evolent s core platforms. This include web applications, services and data management routines.   Investigate and integrate advances in software engineering technology and practices into the overall development process; these areas should include, but are not limited to programming languages, relational database systems, application frameworks, software processes, software automation, and system optimization scaling   Help to resolve questions of program intent, software requirements, and inclusion of internal checks and controls   Develop software solutions using industry best practices and in the area of security and performance in an web and SOA architecture environment   Collaborates with team and business owners in the development andor execution of all types of software development considering the objectives of the organization   Participate in the full systems life cycle with solution design, development, implementation, and product support using scrum and other agile methodologies.   Maintain source-code repository, and participate in deployment of code into production.   Help explore and implement new technologies.   Develop software using known best practices such as Unit Testing, Continuous Integration   Communicates the status and forecasting of these projects to the internal clients through a variety of methods including project status reports.   Researches competitive online marketing presencecampaigns and maintains a pulse on industry trends and systems; bringing forth ideas that embrace emerging technologyexecutions and innovative ideas.   Develops metrics for gauging success of enhancements using TFS and other issue tracking software in an agileSCRUM SDLC environment   Identifies new technologies that will benefit short and long term department goals.   Provides thought leadership in the areas of strategy and technology.   Produces and implements visual enhancements to existing designs as needed.   Performs other duties as assigned.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Automation", "LINQ", "SOA", "Data management", "Online marketing", "Application development", "Unit testing", "Information technology", "SDLC", "Product support"]}