{"JOB DESCRIPTION": "Job Overview:Be a part of a team that’s ensuring Dell Technologies' product integrity and customer satisfaction. Our IT Software Engineer team turns business requirements into technology solutions by designing, coding and testing/debugging applications, as well as documenting procedures for use and constantly seeking quality improvements.The Data Science & Integration Platform & Services team,  is responsible for building the enterprise Integration and Data Solutions for the Dell IT . This team utilizes fusion of middleware technologies with the Cloud based service to provide the seamless integration between on-prem and SaaS providers.Join us as a Senior Principal Software Engineer on our Information Technology team in Bangalore to do the best work of your career and make a profound social impact.Key ResponsibilitiesDesigns architecture of Integration solutions adhering to the latest security standards. Advise leadership on best integration practices, help define the roadmap for Integration Services.Leads the design and architecture of high-quality, complex systems and software in the field of Integration and Middleware. Drive key technological initiatives or programs across the organization.Collaborates with customers in IT and business teams across the enterprise, understand their needs, arrive at the best architecture and design a robust solution to meet the needs. Help build a robust, reliable architecture which can address technology modernization needs.Prepares, reviews and analyzes software specifications for complex products and systems. Evaluate, Prototype and Recommend new products and solutions for future.Implement security & compliance solutions for all Integration platform that we own. .Maintain platform health and hygiene, support, monitoring and RCAsEssential Skills12+ years of related experience with a Bachelor’s or Master’s degree with experience in Integration technologies.Advanced knowledge of Integration tools and technologies, prior experience one or more of the Integration technologies like Spring boot Microservices, Boomi, API gateway technologies such as IBM DataPower, CA Layer7 API Gateway, Cloud Integration tools, Cloud Architecture and IT security. Advanced knowledge on latest Integration technologies and trends in the Industry.  Must have a strategic outlook on Integration and IT technologies and help direct the organization towards the Future state of the Integration Platform.Experience in any one of the cloud platforms such as PCF, AWS, azure .Experience with cloud native architectures, solutions and providing innovative ideas.Knowledge on monitoring / reporting tools like Splunk, Nagios, Zabbix or similar tools. Experience working in a globally distributed IT and Business teamsDesired SkillsVaried knowledge of database, development, system engineering and networking concepts.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Cloud Integration", "PCF", "Spring Boot", "AWS", "Microservices", "Enterprise Integration", "Database Development"]}