{"JOB DESCRIPTION": "Roles and ResponsibilitiesIntroductionSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do. Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide. At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.Your Role and ResponsibilitiesWe are looking for experienced back end or full stack software developers to develop a mix of new features and support existing code on critical projects with high visibility. The successful candidate will work as a Software Developer as part of the IBM Cloud Developer Tools development team. If you are passionate about Cloud Development and the opportunity to have great tools to work with then this may be the opportunity for you.Required Technical and Professional ExpertiseOverall 7 years – 13 Years of IT experienceUnderstanding and experience with Cloud Technologies, Microservices ArchitectureUnderstanding and experience with Back End or Full Stack DevelopmentUnderstanding and experience with DevOps and Design/Implementation within CI/CD and Secure Software Engineering Best PracticesUnderstanding and experience writing and executing Unit and Integration Tests as part of Test -Driven DevOps DevelopmentUnderstanding and experience with RESTful APIs, Kubernetes, Node, Ruby, Go, Java, Postgres, Redis, GitHub, GitLabUnderstanding of critical industry Compliance Best Practices (e.g. GDPR, SOC2)Good attention to detailPreferred Technical and Professional ExpertiseExperience building a truly distributed architecture-based system will be huge plus.Passion for software testing and interest in learning emerging technologiesExperience with full ELK stack implementation (Elasticsearch, Logstash, Kibana)Experience using Kafka message queuingExperience with Grafana / dashboards", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Java", "Software Development", "Cloud Development", "Kafka", "Redis", " Kubernetes", "Postgres", "Ruby", "Microservices", " RESTful APIs"]}