{"JOB DESCRIPTION": " We re looking for a   Senior Cloud Services Developer   (Backend) who ll be responsible to form a team tailored for a specific mission. You contribute to fast realization of prototypes as well as effective product development, by applying deep engineering knowledge of the most relevant coding platforms and standards, in combination with proven Agile collaboration methods and test-driven development.    You ll be part of the Signify   R&D Bangalore   and its responsibilities are architecture, design, development and test automation, so Innovation and passion for technology must be in your DNA.       What you ll do     As Senior Cloud Services Developer (Backend) in the Cloud Applications group     Drive innovation in software solutions for Connected LED Lighting Systems.    Architect, design, implement, debug and solve problems in software applications used in SaaS Cloud Deployment, On Device Web Applications, Software installed on Windows, Mac and Linux environments    Willing to learn other programming languages, cloud service providers, operating systems and new technologies.    Active participation in Code Reviews, Code Quality Analysis, Security Risk Analysis, Build Management and Documentation.    Ability to work with multiple disciplines of system including hardware, firmware, optics, cloud and mobile devices.    Active participation in Agile Software Development Process.        What you ll need      Bachelor/Master degree in Computer Science Engineering, Information Science, or equivalent    Minimum of 10 years of relevant work experience in product development as Cloud/Web Backend Developer    Strong technical skills in   Java   , JavaScript, Python. Knowledge in other relevant programming languages (C#, Kotlin) is advantage    Web Services Technologies: Web Services -   REST   , SOAP; Multithreaded Applications, Computer Networks -   TCP/IP   , UDP, IPv4; Computer Graphics -   Open GL   , Web GL; Data Structures, Databases -   Postgres   , MySQL, SQL Server; Encryption -   PKI   , x509 Certificates; Realtime message brokers -   MQTT   , XMPP; Data Serialization - XML,   JSON   ; Application Frameworks -   Spring Boot   , Python Pandas; Authentication Frameworks -   OAuth2   , OpenID    Cloud Services Technologies: Container Technologies -   Docker   , Kubernetes; Compute Services - AWS -   EC2, Lambda   ; Azure - App Svs; Storage Services - AWS-   S3, EFS, EBS   ; Other Tools -   Cloudwatch   ,   Kinesis   ,   Terraform   , Cognito, VPCs,   API Gateway   , Route 53    Software Development Tools: IDEs like Eclipse, JetBrains, PgAdmin, Angular IDE; Code quality tools like SonarQube, Coverity; Build tools like Make, GCC, Jenkins, Maven Ant; Source Control tools like Git, SVN, ClearCase    An interest and preferably working experience in agile development methodologies (Agile, Scrum, Kanban, SAFe )    Test Driven Development is your way of developing high quality software    Knowledge of software development patterns    Able to coach others in technical areas    Experience with relational databases and data modelling    Experience deploying to a cloud-based hosting environment (AWS, Azure, Google Cloud)    Experience with enterprise integration patterns    Experience in developing Continuous Integration/Continuous Deployment Pipeline solutions   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Linux", "XML", "Eclipse", "MySQL", "Javascript", "Data structures", "Windows", "Firmware", "SQL", "Python"]}