{"JOB DESCRIPTION": "Software Engineer at NUANCE COMMUNICATIONS Push the limits of what people believe is possible. Our innovations have changed the world and were just getting started. Come be part of it. Find Nuance jobs that match your profile. At Nuance,  we empower people with the ability to seamlessly interact with their connected devices and the digital world around them. We are creating a world where technology thinks and acts the way people do by designing the most human,  natural,  and intuitive ways of interacting with technology.Our nimble technology uses analytics and advanced algorithms to transform the inanimate into animate and reduce complicated processes into simple ones.Join our Healthcare team...caring for clinicians the way they care for patients. Beyond words. We create technology that lets clinicians capture and document care quickly and easily,  so they can focus their attention on their patients.Job Summary: Enhance healthcare by developing an industry leading analytics and data mining platform to improve clinical outcomes and deliver more efficient care.Responsibilities Contributing to a next- gen Cloud platform,  including new feature functionality,  tooling and processes to migrate data,  automating blue/ green deployments,  and ensuring system resiliency and scalability. Integrating with multiple data sources using REST,  SOAP,  ODBC,  SQL. Working with key stakeholders to enhance integration with Microsoft Excel,  allowing for rapid data analysis. Maintain and support an existing application,  while working closely with Support during escalation of issues. Ensuring high standards of application security,  unit testing,  and software quality. Ability to work independently in a fully distributed team,  while effectively communicating and collaborating with engineers,  support staff,  and product owners. Required Knowledge,  Skills and Abilities: Education: BS in Computer Science or equivalent Minimum years of work experience: 5 Enhance healthcare by developing an industry leading analytics and data mining platform to improve clinical outcomes and deliver more efficient care.Responsibilities Contributing to a next- gen Cloud platform,  including new feature functionality,  tooling and processes to migrate data,  automating blue/ green deployments,  and ensuring system resiliency and scalability. Integrating with multiple data sources using REST,  SOAP,  ODBC,  SQL. Working with key stakeholders to enhance integration with Microsoft Excel,  allowing for rapid data analysis. Maintain and support an existing application,  while working closely with Support during escalation of issues. Ensuring high standards of application security,  unit testing,  and software quality. Ability to work independently in a fully distributed team,  while effectively communicating and collaborating with engineers,  support staff,  and product owners. Preferred SkillsExperience working with PostgreSQL,  RabbitMQ,  and Redis. Javascript frameworks such as jQuery and ReactJS. Experience with Apache,  RabbitMQ,  and PostgreSQL. Experience with containerization,  ideally using Docker and Kubernetes Sorry the Share function is not working properly at this moment. Please refresh the page and try again later.Share on your newsfeedWhy Nuance Our employees spend their days reinventing the relationship between people and technology. Join Nuance and help shape the future. Hear from members of our global team. Click profiles to learn more.Arvind K. R&D; Pune,  India Innovation: Nuance is like a $2- billion start- up. There are so many things we are doing for the first time,  but the scale is huge and the machinery is complex.We are a matrix organization: It is challenging but very rewarding to build collaborations with stakeholders that are halfway around the world.Impact: It boggles the mind to think that such a simple thing like software can not only change lives,  but actually save lives. And finally,  to paraphrase a quote from an unknown source: You have to be a little bit crazy to work at Nuance,  but you have to be completely crazy to work anywhere else. The global HR team is incredibly collaborative and creative. The work environment here at Nuance is diverse,  dynamic -  offering opportunities to challenge myself,  while allowing me to have sound work- life balance.Vaidehi K. R&D; Bangalore,  India I like having the opportunity to work with different teams in Healthcare and I have been fortunate to make strong contacts over the years. I enjoy the fact that there are constantly new and diverse challenges and that I get to explore and learn new things every day.Eric T. Human Resources Atlanta,  United States It was the great Will Rogers who said If you want to be successful,  its just this simple. Know what you are doing. Love what you are doing. And believe in what you are doing. Here at Nuance the work has always been challenging,  demanding beyond belief,  but in the service of others its fulfilling. I believe Im making a difference. I believe together were making a difference. This is why Im here.I love being part of a team that is creating innovative strategies and building solutions for the worlds biggest companies. Were changing how people interact with the technology they use every day like their carand thats an incredible feeling!Stay up to date with Nuance Sign up to receive Nuance job alerts and communications.To select your interests,  choose a category and/ or location from the auto- suggestions and click \"Add\". Programming,  Pune,  Maharashtra,  India With more than 13, 500 employees and 45 offices around the world,  we strive to create an exciting,  collaborative,  and supportive work environment.As a key member of our team,  you will expand your technical skills exponentially,  grow your professional network,  and work alongside some of the best and brightest in the world!", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["Computer science", "Data analysis", "Email", "Javascript", "Service", "Healthcare", "Data mining", "Machinery", "Analytics", "SQL"]}