{"JOB DESCRIPTION": "      About the Role     you will be working as lead on Individual Contributor role as part of FCL development team using Spring, Microservices, and java based environment using Queue/Cache on Linux/Unix environment. You will be expected to do end to end design, architecture and development. Coordination with various teams involved in process like BA, QA and users. Role demands thorough understanding of agile methodology. You should have clear understanding of enterprise architecture integration and Design patterns.     Responsibilities     Lead application design and delivery Lead   the team of developers and application design and take care of application production delivery.     Interaction with Business and requirement analysis   Participate in Agile process, Interact with Product Owner for requirement analysis .     Requirement analysis and Design   understand requirements, existing architecture and mapping it to target architecture. Should be able to design server side components using Java8, microservices, Kafka and spring/Coherence/Solace/Linux Scripts/Autosys. Should be able to create techno-functional documentation and HLD/ LLD from requirements     Develop   - Services in Java8, microservices and spring. Should be able to independently implement functionality     Automation Testing   Will be responsible for building BDD(Cucumber) and headless automation test suits for application.     Build and integration   Should know build tools MAVEN     Deployment   should have understanding of UDeploy     Source control and configuration management   Should know branching process, merge and check-ins/check-out. Must know GITHUB.     Good understanding of Agile methodology     Taking care of L3 and L2 issue     CI/CD pipeline and DevOps   should have good understanding on CI/CD pipeline and DevOps tools     Essential Qualifications     IT/CS Engineering OR MCA      Experience   around 8-12 years     Knowledge   in Capital Market and Securities     Strong   analytical skills.     Strong design and application architecture skills     Fluency   in English and at least one regional language.       Desired Qualifications     Certification in Capital Markets   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.A in Other Specialization", "PG": "MCA in Computers"}, "KEY SKILL": ["Unix", "Maven", "Automation", "Linux", "Enterprise architecture", "Configuration management", "Fixed income", "Investment banking", "Capital market", "Analytics"]}