{"JOB DESCRIPTION": "Roles and ResponsibilitiesIntroductionSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do. Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide. At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.Your Role and ResponsibilitiesIBM's Tech Re-Entry program is looking for talented technical professionals who are looking to restart their technical careers after an absence from the workforce of 24 months or more. This returnship will enable you to work on projects that match your expertise, interests, and abilities and could lead to full-time employment. During your IBM Tech Re-Entry program, you will have the opportunity to update your skills in a contemporary work environment. You will have access to the latest tools and technologies available and work alongside a multi-disciplinary teams to hone your expertise and deliver on client-critical solutions. You'll be able to experience the breadth of IBM resources while developing new skills and relationships.Re-Entry hires participate in ~6 month program to refresh skills and prepare for transition to full time opportunities. The experience provides personalized technical learning to update and gain additional skills; earning badges and credentials along the wayAt IBM, we are driven to help our clients transform themselves and take full advantage of the cloud and IBM Cloud Platform Services play a key role with its global cloud presence that continues to grow and expand its reach. We are looking for a talented Software Development Engineer with Development and Software Engineering experience to join us in Bangalore, India. We seek individuals who innovate and share our passion for winning in the cloud marketplace.The ideal candidate will be working alongside fellow software engineering professionals, as we continue to develop and improve the software that powers the Cloud. This area of Engineering is responsible for the technical design, service implementation and support of one of the world’s largest and most interconnected set of data centers. If you are a talented professional who is passionate about technology, seeks responsibility, thrives when empowered and understands the importance of personal accountability, we want to talk to you!The successful candidate will work as a Software Development Engineer as part of the IBM Cloud Network team with a focus on the following key responsibilities: Provide technical leadership and guidance.Work across functional teams to drive quality deliverables.Work within a Continuous Integration and Continuous Delivery development model.Foster a culture of continuous improvement.Required Technical and Professional ExpertiseSoftware Development Skills: Python, GoLang , CStrong troubleshooting skillsExperience with Git and GithubExperience with Linux OS & Network internalsContinuous Integration/Continuous Development (CI/CD)Understanding and experience with micro-service, REST APIUnderstanding of Containers and virtualization and related toolsDomain Knowledge in cloud network infrastructurePreferred Technical and Professional ExpertiseMaster’s degree in Computer Science, Engineering or other technical discipline;Cloud Development experience;Minimum of 10 years’ experience in Software Development or Software Engineering;Minimum of 5 years’ experience with Agile/DevOps Development Practices;Linux Virtualization technologies relating to network virtualization (KVM, Xen) is a plusVPN (Virtual Private Network) is preferred", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "MS/M.Sc(Science) in Computers, MCA in Computers, M.Tech in Computers, Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Software Development", "C", "GIT", "Linux", "OS", "Software Engineering", "Watson", "Rest Api", "Devops", "Python"]}