{"JOB DESCRIPTION": "     Department Overview     Payments, Virtual Solutions, and Innovation /Community Bank Technology within the Enterprise Information Technology business provides strategic technology solutions to the both the PVSI and Community Banking lines of business, including application design, development, and support.       About the Role     This position within the   Core Banking - Settlement   team is responsible for developing high/low level designs build/UT, Test and implementation support. Th  is   team works with   Mainframe applications, other external / internal upstream and downstream applications  .      Responsibilities      Demonstrated ability to translate business requirements and functional design into technical implementation.    Develop and maintain   mainframe   programs to specifications. Includes development of COBOL, JCL, IMS and DB2 program on   Mainframe   platform. Perform unit testing and ensure functionality meets the business requirements.    Periodic project status reporting and overall project co-ordination. Assure seamless communication between developers and U.S project partners for better understanding of the requirements and error-free deliverables.    Provides technical consultation and support in the development of computer applications and programs.    Analyzes business requirements, designs and writes technical specifications to design or redesign computer solutions.    Develops original and/or complex code - assists in preparing programming specifications and completes programming tasks to maintain or modify current programs or to develop less complex computer programs using COBOL and   Mainframe   tools.    Leads and/or performs modeling, simulations and analysis efforts for assigned projects.    Verifies program logic by overseeing the preparation of test data, testing and debugging of programs.    Participates in overall systems testing during the development SDLC phase.    Confirms the migration of application code to the production environment after releases are installed.    Develops new documentation, participates in the development of department technical procedures and designs user guidebooks as needed. These documents include restart instructions and flow diagrams.    As an escalation point for application support and troubleshooting production issues, provides guidance and direction to less experienced staff in resolution of escalated issues and/or complex production, application or system problems       Essential Qualifications      Technology oriented B.E/B Tech Degree or equivalent advanced degree    5+ years of experience in Core Banking system, preferably in   Settlement    Understand the various functionalities of the   Debit Card Settlement   to ascertain the deviation in the current process    8+ years of experience in programming using COBOL, JCL, IMS, DB2, VSAM.    Good working experience on mainframe utilities like sort, REXX, fileaid, endeavor/changeman easytrieve..etc    Good working experience on debugging tools like Xpediter, abend aid..etc    Good experience in leading small to medium project by providing technical leadership.    Analytic and excellent organizational skills    Excellent communication skills     Proactive and can work independently     ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Production/Industrial", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["VSAM", "JCL", "Application support", "Db2", "Cobol", "Debugging", "Troubleshooting", "Information technology", "SDLC", "IMS"]}