{"JOB DESCRIPTION": "    Job description       About the Role        We are looking for a senior development engineer, with experience in capital markets preferably in equities or fixed income focus on building order management, position management platforms.        The role requires in depth technical knowledge and analytical ability to engineer and manage a complex ecosystem including server side components, market data delivery, trading desktop, high performance computing infrastructure and data analytics      This role offers opportunity to work on business critical, greenfield/brownfield and high visibility projects.      In addition to the primary responsibility of being the lead engineer for resolution of technology issues in the Asset Management platforms, the person will be expected to champion best practices to build a resilient platform.      The position will collaborate directly with the US-based engineering teams, business/product managers and business analysts. Specific responsibilities include, but are not limited to:       Design, develop key features for Asset Management business requirements using latest features in .NET/.NET CORE. Role requires an excellent understanding of the concepts, challenges and tradeoffs in developing complex .NET applications.    Troubleshoot complex issues in distributed ecosystem    Evaluate the architecture and identify opportunities for improvement    Ensure that deliverables are on time, within estimates and of high quality and are following expected agile methodology. Person is supposed to be result oriented and have delivery mindset.    Work with application support teams to ensure timely resolution of issues.    Mentor junior team members.       Required primary skills/experience   :       8+ years solid server-side development      Solid knowledge of .Net ecosystem (   C#, ASP.NET Core, MVC, Web API   , WCF, WPF)      Solid understanding of OOP design principles      Hands on experience in test driven development and DevOps practices      Data structures/algorithms      Experience with scalable, performant design and architecture      Domain Driven Design      Experience with at least one of the mainstream relational databases (SQL Server, Oracle, Postgres, MySQL or Sybase) and advanced knowledge of SQL      In depth understanding of Database concepts like indexing, query optimization, replication, PL-SQL      Familiarity with at least one NoSQL database (MongoDB, Redis)      Familiarity with distributed processing frameworks      Familiarity with Service-oriented architectures Microservices in particular      Experience with version control systems (Git/TFS)      Understanding of messaging, concurrent programming and highly distributed software        Desired Qualification        Basic understanding of containerization technology and Kubernetes in particular      Experience with AWS or one of the mainstream public cloud providers (GCP, Azure)      Familiarity with Elastic Search stack (former ELK)      Documentation and presentation skills.    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Application support", "MySQL", "PLSQL", "Data structures", "WCF", "MVC", "Investment banking", "Oracle", "WPF", "SyBase"]}