{"JOB DESCRIPTION": "      About the Role    Key technical resource on team building sophisticated and complex Pega Applications.   Responsible for working on medium to high architectural impact projects, recommending exceptions to the Enterprise Architecture for high level projects, reviewing and approving medium architectural impact designs, communicating the Enterprise Architecture strategy and direction to both management and systems related teams within their line of business or infrastructure sub-domain (organizational unit) and directing implementation of the architecture for their organizational unit. .    Responsibilities           Leads the technical team in DCO sessions while gathering and understanding requirements, and developing and testing use cases to help ensure best possible application design.                Designs the technical solution and leads the technical team in development activities while ensuring adherence to the COE standards and best practices.                   Performs code reviews and reviews alert logs to ensure application quality is in compliance with COE coding standards, UI/UX standards and Corporate Security standards.                   Validates final delivered solutions meet and perform to functional and non-functional requirements.                   Demonstrates a solid understanding of reuse and portability in terms of enterprise solutions seeking to determine and develop repeatable, efficient and optimal ways of implementing Pega applications.              Makes recommendations of when to integrate with other products versus using PRPC for end to end solution and presents the best architecture to meet desired business needs        Essential    Qualifications           12+ years of application development and maintenance experience.                8+ years of active Pega Systems application development experience.                    M      ust have Pega 8.x development experience           Ability to prepare comprehensive technical specification document and solution architecture design.                Pega CLSA (Lead Systems Architect) certification, and/or equivalent training/experience.                   Experience in designing and developing Business Rules Engine (BRE) and Business Process Management (BPM) applications using Pega PRPC frameworks.                   Expertise in use of Connectors and Services in PRPC to integrate with external systems                   Proficient in authentication, authorization, LDAP and advanced security concepts.                   Sound skills in developing PRPC High Level Class structure, Work Flows and Business Process Management.                   Extensive knowledge in Design, Development, Migration, Deployment and Integration of PRPC.                   Expertise in creating User Interface (UI) using flow actions, harness and section rules                   Extensively used Clipboard, Tracer and Performance Analyzer (PAL) for troubleshooting and performance tuning of PRPC applications.                   Experience with DB2, Oracle 9i/10g and stored procedures using SQL, PL/SQL                   Development experience working in Agile Scrum environment, expert in JIRA and Confluence        Emphasis on collaboration with various Pega development teams, Architects, and Pega Tech Lead Engineer.                   Able to work under pressure, team member oriented, with strong verbal, written, and interpersonal communication skills              Desired Skills:     Knowledge and understanding of desktop and Windows server operating systems  Knowledge and understanding of software development life cycle (SDLC): code control, build and deployment  Knowledge and understanding of authentication methods or protocols  Knowledge and understanding of cloud computing  should have a lead a team of junior people    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Performance tuning", "LDAP", "Db2", "Coding", "PLSQL", "Application development", "Windows", "microsoft", "Troubleshooting", "SDLC"]}