{"JOB DESCRIPTION": "     About the Role    Key technical resource on team building sophisticated and complex Pega Applications.   Responsible for working on medium to high architectural impact projects, recommending exceptions to the Enterprise Architecture for high level projects, reviewing and approving medium architectural impact designs, communicating the Enterprise Architecture strategy and direction to both management and systems related teams within their line of business or infrastructure sub-domain (organizational unit) and directing implementation of the architecture for their organizational unit. .    Responsibilities      Looking for a senior developer who would be involved in design and development of PEGA applications  Serves as a technical consultant to internal clients and technical management to ensure conformity with Enterprise Architecture; having expertise across a broad portion of the organizational unit's architecture, or in-depth expertise within a more specific portion of the architecture.   Development of PRPC 7.1 features on BPM side.  Creation of rule types, UI and correspondence features.  Creation of rules management and associated tools such as export & import tools, skimming and bulk processing tools  PPRC configurations such as MQ, File, email server, Scan station and other configurations  Scalability and reuse of the application in development  Creation of enterprise class structure that is scalable and extensible  Develop PRPC integration capabilities  Development of PRPC security model, integrating PRPC with external managed security such as SSO and LDAP  PRPC architecture and its relation to J2EE architecture  Performance tuning and optimization of PRPC implementations  Usage of application preflight tool, PAL, DB Trace, Profiler tool, SMA console, Pega AES  Creating Web Services in Java       Essential      Qualifications       8+ years design and planning experience in systems applications or IT Architecture  7+ years of application development and implementation experience  4+ years of development experience in building applications using Pega  Good verbal and written communication skills  Good problem solving and analytical skills  Should be detail oriented, able to multi task  Demonstrated ability to learn the business quickly.   Self-starter. Team player.    Desired Skills:     Knowledge and understanding of desktop and Windows server operating systems  Knowledge and understanding of software development life cycle (SDLC): code control, build and deployment  Knowledge and understanding of authentication methods or protocols  Knowledge and understanding of cloud computing  should have a lead a team of junior people   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Performance tuning", "Cloud computing", "LDAP", "Enterprise architecture", "Application development", "Pega", "Windows", "microsoft", "Information technology", "SDLC"]}