{"JOB DESCRIPTION": "  About the Role    As a Front End Engineer you'll collaborate with a larger team of engineers to drive front-end development standards and work continually to enhance customer facing features. This is an opportunity and challenge to make an impact in the real world using exciting and new technologies.    What You'll Do    Work on Uber's most complex web applications by designing, implementing, and unit testing the frontend application code.  Build a next gen UI using the latest technologies: React, Redux, Sass, ES2016  Help teams with helping with defining an architecture that would scale and also encourage best practices.  Create frameworks and abstractions that are reliable, reusable and avoid surprising outcomes.  Goto person to get clarity of problem statements and also can breakdown into meaningful tasks.  What the Candidate Will Need / Bonus Points    What You'll Need    5+ years of software engineering experience focused on web development.  Hands on experience in architecting large scale frontend applications.  Have detailed hands-on experience of cutting edge web technologies (HTML5, CSS, Javascript, TypeScript), Application Servers, Web Applications.  Experience developing UI with JavaScript development frameworks (e.g. React, Angular, Vue, Bootstrap, etc)  Have in-depth understanding of application performance and scalability Experience working on open-source projects, building frameworks, ui platforms at scale.  Deep understanding of Web and Information Security concepts and concerns, such as CORS, CSP, CSRF, XSS, etc.  An expert in debugging and profiling Browsers and Node.js, and understand ways to decrease page load speed and runtime slowdowns ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Travel , Hotels , Restaurants , Airlines , Railways", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Web technologies", "Architecture", "Scalability", "Information security", "Web development", "Debugging", "Javascript", "Architecting", "Unit testing", "Open source"]}