{"JOB DESCRIPTION": "Software Development Engineer (Analytics),  Product Development Job description: As a software development engineer,  you will be responsible for analysis,  design,  development,  testing and maintenance of 2020TouchControl systems that are leading the way in assuring high quality of 2020 Imaging products. Job responsibilities:  Be responsible for coding,  debugging and testing image processing modules in MS Visual C++ or any C++ compiler Be responsible for reviewing Business Requirement Specification (BRS),  System Requirement Specification (SRS) and preparing High Level Design (HDD),  Detail Design Document (DDD)  Job requirements:  Should have participated in all the phases of the application development life cycle involving analysis,  design,  development,  testing and deployment of the project Should have been involved in Unit Testing and Integration Testing of Different Modules Should be a good Team Player with excellent communication,  analytical,  verbal and writing skills along with strong management,  organizational and mentoring skills Should have ability to excel in cross functional team environment Should have excellent written and verbal communication skills in English Should have attention to detail,  positive attitude under stress  Professional qualifications: 2 3 years of relevant experience Bachelors degree in Engineering preferred Strong knowledge of C,  C++,  OOPS IDE Visual Studio 2012 or latest version Operating Systems Windows 7/  XP/  Vista,  Windows Server 2008 Knowledge on media compression technology like X.264,  X265,  MPEG4,  etc. Exposure to different image processing libraries such as OpenCV,  etc. Strong understanding of image processing algorithm", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - System Programming", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["server", "C++", "development", "software", "level", "Debugging", "testing", "specification", "Windows", "Visual Studio", "Analytics", "quality", "excel", "Algorithms", "application", "Product Development Manager", "Coding", "Software Development Manager", "design", "oops", "Application development", "deployment"]}