{"JOB DESCRIPTION": "  Position    :      As a Sr SDET, you will be a key member of the product team responsible for product quality. This product team works within the larger platform group to create and maintain the system that allows for access between the users device and secured content. We design and deliver those aspects of the platform that streamline and improve developing and deploying applications and customizations. The team is focused and follows agile methodology for development.      The ideal candidate will be a hands-on craftsman with technology and code. They should be comfortable in a heterogeneous environment that is rapidly evolving and demands quickly mastering new technologies as we integrate these into our platform.        Job Requirements:      Essential       Bachelor's or Master's degree in Computer Engineering or equivalent      4 years of software testing experience      Excellent testing acumen and positive attitude towards problem solving.      Experience creating / updating / reviewing / executing automated and Manual tests      Identify defects and own them through the resolution and verification cycle.      Strong programming experience & code debugging skills.      Proficient in writing clean, maintainable code in Java.      Hands on experience in Test Automation - Java, REST, API, JSON, TestNG, Selenium, MySQL      Experience in designing and developing automation frameworks using Java and TestNG       Preferred:       Knowledge of revision control software (ex. SVN, Git, etc.) SDLC & STLC is plus.      Experience with Agile Methodology and continuous integration (i.e. nightly built and release) is a plus.      Experience designing and implementing testing tools and systems is a plus      Working knowledge of virtualisation servers e.g. ESX servers, VM's etc. Understanding of Linux OS.      Behavioural Attributes:      Must have a passion for quality and a bias towards speed      Be a good evangelist for the benefits of test automation      Must be a motivated self-starter with a short learning curve      Must be able to learn new technical areas quickly      Ability to communicate effectively - Verbal & Written      Able to work well with global teams, including some time zone flexibility. Collaborate well with other teams within the organisation.        ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Media, Entertainment, Internet", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Software testing", "GIT", "Linux", "Testing tools", "MySQL", "Debugging", "JSON", "Agile methodology", "Selenium", "SDLC"]}