{"JOB DESCRIPTION": " Major Duties/Responsibilities: 1. Write code using multiple web development languages, primarily HTML, CSS, and C#. 2. Create various web applications using code and visual design skills. 3. Design and create user interface layouts and web pages. 4. Perform usability tests and analyze the results. 5. Analyze user data to evaluate user interfaces for existing applications and web pages and to identify areas needing improvement. 6. Create original graphic designs (e.g., images, sketches, and tables) 7. Create prototypes for new product ideas. 8. Test new ideas before implementing. 9. Ensure that project deliverable meet business requirements and ensure to complete the project within assigned timelines. 10. Produce high-quality design solutions through wireframes, visual and graphic designs, flow diagrams, storyboards, site maps, and prototypes.  Required Knowledge, Skills, and Abilities:  1. At least 4 years of working experience in UI Development. 2. Expertise in using C#, Web API technologies, and Azure DevOps.  Experience in Docker, Azure Kubernetes Service (AKS), Azure Container Registry(ACR), Azure Pipelines CI and CD, Azure Cosmos Data store and Azure functions are preferrable.3. Strong understanding of HTML, CSS frameworks such as LESS, SASS, SCSS, CSS libraries such as Bootstrap, Foundation, Semantic UI. 4. Demonstrated experience in creating and implementing the design. 5. Experience in using JavaScript such as Vuejs, Angular or similar JS libraries. 6. Holding experience with any blue-chip companies or certificates of any blue-chip college. ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "M.Tech in Any Specialization"}, "KEY SKILL": ["C#", "Web API", "UI Development", "Semantic UI", "Javascript", "Microsoft Azure", "Bootstrap", "Angular", "Azure DevOps"]}