{"JOB DESCRIPTION": "About us eSportsBuy. com is a leading Sports & Fitness eCommerce website in India. The team comprises of a bunch of IIT Delhi graduates dedicated to provide best online shopping experience in sports domain by offering best brands at great prices and best customer service. Be it equipment, apparel, footwear, accessories or any other thing, if it has anything to do with sports, it will be on eSportsBuy. com\n\nOur mission is to be the industry leader in providing a wide assortment of quality branded sports products and serve the sports fraternity by making the products accessible and affordable to every sports lover in the country. With features such as Free Home Delivery across the country, No Questions Asked Return Policy & Cash on Delivery, we see ourselves moving towards that aim.\n\nJob Description \n\n1. Work with the Software team on our continously evolving website\n\n2. Work on implementing new and innvovative features for the website.\n\n3. Work on the Search Engine Optimization (SEO) techniqiues to improve eSportsBuy. com's ranking in the search results.\n\n4. Work with the Catalog team to manage and update the product catalog\n\n5. Provide support in preparation of pitch decks (power point presentations) for important clients and customers\n\nRequirements \n\n1. Any college under- graduate/graduate/post- graduate from computer science background\n\n2. Excellent programming skills in any one language (PHP preferred)\n\n3. Excellent verbal and written communication skills\n\n4. Strong problem solving and analytical skills\n\n5. Aggressive and willing to work in a startup\n\n6. Should be able to work in a team and handle the assigned work within time\n\n7. Prior experience with design softwares like Adobe Photoshop is an added advantage\n\nDetails \n\nLocation: Preferable New Delhi but you can work from your place of choice if required\n\nCommitment: Non- negotiable", "ROLE": "Software Developer", "INDUSTRY TYPE": "Wellness , Fitness , Sports, Beauty", "FUNCTIONAL AREA": "IT Software - eCommerce, Internet Technologies", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["Computer science", "Accessories", "PHP", "Customer service", "Software Development Engineer", "SEO", "Business Executive", "Search engine optimization", "Sports"]}