{"JOB DESCRIPTION": "      What you ll be doing       and enhance MobileIron methodologies and evangelize effective testing standards     Optimize test cycle efficiency & add test automation into the continuous delivery pipeline     Develop innovative library architecture to enable efficient test case automation.     Develop test infrastructure components supports test execution, monitoring & reporting.     Work with functional teams to identify the requirements for common libraries and put a plan in place to meet those requirements.     Create, share and evangelize best automation practices, coding standards, design principles.     Mentor, guide junior engineers on automation & design skills.     Develop test scripts to automate the E2E workflows in an Agile SDLC environment     Generate professional test results, metrics and status reports (can be automated!)     Analyze test results to ensure that the product functions per requirements     Exceptional debugging skills and ability to identify root cause of a test failure     Setup, configure, and maintain software test labs and test environments     Contribute to our Test Plans with the inclusion of the System Test areas such as Stress, Reliability, Recovery, Configuration, and Performance testing     Work closely with the rest of the QE team and provide technical guidance to peer QE members as needed.     Define and lead high-profile initiatives to improve product quality, deployment scalability and customer experience before, during and after change.     Ensure on-time and effective delivery of high-quality, enterprise SaaS releases.     Continuously improve quality engineering processes.     Play a leading role in managing release readiness and success criteria based on business requirements.     Capture and analyze quality metrics for release readiness     Implement best practices consistent with an agile development methodology.     Proactively identify and mitigate risks and remove obstacles.     Guide the completion of root cause analysis to ensure issues do not recur.     Manage and provide oversight for deployment of releases into production environments.     Manage multiple projects/tasks simultaneously.     Design/Enhance automation frameworks for Server / client applications.     Identify Improvements, Automation best practices and communicate across cross functional teams.     Can provide guidance to multiple teams, and lead cross product initiatives.     Acts independently to determine methods and procedures on new or special assignments. May supervise the activities of others. Leads multiple-team initiatives, leads groups of engineers.     Should be able to me   ntor and onboard other Staff/Sr SDET engineers.      Who you are...      Excellent communication and collaboration skills, both written and verbal. Ability to drive a meeting     Attention to detail, particular when it comes to troubleshooting and analytics     Ability to rapidly shift context between project oriented work and work supporting other teams     Ability to work off-hours, on occasion, to provide support for production releases     Have understanding of software development design patterns.     Should be a subject matter expert for multiple technical areas, Can be thrown into ugly situations and turn them around.      What have you done       Bachelors or Master s degree in Computer Engineering or equivalent work experience     Lead the project teams in agile project management ways     8 years Quality Engineering Experience      Experience in test automation [hands-on coding and design in Java], test automation frameworks     6 years of experience in test and automation of mobile applications on Android and/or iOS      Must be proficient in writing clean, maintainable code in Java.      Must have developed a test automation framework from scratch.      Experience in Jenkins, Appium or UI Automation tools, scripting is required.      Prior working knowledge of networking server technologies and protocols (HTTP, Proxy Servers, Load Balancers) is plus.      Knowledge of revision control software (ex. Perforce, SVN, Git, etc.) and development lifecycle is plus.      Experience with the Agile Methodology and continuous integration (i.e. nightly built and release) is a plus.      Well versed in testing highly scalable enterprise client-server software is a plus.      Experience designing and implementing testing tools and systems     Experience in building and maintaining the device labs for iOS/Android. (Mac/Windows optional)      Preferred skills         Understanding of build systems, source code control systems, defect tracking systems and the interactions between them     Bachelor s degree in Computer Engineering or equivalent.      Experience with one or more database technologies (Postgres, MySQL) a must.      Java based SaaS application experience     REST API Experience     Testing tools like testrail and Jira     Experience with at least one scripting language (shell/Perl/python/jython etc.)     Exposure to mobile operating systems specially iOS and Android.(MDM, MAM and MCM is a plus)     Experience setting and managing CI environment e.g. Jenkins   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Media, Entertainment, Internet", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Networking", "Testing tools", "MySQL", "Performance testing", "Perl", "Windows", "JIRA", "Troubleshooting", "Android", "Python"]}