{"JOB DESCRIPTION": "   Responsibilities         Job responsibilities will encompass working across a team of high impact individuals who are designing and coding drivers, tools, firmware, Linux kernel, Android Framework and Android applications across various technologies on Surface Duo devices. The job is highly dynamic and involves working across various disciplines to successfully deliver the product with the Surface Duo experience and quality.     Qualifications           A minimum of 6 years of experience in software and/or product development      Experience with embedded system software development and architecture, especially around UEFI, power management, ARM SOC Architecture, BSP and/or USB     Excellent C/C++/Java/Python coding skills     Experience and knowledge of Android OS and the Android Open Source Project (AOSP)     Experience with developing Linux kernel mode drivers     Familiarity with one or more of the following Linux/android sub-systems: audio, graphics, display, camera, sensors, telephony (cellular)     Experience with new hardware bring-up and factory manufacturing     Experience with source code management and bug tracking tools like GIT, Jira/ADO or similar     BS in Engineering or equivalent experience      Desired Experience:      Experience with Android Applications and shipping Android based products     Proven track record of shipping high volume consumer devices (Windows, Android, Linux)     Familiarity with wireless protocols like BTLE,BT,WIFI,NFC      Familiarity with agile development methodolog     Experience with debug tools like logic analyzer, oscilloscope      Strong communication skills and ability to work across multiple disciplines and functions (PM, Test, Hardware Engineers, etc.     Some domestic and international travel might be necessary.     High tolerance to ambiguity and ability make progress in the face of it      Some domestic and international travel might be necessary.    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - System Programming", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Graphics", "C++", "Linux", "Coding", "Windows", "Firmware", "microsoft", "Open source", "Android", "Python"]}