{"JOB DESCRIPTION": "   Role and Responsibilities       Good knowledge of the Object-Oriented Programming and Microsoft Dot Net Framework and should be able to work independently.   Hands-on in C# and MSSQL server, Team Foundation Server (TFS)   Knowledge of Java Scripts, JQuery, AJAX, Bootstrap   Follow best practices for secure coding.   Knowledge of other tools like Automation using Active Directory, Exchange Services and ORACLE ERP will be an Advantage.   Create Unit Tests   Reviewing current systems   Working closely with analysts, designers and business stakeholders   Producing detailed specifications and writing the program codes   Testing the product in controlled, real situations before going live   Preparation of training manuals for users and maintaining Technical documentation as per the ISO and ISMS standards.   Software Maintenance and support.      Functional Skills (to be filled by Ops)      Must have worked on Medium to Large scale software projects using any SDLC methodology.   Implementation knowledge of JavaScript, JQuery and AJAX.   Database designing including stored procedures and functions.   Worked on Design pattern.   Worked on HTML 5 and Bootstrap, Responsive UI.   IIS and SMTP Configuration.   Writing Unit Tests.      You can look forward to:      Being part of a passionate and dynamic team   Come on board with the fastest growing service company   Flexible and employee friendly organization   3- 6 years relevant experience in Software Development on Microsoft Technologies on the Dot Net Framework.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Telcom, ISP", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Automation", "IIS", "jQuery", "ISO", "Coding", "Javascript", "Active directory", "Stored procedures", "SDLC", "Ajax"]}