{"JOB DESCRIPTION": "   Role Description        As a senior engineer in the FIRE APAC team you will join the team responsible for architecting, developing and deploying the tools and services used for automating the next generation of public cloud based infrastructure for Salesforce. You will work closely with the Engineers in the team, management leadership team and technical architects to deliver a robust user platform and allow for simple adoption methods for the customer base and ensure self-serve capabilities to support the growing customer base. You will play a key role in building system level capabilities for transitioning all of Salesforce infrastructure to public cloud native implementation.        Responsibilities          Design and build backend distributed services able to operate and enable infrastructure setup across multiple public cloud domains and regions (AWS, Azure, GCP etc.)       Achieve high degree of parallelization in backend processes to reduce cycle times and improve machine throughput       Dexterously own balancing of production features Support, feature delivery, and retirement of technical debt       Excited by building reliable, self-healing services with robust error handling       Experience designing, developing, debugging, and operating resilient distributed systems that run across thousands of compute nodes in multiple data centers       Capable of driving and delivering thin slices of end-to-end functionality on a regular cadence with data-driven feedback loops         Work with a global team (US and APAC based) to coordinate work efforts, report status          Required Skills / Experience          5+ years of software development experience with some UI development experience       Strong programing skills (preferably in JAVA) with focus on parallel and multithreaded programing       Experience building RESTful web-services       Experience with Terraform, Cloud Formation or similar infrastructure as code language to setup automated infrastructure resources and application clusters       Experience owning and operating multiple instances of a mission critical service       Experience with Agile development methodology and Test-Driven Development       Experience using telemetry and metrics to drive operational excellence          Desired Skills          Strong programming skills in Java       Experience with AWS, Azure, GCP or other public cloud substrates for scaling web and mobile application backend infrastructure       Experience with Java / C# / C++ building large scale distributed systems       Knowledge of open source distributed automation frameworks (e.g. Docker, Rundeck,Spinnaker etc.)       Experience with the Salesforce application    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Media, Entertainment, Internet", "FUNCTIONAL AREA": "IT Software - Other", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["UI development", "Cloud computing", "C++", "Automation", "Team management", "Software Development Manager", "Debugging", "Open source", "CRM", "Salesforce"]}