{"JOB DESCRIPTION": "    Job Overview       We are looking for the very best software development engineers to join our Indian office/subsidiary as we start a brand-new RD center in NCR India.      A day in your life       Most days at WatchGuard are fast-paced and challenging, and your ability to thrive in an ever-changing environment will give you the outlook to determine daily priorities.      A typical day could range from having a discussion with your team on the best approach for your development activities for the current sprint and the prioritization of additional work items, to strategizing on what improvements can be implemented based on what has been learned.      Your day could also include a deep-dive into an adjacent software stack in order to learn and contribute to a new area.      You may be asked to ensure that whatever we are building we are able to monitor effectively in production, so that we can make subsequent decisions based on true and meaningful insights.       Key Responsibilities          Design Build fault tolerant and failsafe Platform and Services for Watch         Maintain an open environment of collaboration, transparency, innovation, and fun.         Work with globally distributed teams (in Engineering, Product Management program management) to deliver on the priorities and commitments on behalf of the overall RD organization in WatchGuard         Makes use of and enhances our cloud delivery model (CICD)         Supports ongoing development and improvements to our security model including use of strong two-factor authentication, WAFs, separation of duties, OWASP coding practices         Strive to always make development more efficient, focused on the right priorities, and more fun       Your Experience will show:       An analytical frame of mind, a desire to take ownership, and never taking any failure as a setback       Building cloud services using 4 or more of following skills (with a minimum of 7 to 10 years of work experience in each)      Primary language (one or more): Go, Python, Java, JavaScript/Angular     Secondary language (zero or more): C++, Scala, C#     Good to have One (or both) of the following streaming backbone: Kinesis, KAFKA     Good to have One (or more) of the Structured Streaming Analytics Technologies: Spark, Flink, Kinesis Analytics     One (or more) databases: MySQL, ElasticSearch, Redshift, DynamoDB, MSSQL     Messaging Queues like Rabbit MQ, Active MQ, SQS etc.     AWS services (EC2, ECS, Lambdas, S3, API Gateway, RDS, Aurora, CloudFront, SNS/SQS)      Understanding of Scrum/Agile DevOps Process with at-least a couple of years of experience       Being at ease with tools/systems like Jira, GitHub, Confluence, CI/CD Pipeline using Jenkins, Cloud Formation templates, Artifactory, Office Suite, Linux       Who you are. You .       Don t have to be an expert in security but you have disciplined and hygienic development/engineering practices with an every person counts mentality.       Believe that nothing is impossible and challenge yourself and others to be the best that they can be.       You realize the endless possibilities of being part of a growing global company operating in one of the hottest domains (cyber security) of today.        Can break a problem methodically and utilize your out of the box thinking to solve diverse technical issues with minimal supervision and an unbeatable sense of urgency.       Are a highly motivated individual with a passion for cloud environments, scalability, and staying at the bleeding edge of new technologies.       Have strong verbal and written communication skills.       Are not afraid to voice your opinion even if it s not the most popular one in the room and are very open to ideas by others and utilize a rational thinking and approach to arrive at the right solution.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Broadcasting", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Wireless", "Linux", "Coding", "Configuration management", "MySQL", "Javascript", "Agile", "Network security", "Technical support", "Python"]}