{"JOB DESCRIPTION": " Job Description    The Lead Software Development Engineer is a hands-on developer specializing in Java development with a particular focus producing API services to support Secure Remote Commerce platform.   As a Lead, you will be responsible for helping design and implement SDKs and API microservices across multiple products and services. You ll work closely with other team technical leads and with our Product Management team, and other stakeholders.   Working within an agile development methodology, you will collaborate with and mentor other engineers and with other technical delivery teams, implement solid, robust solutions for new features and services. In addition you ll research new frameworks and technologies, assist with prototyping and proof-of-concepts, participate in code reviews, and help ensure a high level of code quality in your work.     Requirements    A record of successful delivery of software applications as an individual   Excellent communicator and collaborator with strong relationship and organization skills   Problem solver and solution-seeking approach   Excellent communication skills with the ability to communicate with all levels of management   Ability to build rapport and relationships   Understands the full SDLC   Knowledgeable possessing the technical knowledge, market knowledge, and other specialized knowledge of the team s problem domain   Team player   Hands on experience in designing complex and highly scalable systems   Solid understanding and hands-on experience in Java, J2EE, Spring Boot, REST web services are a MUST   Solid understanding and experience integrating web services   Exposure to building cloud ready applications (microservices)   Exposure to Test Driven Development   Exposure to Continuous Delivery and Integration   Agile Scrum experience   Computing degree ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Product management", "Web services", "Lead Software", "test driven development", "Management", "Application software", "SDLC", "Recruitment", "microservices", "I18n"]}