{"JOB DESCRIPTION": "  JOB DESCRIPTION      As a Senior Software Engineer embedded in an energetic mobile agile team of Software and QA Engineers, you will lead the team in creating mobile software products utilizing state of the art technologies.    You will be hands on, involved in designing mobile applications and flexible services that expose core capabilities to different applications and user bases, and leading teams to achieve the vision through active mentoring, technical decision-making, and facilitating company-wide collaboration.    All of this will be accomplished with cutting edge, lean-agile, software development methodologies. Our culture fosters collaboration, innovation, integrity, mentorship, commitment to success and fun.    Our managers are dedicated to growing their people and offering an opportunity that allows you to make impact in your career.      Core Requirements and Responsibilities:      Essential job functions included but are not limited to the following:    Responsible for developing new features and supporting/bug fixing existing features    Responsible for production    Troubleshoot issues across the whole stack - OS, DB, applications, JavaScript, and network    Share what they know by mentoring other team members    Closely follow industry trends and the open source community     Skills/Requirements     Knowledge, Skills and Abilities:      Care about quality and know what it means to ship high quality code    Curious and avid learners    Communicate clearly to explain and defend design decisions    Self-motivated and excellent problem-solvers    Driven to improve, personally and professionally    Mentor and inspire others to raise the bar for everyone around them    Collaborate with their peers, designing pragmatic solutions    Operate best in a fast-paced, flexible work environment    Prepare technical training and information sessions for other staff      Qualifications:      Have an intense passion for building software and mentoring their teams    Are very strong in both design and implementation at an enterprise level    3 to 6 years of professional experience with Java or .NET and common frameworks    Can work advanced database magic with relational and NoSQL databases    Are in-tune with high performance and high availability design/programming    Have experience in security best practices for software and data platforms    Design 'perfect-fit' solutions with engineering teams and business units to drive business growth and customer delight    Enjoy solving problems through the entire application stack    Are interested and capable of learning other programming languages as needed.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Software development methodologies", "Networking", "Product innovation", "Javascript", "Agile", "Manager Technology", "Mobile applications", "Open source", "Troubleshooting", "SQL"]}