{"JOB DESCRIPTION": "Lead development of the ecommerce platform integration across successive releases based on usage feedback,  A/ B testing,  leveraging resources in the company and other developers and instructional designers in partner companies. Lead a development team of 5 developers and 2 QA and be the responsible person for the integration module Read more \n\nRequirements \n\nA high level of energy and motivation. 8+ years of professional experience developing web application /  micro services. Loves coding. Producing clean,  effective,  and reusable code should be your passion and not just a job! 5+ years experience as a lead developer with proven track record in on-time and successful deliveries. Must be highly proficient in NodeJS,  Javascript and Microservices (REST web services ) Work end to end on micro-services and SPAs built on cutting-edge technologies like Nodejs (Strong practical experience preferred)\n\nStrong knowledge of database web applications. Excellent problem solving and communication skills,  so that you are able to articulate technical concepts to the team,  also excellent development,  and debugging skills Ability to learn,  act,  and thrive in a fast-paced environment with a distributed team Basic Qualifications \n\nBachelors degree in Computer Science,  Information Systems,  Engineering,  Business,  or related scientific or technical discipline required\n\nExperience developing enterprise level applications,  multi-tiered applications,  micro-services and SPAs\n\n8+ years of experience\n\nExperience with service-oriented architecture development and implementation.\n\nExperience and understanding of architectural principles and frameworks (MVC).", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["development", "code", "SOA", "Architecture", "technical", "level", "Debugging", "usage", "developing", "microservices", "Computer science", "database", "Web technologies", "Web services", "application", "Coding", "web", "Javascript", "developer", "MVC"]}