{"JOB DESCRIPTION": "Roles and Responsibilities Who We Are: Jobvite offers a marketing-inspired approach to recruiting by combining the power of data and the human touch. We enable recruitment teams to personalize the candidate experience with a full-scale talent platform that accelerates and simplifies the entire talent acquisition process  from the moment the search begins to the celebration of the first promotion and beyond. We make it possible to automate communication through bot-powered texts and anticipate the employee journey with internal mobility and referral tools driven by human insight and assisted by AI. With a comprehensive, talent acquisition-focused suite Jobvite has been serving customers, including Dollar Shave Club, Dunkin Brands, OpenTable, LinkedIn, Zappos, Universal Music Group, Wayfair, Zillow & Feeding America, since 2006. What you will do:As a Software Engineer on the integration platform team, you will be entrusted with the design and development of scalable infrastructure components and applications that integrate with a wide variety of vendors. The team is responsible for creating and leveraging existing framework to enable integrations, as well as working with partners and clients on building configurable and reusable components that tightly reflect customer workflows across different applications. In this position, you will work to understand and maintain partner systems, test and verify our solutions with these systems, design and implement new integrations, and deliver product in a rapidly changing environment. Youll work with a team who gets to do things (not has to do them), obsesses over customer delight and shift left concepts, owns what they code, and is committed to shipping small and failing fast. As an engineer at Jobvite, you will have the freedom and ownership to turn your ideas into great products, in collaboration with our broader team. What you will bring:5-10 years of software design and development experience 3+ years of experience with B2B SaaS company applying modern frameworks and patterns to build highly scalable enterprise B2B SaaS applicationsStrong Java/ J2EE experience, REST APIs using Spring & HibernateStrong experience on MySQL and any NoSQL databasesExperience with AWS services and deploymentsStrong knowledge of open source technologies such as Apache, Solr, Lucene, Elastic Search, MemcachedFamiliar with SDLC tools - Ant, Maven, Git, SVN, Jenkins, Travis, Puppet, Ansible, DockerExperience with Agile methodology, test methodology, test-driven development, source control management, and automated testingTechnical leadership, due diligence in analyzing requirements and designsBE or equivalent degree in Computer Science or related fieldBe a mentor to other team membersExcellent communication skillsRecruiting industry experience, such as working experiences with Oracle, Taleo, Workday, SuccessFactors is a plusURLs to share with us showing open source contributions, websites youve worked on, questions youve answered on Stack Overflow, or thing else that shows off your expertise is a BIG PLUS!", "ROLE": "Technical Architect", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization, BCA in Any Specialization"}, "KEY SKILL": ["Java", "Hibernate", "NoSQL", "Software Development Methodologies", "Software Engineering", "SAAS", "Spring Boot", "J2Ee", "AWS", "Python"]}