{"JOB DESCRIPTION": " Job Description     Essential Functions:     Accountable for creating application and infrastructure performance plans/models for a highly scalable, low-latency, highly-available and high-throughput payment processing system.   Work with the architects and development team to ensure proper metrics instrumentation done in software components, to help facilitate real time and remote troubleshooting/performance monitoring.   Evaluate, develop and execute load test tools to stress the limits of Visa s most critical payment applications.   Understand and performance test the APIs, abstractions and integration patterns to solve challenging distributed computing problems.   Should have experience in defining Performance Strategy and reporting performance baselines required to certify Go-Lives. Should have strong experience in handling multiple tasks and stakeholders   Should be well versed in documenting the steps performed during course of performance tests cycle including performance test scripts used   Should be able to provide mentor support emphasizing performance testing methodology, preparation, scripting, execution planning, simulation and test results reporting.   Should be able to able to look at the code and suggest optimization techniques.   Should have ability to work independently and be a team player.   Actively contribute to capacity planning and disaster recovery exercises.   Support in triaging and troubleshooting of issues related to performance degradation incidents in production environment   Monitor application performance, optimize performance bottlenecks and usage to create an application capacity model.   Help optimizing system components such as CPU/Memory/Disk/Network & OS/Application software for maximizing the computer resources utilization.   Technically lead the team and provide solutions   Think Beyond and provide futuristic approach and solution with respect to performance   Perform tool POC and focus on technical strategies    Basic     12-18 years of work experience and a Bachelor s Degree or 10 -16 years of work experience with an Advanced Degree (e.g. Masters, MBA, JD, MD)    BS or MS in computer science or equivalent.     Preferred     Expert knowledge in hardware, software, and distributed applications environments and solid understanding of their associated capacity and performance indicators   Expert knowledge and strong experience using tools, Loadrunner/Jmeter,. etc. and understanding of APM solutions like Appdynamics, dynatrace, OPNET,. etc   Hands on experience in Unix/Linux OS environments and operating system internals, file systems, disk/storage and networking protocols.   System internals. Having working knowledge with VMs and Containers.   Coding Knowledge in programming languages like Java/Python and scripting languages is must   Experience in ORACLE/MYSQL DB tuning and optimization    Knowledge of distributed database, distributed computing and high frequency transactions is a big plus.   Knowledge and understanding of MQ/Kafka system.   Working familiarity with the entire software development lifecycle including version control, build process, testing, and code release   Effective verbal and written communication skills. Strong interpersonal, facilitation and leadership skills.   Deeply self-motivated with the ability to work independently, coordinating activities within cross-regional and multi-functional teams.   Previous experience with financial services or payments processing domain is a big plus.   Knowledge of any scripting language is a must.  ", "ROLE": "Team Lead/Technical Lead", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["Unix", "Computer science", "Networking protocols", "Linux", "Simulation", "Coding", "Disaster recovery", "Oracle", "Troubleshooting", "Python"]}