{"JOB DESCRIPTION": "   Position Summary     The role is a self-organized Sr Software Engineer Test with hands on mobile Test Automation development and Manual testing experience.   In this position, you are first and foremost a passionate and talented Rest engineering developer who can work in a dynamic environment as a member of Agile Scrum teams. Your strong technical leadership, problem-solving abilities, coding, testing and debugging skills is just a start. You must be dedicated to filling product backlog and delivering production-ready code. You must be willing to go beyond the routine and prepared to do a little bit of everything.   This position is based in Bangalore, India.     Key Responsibilities     The Mobile Test-Automation Engineer position will be responsible for building/enhancing test automation frameworks, writing automation scripts from inception and testing primarily on Mobile (iOS and Android) including and manually testing the features.   In this role, you will work closely with software engineers, UX designers and product owners and will drive our testing and test automation strategy using industry best practices.   Work collaboratively with a cross-functional team of software engineers and product owners .   Should have demonstrated passion for high-quality software, enjoy collaborating with other teams, and are good problem solvers.    Own the Manual testing, Test Automation and QA tools development for Mobile Applications     Primarily responsible for the testing and validation of all the mobile feature (and other software applications)     Responsible for the quality of the Mobile app releases     Possesses deep knowledge on Functional, Integration, System, End to End functional regression, Client/End-user, performance and load testing, process and methodologies.     Has the ability to develop Test strategy, Test plans, Testing approaches and lead testing activities.     Ability to work across teams to set up the testing environments for different testing methodologies     Ensure comprehensive and automated test plans are in place for successful delivery of new/enhanced mobile product features     Develop high-quality automation test engineering best practices, test strategy, and principles     Development and execute automation script / manually test features during Mobile release and post dev sprints, detecting issues and reporting detailed bugs     Analyze complex software systems and collaborate with others to improve the overall design, testability, and quality of our Mobile (and/or server platforms)     Enhance and/or designs and develop test automation frameworks into a continuous integration and execution model     Establishes a set of test suites (unit, smoke, integration, regression, performance/load, security) for multiple applications that can run in a CI/CD environment, across various Mobile devices and test environments     Work with the product team/ Dev leads to understand how new features should be tested, and then engage them in contributing automated tests     Work with the development team to define and implement mechanisms to inject testing earlier into the software development process     Coordinate with scrum team in overseeing bug tracking, test prioritization, test automation, and release     Define and track quality metrics such as defect densities and open defect counts,     Creating reports showing automation v/s manual test cases status     Tracking and communicating release/project testing and automation testing results in a timely and effective manner     Qualification      Bachelors/ Masters degree in Computer Science/Computer Engineering or other related fields with a minimum of 3 to 5 years of experience in Manual testing and Automation.   In-depth unde", "ROLE": "Testing Engineer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - QA & Testing", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Computer science", "Automation", "Load testing", "Coding", "Debugging", "Javascript", "Scrum", "Selenium", "Test cases", "Troubleshooting"]}