{"JOB DESCRIPTION": "   Role Overview:       Manager for a software development team developing cloud networking solutions. The role will entail software development by Agile methodologies, people management and interaction with cross functional teams .      An Ideal Candidate will be:     A creative thinker with ideas to spare and designs to share   A proactive problem solver and passionate about technology   A dedicated employee who is not only a manager but a leader in truest sense   A person well practiced in planning, organizing, staffing, directing and controlling   A highly-skilled hands on person who can keep both customers and team happy   A supportive collaborator who can offer and hear constructive feedback   An interpersonal champion, rooting for the success of the team and cross functions       The Role:     Deliver high quality software in time as per requirements in an Agile way   Hands on manager with involvement in deep guts of software development, coding etc.   Solve problems for the team and business   Own and maintain high integrity of design, quality and long term maintainability of end to end software   Actively manage engineering processes and compliance to them   Enhance and manage a team of security aficionados to develop their careers, improve skills and provide guidance on day to day issues as well as long term plans   Facilitate issue resolution and remove roadblocks for smooth execution   Proactively contribute in enhancing processes, brining in best practices and efficiencies   Lead by example       Qualification:     B.E. in Computer Science or equivalent degree or combination of experience   12+ years of industry experience in networking technologies and embedded systems   Experience as a hands on manager delivering products or complex sub-products   Experience in people management, career planning and team management   Experience working with cross functional teams   Proven ability to translate requirements into execution   Experience in handling critical issues, escalations and unforeseen roadblocks   Ability to appreciate software design, high level fitment of design into product and features into product strategy   Experience with Agile software development methodologies       Highly Desirable:     Have experience in developing cloud networking software, VPN, IPSEC etc.   Have experience with reporting and analytics   Have experience with AWS, Azure and other cloud technologies   Have experience leading a team of engineers in delivering complex features/products   Have experience in working with cross functional teams including product marketing   Experience in introducing better processes and process optimization   Appreciate test automation and continuous integration   Take personal pride in your craft because quality matters to you   Work thoughtfully and collaboratively with your team   Have solid written and verbal communication skills  ", "ROLE": "Project Manager-IT/Software", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Project Managemen", "EDUCATION": {"UG": "B.Tech/B.E. in Production/Industrial", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Software design", "Process optimization", "Team management", "Networking", "Coding", "VPN", "Agile", "Analytics", "Product marketing"]}