{"JOB DESCRIPTION": " Pearson Marketing Cloud (PMC) is our Global Technology Platform that enables customers to access learning products and services through eCommerce and Digital Marketing journeys. We currently process more than 80% of global Pearson eCommerce revenue and serve nearly 50% of all Pearson web traffic, with over 24million page views per month.We are looking for a software engineer to support and maintain website features using Java, HTML, CSS and JavaScript, with a keen interest in Web and Ecommerce technologies and a passion for software engineering. This is a unique opportunity for a software engineer to help us support something end-to-end that will directly enhance the lives of millions, by supporting the provision of education on a global scale. The role will report into the PMC Support manager. Join a high performing team which focuses on supporting Pearsons digital transformation! As an Engineer - AEM / Ecommerce you will:  Provide on-going support to address the incidents and problems in an exciting and challenging environment with lots of learning opportunities  Lead/oversee daily/weekly touch-point meetings with business and partner application teams including vendor teams. Be a passionate team member with focus on end customers  Be proactive in identifying issues and take ownership in helping to resolve them Focus on reducing recurrence of issues by implementing good monitoring controls across the various applications. Implement new functionality/ enhance existing functionality on the global Adobe Experience Manager and Ecommerce platforms (SAP-Hybris, Shopify etc) Have multiple opportunities to be hands-on and learn various technologies. Follow and contribute to the project's technical best practices and development standards Contribute to the continuous improvement of the teams way of working Have a strong focus on high quality throughout the entire process, working closely with the Quality Assurance stream and various development streams  Collaborate with Senior Engineers, Technical Leads & Solutions Architects for aspects related to integrations with other systems. Qualifications - External Skills & Abilities B.S. in Computer Science or equivalent, with strong fundamentals and problem-solving skills  5+ years industry experience  Experience of full-stack development, using technologies such as Java, HTML, CSS, JavaScript, Sightly and AJAX. Experience of hands-on development building or running a public website on the Internet Any experience with supporting Ecommerce platforms and payment systems will be a huge plus The ability and drive to research and solve problems. A good understanding of web protocols such as HTTP and AJAX Adept at learning new technology, systems and functionality.  Excellent communication skills.", "ROLE": "software engineer", "INDUSTRY TYPE": "Education, Teaching, Training", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Not mentione", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["front end", "Angularjs", "css", "Spring Mvc", "Aem", "vue.js", "HTML", "Core Java", "java", "Software Engineering", "j2ee", "Javascript", "React.Js", "Hybris"]}