{"JOB DESCRIPTION": " As a Staff Software Engineer, you will join an engineering team and help mentor and guide the engineering team. In this role, we are looking for a dedicated individual with experience in leading others, service framework and application development with a full stack understanding. This individual is also expected to operate in agile, high pace and test-driven development.         What you'll be doing:     Lead a team of Software Engineers, liaison to Manager     Participation in the process of the Agile software development lifecycle while working with cross-functional team members - Development Leads, Architects, Quality Engineering and Product managers - in a highly collaborative development environment     Hands-on contribution to the development of our Fanatics Brands applications, underlying Infrastructure and Tools.      Deliver high quality, robust and scalable code     Utilize newly developed best practices, software development techniques, and frameworks with other teams within the organization     Assess and communicate risks based on complexity, resources and timeline constraints.     Perform research, evaluation and adoption of emerging technologies.     Participate in architectural decisions and infrastructure deployment of our Cloud-based platform    What we're looking for:    Requires at least 8+ years of software development experience      Requires knowledge of React JS and Node JS scripting languages     Requires knowledge of build tools and source controls     Requires experience with databases like MySQL on AWS     Requires experience with database stored procedures, functions, triggers, and data import processes.     Requires knowledge of open source application frameworks and RESTful services     Requires knowledge of Microservices and container platforms like Docker     Experience participating as part of an engineering team, including roles in a high-paced agile environment     Proven experience working with Agile development methodologies     Ability to scale and participate in multiple, major projects and ensure they are delivered on time according to project schedules. Requires in-depth knowledge of software development lifecycles and their utilization in software projects     Requires solid communication and interpersonal skills; with the ability to work constructively in a collaborative team environment    Bonus Points!    Prior experience in licensed product manufacturing applications     Prior experience in wholesale/retail applications     Hands-on experience in the Cloud; specifically, AWS     Hands-on experience with Open-Source projects  ", "ROLE": "Team Lead/Technical Lead", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - eCommerce, Internet Technologies", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Supply chain", "Architecture", "Analytical", "MySQL", "Software development life cycle", "Application development", "test driven development", "Stored procedures", "Open source", "Wholesale"]}