{"JOB DESCRIPTION": "   Develops software solutions by studying information needs; conferring with users; studying systems flow, data usage, and work processes; investigating problem areas; following the software development lifecycle.    Improving system quality by identifying issues and common patterns, and developing standard operating procedures.    Enhancing applications by identifying opportunities for improvement, making recommendations and designing and implementing systems. Maintaining and improving existing codebases and peer review code changes.    Liaising with colleagues to implement technical designs. Investigating and using new technologies where relevant.    Providing written knowledge transfer material.    Determines operational feasibility by evaluating analysis, problem definition, requirements, solution development, and proposed solutions.    Documents and demonstrates solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code.    Prepares and installs solutions by determining and designing system specifications, standards, and programming. Improves operations by conducting systems analysis; recommending changes in policies and procedures           About you      7-10 years of experience, has a B.Tech/MCA degree or similar, and is familiar with the following skills and tools/technologies:    A passion for solving problems and providing workable solutions, knowledge of algorithms and data structures, strong analytical and reasoning skills with an ability to visualise processes and outcomes, proficiency in troubleshooting software issues and debugging a large codebase, outstanding all-round communication skills and ability to work collaboratively.    Proven hands-on Software Development experience, proven working experience in Java development, hands on experience in designing and developing applications using Java EE platforms, object Oriented analysis and design using common design patterns.    Excellent knowledge of Relational Databases, SQL and ORM technologies (JPA2, Hibernate)    Experience in the Spring & Spring boot Framework    Experience in building API's and services using RESTful/SOAP service.    Experience in CI/CD delivery pipeline designing with github/gitlab, Jenkins.    Experience in JavaScript build tools like grunt or gulp    Proficient in CSS, HTML, and writing cross-browser compatible code.    Expert in any one of the modern JavaScript MV-VM/MVC frameworks (AngularJS, JQuery, NodeJS, GruntJS)    Familiar with testing frameworks (Ex. Jasmine)    Test runner framework (Ex. Karma)    Hand on and implements complex AngularJS applications, directives, controllers, services         Additional information     Experience in cloud technologies - AWS/Azure/GCP    Experience in No-SQL databases, Elastic Search etc.       ", "ROLE": "Team Lead/Technical Lead", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "MCA in Computers"}, "KEY SKILL": ["Hibernate", "jQuery", "Analytical", "Debugging", "Javascript", "Software development life cycle", "Data structures", "HTML", "MVC", "SQL"]}