{"JOB DESCRIPTION": "Roles and ResponsibilitiesWe are looking for a Lead Java Developer who is a self-starter, who can work well with minimal guidance and in a fluid environment. In this role you will be architecting our futuristic mobile & web 3.0 products and choose the best technologies, components, and subsystems on different server-side tech.WHAT YOU- LL DO:- Incumbent will be architecting our futuristic mobile & web 3.0 products and choose the best technologies, components, and subsystems on different server-side tech.- Drive innovations in the product constantly to remain ahead of the curve.- Serve as a thought leader and mentor on technical, architectural, design, and related issues.- Proactively identify architectural weaknesses and recommend appropriate solutions.- Balance short-term versus long-term actions, strategic versus tactical requirements, while continuing to move forward towards the strategic vision.- Collaborate with cross-functional teams to solve complex problems and building products spanning across multiple teams to deliver end-to-end products & features.- Estimate efforts, identify risks, devise, and meet project schedules.- Provide functional, design, and code reviews in related areas of expertise with-in team and cross-team.- Mentor/Coach engineers to facilitate their development and provide technical leadership to them.WHAT YOU'LL NEED : - Strong software design/development experience in building massively large scale distributed internet systems and products.- Experience in leading small teams.- Hands-on experience in Advanced Java and frameworks, Multithreading, collections, and MySQL/NoSQL, Golang, etc.- Excellent Data Structure & Algorithm, and problem-solving skills.- Experience and knowledge of open source tools & frameworks, broader cutting edge technologies around server-side development.- Should be an active contributor to developer communities like Stackoverflow, Topcoder, Github, Google Developer Groups (GDGs).- Excellent organization, communication, interpersonal, and leadership skills.- Must be a proven performer and team player who enjoy challenging assignments in high energy, fast-growing, and start-up workplace.WHO YOU ARE :1. Self-starter, highly motivated.2. Mentor/Coach who enjoys challenging assignments3. Curious. You are always learning and seeking ways to make things better.How we operate : You'll be a part of the a team that works together and wins together: delivering bold results, caring passionately about what we do and making a crucial difference through work that matters.Excited to work with us? Apply ASAP to give a head start to your careerMake an impact : Working at the speed of social, we create value for our customers by delivering solutions that power relationships at scale. Our pace of work enables fast learning and fosters an environment where you can make an impact.Learn and grow : We're committed to growing the capabilities of our people. We are building a learning community where you can work with diverse individuals, explore new ways of thinking, and expand your capabilities.Excited to work with us? Apply ASAP to give a head start to your career.", "ROLE": "Team Lead/Technical Lead", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "BCA in Computers, B.Tech/B.E. in Any Specialization, B.Sc in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Golang", "Java", "Multithreading", "Open Source", "Distributed Systems", "Algorithm", "Data Structure"]}