{"JOB DESCRIPTION": "As Technical Lead of Serving, you will lead a team of engineers responsible for the design, development, maintenance, and operations of key pipelines responsible for driving GroundTruths revenue. This is a hybrid role, with the opportunity to contribute as both a manager and an individual contributor. You will make hiring decisions, manage a team of engineers, and interface with colleagues across India and US offices. At the same time, you will also write code, participate in code review, and dive in to solve operational challenges. Your work will be immediately impactful as you develop features, safeguard mission-critical systems, and ultimately drive GroundTruth's bottom line.You will:Write clean, testable code with an emphasis on performance and maintainabilityHire, mentor, and manage engineers to deliver software solutions to business problemsSafeguard mission-critical systems, ensuring high reliability and availabilityTune complex systems to achieve key performance benchmarksCollaborate with fellow engineers, architects, and product owners to build highly reliable, scalable systemsIdentify areas of improvement and propose solutionsParticipate in code reviewWork on mission-critical systems that make up GroundTruths next-generation ad serving platformYou are:Organized and ThoroughAdaptive and FlexibleCollaborative and CooperativeResults-orientedPassionate and Proactive You Have:Bachelors or Masters degree in Computer Science or related field5+ years of software development experienceA strong grasp of fundamental data structures and algorithmsExperience in C++, and fluency in at least one C-style language such as C++ or JavaExperience in hiring, mentoring, and managing Strong verbal and written communication skillsExperience in at least one of the following areasSpatial IndexingDistributed SystemsMultithreadingServer-side platforms and data infrastructureKnowledge of one or more of the following technologies/toolsBig data/streaming technologies (e.g. Spark, Kafka, EMR)NoSQL data stores (e.g. Aerospike, DynamoDB, Redis, Elasticache)Performance analysis and profile tools (e.g. valgrind, oprofile, perf)Multi-threaded, event-driven servers (e.g. Apache, Nginx, Boost::asio)", "ROLE": "Technical Architect", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["Software Development", "Algorithms", "Data Structures", "Linux", "Software Engineering", "Aerospike", "Kafka", "Redis", "Valgrind"]}