{"JOB DESCRIPTION": " Title: Senior Software Engineer - IT - (RD-4) ACCOUNTABILITIESDesigns, codes, tests, debugs and documents software according to Dell systems quality standards, policies and procedures.Analyzes business needs and creates software solutions.Responsible for preparing design documentation. Prepares test data for unit, string and parallel testing.Evaluates and recommends software and hardware solutions to meet user needs. Resolves customer issues with software solutions and responds to suggestions for improvements and enhancements.Works with business and development teams to clarify requirements to ensure testability.Drafts, revises, and maintains test plans, test cases, and automated test scripts. Executes test procedures according to software requirements specifications Logs defects and makes recommendations to address defects.Retests software corrections to ensure problems are resolved.Documents evolution of testing procedures for future replication.May conduct performance and scalability testing.RESPONSIBILITIES:Leads small to moderate budget projects; may perform in project leadership role and/or may supervise the activities of lower level personnel.Provides resolutions to a diverse range of complex problems.Executes schedules, costs and documentation to ensure assigned projects come to successful conclusion.May assist in training, assigning and checking the work of less experienced developers. Performs estimation efforts on projects and tracks progress.Drafts and revises test plans and scripts with consideration to end-to-end system flows.Executes test scripts according to application requirements documentation.Logs defects, identifies course of action and performs preliminary root cause analysis. Analyzes and communicates test results to project team.Description CommentsOracle Agile PLM implementation experience. Extensive experience in Agile SDK, Process Extensions, Web Service Extensions Development Proficient in Java/J2EE Strong knowledge in Oracle SQL , PL/SQL. Experience in Developing web URL extensions, Agile Administration and Support Understanding of Oracle Agile product architecture, understand the nuances of PLM domain and managed some of the complex PLM programs Ability to thrive in a dynamic environment; work with minimal supervision while delivering on action items in a timely fashion Desirable Requirements: Familiarity with Extreme Programming (Agile/SCRUM /Pivotal) development methodologies and software development lifecycle principles Knowledge of SOA , Kafka Experience in Dev -Ops ( CI/CD), Automation), Gitlab Machine Learning Infrastructure engineering", "ROLE": "IT/Technical Content Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Temporary/Contractua", "ROLE CATEGORY": "Othe", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["Software Development Life Cycle", "Java", "Oracle SQL", "Scalability Testing", "SOA", "Software Engineering", "Web Technologies", "Kafka", "J2Ee", "Pivotal"]}