{"JOB DESCRIPTION": "Work Location: Remote -, India  ACCOUNTABILITIESDesigns, codes, tests, debugs and documents software according to Dell systems quality standards, policies and procedures.Analyzes business needs and creates software solutions.Responsible for preparing design documentation.Prepares test data for unit, string and parallel testing.Evaluates and recommends software and hardware solutions to meet user needs.Resolves customer issues with software solutions and responds to suggestions for improvements and enhancements.Works with business and development teams to clarify requirements to ensure testability.Drafts, revises, and maintains test plans, test cases, and automated test scripts. Executes test procedures according to software requirements specifications Logs defects and makes recommendations to address defects.Retests software corrections to ensure problems are resolved.Documents evolution of testing procedures for future replication. May conduct performance and scalability testing.RESPONSIBILITIES:Leads small to moderate budget projects; may perform in project leadership role and/or may supervise the activities of lower level personnel.Provides resolutions to a diverse range of complex problems.Executes schedules, costs and documentation to ensure assigned projects come to successful conclusion.May assist in training, assigning and checking the work of less experienced developers. Performs estimation efforts on projects and tracks progress.Drafts and revises test plans and scripts with consideration to end-to-end system flows.Executes test scripts according to application requirements documentation.Logs defects, identifies course of action and performs preliminary root cause analysis.Analyzes and communicates test results to project team.Total Exp- 5-8 years Skill :Java full stack developers. Must have- (must to have skills in Java 8, Spring Boot, REST API, SQL, PL/SQL, Angular and WebLogic knowledge and nice to have skills in PCF). Details Key Responsibilities: Design, develop and deploy of mission-critical enterprise applications using Java/J2EE. Development of detailed estimates for the technical tasks Develop the code as per the coding standards and naming conventions. Perform code migration and deployment during various phases. Perform code reviews and prepare technical documentation. Review of the test cases with the testing team and re-work on defects to closure .Contribute towards capturing performance requirements and involve in performance testing phase. Define initiatives to improve quality and/or productivity such as implementing automated test tools or new development methodologies within the team. Contribute to standards and processes to be followed during the software development lifecycle. Essential Requirements: Bachelors of Engineering/Technology degree in Computer Science or equivalent 5+ years of application design and development experience in Java/J2EE technologies, with at least 2 years of experience as a senior developer in a demanding enterprise J2EE/SOA/Webservices environment Extensive Object-Oriented Design skills using Java, J2EE, UML. Experience in deploying applications in WebLogic 12.x or greater. Exposure to Enterprise Application Integration (middleware) technologies and techniques. Strong knowledge of Spring, Angular/ JavaScript, Rest/Web Services, XML, XSLT & XSD (mandatory). Strong knowledge in SQL, PL/SQL with Oracle/SQL Server JDeveloper (Desirable) / Eclipse (desirable). Experience using Agile methodologies previous experience working from a backlog, sprints, retrospectives etc. Proven experience of delivering quality solutions on a fast-moving business environment.Experience with IBM MQ/Rabbit MQ/Kafka.Work Location (Location & Site) Hyderabad, Main Campus Work Shifts timing General Shift 10:00 AM IST 7:00 PM IST", "ROLE": "IT/Technical Content Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Temporary/Contractua", "ROLE CATEGORY": "Othe", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["Software Development Life Cycle", "Java", "Pcf", "Eclipse", "Javascript", "Spring Boot", "J2Ee", "Rest Api", "Web Services", "Angular"]}