{"JOB DESCRIPTION": "  GENERAL SCOPE & SUMMARY    Aspect, as a company, is on the exciting and monumental transition from on-premise to true SaaS and the R&D organization is searching for a passionate and results oriented Software Development Engineer looking to partner with a team of talented engineers working on our best in class Aspect Unified IP premise solution.   The team you will be joining works on both new and existing projects on Omni Channel communications across Self-service, Live Agent conversations, System Configuration, and outbound campaigns. One of the team s forward-looking charters is to design, develop, and deliver customer requests and sustain and upgrade ~1000 global deployments of Unified IP to the latest release to leverage new and innovative technologies.   We work in Agile teams that are very collaborative and supportive of each other and rally around company s goals of urgency, accountability for successful outcomes. In this supportive environment and with the challenge of diverse technical problems you will have ample opportunities in which to grow and accelerate your career.    PROFESSIONAL TRAITS NECESSARY FOR SUCCESS    Enthusiastic and versatile with a great attitude.  Team player and collaborative problem solver.  Extreme ownership and strong sense of personal responsibility.  Customer obsession in driving to successful outcomes.  Self-motivated individual capable of working from home with minimal supervision.  Self-learner that enjoys experimenting with new technologies.    PRIMARY ROLE & RESPONSIBILITIES     Lead and contribute to the design and development of new features sets.   Prototype new solutions and evaluate technical feasibility.   Overcome complex technical challenges demonstrating technical flexibility and creativity in problem solving.   Lead and participate in design reviews with cross-functional team members to better understand requirements.   Troubleshoot and resolve complex customer problems escalated to engineering.   Provide estimates and timelines for the development of features sets and delivering fixes.   Write tests and lead hands-on testing with other team members to complete feature sets.   Work with support engineers, professional services, and sales engineers to investigate and handle customer and field escalated cases.   Create and document best practices guidelines and knowledge base articles.   Complete documentation and procedures for installation and maintenance.   Develop, manage, and/or execute implementation according to project plans and priorities.   Provides estimated timelines for fixes.   Ensures products are up to date with 3rd party components that are in use.   Proactively identify non-compliance of code against requirements/standards/design and raise defects.   Work with members in the organization across various time zones.   Directs and or guides junior staff on specific tasks.   Participate in on-call rotation.     REQUIRED EXPERIENCE & SKILLS     Four-year degree in technical or engineering field. B.S. in Computer Science, Electronics, Mathematics, or related discipline.    5+ years of experience developing data driven applications using Javascript and Angular    Passion for developing rich & interactive user interfaces for complex domains   Proficiency designing and implementing complex web application features using JavaScript, Typescript, HTML5, and CSS3.   Strong experience of MVVM design patterns, and JavaScript libraries and frameworks including AngularJS, Angular, jQuery, and React.   Experience writing unit tests in a JavaScript unit testing framework and knowledge of Test Driven Development & Behavior Driven Development concepts and principles.   Experience with continuous integration/continuous deployment environments   Experience of HTTP for browser to back end tier communication.   Experience using Web Storm or equivalent IDE   Experience developing at least one major project from design to completion    Agile development methodologies and participate with team members in the planning and review of projects   Ability to adapt to changing priorities and learn new languages/technologies as necessary   Ability to communicate complex technical information to internal audiences.     PREFERRED EXPERIENCE & SKILLS     Experience building large-scale web apps with a reusable component architecture   Experience with source control, build management, project management, and continuous integration platforms and tools including Git, Jenkins, and Jira.  ", "ROLE": "Technical Architect", "INDUSTRY TYPE": "Construction, Engineering, Cement, Metals", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization, Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "jQuery", "Prototype", "MVVM", "Project management", "Javascript", "HTTP", "Unit testing", "JIRA", "CSS3"]}