{"JOB DESCRIPTION": "   About the Team    Fanatics is first and foremost a technology company. We are powered by cutting-edge tech created by our small agile teams using the latest tools and technologies under our highly analytical, forward thinking, and open-minded leadership. As the global leader in licensed sports merchandise, we challenge ourselves by improving our new fully responsive NodeJS cloud commerce platform, Elasticsearch engine, and deep data science capabilities while building the best-in-class retail manufacturing and supply chain technologies. Our tech teams work together to revolutionize data science and engineering initiatives, provide highly scalable real-time and streaming platforms, and create secure e-commerce and in-stadium fan experience products. Our own e-commerce platform transacts in over 190 countries, 17 languages, and 14 currencies. Our motto is #GSD get stuff done and we do just that. If you want to be at the nexus of sports, commerce, and technology, come be a part of our industry-leading team here at Fanatics Tech.   The Commerce Platform Services team is looking for a Principal Engineer whose primary responsibilities are the architecture, design and implementation of distributed software solutions in a highly available cloud environment. In this role, you will collaborate with product managers, and engineering teams across functional domains like Product Finding, Accounts Checkout, Inventory Order Management, Customer Experience Support, Pricing Promotions. If you re passionate about technology and its potential to enable a great end-to-end experience for sports fans, this job is for you.   Responsibilities   Architecture and design of systems: define, document and communicate it   Distributed systems, trade-offs between availability and consistency, horizontal and vertical scalability   Data modeling, SQL, NoSQL and NewSQL databases   Hands on contribution, understand modularity, concurrency and benefits of immutability and functional programming   Provide technical guidance in planning and executing assigned projects.   Strong team builder and team player with demonstrated ability to lead, motivate, and mentor others.   Develop new systems and maintain and modify existing systems when required.   Ability to translate complex technical subjects for a diverse audience; capable of contributing to broader business conversations beyond functional expertise.   Minimum qualifications   BS Degree in Computer Science, Engineering   Requires at least 10 years of software development experience   Proven experience working with Agile development methodologies and software development lifecycles   Ability to scale and lead major initiatives   Requires knowledge of open source application frameworks and service oriented architecture   Preferred qualifications   Master's degree in Computer Science   Experience with Java or other object-oriented languages is a plus   Experience working in an e-commerce or direct to consumer retail environment is a plus   Hands-on experience with Open-Source projects a plus   Hands-on experience in the Cloud; specifically AWS a plus   Prior experience in eCommerce and payments industry a plus   & ", "ROLE": "Team Lead/Technical Lead", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - eCommerce, Internet Technologies", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Order management", "software development", "E-commerce", "sql", "nosql", "cloud", "Supply chain", "Computer science", "java", "Data modeling", "Analytical", "agile", "aws", "Open source", "Distribution system"]}