{"JOB DESCRIPTION": "The Senior Software Engineer/ Sr. System Analyst is responsible for planning, processing and executing all technical assignment using ASP .Net in an efficient manner with no assistance from the supervisor. Review and repair legacy code, Analyze, design, coordinate and supervise the development of software systems to form a basis for the solution. Responsible for analysis of current programs including performance, diagnosis and troubleshooting of problem programs, and designing solutions to problematic programming. Making presentations to customer or client audiences or professional peers. Maintain positive client interactions. \n  Responsibilities  \n Must have hands-on experience in the following areas: \n middot   Off Site Interaction with project stake holders for gathering project requirements and suggesting solutions and implementation. \n middot   Design & Development of the project which includes, system architecture, Database design, Application Coding, Integration, Implementation and Maintenance. \n middot   Reviewing the work products like solution documents, code change etc. \n middot   Provide assistance to testers and support personnel as needed to determine system problems. \n middot   Identify the requirement from the client. \n middot   Maintain client databases \n middot   Strong and effective inter-personal and communication skills and the ability to interact professionally with a diverse group of clients and staff. \n middot   Provide recommendations to management concerning issues of programmer productivity and software development management. \n middot   Research and recommend software tools to management. \n middot   Deliver the project as per the schedule plan. \n\n\n  Experience  \n middot   Candidate having 4-5 years relevant hands-on technical experience preferred experience in working with US based companies. \n middot   Proficiency in.Net 2.0, 3.0 & 3.5 Frameworks & Web Tools & technologies like ASP.Net, Web Services, XML, AJAX Database knowledge of SQL Server 2008/05 \n middot   Maintain, revise & update existing software. \n middot   Extensive Knowledge in OOPS concept, WPF, WCF and LINQ.", "ROLE": "System Analyst", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["database design", "coding", "software development", "documents", "xml", "system architecture", "inter", "troubleshooting", "wcf", "ajax"]}