{"JOB DESCRIPTION": "   Job Description         Job Responsibilities   1. Developing UAT test plans including test scripts, test scenarios, test schedules, defect tracking and reporting.    2. Confirming that Test scenarios and scripts are comprehensive to completely test all requirements.    3. Confirming that the Test results accurately document the results of testing and all test exceptions are resolved and verified.    4. Confirming that through the System and User Acceptance Test phases that Test scripts are appropriately updated to address any script issues.    5. Confirming that the RTM ties requirements back to the Test scripts and confirms that all requirements have been successfully tested.    6. Working with the corresponding functional leads to communicate any requested changes to the project managers, business owners, and program management office.    7. Anticipating issues / risks and proactively addressing them.    8. Resolving conflicts with sensitivity and tact.    9. Effectively communicating with stakeholder, vendor and customers.    10. Communicating to team members how their work assignments relate to and help achieve project objectives.    Skills Required   Minimum 8 years of experience in System Testing in medium to complex software applications Experience in all aspects of the Systems Test Lifecycle (STLC) effort including plans, schedules, defect management, reporting and coordination of other resources Understand the testing methodology used and be able to explain the processes, tools, templates, environment, and concepts to appropriate stakeholders    Ability to document and communicate the status of testing progress against plans, taking corrective action and escalating as necessary Understanding of Software Development Life Cycle (SDLC) and STLC methodologies for ERP and/or Cloud based systems Scheduling and leading UAT team meetings such as status, project kick-off, stand-ups, defect tracking, etc., and meeting with the business stakeholders to prioritize work and projects. Ability to develop strong client and working relationships with the team. Identifying, managing and mitigating issues, risks and project conflicts. ", "ROLE": "Testing Engineer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - QA & Testing", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["System testing", "ERP", "Test scripts", "Defect tracking", "Test scenarios", "Software development life cycle", "Scheduling", "Application software", "User acceptance testing", "SDLC"]}