{"JOB DESCRIPTION": "Roles & Responsibilities:  Candidate will be part of our Self Care team liaising with Product Strategist and Product Owner to develop Tetherfis Products based on Self-care & Outbound Product Streams. Will design, develop and enhance Tetherfis existing products and future products placed under Self Care Product Line. Will report to Delivery Owners on Project Deliverables.Will be mentored to nurture and groom their skills in Self-care related Product and application development.  Expected Technical & Functional Skills:   Extensive Hands-on experience in building self-service IVR applications using any of the leading coding techniques including VXML, Core Java, JavaScript, J2EE, JPA, Spring, Hibernate etc., Prior experience in integrating applications with webservices like MQSeries, LDAP etc., and developing SOAP/REST based services  Must have Deployed insightful data driven IVR solutions with conceptual understanding on the principles and concepts of IVR. Have in-depth knowledge of open architectures including VXML, CCXML and GRXML. Well versed with Contact Center Telephony concepts and IVR development in any of the major platforms like AVAYA, GENESYS, CISCO, ASPECT, etc.,  Thorough understanding of call flows, queuing, routing and CTI on any of the above-mentioned Principals.Prior experience in Developing IVR Solutions for any of the above-mentioned OEM. Candidate should have realization on designing and troubleshooting routing work flows and IVR-CTI integrations.Experience in designing and deploying solutions for cross integrations among OEMs in CC or UC environment is preferred. Must have integrated, retrieved data and extensively familiar in handling Database interactions with Databases like SQL, Oracle and other standard DBs.  Prior experience in writing and presenting HLD and LLD and getting them signed off from respective stake holders.  Excellent verbal,      written and effective communication skillsDemonstrated      ability to achieve stretch goals in a highly innovative and fast paced      environmentEffective      time-management, organizational and prioritization skillsStrong      sense of responsibility, accountability and passion about quality of work,      desire to learn and take ownershipPrioritize      and juggle between multiple projects based on business needEffectively      Communicate with external customers as and when requiredMust bring structure to      ambiguous / open ended challenging assignments", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Telecom Software", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "Post Graduation Not Required, Any Postgraduate in Any Specialization", "DOCTORATE": "Any Doctorate in Any Specialization"}, "KEY SKILL": ["Hibernate", "Core Java", "Rest", "IVR", "Javascript", "VXML", "JPA", "J2Ee", "Spring", "SOAP", "Web Services", "Avaya"]}