{"JOB DESCRIPTION": "   We are looking for a self-motivated   Senior Quality Assurance Specialist   to join our team in Trivandrum!       The ideal candidate is someone who thrives in a changing environment, develops a deep understanding of our products and wants to lead innovation in FinTech. This role is an immediate full-time position.         What will you contribute     The Senior Quality Assurance Specialist will be working on Finastra s latest-generation Azure cloud-based infrastructure and lending applications and report to the Senior Manager of Software Development.         Responsibilities Deliverables:      Your responsibilities will include, but are not limited to, the following:           Design and implementation of automated testing for multiple applications           Take ownership and responsibility for the design and development of test strategies           Follow our software development lifecycle           Identify, document and track issues found during testing           Advocate for the needs of QA to all levels      Required Experience:            C#, Selenium and WinAppDriver experience           RESTful API test experience preferred           Awareness of CI / CD pipelines           Thorough knowledge of methodologies of quality assurance and standards           Familiarity with software development methodologies and the software development lifecycle           Ability to research discuss solutions to a variety of technical problems of moderate scope and complexity -- over time, independently           Strong technical, analytical, and development skills           Effective verbal and written communication skills and a customer orientation           Collaborate within a friendly team environment.           Financial industry experience a plus, but not a requirement   ", "ROLE": "Quality Assurance/Quality Control Manager", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - QA & Testing", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "QA/Testing/Documentatio", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["QA", "Software development methodologies", "Automation testing", "Software QA", "Manager Quality Assurance", "Analytical", "Finance", "Software development life cycle", "Recruitment", "Testing"]}