{"JOB DESCRIPTION": "Software Development Engineer QA- Leading Well Funded Startup in Mumbai  Immediate opening for Test engineers with 4-8 years of experience and preferably have worked in automation testing across direct-to-consumer setups.  (b2c)     Prefer candidates only from Tier 1 Institutes- IIT, NIT, BITS etc.  Software Development Engineer QA- Leading Well Funded Startup in Mumbai I'm looking for Software Development Engineer QA  (SDET II)  for a Leading well Funded Startup. We're looking for Test engineers with 4-8 years of experience and preferably have worked in automation testing across direct-to-consumer setups.  (b2c)  Client- HQ in Mumbai- Our tech team is the core of our mobile-first cross-platform  (desktop + mobile PWA,  android & iOS)  our product serving more than 3+ crore users with over 1.5 million rpm  (requests per minute)  at peak concurrency. Leaders in its field We are looking for candidates from Tier 1/ Top Engineering institutes Only with experience in reputed startup in Mumbai/ Pune Your role:  -Develop automated test scripts to maximize efficiency -Perform load testing,  locate performance bottlenecks to create and analyze reports relating to performance benchmarking,  test plan status,  and site usage statistics -Participate in design reviews and provide feedback on features and usability as accurately as possible and come up with possible test requirements -Identify test data requirements and generate required data to support testing -Completion of the tasks without creating a dependency -4-8 years of QA experience with emphasis on automated testing  (white box testing)  with Selenium/ Appium/ Robotium -Experience working on scripting or programming languages  (JavaScript,  Java)  and MY SQL -Hands-on experience with JUnit/ TestNG/ RESTful frameworks  - Should have worked on load testing tools like Expresso/ SoapUI Pro/ Jira/ Jmeter and Swift automation technologies   -Familiar with agile software development cycles and security testing My client is looking for candidates from Tier 1/ Top Engineering institutes Only Pls share your resume accordingly will call and discuss with you regarding the company in detail. ", "ROLE": "Team Lead/Technical Lead", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - eCommerce, Internet Technologies", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["rest", "Automation", "software development", "Load testing", "Test scripts", "automation testing", "testing", "JIRA", "javascript", "sql", "Android", "White box testing", "java", "selenium", "Testing tools", "agile", "soap"]}