{"JOB DESCRIPTION": "About the CompanyAlphaGrep is a proprietary trading firm focused on algorithmic trading in asset classes across the globe. We cover the global markets by leveraging and integrating technology, risk management and quantitative research.  We are one of the largest firms by trading volume on Indian exchanges and have significant market share on several large global exchanges as well. We use a disciplined and systematic quantitative approach to identify factors that consistently generate alpha. These factors are then coupled with our proprietary ultra-low latency trading systems and robust risk management to develop trading strategies across asset classes (equities, commodities, currencies, fixed income) that trade on global exchanges.We are seeking bright and resourceful individuals for our DevOps team which is based out of our Mumbai office.Roles and Responsibilities Build infrastructure tools and applications to support trading teams across the firm.Identify, design, and implement internal process improvements: automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability, etc.Assemble large, complex data sets that meet functional / non-functional business requirements.Coordinate with global teams to understand their requirements and work alongside them.Establishing programming patterns, documenting components and provide infrastructure for analysis and executionSet up practices on data reporting and continuous monitoringWrite a highly efficient and optimized code that is easily scalable.Adherence to coding and quality standards.Qualification1-4 years of strong hands-on experienceStrong working knowledge in programming languages like Python, C++, etc.Strong working SQL knowledge and experience working with relational databases, query authoring (SQL) as well as working familiarity with a variety of databases.Experience performing root cause analysis on internal and external processes to answer specific business questions and identify opportunities for improvement.Good to haveExperience with web crawling and scraping, text parsingExperience working in Linux EnvironmentExperience with Stock Market DataWhy you should join usGreat People. Were curious engineers, mathematicians, statisticians and like to have fun while achieving our goalsTransparent Structure. Our employees know that we value their ideas and contributionsRelaxed Environment. We have a flat organizational structure with frequent activities for all employees such as yearly offsites, happy hours, corporate sports teams, etc.Health & Wellness Programs. We believe that a balanced employee is more productive. A stocked kitchen, gym membership and generous vacation package are just some of the perks that we offer our employees", "ROLE": "Solution Architect / Enterprise Architect", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "System Design/Implementation/ERP/CR", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["C++", "Linux", "Python", "Scalability", "Coding", "Continuous Monitoring", "Data Reporting", "Quality Standards"]}