{"JOB DESCRIPTION": "PHP Laravel Internship - Final year students - Faveo Helpdesk Software PHP Laravel Internship Final year students  OverviewA three-month programme will welcome you in the world of web development where you would be learning to develop informative,  creative and attractive custom web applications.  This internship program is especially for college student from reputed colleges only\n  Who are we looking for?\n\nFreshers,  final year engineering college students from top 100 reputed engineering college in India \nCandidate having Creative Thinking and Original Approach \nWillingnessability to learnwork on new technologies   Responsibilities/ Learning: \n\nBuilding Web applications using PHPLaravel framework  Technologies Interns will work on: \n\nCandidates from engineering,  computer science and information technology background preferred \nCandidates having interest in programming preferred \nCandidates having prior knowledge ofPHP/ Laravel preferred   How can I apply?\n\nIndicate the area of work that you want to intern for \nAttach previous work or portfolio \nResume should have candidate photograph in it \nMention LinkedIn,  Github Profile URL in the resume \nUse following mail subject: Internship Application PHP Laravel Development  \nGood performing,  deserving candidates will be given stipend of INR 10, 000 per month \nExceptionally good interns may be offered permanent job opportunities depending on the needs of the organization \nWe do not charge any fees/ money in terms of caution deposit or training charges or in any other forms from candidates  Your email address will not be published.    We are live and ready to chat with you now.  Say something to start a live chat. \n\n\n\n   Warning :Sorry,  file transfer is limited to5files at a time.  Please try the following file(s) again :\n\n  Close \n\n   Warning :Sorry,  file transfer is limited to50mbper file.  Please compress the following file(s) and try again. \n\n  Close \n\n Message cannot exceed 5000 characters\n  Drop files here to upload \n Please fill out the form below to start chatting with the next available agent. \n Visit tawk. t", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["development", "Email", "software", "Web development", "it", "Internship", "Information technology", "Helpdesk", "application", "web", "XML", "MySQL", "PHP", "Messaging", "Final", "programming", "applications"]}