{"JOB DESCRIPTION": " MergerWare is looking for expanding the software engineering team to enhance a world-class M&A software product. We serve top tier customers globally in Fortune 100 space. Our product is a disruptive innovation in the financial sector required by VCs, private equity funds and corporate M&A. We are looking for key technical talent who will form the core of the company. This team will build the product from the ground up, contribute to architecture, design, and platform with lots of room for innovation!    Our engineering talent would ideally be hands-on in the following areas with multiple years of experience in developing and leading enterprise-class teams.    Self-motivated with an ability to go beyond the norm and rise above the challenges! Our key hires will be given stock options and the ability to function in various roles and key responsibilities by cross-function mobility opportunities.  What you will do            Learn software architecture and fundamentals of the platform in which product is developed.     Understand javascript frameworks Meteor JS, Node JS, MongoDB, NoSQL, Push Notification, etc.           Get a hands-on and familiarity with newer specifications of EcmaScript                          Experience with the data structure and RESTful APIs                            Gain deep expertise and Knowledge of modern authorization mechanisms, such as JSON Web Token      Will get proficiency in JavaScript, including DOM manipulation and the JavaScript object model      Translate design specifications into an implementation that meets those tech requirements.      Get familiar with the agile software deployment model and actively participate in performing daily work for the team.      With guidance, deliver well-structured, high-quality, extensible, maintainable code that follows established MergerWare coding guidelines and best practices for code structure,   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Automation", "DOM", "Coding", "Agile", "M&A", "Software Intern", "Customer support", "software quality", "Private equity", "Equity Funds"]}