{"JOB DESCRIPTION": "UI/ UX Internship -  Faveo Helpdesk Software UI/ UX Internship  Overview  A three month programme will welcome you in the world of web development where you would be learning to develop informative,  creative and attractive custom web applications.  Who are we looking for   Candidate having Creative Thinking and Original Approach Willingness & ability to learn & work on new technologies  Responsibilities/ Learning:  Front- end programming in any one framework such as JavaScript/ jQuery/ Vue.js Converting raw images and layouts from a graphic design perspective or PSD files into CSS/ XHTML themes Optional Creating responsive design layout from PSD using Twitter Bootstrap Optional   Technologies Interns will work on:  Basic Adobe Photoshop Any IDE such as Adobe Dreamweaver/ Netbeans  Candidates from engineering,  computer science and information technology background preferred Candidates having interest in programming preferred Should have completed Web design/ UI course from reputed institute/ college Build a project using HTML, CSS, jQuery as part of college or training at an institute  How can I apply  Indicate the area of work that you want to intern for Attach previous work or portfolio The resume should have candidate photograph in it Mention Linkedin Profile URL in the resume Use following mail subject: Internship Application PHP Laravel Development  Internships are not paid Good performing,  deserving candidates will be given a stipend of INR 5, 000 per month (Negotiable,  based on performance) Exceptionally good interns may be offered permanent job opportunities depending on the needs of the organization We do not charge any fees/ money in terms of caution deposit or training charges or in any other forms from candidates  One to three months Your email address will not be published. Recaptcha requires verification.   I'm not a robot   We are live and ready to chat with you now. Say something to start a live chat.      Warning : Sorry,  file transfer is limited to 5 files at a time. Please try the following file(s) again :   Close     Warning : Sorry,  file transfer is limited to 50mb per file. Please compress the following file(s) and try again.   Close   Message cannot exceed 5000 characters  Drop files here to upload  Please fill out the form below to start chatting with the next available agent.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["psd", "c++", "C", "software", "HTML", "bootstrap", "jquery", "Technical product configuration", "ui", "web", "design", "MySQL", "JavaScript", "email", "programming", "development", "ux", "integration PHP", "adobe", "photoshop", "it", "xhtml", "layout", "application", "php"]}