{"JOB DESCRIPTION": "       Your Career    As a Software Quality Assurance Engineer on our Prisma Cloud Service team, you will design, develop and deliver next-generation technologies. You will build, automate, and run testing scenarios for our products in virtualized environments. We are looking for highly technical individuals driven in their desire to get hands-on experience in complex cloud environments. You'll work closely with our development and product management teams, testing and presenting the results to identify new approaches.   You will participate in design discussions and help make a difference in developing the future direction of our software. You will drive the efficiency and reliability of our products by testing them thoroughly to understand potential risks, bugs, or issues, providing an exemplary product experience for our end users. You strive for the best in everything you do meaning you   won t rest until the products you work on at the highest quality. You love hunting for problems within code, seeking issues to correct, and enjoy the challenge of a code-based scavenger hunt that includes testing, providing feedback, and identifying alternative suggestions for our products environment.      Your Impact     Provide a consistent, standardized, and a standard methodology approach in developing testing automation across our cloud platform   Design and develop test plans and test strategies for complex new features/application span across multiple scrum teams and define the process for communication and collaboration among them   Analyze complex defects/issues, provide guidance/work methodically to isolate root cause found during and after software release   Take a leading role in ongoing process enhancements and software testing practices   Work closely with the greater engineering group, Product Management teams during product development from requirement to release   Define, develop and maintain complex testbed environments   Build test automation frameworks that is easy to develop scripts, robust, supports variety of reporting, easy to troubleshoot failures, integrates with bug tracking systems and works easily with CICD for cloud-based products   Drive improvement on functionality, usability, testability, performance and production stability of the applications and systems   Analyze performance data, production logs, and graphs to find anomalies in production   Work with APIs from multiple cloud vendors and their associated technologies and tools   Mentor and coach scrum team members       Your Experience     BS/MS in computer science or a related technical field with 10+ years of relevant industry experience   Career level years of proven experience in leading test strategy for SAAS products such as AWS, Google Cloud Platform (GCP), and Azure   Software QA Automation experience with Distributed and Cloud-based systems using Python   Experience working with Selenium-based UI automation frameworks   Career-level years of hands-on leadership experience in Agile and Scrum process    Expertise in identifying performance bottlenecks and solving performance issues in distributed cloud software   Experience driving performance test efforts for complex, asynchronous microservice-based systems   Experience with Rest API testing at scale   Knowledge of PyTest and Robot framework is a plus   Experience with Docker, Kubernetes would be a plus   A self-starter who is confident and effective when working across distributed teams   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Test strategy", "Social media", "Agile", "Scrum", "Selenium", "Internship", "Software quality assurance", "Analytics", "Python"]}