{"JOB DESCRIPTION": "Associate Business Analyst -  Internship -  Faveo Helpdesk Software Associate Business Analyst Internship Overview \n\nWe are looking for interns to join our customer relationship department. A three- month programme will welcome you in the world of Business Analyst & Relationship management where you would be learning skills necessary to advance into a Client management role within Faveo Helpdesk.\n\nResponsibilities \n\n As an Entry level business analyst,  You ll be expected to capture complex processes and requirements from business experts in detail to form concrete,  practical requirements. You ll need to coordinate with management and IT team to further refine and develop solutions for these requirements \n\nEnd to End Account management of our existing customers \n\n Understand the business need & gather requirements from clients. Create direct channels of communication to software and application developers that get the job done without managerial interjection \n\nSuccessfully dealing with the different point of contacts from the client and serving their requirements \n\nPerform account management related duties and ensure that all client deadlines are met \n\nFlawlessly execute end- to- end projects,  liaising with key internal and external stakeholders. \n\nMaintain regular communication with key accounts and annual correspondence with all customers \n\nResponsible for Service Delivery ensuring client retention and reference Qualifications \n\nBachelor s or Masters degree,  professionals from technical background preferred. \n\nAwesome written & verbal communication skills \n\nAbility to form relationships with customers,  including being responsive and empathetic to customers needs \n\nSolid work ethic,  self- discipline,  persistence,  and ability to work independently and in a team \n\nMultitasking,  organizational,  and time- management skills \n\nProactively keeps up to date on industry and customer specific issues \n\nTechnical abilities to understand our products & client requirement \n\nCandidate with experience in CRM,  Helpdesk industry How can I apply \n\nIndicate the area of work that you are applying for \n\nAttach previous work or portfolio \n\nRegular cash/ gift monthly/ quarterly/ half/ annually incentives offered based on performance \n\nComplementary Hot Beverages and healthy Lunch provided at office \n\nAnnual salary after internship 1, 20, 000 to 2, 40, 000 P.A CTC \n\nFor Internship Stipend 5, 000 to 10, 000 CTC Per month \n\nSalary mentioned above will have deductions such as PT,  PF,  ESI,  TDS etc as per government regulations. In hand salary after deductions will be lower then the salary mentioned above. Detailed salary breakup is provided along with offer letter. \n\nAnnual Incentive/ bonus based on yours & company s performance. Declared in March every year and credited in April \n\nEmployee stock option available \n\nExceptionally good interns may be offered permanent job opportunities depending on the needs of the organization \n\nWe do not charge any fees/ money in terms of caution deposit or training charges or in any other forms from candidates Other details: \n\nWe expect minimum 12 months job commitment from candidates. No relieving documents are issued to candidates leaving the job before the commitment period. \n\nNotice period is 60 days. \n\nBYOD We promote bring your own device policy. Employees need to carry their own laptop to work. \n\nSalary hike,  appraisal reviews will take place annually in March every year. Annual salary hike will commence from April each year. \n\nMinimum 12 months of employment is required to be eligible for annual bonus or salary hike. Before joining there will be thorough verification by third party. Following documents needs to be submitted and carried for final round of interview.\n\nID Proof Aadhar card & Pan card \n\nAddress proof \n\n10th,  12th(PUC),  diploma,  graduation,  post graduation marks card and certificate(degree) We are an equal opportunity employer and value diversity. We do not discriminate on the basis of race,  religion,  color,  national origin,  gender,  sexual orientation,  age,  marital status,  veteran status,  or disability status.\n\nYour email address will not be published. \n\nPop out widget \n\nEnd this chat session Please fill out the form below to start chatting with the next available agent.\n\nSorry,  file transfer is limited to 5 files at a time. Please try the following file(s) again :\n\nSorry,  file transfer is limited to 50mb per file. Please compress the following file(s) and try again.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Relationship management", "TDS", "Associate Business Analyst", "technical", "software", "level", "Account management", "it", "Internship", "Client management", "Helpdesk", "application", "service", "Customer relationship", "email", "CRM", "PUC"]}