{"JOB DESCRIPTION": "Hi,Hope this message finds you well!This is Nita Kamra from Collabera and I am writing to you regarding an excellent job opportunity that I have with one of Collabera's premier clientsWe have below position on Collabera Payroll.Position Details:Employer: Collabera Technologies Pvt Ltd (will deploy with one of our client)Job Title / Skill : Dot net Developer with C#Mode of Interview: Online interviewInterview: On Prior Intimation in weekdays only (Monday to Saturday)Training location: BangaloreWork Location: Pan India, like Bangalore / Hyderabad / Chennai / Pune / Kolkata, etc Depending on Client onlyCan join in : Immediate to 15 daysExperience : Fresher + (Required all the documents of the Education like, Mark sheet, Provisional Certificate / Degree Certificate , Aadhar card, etc) Job Description:  Application Developer- C#.Net  Qualification : Only B.E, B.Tech (Only CSE/IT)Year of Pass Out : 2020 (only)Percentage Criteria  :60% in 10th,60% in 12th, 65% in B.E/B.Tech (Need Provisional Certificate / Degree Certificate)Education Gaps, Backlogs, Masters will not be considered Basic Skills : Have to mandatorily from CS/IT discipline with programming skills Candidates with basic programming skills in C, C++ , Java to be considered. Candidates with very Good Communication Skills & Good Attitude is Mandatory to have. Candidates Must haveLaptop or Desktop with webcam (Camare is Mandatory) (No Phone or Tablet)Proper Internet connectivityMicrophone will be helpful so communication should be recorded properly.' Since this is an urgent business requirement, Id appreciate a prompt response on this. Also I would appreciate if you can pass on this information to your friends or colleagues who are looking for change at this time.If you are intersted then Call on 9023129157 Email me on Nita.hansraj@collabera.com", "ROLE": "IT/Technical Content Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Othe", "EDUCATION": {"UG": "B.Tech/B.E. in Other Specialization, Computers"}, "KEY SKILL": ["C#", "Java", ".Net", "Net"]}