{"JOB DESCRIPTION": "Sales Internship - Final year students - Faveo Helpdesk Software Sales Internship Final year students  OverviewA three-month programme will welcome you in the world of sales where you would be learning skills necessary to advance into a sales role within Faveo Helpdesk.   Who are we looking for? Freshers,  final year Business school students from top 100 Business schools in India Candidate having Creative Thinking and Original Approach Willingnessability to learnwork on new technologies Must be a self-starter Strong communication and interpersonal skills Proficient computer skills,  including Microsoft Office   What will you be doing?   We are growing very rapidly and looking for talented,  motivated and self-driven people.  You will sharpen your skills while diving into the startup world in a very diverse and fast-paced environment.  As an Intern,  you will have the opportunity to support our awesome sales team. You are a people person and will support our Sales Development Representatives and Account Executives.  You love getting into the details of a customer and finding out who they are and what they are looking for.   Candidates studying MBA,  sales background preferred  How can I apply? Indicate the area of work that you want to intern for Attach previous work or portfolio Resume should have candidate photograph in it Mention LinkedIn Profile URL in the resume Use following mail subject: Internship Application Sales  What can we offer you?  A great challenge! A lot oflearning opportunities and freedom Being part of an international,  winning and growing team that exists of 20 awesome colleagues   Good performing,  deserving candidates will be given stipend of INR 20, 000 per month Exceptionally good interns may be offered permanent job opportunities depending on the needs of the organization We do not charge any fees/ money in terms of caution deposit or training charges or in any other forms from candidates  Your email address will not be published.    We are live and ready to chat with you now.  Say something to start a live chat.       Warning :Sorry,  file transfer is limited to5files at a time.  Please try the following file(s) again :   Close     Warning :Sorry,  file transfer is limited to50mbper file.  Please compress the following file(s) and try again.    Close   Message cannot exceed 5000 characters  Drop files here to upload  Please fill out the form below to start chatting with the next available agent. ", "ROLE": "Regional Manager", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "Sales, Retail, Business Development", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Retail Sale", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "MBA/PGDM in Marketing"}, "KEY SKILL": ["Copyright", "Linkedin", "Email", "Helpdesk", "Messaging", "Internship", "Final", "Business Executive", "Application", "WHO"]}