{"JOB DESCRIPTION": "Senior Software Engineer - Backend - Supply Chain Management (In Bound - Vorta)Myntra’s Engineering team builds the technology platform that empowers our customers’ shopping experience and enables the smooth flow of products from suppliers to our customers’ doorsteps. We work on areas such as building massive-scale web-applications, engaging user-interfaces, big-data analytics, mobile apps, workflow systems, inventory management etc.We are a small technology team where each individual has a huge impact. You will have the opportunity to be part of a rapidly growing organization and gain exposure to all the parts of a comprehensive e-commerce platform.You will be a part of Vorta, the intelligence and insights engine for MyntraVorta systems power critical insights and intelligence for a variety of functions for Myntra. It surfaces Market Intelligence for our business teams to make the right decisions around Pricing, Selection, Merchandising, and many other axes. It assists our inhouse fashion designers in creating fresh designs, make them aware of the latest trends in the industry and guide them in their design process to produce the best selling designs. Vorta is also working towards helping Myntra buy the right kind of inventory from Brands to make working capital more efficient. Vorta relies on massive data gathering from a variety of internet sources, intelligent informationextraction, standardization, data warehousing, compute powerful insights and serve them via our portal. We use cutting edge AI and ML models for a variety of stages in our data pipeline. We use technologies like Camel, ElasticSearch, RabbitMQ, MySQL, MongoDB, Druid, etc and also a lot of Azure technologies like ADLS, Custom Vision, AKS.Your Responsibilities: Write maintainable/scalable/efficient code. Design and architect technical solutions for the business problems of a very largee-commerce portal. Work in a cross-functional team, collaborating with peers during the entire SDLC. Follow coding standards, unit-testing, code reviews etc. Follow release cycles and commitment to deadlines.Desired Skills and Experience: 3 to 5 years of experience in very large scale applications. Strong problem solving skills, data structures and algorithms. Experience with distributed systems handling large amounts of data. Excellent object oriented coding skills in Java/J2EE/Python Very good understanding of Web Technologies. Very good understanding of any RDBMS and/or messaging. BE/BTech/MTech/MS in Computer Science or equivalent from a reputed college.", "ROLE": "Software Developer", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers, MS/M.Sc(Science) in Computers", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Rabbitmq", "Java", "Warehouse", "Algorithms", "MySQL", "MongoDB", "J2Ee", "Supply Chain Management", "Camel", "Python"]}