{"JOB DESCRIPTION": "Our Exciting Opportunity : The Software Developer supplies, to create a customers solution, in all phases of the software development lifecycle, towards properly engineered information systems, containing software as the major component, to meet agreed business requirements!  The Software Engineer is responsible for ensuring that the delivered software components provide the vital functionality and perform in accordance to the overall requirements and to the customers expectation! You are passionate about technology and software developmentYou are continuously experimenting and learning more You love solving problems and digging into complex problems We believe in trust – we trust each other to do the right things.  We believe in taking decisions as close to the product and technical expertise as possible. We believe in creativity – trying new things and learning from our mistakes. We believe in sharing our insights and helping one another to build an even better user plane  You will:Involved in Solution Design, Development and Integration. Involved in Problem solving and critical thinking. Delivering Results & Meeting Customer Expectations. Clearly sharing all knowledge in respect of the automation applications owned, in terms of code, application architecture, user-IDs, passwords, security related parameters, etc with the appropriate partners. Ownership of timely updates to all the affected partners regarding any new factors affecting any Automation application designed or deployed or both. To be successful in the role you must have: Java programming skills, Web technologies, knowledge and development experience, primarily on UNIX / Linux platform. software development experience in (Java, Groovy, JavaScript, extjs, Multithreading, JIRA) Good to have - knowledge and skills on any RDBMS, preferably on SQL. Good solid understanding of packet networking. Development experience on this would be a definite plus. Basic familiarity with mobile telecommunication networks, their architecture and mechanisms would be an added advantage. Primary Competence Domain (Software development). Key Qualifications: Education: Bachelor’s degree or higher in ECE, IT, CS or MCA. Minimum years of relevant experience: 2 years.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Telcom, ISP", "FUNCTIONAL AREA": "IT Software - Telecom Software", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization, Any Graduate in Any Specialization"}, "KEY SKILL": ["Java", "Maven", "Hibernate", "Automation", "Web Technologies", "OOPS", "J2Ee", "Groovy", "Spring", "SQL", "Software Development Life Cycle", "Core Java", "Multithreading", "Software Engineering", "Javascript", "Core"]}