{"JOB DESCRIPTION": "  About the Role    We are looking for Ruby on Rails developer to join an existing application development team, working on the development of a Cloud based Financial Accounting application. The individual will be required to work within a team of established developers (offshore and onshore) to develop new functionality for an existing Financial Accounting application.    We are looking for candidates with commercial experience in web development and Ruby on Rails.    Main Duties and Responsibilities    o A Proven work experience as a Ruby on Rails developer with good understanding of Java script, jQuery, HTML, CSS. The individual will need to be hands on with development, performance optimization, secure development process, usability, and coding standards of the product.   o Strong ROR development experience and follows best practices (test-driven development, continuous integration, SCRUM, refactoring, and code standards)   o Should have a mix of excellent reasoning ability to document, architect, develop and test software with the commitment to excellence and defect free product before being deployed.   o Should be able to work closely with all stakeholders to investigate, fix, optimize, test, and deploy high quality solutions.   o Should have excellent hands on understanding of technical design, implementation, and maintenance of technical initiatives towards improving and scaling of products.   o Should help support team in deploying product functionality and assist in troubleshooting in production environment.   o Self-motivated and should rapidly incorporate new requirements and deliver successfully by self.   o Effectively communicates with peers and stakeholders; gathers and clarify requirements from technical functional aspect   o Follows software development process; consistently innovates processes to improve individual and team productivity and quality.   o Strong Analytical, Problem Solving Skills and participates in all activities with urgency, should be result oriented and with strong work ethic.   o Drive continuous adoption and integration of relevant new technologies into design   o Experience with Agile development lifecycle with excellent understanding of feature estimation and ability to communicate issues and risks that may impact timelines or resources.    Key Relationships    o Head of Principal Engineering   o Team Leader   o Development Team (developers, QA, Business analysts)    Essential experience    o At least 2 years Ruby on Rails commercial development experience   o At least 4 years commercial web development experience.   o SQL database experience    Desirable experience    o Experience with financial accounting systems or other domain knowledge relevant to a financial accounting system   o Database development using MySQL Stored Procedures and database scripts   o REST API development   o Web development - HTML, HTML5, JavaScript, AJAX, CSS, jQuery, http, REST   o AGILE/SCRUM development Experience   o Development practices - Rails test framework / TDD / BDD, Domain Driven Design, SOLID, refactoring, OOP design patterns      Relevant experience    o Application Servers - JBOSS, Tomcat, IIS   o XML   o Build - Git ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Tomcat", "jQuery", "JBoss", "XML", "MySQL", "Web development", "HTML", "Application development", "Troubleshooting", "Ajax"]}