{"JOB DESCRIPTION": " Responsible for designing and programming a small module or a large  component and designing a feature, set of features, or whole feature  area.  Works independently and contributes to the immediate team and to  other teams across business. Leads design discussion in a limited  manner.Job DescriptionEssential Responsibilities :• Minimum 3 years of experience in using Python Flask framework• Minimum 3 years of experience in building APIs using Python 3• Minimum 2 years of experience in building micro services and hosting applications in Cloud environments• Minimum 3 years of experience in working with relational databases preferably Postgres• Minimum 2 years of experience in working with NOSQL databases• Experience working with Timeseries data• Minimum of 2 years of experience in Unit Test Frameworks in Python like PyTest or UnitTest• Ability to translate requirements into production code and implement unit test methodologies• Ability to adapt to an Agile development environment• Expert in breaking down problems and estimate time for development tasks• Demonstrates the ability to make informed technology choices after due diligence and impact assessment•  Understands whole product, its modules and the interrelationship  between them while being an expert in the assigned component or module•  Helps in designing interfaces and information exchange between modules.  Serves as subject matter expert (SME) on one or more major modules• Demonstrates clarity of thinking to work through limited information and vague problem definitions• Drives design reviews, defines interfaces between code modules, and applies existing technology to designs• Expert in assessing application performance and optimizing/improving it through design and best coding practices• Expert in core data structures as well as algorithms and has the ability to implement them using language chosenQualifications/Requirements :• Bachelors Degree in Computer Science or in STEM” Majors (Science, Technology, Engineering and Math)• A minimum of 8 years of professional experienceDesired Characteristics :• Experience with AWS services or other similar cloud platform servicesAdditional Eligibility Qualifications :Relocation Assistance Provided: Yes.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "BCA in Computers, B.A in Maths, B.Sc in Maths, Computers, B.Tech/B.E. in Computers", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Algorithms", "NoSQL", "Software Engineering", "Relational Databases", "Data Structures", "Pytest", "Programming", "Postgres", "Flask", "Python"]}