{"JOB DESCRIPTION": " Job Description    Billing Incentives Platforms team is looking for an Automation Engineer responsible for building automation tools and frameworks for automation testing of enterprise applications. The ideal candidate will bring in depth experience in building automation frameworks for testing large volume financial systems and building test automation suites for UI as well as data/batch oriented applications.   Candidate must be passionate about using technology to build automation to replace manual processes in both testing and other software development lifecycle steps ; as well as flexible and willing to switch tasks base on team s needs and priorities.    Key Responsibilities:     Build automation tools and test automation frameworks from scratch.     Closely work with Software engineers to understand the application design and specifications before designing and developing comprehensive test automation suites with thought thru scenarios and test data based on application functionalities.     Design and develop test automation frameworks for both web based user interfaces and backend batch processes.     Build test data generation tools and scripts.     Design and build automation tools for data analysis, pattern recognition and monitoring.     Work with the team in identification of opportunities for automated test executions and drive adoption of automated testing and tools thru the product/project lifecycle.     With hands on scripting abilities, build scripts for automating repeated manual processes that may be part of software development lifecycle.     Stay abreast of emerging technologies and proactively assess and evaluate the adoption thereof into the organization     Conduct POCs for technology and tools evaluation to ensure they are good fit for Visa s requirements.     Support agile activities: sprint planning, stand ups, sprint review and sprint retrospective.     Work with limited direction, within a complex environment, to drive delivery of solutions and meet service levels     Must be self-motivated with ability to work in a fast-paced agile delivery model.     With active engagement, collaboration, effective communication, quality, integrity and reliable delivery, develop and maintain a trusted and valued relationship with the team, customers and technology partners.    Qualifications     5 years or more of relevant experience in automation development, application analysis/design, development, testing and business system analysis.     Bachelor's degree in a Computer Science or other Engineering discipline.     Hands on experience with Java, JavaScript, Oracle database, Shell Scripts, JSON and XML.     Hands on experience in building test automation with tools such as Selenium, Protractor, Test NG, Cucumber, SoapUI etc.     Experience working with one of the modern JavaScript frameworks such as Angular, Node JS or React is needed.     Experience working with Performance and load testing tools such as JMeter or LoadRunner.     Experience in configuring CI/CD pipeline using industry standard tools such as GIT, Jenkins, Maven etc is needed.     Experience in developing with Spring Boot is a big plus.     Experience in building test automation for Oracle Revenue Management and Billing (ORMB) application is a plus.     Experience in NoSQL such as MongoDB and Cassandra; or in PostgreSQL is a plus.     Experience preparing test data based on the business scenarios and creating tools and scripts to manufacture test data.     Strong interest in new automation technology and trends with the ability to relate concepts to practical application     Expertise with Agile/Scrum development methodologies and project/requirements management tools like JIRA.     Strong interpersonal, facilitation, and leadership skills along with effective communication (both written and verbal) skills and the ability to present complex ideas in a clear, concise way.     Ability to work in a complex organization to determine business and customer needs, providing the best solution to meet those needs     Candidate must be able to proficiently multi-task.     Strong teamwork focus and the ability to foster collaboration within and across teams     Demonstrated ability to learn new technologies and takes pride in delivering working software      ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Maven", "Automation", "Data analysis", "Testing tools", "Enterprise applications", "XML", "Billing", "JSON", "Selenium", "Oracle"]}