{"JOB DESCRIPTION": " Job Description    The   Business Intelligence Analytics team   is looking for an   experienced Software Engineer   who is passionate about solving challenging business problems, building applications that provide an excellent user experience.    As a key member of the delivery execution team, candidate would need to create custom applications for data and analytics, write maintainable code, reusable components/services/utilities, and test cases. Qualifications include good organizational skills, problem-solving skills, time management skills, ability to work independently and effectively communicate and collaborate with team members. The candidate must be capable of working in all phases of the application system development lifecycle.    The role is for a self-motivated individual with software engineering skills with maturity to collaborate and have an agile mindset.     Responsibilities     Hands-on execution as well as leadership of the following:   Assemble large, complex data sets that meet functional / non-functional business requirements   Create and tune complex SQL for views across federated sources including Hadoop, DB2 and Oracle   Collaborate with product management / product owners on defining user experience, demos and training   Collaborate with BI report developers on design for optimal performance   Assist on data analytics projects involving data modeling and architecture   Assist on building integration with other data / metadata tools in the architecture   Assist on some database administration tasks for the data virtualization platform    Use business requirements to document clear and concise technical designs   Maintain design and naming standards   Contribute to project planning discussions, provide status updates for development progress and be a critical resource for issue resolution    Qualifications     Bachelor's degree in Computer Science or related discipline     Experience with Big Data tools: Hadoop, Spark, Kafka, etc.     Minimum 3 years of experience writing and tuning SQL     Experience with RDBMS technologies (DB2, Oracle)     Experience with SQL-on-Hadoop preferred (Hive, Impala)     Familiarity with web services, APIs and related architectures     Excellent written and oral communication skills     Experience with basic Windows and Linux administration is a plus     Experience in Agile development methodology / Scrum is a plus    Additional Information     Physical Requirements:     This position will be performed in an office setting.    The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment, such as telephones and computers, reach with hands and arms, and bend or lift up to 25 pounds.   Visa will consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.      ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Db2", "Data modeling", "RDBMS", "Database administration", "Scrum", "Windows", "Oracle", "Business intelligence", "Virtualization", "SQL"]}