{"JOB DESCRIPTION": " Job Description    The candidate will work in Billing Incentives Platforms Team designing, developing and implementing applications that improve the effectiveness and efficiency of the Finance business function. The ideal candidate will bring extensive experience in developing (coding) solutions for functionally complex, large volume, high throughput financial systems. This role will be responsible for building techno functional designs, coding and mentoring developers and testers for successful delivery of business capabilities.   The candidate should enjoy working on diverse technologies and should be excited to take initiatives to solve complex business problems; and get the job done while taking on new challenges. You should thrive in team-oriented and fast-paced environments where each team-member is vital to the overall success of the projects.    Responsibilities      Develop solutions for mission critical large revenue systems, including transaction processing (mediation), pricing, rating, billing, accounts receivable and revenue reporting functions. Responsibilities include analysis, creation of technical designs, development, unit testing and support activities.     Design and Build applications using a variety of frontend and backend technologies.     Design and build applications with high level of scalability, resiliency and monitoring.     Design and build production machine learning pipelines from dataset collection and labeling to training and validations.     Mentoring other developers in technology adoption, system knowledge and engineering best practices.     Review designs and code developed by other develops to ensure quality of deliverables.     Work closely with business partners, TPMs and Product managers to drive and/or facilitate user story grooming, functional and technical specifications, workflow designs, use cases and process re-engineering.     Manage complex application dependencies.     Define and refine engineering best practices and Mentor junior team for their adoption.     Stay abreast of emerging technologies and proactively assess and evaluate the adoption thereof into the organization     Conduct POCs to prove out concepts and select best solution approach.     Work with limited direction, usually within a complex environment, to drive delivery of solutions and meet service levels     Must be self-motivated with ability to work in a fast-paced agile delivery model.     With active engagement, collaboration, effective communication, quality, integrity and reliable delivery, develop and maintain a trusted and valued relationship with the team, customers and technology partners.    Qualifications     8 years or more of relevant experience in application development and implementing (designing, coding and testing) Java based applications with exposure to both front end development frameworks and back end processes.     Bachelor's degree in a Computer Science or other Engineering discipline.     Solid experience in core Java, scripting, Hibernate, JavaScript and Oracle Database.     At least 3 of experience building applications on one of the modern JavaScript frameworks such as Angular, Node JS or React.     At least 3 of experience building applications using Spring Boot.     Experience building and architecting large-scale, production quality backend systems, especially in applied machine learning or data pipeline.     Familiar with parallel / distributed systems.     Experience with metrics and evaluation for large systems.     Knowledge of common data structures and ability to write efficient code in Python.     Demonstrated knowledge of RDBMs and SQL with experience in building complex database queries based on the understanding of the data model is a big plus.     Experience in configuring CI/CD pipeline using industry standard tools such as GIT, Jenkins, Maven etc is plus.     Experience in NoSQL such as MongoDB and Cassandra; or in PostgreSQL is a plus.     Prior experience in building or implementing Oracle Revenue Management and Billing (ORMB) will be a plus.     Experience with messaging systems including Kafka or Active MQ will be a plus.     Enjoy working fast and smart, and able to grasp complex concepts to design and build algorithms from scratch.     Proficiency with Agile Development Techniques.     Strong interpersonal, facilitation, and leadership skills along with effective communication (both written and verbal) skills and the ability to present complex ideas in a clear, concise way.     Ability to work in a complex organization to determine business and customer needs, providing the best solution to meet those needs     Candidate must be able to proficiently multi-task.     Strong teamwork focus and the ability to foster collaboration within and across teams     Passionate about learning and applying new technologies; and takes pride in delivering working software      ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Hibernate", "Core Java", "RDBMS", "Coding", "Data structures", "Workflow", "Application development", "Oracle", "SQL", "Python"]}