{"JOB DESCRIPTION": "  Role      As a    n    Engineer    ing Manager    ,    y    ou will have the opportunity to drive and lead the technical architecture and design as well as manag    e      a    team      working on      Platform Identity and    Access Management    .      The Platform    IAM team    s    work within the larger platform group to realize the vision of application development in the cloud.      We design and deliver    identity/    authentication      features of the platform that will be used by our customers to securely establish the identity of      their users. You will own your code from design through implementation and test automation. You will also draw from your years of experience in the field to assist and guide others on the team.           What you get to do in this role:       Lead a group of talented engineers working on platform identity features        Hire, manage, mentor and grow a    high-performance    team of Software Engineers        Plan and coordinate complex discussions across teams      and handle multiple competing priorities in a fast-paced environment        Work with business leaders and product managers to define product requirements.        Prioritize, communicate, maintain, and execute      product      roadmaps, plans, and commitments        Work with engineers to define technical requirements    ,    architect    , design    and execute best-in-class implementations in agile manner        Build and maintain world-class customer experience and operational excellence for your deliverables       To be successful in this role, we need someone who has:       Passion for software development and problem-solving        Over 10      years of    software development experience in    customer facing products        Expertise in java,    object      oriented    design and architecture.        Hands-on engineer who has organically evolved/grown to a management role.          Minimum      3+ years of experience building and managing development teams delivering high quality enterprise ready software within a global setup.        Excellent written, verbal communication and Inter-Personal skills with the ability to present complex technical information in a clear and concise manner to a variety of audiences.        Proven ability to hire top talent and build out winning team.        Working experience within product development teams is a must        Must have demonstrated work experience through      multiple life cycles of a product within a single company.        Solid understanding of agile software development lifecycle        Experience with Cloud Application Development Platforms    in security domain    will be a big plus.        Bachelor s/Master's degree in Computer Science or related discipline.    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Computer science", "Interpersonal skills", "Operational excellence", "Engineering management", "Architecture", "Access management", "Cloud", "Agile", "Software development life cycle", "Application development"]}