{"JOB DESCRIPTION": " Some of Your Key Responsibilities   Our engineers do more than just write code:   -You ll help our customers achieve their real goals by understanding their requirements and how they respond to their business needs.   -You ll use technologies that include Java, REST, NoSQL, Docker, Kafka, Hazelcast and more.   - You ll leverage on new technologies to build the next generation of Payment Services   -You ll develop and deliver new features every few days and be responsible for them end-to-end   -Your DNA includes a passion for ingenuity, engineering excellence, and following/creating software best practices and processes.   - You have excellent communication and interpersonal skills and above all, you are a team player!    You have a Bachelor degree in Computer Science or related field and at least 5-8 years of Software Development Experience or a Masters with at least 4-5 years of Software Development Experience.   You are a Java, Java EE expert with relevant experience designing and building large scale enterprise Java applications.   You have experience with REST APIs, JSON and exposure to container based technologies.   You have strong experience with Agile development incorporating Continuous Integration and Continuous Delivery, utilizing technologies such as GIT, Maven,Jenkins, Chef, Crucible, Sonar, Junit.   We count on your curiosity and creativity, to want to understand customer requirements and our processes and want to come up with creative solutions and improvements.   While you ll have the skill to see and understand the big picture, you re able to stay focused on the task at hand to achieve immediate goals. ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Java EE", "Maven", "continuous integration", "GIT", "NoSQL", "fedex", "Agile development", "JSON", "Unit testing"]}