{"JOB DESCRIPTION": "Roles and ResponsibilitiesThorough understanding of the Magento 2 platform, its architect, structure, hierarchy, components and extensions.Strong Working knowledge of shopping cart development with shipping, and - Payment Gateway Integration for E-commerce websites.Strong experience in customising and extending Magento 2 platforms PHP coding, MySQL administration and optimization, and Unix/Linux server administration is key.Collaborate with team members to develop and ship Magento based ecommerce applications. Ability to understand requirements from business and work with Onsite & Offshore teams to ensure timely delivery.Write clean structured and well-documented codeResolve cross-browser compatibility issuesIntegrate data with Sage, Quickbooks, WordPress, Salesforce and APIs in general and ERP/stock management systemsDesired Candidate ProfileGood exposure on front-end development using HTML5, PHP, CSS3, and JavaScript (jQuery).Minimum 2-7 years of experience as a Developer with Magento and general open source.Developed & managed e-commerce websites, web apps using Magento Enterprise.Should possess in depth knowledge on complete Ecommerce architecture and systems. Must have the ability to develop Magento Modules and Customization, Extension Development.Experience of having built RESTful services on php.Has good debugging and problem solving skills.Should have problem solving, prioritizing tasks, multi-tasking abilitiesAbility to work with multiple teams on multiple projects simultaneously.Proficiency to handle complex and quality demanding jobs.Job BenefitsWork in an always challenging environment.Take up challenges within the team.Small teams that will provides opportunity for learning and growth.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["IT Skills", "Magento", "PHP", "Configuration Management", "Open Source", "Project Management", "Javascript", "Ecommerce Development"]}