{"JOB DESCRIPTION": "Roles and ResponsibilitiesWe are looking for candidates with positive attitude to work, analytical, results-driven Back-end Developer who will work with team members to code, troubleshoot and improve current back-end applications and processes.The Back-end Developer will use his/her understanding of programming languages and tools to analyze current code, formulate more efficient processes, solve problems and core more seamless experience for users. You will be working on developing micro services, API creation and lifecycle management, Cloud services on Microsoft Azure and AWS etc.Design, analyze, develop, document, test and troubleshoot application logic to solve business problems for one or more business / functional areas.Unit Testing, Functional/system integration testingSupport production as needed and help in meeting customer satisfactionTo succeed as a Backend Developer, you should be focused on building a better, more efficient program, follow best practices on coding standards, testing practices and creating a better end-user experience.You're eager to learn new technologies and you love working in a dynamic environment while solving customer problems with creative solutions.You should have excellent communication, computer and project management skills. You should be knowledgeable, collaborative, and self-motivated.", "ROLE": "Software Developer", "INDUSTRY TYPE": "Facility Management", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Java", " Database concepts", "Spring MVC", "code coverage", " Multithreading", "Unit Testing frameworks", "Java scripts", "J2EE", "Spring Boot", "JSON", "REST", "Web services", "XML", "High performant message queuing", "Web APIs", "Application Server", " connection pool"]}