{"JOB DESCRIPTION": "Roles and ResponsibilitiesOur Adaptive Player team is currently looking for an experienced software engineer to help us deliver a performant and robust Adaptive Player component for our extremely large and ever-growing customer base. As we adapt to the new requirements and challenges, we have to continuously develop new features related to OTT streaming and make them available for all Native clients via a common services layer, the needs are ever-growing.A successful candidate would be self-driven and excited to learn, develop and deliver distributed software systems. He or she will have a keen technical aptitude, excellent communication skills, and enjoys achieving results in a fast-paced, dynamic environment. We are a CloudNative stack company and use some of the latest tech stacks. While we prefer you to come in with Roku Native Streaming experience, we will train the right candidate on generic Adaptive Player tech stack.Responsibilities:Primary responsibilities and skills include the following areas:Intimate knowledge of media playback engines and streaming protocols.Working on an agile team using CI / CD best practices to deliver the highest quality software possible quicklyA strong desire to learn new things and continually improve yourself and those around you with a “can do anything” mentalityYou live to experiment, test, fail fast, and learn as you go, we are not looking for a cookie-cutter solution to the complex problems we solveBasic Requirements:A successful Senior Software Engineer - iOS Streamer will have:A 4-year college degree in Computer Science / Information Technology, master’s degree is preferred or equivalent professional experience8+ years of overall software development experience and with at least 3+ year experience in the development of commercial Roku Apps with thorough knowledge of MPEG DASH & HLS protocols and APIs used in Roku Native Player.Experience with one or more of the following:Should be well aware of MPEG DASH, Http Live Streaming protocol, PlayReady/ Widevine DRM scheme and ROPlayer functionalities.Experience in QT, Bright Script and C++ is a must.Should be well versed with Memory footprints, Time Profiling and CPU load tracking tools.Ability to accurately estimate software tasks and work to schedule.Ability to work in both user and kernel space.Experience with GIT and JIRA is an add-on.Knowledge of Object-Oriented Design, Data structures, Algorithm design, and complexity analysis.Strong verbal and written communication skills.Strengths in problem-solving, issue resolution, ability to work in a deadline-driven work environment, attention to detail, and ability to multitask.Technical Skills - Requirements:Application development experience using Roku SDK, Roku Debugging tools, QT and Bright Script.Knowledge of MPEG DASH, HLS streaming protocol and PlayReady/ Widevine DRM handling.Active work experience on ROPlayer and related APIs.Strong proficiency in C++, with a fair knowledge of the language specificationFamiliarity with templating in C++Knowledge of the latest C++11 standard is appreciatedFamiliarity with Inversion of Control containers and Dependency Injection.Qualification- BE/ BTECH/ MCA/ M TECH", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization, Computers, BCA in Computers, B.Sc in Computers", "PG": "M.Tech in Any Specialization, MCA in Computers", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Roku", "MPEG DASH", " QT", " Roku SDK", " Bright Script", " C++"]}