{"JOB DESCRIPTION": "      Job description            Duties and   Responsibilities:       Operate within an Agile team environment     Assist in the scoping and estimation of user stories     Steward and execute upon user stories within the team?s backlog     Identify opportunities for improvement and / or gaps within existing EWI capabilities and processes     Help make architectural decisions to drive efficiency and maintain compliance in a regulated space     Provide technical expertise and guidance to EWI developers to ensure operational excellence     Understand the ?big picture? and create reusable patterns that solve problems for cross-functional teams        Qualifications         Education Requirements:       Minimum Bachelor's degree in Computer Science, Engineering, Statistics, Technical Science or 7 years of IT/Programming experience         Technical Skill Requirements:       7 years of experience in web development      Highly experienced in HTML5, J  avaScript, Vue / React, Nux  t, CSS3, API?s, (more is good) responsive web design, general web functions and standards      Experience with agile methodologies, coding standards, code reviews, source management (GITHUB), build processes, Jira       Good to Have Skills:       Experience in development and deployment on multi cloud infrastructure ( Heroku to AWS / Azure)     Experience working on multiple projects at once     Experience working with stakeholders in different countries     Pharmaceutical or healthcare industry experience      Learning agility to learn and demonstrate the strategic outcomes.     Architecture experience is also considered.       Professional Skill Requirements:       Self-motivation to be able to work and learn independently in solving problems     Demonstrates a strong desire to iterate and improve existing business and technical processes     Possesses a curious nature driven by the thought of continuously learning     Excellent coordination skills and ability to balance many projects at once     Proven ability to work creatively and analytically in a problem-solving environment      Quick learner to new trends in technology     Excellent self-leadership, communication (written and oral) and interpersonal skills.     Demonstrated leadership in professional setting     Demonstrated teamwork and collaboration in a professional setting.      ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Medical-MS/MD in psychology"}, "KEY SKILL": ["Computer science", "Operational excellence", "Architecture", "Coding", "Pharma", "Web development", "Agile", "Healthcare", "Web designing", "CSS3"]}