{"JOB DESCRIPTION": " Hi,Greetings from Concentrix!Hope this mail find you in good health and spirits.We have an opening for Sr. Software Engineer - Java @Chennai /Bangalore / Hyderabad location.Kindly find the below details for your reference and if eligible and interested reply back with your updated CV , along with your notice period and expected CTC to bharathi.natarajan@concentrix.comAbout Concentrix : Concentrix is a technology-enabled global business services company specializing in customer engagement and business performance. With more than 2,25,000 staff, Concentrix is present across 40 countries and six continents. We are considered as a category leader in the CXM (Customer Experience Management) Services. We serve automotive; banking and financial services; insurance; healthcare; technology; consumer electronics; media and communications; retail and e-commerce; travel and transportation; and energy and public sector clients. In India, Concentrix has a legacy of more than 20 years and are present in 13 cities. We have created disruption in the marketplace with high-profile acquisitions over the years from IBM Daksh to Convergys in recent years. Our key capabilities include Digital Transformation & Marketing Solutions, Analytics & Consulting, Customer Engagement & Customer Experience Insights. Major organizations across India use our IT solutions in banking/insurance space.Senior Software Engineer - JavaJob Description: l Develop, test, and deliver enterprise-grade web applications using Java/J2EE and Spring Framework etc.l Gather and clearly document requirements, design and testing results.l Maintain software efficiently through solid knowledge of software lifecycles.Qualifications: 1. Bachelor's degree in Computer Science, Statistics, or another quantitative field.2. 4+ years of experience as Java developer, with demonstrated ability to effectively develop high-quality software in a collaborative environment.3. Previous experience with ERP system development, testing, and implementation.4. Proficiency in troubleshooting software issues and debugging a large codebase.5. Knowledge of algorithms and data structures.6. Familiarity with Linux, Git and Docker is mandatory.7. Proactive, self-motivated, and highly organized.Note : Kindly ignore the mail if irrelevant.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["Java", "Data Structures", "Spring Framework", "Algorithms"]}