{"JOB DESCRIPTION": " Job Description     A proven Developer with 4-6 years of strong technical experience in development of Progress 4GL based solutions using Progress 4GL/ADM/Webspeed tech stack.    He/She required to work product development, maintenance and enhancements of products in FMS/HCM/ERP domain      Responsibilities include      Work with development teams, product owners, BA and product managers, subject matter experts/architects to implement software solutions including development and enhancements      Provide/Suggest Design solutions/ideas related to client-side and server-side architecture of Progress based application.      Develop components as required to meet sprint / release goals      Understand functional/business requirements through user stories and translate into technical requirements and implement accordingly.      Build frameworks that can be adopted by other Progress products      Work with all stakeholders like Architect, Devops teams to ensure all tools are configured (CI/CD/Automation) and technical challenges/dependencies are addressed      Determine operational feasibility by evaluating analysis, problem definition, requirements, solution development and proposed solutions      Document and demonstrate solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code      Develop and manage well-functioning database/integrations with other internal products/third party controls.      Write effective and reusable code, APIs, Troubleshoot, debug and upgrade software      Ensure maintenance and support fixes are provided for customer reported issues.      Test software to ensure responsiveness and efficiency      Create security and data protection settings      Write technical documentation as required      Key Skills      Develop in Progress using the web services or standard procedural components.      Very Strong basics and fundamentals concepts in OpenEdge, Object Oriented Concepts, .Net Frame Work, AppServer, PRODataset.      Progress 4GL, CHUI, GUI, ADM/ADM2, Open Edge, Webspeed, Data PA, XML, DOM, SAX, .Net FrameWork for Progress ABL.      Familiarity of service-oriented architecture, XML Parsing and composing, Class (OOPS approach) ABL, Prodataset, HTML, CSS and JavaScript      Implement Automated CI/CD processes using relevant tools wherever feasible      Develop frameworks with reusability as mindset      Tools: Git/GitHub, Jenkins, SonarQube      Desirable Skills      Agile methodology, Jira, Pair programming, TDD      Good communication skills      Analytical and efficient Development skills      Self-Motivated, Result Oriented and team player.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.A in Other Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["ERP", "Automation", "DOM", "TDD", "XML", "Javascript", "HTML", "JIRA", "Progress 4GL", "Technical documentation"]}