{"JOB DESCRIPTION": " Job Description     Visa operates the world's largest retail electronic payments network and is one of the most recognized global financial services brands. Visa facilitates global commerce through the transfer of value and information among financial institutions, merchants, consumers, businesses and government entities.    We offer a range of branded payment product platforms, which our financial institution clients use to develop and offer credit, charge, deferred debit, prepaid and cash access programs to cardholders. Visa's card platforms provide consumers, businesses, merchants and government entities with a secure, convenient and reliable way to pay and be paid in 170 countries and territories.    The Corporate Information Technology (CIT) organization provides support for Finance, Revenue, Human Resources, Customer Relationship Management and Corporate Risk applications for Visa. This includes managing system requirements, design, development, integration, quality assurance, implementation and maintenance of corporate applications. The team works closely with business owners of these services to deliver industry leading packaged software and customer developed solutions.    The candidate will work in the Observability team, designing, configuring and testing applications and systems to improve the effectiveness and efficiency of the VISA's business and infra observability platform. The ideal candidate will bring experience in requirement gathering, functional configurations, system and data analysis; and implementation of the design to the platform. This role will also participate in planning and execution of application testing, doing advanced application configurations, system and data analysis to ensure successful delivery of business capabilities.    Key responsibilities:    Candidate's responsibility will include:     Champion resiliency and reliability oriented architectures, patterns and trends through thought leadership and evangelism. Embrace DevOps and Combined Dev + Test Engineering transformation to achieve accelerated delivery.      Develop components involving event instrumentation, event classification, multi-protocol event handlers, stream processing, pipelining, time series data aggregation and data analytics.      Work closely with rest of the development teams to ensure that services and platforms are designed with reliability in mind.      Develop tools for reliability of application services - reliability scope includes event detection, monitoring models, reaction strategies and mechanisms to automate service recovery.      Evaluate & customize various frameworks including open source software to recommend appropriate choices      Design, develop, document and implement new systems, as well as enhancements, modifications, and corrections to existing software with code that complies with design specifications and meets security and Java/J2EE best practices. Coding must adhere to all standards for security, be easily maintainable and have high system performance.       Qualifications     Bachelor's/Master's Degree in Computer Science or related field    - Typically requires 6+ years of experience in delivering enterprise-class, mission-critical, commercial, and scalable products, at least 3 of which were in the role of a technical lead engineer. In-depth experience in Full Stack development & core J2EE technologies and Systems programming. Demonstrated programming skills in one or more languages: Java, Javascript, Go, Python with practical exposure to full stack frameworks - React/React mobile/NodeJS applications    - 3 or more years demonstrated experience implementing scalable solutions for one or more of the following: Event Monitoring, Time Series Analytics. Ability to understand systems from all levels: from the \"big picture\" enterprise-level view to the low level technical view. Strong familiarity with event monitoring frameworks like Splunk    - 5+ or more years demonstrated experience with n-tier web application development and experience in Java development. Must demonstrate knowledge and experience with many of the major Java APIS (e.g. JMS, JPA, JNDI, EJB, RMI, JAX, JMX etc.)    - Experience working with a variety of Applications Servers and big data stack, containerization, dockers etc.    - Hands on experience with Continuous Integration, and full SDLC Development tools, including Jenkins, Bamboo, GIT, Maven, Junit, Code review, Static analysis, Security testing    - Demonstrated experience working in Agile development    - Experience working with a variety of Applications Servers and Databases (e.g. Tomcat, Oracle/NoSQL/Mongo/MySQL, Hadoop/Hbase)    - Experience leading projects from development through implementation.   Bachelor's/Master's Degree in Computer Science or related field    - Typically requires 6 years of experience in delivering enterprise-class, mission-critical, commercial, and scalable products, at least 3 of which were in the role of a technical lead engineer. In-depth experience in Full Stack development & core J2EE technologies and Systems programming. Demonstrated programming skills in one or more languages: Java, Javascript, Go, Python with practical exposure to full stack frameworks - React/React mobile/NodeJS applications    - 3 or more years demonstrated experience implementing scalable solutions for one or more of the following: Event Monitoring, Time Series Analytics. Ability to understand systems from all levels: from the \"big picture\" enterprise-level view to the low level technical view. Strong familiarity with event monitoring frameworks like Splunk    - 5 or more years demonstrated experience with n-tier web application development and experience in Java development. Must demonstrate knowledge and experience with many of the major Java APIS (e.g. JMS, JPA, JNDI, EJB, RMI, JAX, JMX etc.)    - Experience working with a variety of Applications Servers and big data stack, containerization, dockers etc.    - Hands on experience with Continuous Integration, and full SDLC Development tools, including Jenkins, Bamboo, GIT, Maven, Junit, Code review, Static analysis, Security testing    - Demonstrated experience working in Agile development    - Experience working with a variety of Applications Servers and Databases (e.g. Tomcat, Oracle/NoSQL/Mongo/MySQL, Hadoop/Hbase)    - Experience leading projects from development through implementation.    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["JMS", "Tomcat", "Manager Quality Assurance", "MySQL", "Javascript", "Oracle", "EJB", "Open source", "SDLC", "Python"]}