{"JOB DESCRIPTION": "  Job Description Summary    The FrontEnd Engineer is a technical position responsible for Web FrontEnd Engineer role for products being developed for advancements in medication preparation and delivery.   The responsibilities can include but are not limited to: contributing to FrontEnd Web Applications design and development for Medical Device/ Health IT SW Product ; implementation of web application components and features as part of Agile scrum teams and integration and verification of implementation via unit, functional and integration testing.   The individual would have responsibility for working closely with Cross Functional team members and other member of SW teams to understand requirements and SW Architecture for design and development Web Applications and features for OnPrem and Hosted SW deployments of applications and services in a fast-paced, high-demand Windows Server environment.    Minimum Qualifications  :    4-year Bachelor s Degree in Computer Science/Engineering or Electronics/Electrical Engineering. Other majors considered will be MSc. in MIS, Applied Math, Masters in Computer Applications   A minimum of 4 years of post-educational professional experience in Medical Device Software Development.   Hands on experience in working closely with other SW Team members, backend developers to provide Web application development using ASP.Net and ASP.Net Core platform.   Hands on Experience in implementing and maintaining responsive web applications using MVC architecture and responsive client side web development technologies on ASP.net and ASP.net Core platform.   Hands on Experience working with JQuery, Typescript, JavaScript, CSS , HTML and BootStrap.   Experience developing Functional Unit and Integration Tests/Mocks for developed components.   Hands on Experience with consuming of backend services and data service components in a reliable and fault tolerant way.   Hands on Experience working with dev and API tools like Swagger, Postman and Chrome Dev Tools.   Hands on experience working with Virtualized and Containerized deployments.   Hands on experience working with Relational Database systems e.g. Microsoft SQL Server and/or Postgres.   Hands on experience working with C# unit testing frameworks e.g. nUnit, MSTest or xUnit.net.   Strongly desired to have worked with refactoring of existing web components and modules to sub-components and modules.   Ability to generate technical documentation for design capture   Working knowledge of applicable standards for medical devices: FDA QSR, ISO 13485, ISO 14971.   Experience with Software Maturity Models and Agile Scrum methodologies.     Desired Qualifications:     Master s Degree in Computer Science/Engineering or Electronics/Electrical Engineering. Other majors considered will be Masters degrees in MIS, Applied Math and Computer Applications   5+ years of professional experience.   Previous experience with Intended Use Validation in Medical device SW development environment.     Competencies:     Excellent written verbal communication skills   Self-directed with the ability to learn and adapt quickly to new technologies and trends  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Medical, Healthcare, Hospitals", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "MS/M.Sc(Science) in Chemistry, Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Computer science", "jQuery", "MIS", "Web development", "Javascript", "Healthcare", "HTML", "Windows", "Unit testing", "Technical documentation"]}