{"JOB DESCRIPTION": " JOB DESCRIPTION : A hands on software engineer and self-starter with experience working as Full Stack Engineer to develop, build and deploy robust, quality software in production.      RESPONSIBILITIES     Work closely with PM/Architect to drive, innovate and develop quality software.   Analyze, troubleshoot and debug product defects and provide timely solutions to customer issues   Develop an understanding and knowledge of products/solutions, architecture and systems   Work with agile cross-functional team to estimate and plan development activities and timelines   Other duties as assigned     REQUIRED QUALIFICATIONS     Experience with one or more general purpose programming languages including but not limited to: Java.    Strong in data structure(s) and algorithms.   Experience with scripting   5 years of professional experience working in the software industry   Strong knowledge of software engineering best-practices in software design and architecture   Experience with continuous deployment and service-based architectures.   Expertise developing and consuming web services such as RESTful and SOAP.   Use of secure coding practices and methodologies   Passionate in unit testing and producing high quality code   Working knowledge of Linux and Windows operating systems   Effectively communicate, prioritize tasks, and manage time efficiently   High performance individual who is persistent and self-motivated to accomplish tasks   Detail-oriented, quick learner, and problem solver   Strong interpersonal communication skills     PREFERRED QUALIFICATIONS     Strong knowledge of Core Java, Multithreading in Java.   Strong knowledge of design patterns in Java OR C    Strong knowledge of Spring, Hibernate Frameworks.   Strong knowledge of SQL(s), SQL optimization(s), SQL Query Optimization(s).   Strong knowledge of writing Web Service APIs   Excellent knowledge of Javascript and front end technologies.   Experience using or implementing DevOps principles and practice   Bachelor s degree in Computer Science, Information Systems, Electrical Engineering, etc., or equivalent years of experience and formal training   Experience using Linux and Docker    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Hibernate", "Core Java", "Software design", "Multithreading", "Linux", "Coding", "Javascript", "Agile", "Windows", "SQL"]}