{"JOB DESCRIPTION": "Roles and Responsibilities.Net Developer (MVC, Web API, React.Js)CGI is looking for .Net Lead to join our team in Bangalore & Hyderabad. This is an exciting opportunity to work in a fast-paced team environment supporting one of our reputed client in the telecommunication industry. We take an innovative approach to supporting our client, working side-by-side in an agile environment using emerging technologies.Your future duties and responsibilities• Design and development of Portals applications with a primary focus on Security of the applications• Implement, test, and operate advanced software security techniques in compliance with a technical reference architecture• Perform on-going security testing and code review to improve software security• Troubleshoot and debug issues that arise• Provide engineering designs for new software solutions to help mitigate security vulnerabilities• Contribute to all levels of the architecture• Maintain technical documentation• Consult team members on secure coding practices• Develop a familiarity with new tools and best practicesRequired qualifications to be successful in this role• Candidate should have 6 to 10 years of overall work experience.• Candidate should have 6+ years of experience in Asp.Net MVC, C# & jQuery.• Candidate should have 2+ years of experience in Web API.• Candidate should have 2+ years of experience in React.JS or Angular.• Responsible for leading the team in design, coding, testing, and documentation of DCX applications.• Should have strong .Net, MVC, WebAPI skills, and troubleshooting and providing solutions to complex integration issues.• Responsible for code quality and ensure to perform code reviews.• Support testing cycles by triaging the defects and helping the team to resolve them.• Develops the unit test processes and test the interfaces and participates in integration testing.• Provide application support during testing phases & production.• Shift Timings: 12:30 PM to 10:00 PM.\"Qualification: Bachelors degree or above", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Web API", ".NET Developer", "MVC", "React.Js", "Angular"]}