{"JOB DESCRIPTION": "        Description       Lead and mentor a team of engineers       Work closely with product managers to translate product requirements into design       Work with the architects and the engineering team on the implementation of these features and participate in design and code reviews       Work with program management to track day to day project status and run daily scrums.       Communicate project status to stakeholders         Have experience designing and building large scalable web services.       Be proficient in at-least one server side language such as Java or Node.js.       Have thorough knowledge of cloud infrastructure, monitoring and orchestration tools.       Have an in-depth understanding of database technologies (SQL and NoSQL)as well as API cache design and caching technologies.       Haveexperience building RESTful APIs and have good knowledge of RESTful design patterns.       be able to communicate and workwell within a geographically distributed team     We usually look for..      6+ years of software engineering experience building SaaS or consumer web applications.       3+ years of designing and architecting scalable web applications    thorough knowledge of network and communication protocols      strong communication skills       BE/B.Tech in Computer Science or related field    You get bonus points for ..     Experience in real-time communication products    Experience in scaling large high transaction volume web services    Contributions to open source projects   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Production/Industrial", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Communication protocols", "NoSQL", "orchestration", "Web services", "Networking", "Customer support", "Open source", "Monitoring", "SQL"]}