{"JOB DESCRIPTION": "  Job description     About the role     We are looking for a motivated self-starter, with a keen interest for software product development.    In this role, you will be responsible and accountable for strategic and tactical reporting on strategic operational goals for product development, quality, cost and delivery, tracking efficiency, optimizing and driving engineering excellence across all Business Unit.   You will work closely with the team members. Also, as a senior member of the team, you will interact with all internal external stakeholders.      Responsibilities     Support your manager in maintaining product vision and roadmaps, managing the Resource allocation, Knowledge Management, Ideation, program risks and issues    Enterprise reporting of product and portfolio performance   Aid Delivery managers with exception reporting   Track skill levels of the employee and training needs   Support PMO Project audits   Maintain Metrics Reports for Leadership team   Provide support, coach, mentor, develop junior team members and help in managing a high performing team that delivers continuous improvement, adds value, and reduces costs     Skills     Communication, interpersonal and influencing skills   Analytical and problem-solving abilities   Result oriented with ability to plan and deliver against deadlines   Collaborate with support functions   Process compliance   Tracking and reporting metrics   Team and performance management      Technical Skills      VB.Net, PL/SQL, Asp.Net, Web services, Java-scripts, Design patterns, Node.js, AWS (Basic Concept - DynamoDB, Lambda etc.), JIRA Reports   Experience with third-party libraries and APIs   Source Control (TFS/Git)   SQL server administration basics, Postgres SQL   Angular js/ React.js   AHA, JIRA and Tempo   Talend Open Studio   Atlassian connect framework  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["GIT", "Performance management", "Analytical", "Resource allocation", "PLSQL", "Healthcare", "JIRA", "Continuous improvement", "Operations", "SQL Server administration"]}