{"JOB DESCRIPTION": "        What You ll Contribute     Manage a team working on designing and developing world-class enterprise-level solutions.   Leverage, synthesize and integrate work from team members. Demonstrate ability to provide technical advice, coaching, and direction to developers.   Collaborate with relevant stakeholders to attract talent, set goals, measure and reward performance.   Demonstrate technical expertise through publication, presentations, white papers and event participation.   Drive technical discussions and serve as a source of technical expertise for the team members.   Evaluate stability, compatibility, scalability, interoperability, and performance of the software product.   Learn new technologies in related areas.         What We re Seeking     Bachelor s/Master s in Computer Science or related disciplines, or relevant experience in managing software design, development and testing.   Strong people management experience with the proven ability to manage a high performing team.   Strong knowledge of database concepts and programming.   Experience in writing product specifications and documenting product features to present them to a wider audience. Produce and maintain product demos.   Ability to articulate the design with architects and discuss strategy/requirements with teams.         Our Offer to You     A culture and work environment strongly reflecting our core values: Act Like an Owner, Delight Our Customers and Earn the Respect of Others.   The opportunity to make a difference by leveraging your unique strengths.   Highly competitive compensation and rewards.   Flexible work options, opportunities to give back to your community, social events with colleagues and a comprehensive benefits program inclusive of progressive parental leave.      ", "ROLE": "Software Developer", "INDUSTRY TYPE": "KPO, Research, Analytics", "FUNCTIONAL AREA": "IT Software - Other", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Product management", "Software design", "big data analytics", "Artificial Intelligence", "Anti money laundering", "Machine learning", "digital transformation", "Fraud detection", "FICO"]}