{"JOB DESCRIPTION": "The RoleThe role requires a broad spectrum of relevant historical and current industry technical skills in addition to the ability to learn quickly. You will be able to navigate the current ambiguity in relation to the maturity of SDN and NFV technology and still deliver high-quality solutions.As a Engineer, you are expected to have 6+ years of work experience. You will also partner with solution development team and will work closely with engineering leaders and the open source community. Your Experience You will be a hands-on engineer that can determine the right path to follow through prototyping and testing, as well as leading the team by example. You will establish yourself as a trusted advisor with senior executives and engineers in our target customers. You will be a change agent leading customers around the many pitfalls toward lasting transformation. You will be a leader on customer delivery projects and will be comfortable with Agile and Scrum methodologies and can perform the role of Product Owner.  Your ResponsibilitiesDesign, develop (prototype and deliver) and test solutions based on various open source products, customize them and integrate with third party components. Develop and Prioritize product backlog and work with scrum teams.Advise customers on their transition into the software-defined way/automation of the futurePrepare and perform technical presentations for customers, partners and peersPrepare and deliver content for industry events and conference speaking engagementsPrepare white papers and publish them in trade shows.Contributing to the open source community.Your Skills RequirementsExperience with Linux Foundation products like ONAP, OPNFV, ODL for carrier grade use caseExperience with ODL or other SDN platforms (ONOS, Contrail, etc.)Expertise in OpenStack, Tacker, ODL, ONAP, ONOS products from open source communityExperience with some of the modeling languages like TOSCA,NETCONF, YANG, BPMN, HEAT etc.Experience with Software-Defined Networking (SDN)Experience in MicroservicesExperience in some of the Virtual Infrastructure Implementation like AWS, Openstack, Vmware , Kubernetes and DockerDetailed knowledge of SDN/NFV standards: MEF LSO, ETSI MANO, TM Forum open APIs, open flowIn depth knowledge on Service design, Service catalog, Service fulfilment, Service assurance, integration with OSS/BSSHands on experience in programming languages like Java or Python.Network industry certifications from Cisco, Juniper or similar vendor preferred and not mandatoryExperience with Agile and Scrum software development methodologies", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Telecom Software", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Any Doctorate in Any Specialization"}, "KEY SKILL": ["ONAP", "SDN", "Microservices"]}