{"JOB DESCRIPTION": "Roles and ResponsibilitiesSenior Software Engineer - BackendMyntra’s Engineering team builds the technology platform that empowers our customers’ shopping experience and enables the smooth flow of products from suppliers to our customers’ doorsteps. We work on areas such as building massive-scale web-applications, engaging user-interfaces, big-data analytics, mobile apps, workflow systems, inventory-management etc. We are a small technology team where each individual has a huge impact. You will have the opportunity to be part of a rapidly growing organization and gain exposure to all the parts of a comprehensive ecommerce platform.You will be a part of: SCM IB SCM \"Inbound” Engineering team builds the platform and products for Merchandise Planning, Buying, Manufacturing and Cataloging. This group uses technology to predict what combinations of products should be sold on Myntra-Jabong so that customers get the right choice, business gets the right sales and Sellers get a predictable demand - all this much ahead of time, sometimes more than 6 to 12 months in advance. These set of tech systems help our business in planning to procure/manufacture the right merchandise, and then enable timely and predictable execution of those plans. The SCM Inbound products form the \"brains\" of the business that is constantly evolving and trying to solve the key problems - \"what products will be in demand?\", \"how much will be their demand?\", \"when will they be in demand?\", \"who to get them from?\". Answering these questions involves dealing with huge sets of sales, click-stream, inventory and competitor catalog data, and use of new-age machine learning and computer vision techniques to find interesting patterns in the data, and using those to predict sales potential of merchandise in a season. These insights are then used to make plans for revenues running into Millions of Dollars, and then building execution systems with feedback loops to learn from thecurrent season and do better in the next one. Our Partners (Brands, Sellers, Vendors, Manufacturers) form a very important part of Myntra-Jabongbusiness.Inbound team builds the platform to simplify integration across all our partners, and solve some of the most difficult ERP problems, such as partner on-boarding, definition of commercial terms between Myntra-Jabong and partners, placing and tracking commercial orders with the partners,partner payments and refunds, Do-it-yourself systems that allow partners to quickly onboard their catalog on Myntra-Jabong, using deep analytics to provide sales/demand/customer satisfaction insights to our Partners to do better on the our platform. Inbound team builds and manages our home-grown cataloging and content management solution that forms the heart of Myntra-Jabong business - providing digital identity to each of the millions of products that are sold on the Myntra-Jabong platform through rich images, videos, 360-degree views, size-charts, detailed and structured content for sellers to showcase their products and customers to make informed choices about what they buy on Myntra-Jabong. These systems use advanced NLP and computer vision techniques to enable automated cataloging of products, identify discrepancies in the existing content.If you are interested in understanding the core of fashion business, and how Myntra-Jabong is using technology to disrupt it, then this is the team for you. You will learn the core construct of what makes fashion and trends, and how tech can be used to transform it, and impact the lives of millions ofcustomers who want to look fashionable. You will work closely with partners (Brands, Sellers, Vendors, Manufacturers) to understand various aspects of business and use that knowledge to develop right set of technology and platform capabilities to scale their business while scaling Myntra-Jabong business. This is a relatively new team, so you will learn how to design and build new platforms from scratch and get them launched and adopted by end-users. In addition to this, you will learn a lot about building high-scale products using micro-services - including caching, queueing, a variety of relational and NoSQL data stores and will use a host of programming languages/ frameworks (Python, Java, JavaScript, React),machine-learning/ image-processing using tools like R, Scipy etc.Your Responsibilities:Write maintainable/ scalable/efficient code.Design and architect technical solutions for the business problems of a very large e-commerce portal.Work in cross-functional team, collaborating with peers during entire SDLC.Follow coding standards, unit-testing, code reviews etc.Follow release cycles and commitment to deadlines.Desired Skills & Experience:Experience level of 3 to 6 years of experience in very large-scale applicationsStrong problem-Solving skills, data structures and algorithms.Experience with distributed systems handling large amount of data.Excellent coding skills in Java/ J2EE.Very good understanding of Web TechnologiesVery good understanding of any RDBMS and/or messagingQUALIFICATIONSB Tech/BE in Computer Science or equivalent from a reputed college.", "ROLE": "Software Developer", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Java", "algorithms", "Front End", "Algorithms", "NoSQL", "RDBMS", "Javascript", "J2EE", "data structures", "Python"]}