{"JOB DESCRIPTION": "  Responsibilities     Have the passion in developing and supporting the growth of the next generation software architectures and inspire innovation within the team   Develop scalable real-time low-latency processing solutions in an agile delivery method   Lead and guide the team in design, code and implement new algorithms to solve complex problems   Develop solutions using available tools and technologies and assist the global team in problem resolution by hands-on participation.   Engage technical workshops with cross-vertical Technology partners for cross-vertical integration in software development.        Basic Qualifications      Bachelor s Degree or equivalent in the Computer Science, Computer Engineering or Information Technology disciplines with strong fundamentals in software engineering.   At least 4 to 7 years of working experience in the IT industry, preferably with advanced web development experience in developing web applications and solutions that are lightweight, responsive, user-friendly and visually appealing.     Technical Qualifications     4 years of hands-on experience in development of applications using Python (Python, Django)   4 years of hands-on experience in writing Ansible playbooks   4 years of hands-on experience in RDBMS with SQL language (write queries and stored procedure)   Solid knowledge of at least one or more programming language: Golang, Java, C#, python or NodeJS   Good hands-on experience enterprise-level web development experience on Java/J2EE and AngularJS, JavaScript, HTML5, CSS3 as well as data formats in XML and JSON.   Solid knowledge in writing Restful Secure APIs   Good understanding of technologies like Jenkins, Git, Docker, Unix commands, and shell scripts   Good understanding of micro service architecture, and how to configure and deploy complex containerized applications   Good knowledge in GIT, Maven and best CI/CD practices.   Good understanding of any one or more security scanning tools like Checkmarx, Clair, SonarQube, Blackduck, Appcheck.   Good to have least one or more Cloud Platforms (Azure, AWS, GCP) is a strong plus.   Good to have enterprise-level client-server web application development in Java/J2EE, C# and OOP.   Good understanding of SSDLC, Agile methodologies. Agile development experience in a SCRUM environment is a strong plus.   Excellent articulation, communication, interpersonal and collaboration skills are required.   Excellent time management, organization and planning skills are essential.       Preferred Qualifications     At least 2 years of working experience with defining system architecture and design patterns.   At least 2 year of designing systems for greenfield engineering projects from ground up.   Knowledge of content management concepts and systems will be advantageous.   Analytical skills to understand business requirements and to translate into technical specifications.   Problem solver with excellent skills in troubleshooting.   Ability to set priorities in a multi-tasking environment.   Ability to negotiate with both Technology and Business counterparts in terms of delivery scope and timelines that aligns with capacity of the delivery team.   Passion to learn and pick up new technologies as needs evolves.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Unix", "RDBMS", "XML", "Web development", "Javascript", "JSON", "Scrum", "Troubleshooting", "SQL", "Python"]}