{"JOB DESCRIPTION": " Job Description    Responsibilities what you ll do:     Proficient in coding, testing.     Build automated testing platform to enable continuous delivery of the platform components     Proficiency in writing automation, develop new automation suite, automate test cases     Proficiency in API automation and run write new test cases, suites     Proficiency in UI automation and should be able to write new test cases, maintain existing automation.     Create detailed, comprehensive and well-structured test plans and test cases     Estimate, prioritize, plan and coordinate testing activities     Design, develop and execute automation scripts using open source tools     Identify, record, document thoroughly and track bugs     Perform thorough regression testing when bugs are resolved     Perform thorough functional testing for new features     Liaise with internal teams (e.g. developers and product managers) to identify system requirements     Build test, integration, performance and stage environments     Collaborate with team members in design reviews, development and code reviews    Required skills - what you have: 3-5 years of experience      Passionate in learning & delivering code with excellent quality.   Passionate about testing   Hands-on development experience in UI\\API automation using Java/Spring, Soap UI, Selenium, Protractor   Ability to collaborate in a team environment   Undergraduate Degree or Master's Degree, preferably in Computer Science   Experienced in HTML, CSS, JavaScript (JQuery, Angular JS/Backbone, etc.)   Solid foundation in object oriented methodologies & design patterns   Expertise in developing and consuming REST-based web services   Good knowledge of SQL and DB concepts (SQL Server preferred)   Experience writing unit and integration test cases   Experience with Soap UI, Protractor, Selenium  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Computer science", "Automation", "jQuery", "Coding", "Functional testing", "HTML", "Selenium", "Test cases", "Open source", "SQL"]}