{"JOB DESCRIPTION": "We are hiring candidates whose skills matches with the Job Description mentioned below. Prior Experience:3-5 yrs proven experience as Software developer, preferably in healthcare domainJob Description:This role will be part of the Scribe EMR, a healthcare division of Focus group company, into medical coding and scribing. We are building AI powered, innovative, state of the art, web and mobile applications to alleviate the administrative burden of EMR data entry; increase provider satisfaction, productivity and efficiency; and help improve patient quality of care and life. The ScribeEMR solution will weave technology and live scribes together for a comprehensive solution that will simplify and automate todays clinical practices.In this role, you will apply your analytical and critical thinking mind to analyze business requirements, perform system design, development, unit testing and deployment of web and/or mobile based applications. The development will be based on .NET, web services, latest JavaScript frameworks, cloud technologies and machine learning as backend and HTML, CSS/SCSS, ReactJS as front-end. Knowledge of relational databases is a must to perform these tasks while knowledge of NOSQL databases would be a plus.We are looking for passionate, creative, analytical and technically skilled full stack developers who can roll up their sleeves and deliver high-quality solutions in the above mentioned technologies. You will be responsible for bringing great user experience and design to life. You will be expected to create reusable, extensible, flexible, high-performing web and/or mobile applications.Job Summary:      Review business requirements, identify gaps and author functional design documents Develop high-quality software that is aligned with user needs and business goals Participate and author technical design documents, incl. application integration.Exposure to design patterns is desirable.  Proactive and self-starter requiring minimal supervision, who can collaborate with multiple stakeholders in the company      Team player who works well with development/ product engineering teams Adept at troubleshooting and solving complex problems using root cause analysis Adherence with software development processes. Demonstrate problem solving skills, and attention to quality and detail    Good communication skills, proficiency in verbal and written English Perform code reviews and unit testing of program modules  Execute conversion plans and documents possible improvements; identifying and resolving disruptions in the processes Roles and Responsibilities:  An ideal candidate will exhibit the following traits: Adapt and work on distributed technology stacks  Work with BAs to define or elaborate business software requirements  Design and build responsive and usable interface (UI/UX) for web and mobile applications through appealing, visual design  Take ownership of product features and work closely with stakeholders to ideate and rapidly release minimum viable product or solution    Extensive experience with SDLC phases including Agile methodologies Assist in designing client-side and server-side architecture  Develop well managed, high quality, scalable and reusable code using .NET components, web service APIs, database procedures, JavaScript, etc.    Build automation pipeline (CI/CD) through appropriate tools and scripting Perform code reviews, validation and verification testing  Debug code, solve incidents and defects    Proactively communicate in providing status reports and report blockers Document technical design and unit test plans  Evaluate security and regulatory requirements Skills Required:Software developer with extensive knowledge of software development, agile methodologies and the following technologies: C#, ASP.NET, Web API, HTML/CSS, MVC, WCF, Python, JavaScript, SQL Server/Oracle Experience developing highly responsive web and mobile applications (UI/UX) using HTML5/CSS3, W3.CSS, Bootstrap, JavaScript, XML, Xamarin, etc.      Familiarity with various operating systems (Linux, Mac OS, Windows) Hands-on experience in software development and agile methodologies Analytical mind with problem-solving aptitude    Proficiency in relational databases like SQL Server and Oracle. Knowledge of cloud technologies (AWS, Azure, Google cloud), container and virtualization will be a big plus. Familiarity with Continuous integration (Jenkins/Hudson) and version control (GitHub, SVN). Knowledge of modern frameworks and design patterns, and test automation tools for Unit and Performance testing.  Experience creating secure RESTful web services in XML and JSONAbove all, you should love to build and ship products that real people use every day!", "ROLE": "Software Developer", "INDUSTRY TYPE": "Medical, Healthcare, Hospitals", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["Web Api", "CSS", "HTML", "SQL Server", "ASP.Net MVC", "JQuery", "VISUAL", "C#.Net", "Javascript", ".Net", "ASP.Net", "MVA", "MVC", "WCF"]}