{"JOB DESCRIPTION": "       As a senior software engineer in the Wireless LAN(WLAN) firmware group, you will be designing, developing, unit testing, bug fixing and maintaining WLAN firmware components that implements functional aspects of WLAN features on low memory foot print processors that will work in tandem with device drivers running on the host processors. The host driver and the firmware implement the WLAN drivers on the Qualcomm s WLAN SoC platforms.      As part of this team, you will be working on cutting edge WiFi technologies, all 802.11 standards, solving challenging WiFi design & performance issues and working with some of the leading WiFi ODMs & OEMs across the globe on their sometimes high pressure & tough timelines.      Also, Co-work with Hardware designer to verify hardware (MAC) features and debug hardware (MAC) issues; - Co-work with Driver team to debug software/firmware interface issues; - Co-work with algorithm team to diagnose WLAN RF systems performance issues.       Requirements     Outstanding ability of C/C++ language      More than 4 years of hands on technical experience in developing drivers and firmware. Experience working with low memory systems and code/data optimization. Hands on experience on Data structures. Good knowledge of OS theory and system architecture.     Excellent problem solving skills.    Knowledge on wireless industry standards (IEEE 802.11a/b/g/n/ac/ax/be) and RF will be a strong plus.       Educational Requirements     Bachelor's degree or Master degree in Engineering, Information Systems, Computer Science, or related field.      4-7 years of relevant hands-on technical experience in years Software Engineering or related work experience.      4-7 years of experience with Programming Language such as C, C++.        ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Wireless", "Computer science", "System architecture", "RF", "SOC", "LAN", "Data structures", "Firmware", "Unit testing", "WiFi"]}