{"JOB DESCRIPTION": "KONE Technology & Innovation (KTI) is a global organization of technology, design and IT experts who research and create new technologies and solutions for innovative People Flow We are now looking for an Cloud Software developer to join KONE IoT platform team. In this role you will be a vital part of our Cloud software development team and help us create new digital services for our business lines. You will design, develop and maintain APIs, microservices and data pipelines on cloud environments connecting elevators, escalators, building doors and other KONE systems. As we work in accordance with agile methodologies, this means that your day-to-day work will also consist of participating in sprint planning, daily scrums and retros. You will also work with automating the software delivery lifecycle utilizing Devops practices. Main responsibilities: Working closely with Product Owner and feature teams to design and develop new features Hands-on developing software applications and APIs for KONE cloud Devops, unit and integration testing Collaborating closely with other development teams, software architects, partners, project managers and stakeholders Required Skills:Minimum 3+ years of hands on experience with building application using AWS services such as Kinesis , ECS, EKS, EC2, SNS, S3, IAM, Code commit and cloud watch or equivalent services in any other cloud platformKnowledge of serverless architecture and microservices developmentREST Web Services development using JavaExperience with container technology - Docker, Kubernetes, Istio dashboardExperience with any SQL and NoSQL DatabasesExperience in agile methodologies for software developmentUsing modern project management tools (Confluence, Jira, MS Project, etc)Should have genuine curiosity to learn new thingsGood to have:Experience with one or more Platform-as-a-Service offerings with IoT capabilities (AWS IoT/ IBM Watson IoT/ Azure IoT Hub).Development and implementation experience across various cloud PaaS solutions such as Amazon, Azure or IBM cloud ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Graduation Not Required, Any Graduate in Any Specialization", "PG": "Post Graduation Not Required, Any Postgraduate in Any Specialization", "DOCTORATE": "Any Doctorate in Any Specialization, Doctorate Not Required"}, "KEY SKILL": ["stream api", "microservices", "java 8", "S3", "Spring Boot", "EKS", "kinesis", "docker", "ECS", "EC2", "Cloud watch", "kafka", "SNS", "containers", "aws", "Lambda", "Spring Security", "azure"]}