{"JOB DESCRIPTION": "We're ADVANCED \n\nWe re one of the UK s largest and fastest growing software companies.  True partnership is the defining thing that enables us to stand out from the competition.  We pride ourselves on delivering focused software solutions for the public sector,  enterprise commercial and health & care organizations that simplify complex business challenges and deliver immediate and high-quality value.  \n\nPOST TITLE:  Software Engineer \n\nLOCATION :  Bangalore - India \n\nREPORTING TO:  Respective Line Manager \n\nEXPERIENCE LEVEL :  2-4 Years \n\nPROJECT :  C&C \n\nJOB DESCRIPTION :  \n\nA proven software developer with 2-4 years of strong JavaScript,  Angular and React JS technologies and working on web OR UI/ UX development experience in (2-4 years) and required to work within a team for a Critical product within Financial domain.  \n\nKey Skills \n\n1.  Exceptional problem-solving skills and excellent skills in Front End technologies like HTML5,  CSS3,  jQuery,  JavaScript,  Redux,  ReactJS,  NodeJS \n\n2.  Must have strong JavaScript experience \n\n3.  Knowledge to (React JS OR NodeJS OR Angular JS) \n\n4.  Thorough understanding of SOLID architecture principles,  dependency injection,  MVC and MVVM \n\n5.  Good communication skills to work with team across geographies and other departments \n\n6.  Team player \n\n7.  Good understanding of scrum framework and experience \n\nDesirable Skills \n\n8.  Desirable - MEAN (MongoDB,  Express,  Angular,  Node. js) and MERN (MongoDB,  Express,  React,  Node. js) \n\n9.  Knowledge on AWS/ CI. CD/ GitHub/ JIRA/ Scrum process", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["github", "development", "ux", "solid", "MVVM", "software", "level", "JIRA", "CSS3", "jQuery", "Front end", "web", "Javascript", "Scrum", "MongoDB", "developer", "MVC", "architecture"]}