{"JOB DESCRIPTION": "Location - India - Bangalore \n\nReporting to - Development Manager \n\nEXPERIENCE LEVEL:  3-6 Years \n\nPROJECT:  Docman \n\nAdvanced is expanding and is building great software teams that create products in the Healthcare,  Enterprise Resource Planning,  and Education markets.  We are now in immediate need for talented software developers who can demonstrate excellent skills for creating modern healthcare applications.  \n\nA proven software developer with 3 to 5 years of strong . NET technologies development experience and required to work within a team for Docman product /  application in Health & Care Domain.  \n\nAbout the role \n\nThis is an opportunity to work as a Software Developer within a team and employ the best practices and tools to create innovative and market leading solutions.  \n\nIn this role you will:  \n\nManage small-scale development projects to delivery schedule.  \n\nLearn our applications and become knowledgeable and proficient in their development.  \n\nTranslate software requirements into concise and robust program code.  \n\nWork closely with the Product Owner to refine requirements,  estimate development effort and gain their acceptance of the solution.  \n\nWorking closely with the Test Analyst,  use effective automated and manual testing techniques at various levels to ensure the software is correct,  performant and robust.  \n\nIdentify improvements to existing application code and designs,  increasing flexibility and reducing future effort.  \n\nProvide support,  investigating technical issues and advising internal support technicians.  \n\nInvestigate and resolve software defects with the minimum impact and risk.  \n\nOur people deliver excellence in everything they do.  They act with pace,  are fearless and always do the right thing.  We work together and act as a team,  so you will \n\nWorking as part of a high performing SCRUM team \n\nIdentify problems and act and be responsible in resolving them \n\nAim for self-improvement and continuous learning \n\nAsk for help and help others \n\nClearly explain and discuss technical points with both technical and non-technical people \n\nSay what you will do by when and work to do it in time \n\nAppreciate challenge and feedback from colleagues \n\nKey Skills \n\no Hands on experience in VB . NET,  C#,  MySQL,  \n\no jQuery and Jenkins \n\no Desirable skills such as VB . NET,  C#,  MySQL,  jQuery and Jenkins,  \n\no Good knowledge in JIRA,  GITHUB,  AGILE", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["github", "ERP", "development", "VB.NET", "code", "technical", "software", "testing", "it", "JIRA", "vb", "tools", "jQuery", "Manual testing", "application", "MySQL", "Agile", "Healthcare", "Scrum", "developer", "net", "support", "applications"]}