{"JOB DESCRIPTION": "We're ADVANCED \n\nWe re one of the UK s largest and\n\nfastest growing software companies.  True partnership is the defining thing that\n\nenables us to stand out from the competition.  We pride ourselves on delivering\n\nfocused software solutions for the public sector,  enterprise commercial and\n\nhealth & care organizations that simplify complex business challenges and\n\ndeliver immediate and high-quality value.  \n\nPOST TITLE:  \n\nSoftware\n\nEngineer (C#,  . NET,  SQL,  WCF,  Windows) \n\nLOCATION:  \n\nBangalore\n\n- India \n\nTEAM:  \n\nAHC \n\nEXPERIENCE LEVEL:  \n\n3-5 Years \n\nJob Description: \n\nHealthcare Software Developer \n\nIndia - Bangalore \n\nReporting to Development Manager \n\nAdvanced is expanding and is building\n\ngreat software teams that create products in the Healthcare,  Enterprise\n\nResource Planning,  and Education markets.  We are now in immediate need\n\nfor talented software developers who can demonstrate excellent skills for creating\n\nmodern healthcare applications.  \n\nBackground \n\nAdvanced Health and Care is a leading\n\nsupplier of IT Solutions to the Healthcare sector.  \n\nAdastra is the market leading patient\n\nmanagement system for unscheduled care across England,  Scotland,  Wales, \n\nNorthern Ireland,  the Republic of Ireland and the Netherlands.  \n\nWe are the market leader for 111 services, \n\nwith over 85% of Out-of-Hours GP services across the UK and Republic of\n\nIreland.  Adastra is a clinical case management,  integration services and 24x7\n\ntechnology infrastructure solution from Advanced Health and Care.  \n\nMore than 14 million episodes of care are\n\nmanaged,  connected,  integrated and measured annually across Europe using\n\nAdastra.  100% committed to open-systems and interoperability,  Adastra is fully\n\nengaged in connected care - in product,  in spirit and in action.  \n\nAdastra is a windows-based application, \n\nmainly built using C# winforms,  WCF and SQL server.  The product is built upon\n\nSOLID principals and leverages time-tested design patterns for stability and\n\nbetter performance.  \n\nAbout the role:  \n\nThis is an opportunity to work as a\n\nSoftware Developer within a team and employ the best practices and tools to\n\ncreate innovative and market leading solutions.  \n\nIn this role you\n\nwill:  \n\nManage small-scale development projects to delivery schedule.  \n\nLearn our applications and become knowledgeable and proficient in their\n\ndevelopment.  \n\nTranslate software requirements into concise and robust program code.  \n\nWork closely with the Product Owner to refine requirements,  estimate\n\ndevelopment effort and gain their acceptance of the solution.  \n\nWorking closely with the Test Analyst,  use effective automated and\n\nmanual testing techniques at various levels to ensure the software is correct, \n\nperformant and robust.  \n\nIdentify improvements to existing application code and designs, \n\nincreasing flexibility and reducing future effort.  \n\nProvide support,  investigating technical issues and advising internal\n\nsupport technicians.  \n\nInvestigate and resolve software defects with the minimum impact and\n\nrisk.  \n\nOur people deliver excellence in\n\neverything they do.  They act with pace,  are fearless and always do the right\n\nthing.  We work together and act as a team,  so you will \n\nWork as part of a high performing SCRUM team \n\nIdentify problems,  act and hold the responsibility of resolving them \n\nAim for self-improvement and continuous learning \n\nAsk for help and help others \n\nClearly explain and discuss technical points with both technical and\n\nnon-technical people \n\nSay what you will do,  by when,  and work to do it in time \n\nAppreciate challenge and feedback from colleagues \n\nAbout you \n\nYou have a passion for all things\n\nconnected with software development and an avid interest in technology.  So, \n\nit s no surprise that you have solid experience working as a software developer\n\non high quality enterprise level solutions and can tell us about your\n\nexperience across the whole software development life cycle.  \n\nYou establish productive working\n\nrelationships with your teammates and other colleagues,  both technical and\n\nnon-technical,  and work collaboratively as part of a team to deliver on shared\n\ncommitments.  You are a self-starter and able to plan and manage your own\n\nworkload.  You enjoy working with technologies that are new to you and\n\ntaking on additional roles that help the team make progress.  \n\nYou have sound\n\nunderstanding and experience with:  \n\nModern software language capabilities such as object-orientation, \n\ngenerics,  etc.  \n\nC#/ . NET and Visual Studio \n\nSQL databases,  preferably Microsoft SQL Server \n\nSource Control with TFS or Git/ GitHub or any similar version management\n\ntools \n\nSoftware development principles,  patterns and practices \n\nResourcefulness and troubleshooting aptitude \n\nThe following would\n\nbe beneficial:  \n\nWorking with Windows Applications \n\nWCF,  Web Services or Web API \n\nBest practice such as SOLID and TDD \n\nAgile development methodologies and practices \n\nCI/ CD development infrastructure such as Jenkins,  Team City \n\nPackaging systems such as Nuget.  \n\nHealthcare software development including standards such as HL7,  FHIR\n\nand SNOMED \n\nYou also have:  \n\nA degree in\n\nSoftware Engineering or Computer Science or equivalent qualification or\n\nexperience.  \n\nGood verbal and\n\nwritten English communication skills \n\nBenefits:  \n\nHealth insurance benefits for up to eight members of the family \n\nEmployee Assistance Programmes \n\nOrganize/ deliver or just attend regular tech talks,  Meet Ups,  podcasts \n\nFree coffee,  tea and milk all the time! \n\nJoin the A team! \n\nJoin a business that embraces innovation, \n\ngives you the scope to seize every opportunity and will help get you where you\n\nwant to go.  Life at Advanced begins in an unprecedented environment with a role\n\nthat matters,  taking you on a fast-paced journey of discovery,  however big that\n\nmight be.  \n\nWe re one of the UK s largest and fastest growing software companies. \n\nTrue partnership is the defining thing that makes us different from the\n\ncompetition.  We pride ourselves on delivering focused software solutions for\n\npublic sector,  enterprise commercial and health & care organisations that\n\nsimplify complex business challenges and deliver immediate value.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["server", "code", "technical", "software", "Winforms", "Windows", "Troubleshooting", "microsoft", "tools", "sql", "TDD", "web", "design", "Scrum", "api", "net", "c#", "solid", "level", "testing", "Visual Studio", "it", "quality", "Computer science", "infrastructure", "Packaging", "Healthcare", "developer", "WCF", "applications"]}