{"JOB DESCRIPTION": "         Position Details:     Essential duties and responsibilities include the following.     Create and maintain web apps using C#,  MVC,  Dotnet Core,  CSS.   Work with project owners to complete issues in a timely manner.   Work with deployment team to move your code into production.   Troubleshoot and resolve issues in applications.   Analyze technical requirements involved in the implementation of new features or modification of existing features,  including:   Assessing the functional and technical requirements.   Suggesting feasible alternatives.   Estimating the time required to complete the work.   Submitting the results of the analysis to the Director,  Web Development.     Mentor and assist junior developers.   Other duties as assigned.      Must have ability to:    Prioritize work and address multiple tasks concurrently.   Troubleshoot reported issues,  ensuring the successful execution of processes.   Provide support to the user community via technical problem analysis and resolution.   Must have commitment to quality and customer service.   Must have ability to work effectively under stressful working conditions.   Must be able to work well independently or in a team environment.   Must have ability to thrive in a fast paced,  high energy work environment.        Language Ability:    Must be able to communicate with internal and external customers in a clear,  concise and understandable manner both verbally and in writing.   Must be able to communicate effectively under extreme pressure.        Reasoning Ability:     Must possess excellent analytical and problem solving skills.   Must possess the ability to research issues and resolve customer s issues in a timely and appropriate manner.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Analytical", "Software Engineer II", "Web development", "Director", ".Net", "Mentor", "Customer service", "MVC", "Research", "Troubleshooting"]}