{"JOB DESCRIPTION": "Job Description: Software Developer  India -  Bangalore  Reporting to Development Manager  Advanced is expanding and is building great software teams that create products in the Healthcare,  Enterprise Resource Planning,  and Education markets. We are now in immediate need for talented software developers who can demonstrate excellent skills for creating modern web applications. About the role  This is an opportunity to work as a Software Developer within a team,  and employ the best practices and tools to create innovative and market leading solutions.  In this role you will:   Design technical solutions to high level requirements or problems,  through evaluating several options.  Manage small- scale development projects to delivery schedule.  Learn our applications and become knowledgeable and proficient in their development.  Translate software requirements into concise and robust program code.  Work closely with the Product Owner to refine requirements,  estimate development effort and gain their acceptance of the solution.  Working closely with the Test Analyst,  use effective automated and manual testing techniques at various levels to ensure the software is correct,  performant and robust.  Identify improvements to existing application code and designs,  increasing flexibility and reducing future effort.  Produce and update technical product documentation that describes the system and its operation.  Provide support,  investigating technical issues and advising internal support technicians.  Investigate and resolve software defects with the minimum impact and risk.  Liaise with third- parties to implement interactions with other systems and components.  Understand and apply the product build and delivery pipeline,  and make improvements to it.  Our people deliver excellence in everything they do. They act with pace,  are fearless and always do the right thing. We work together and act as a team,  so you will  Identify problems and take action and responsibility for resolving them  Aim for self- improvement and continuous learning  Ask for help and help others  Clearly explain and discuss technical points with both technical and non- technical people  Say what you will do by when and work to do it in time  Appreciate challenge and feedback from colleagues About you  You have a passion for all things connected with software development and an avid interest in technology. So it s no surprise that you have solid experience working as a software developer on high quality enterprise level solutions,  and can tell us about your experience across the whole software development life cycle. You establish productive working relationships with your teammates and other colleagues,  both technical and non- technical,  and work collaboratively as part of a team to deliver on shared commitments. You are a self- starter and able to plan and manage your own workload. You enjoy working with technologies that are new to you,  and taking on additional roles that help the team make progress.  You have sound understanding and experience with:? ?Strong Visual Basic skills (VB6 /  VB.NET)  Strong SQL Server Skills Ideally some web development /  Javascript skills for redevelopment work You also have  A degree in Software Engineering or Computer Science or equivalent qualification or experience Good verbal and written English communication skills Join the A team!  Join a business that embraces innovation,  gives you the scope to seize every opportunity and will help get you where you want to go. Life at Advanced begins in an unprecedented environment with a role that matters,  taking you on a fast paced journey of discovery,  however big that might be. We re one of the UK s largest and fastest growing software companies. True partnership is the defining thing that makes us different from the competition. We pride ourselves on delivering focused software solutions for public sector,  enterprise commercial and health & care organisations that simplify complex business challenges and deliver immediate value.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["server", "code", "technical", "software", "Web development", "public sector", "Visual Basic", "web", "design", "Javascript", "Evaluation", "development", "solid", "level", "testing", "Tools", "it", "SQL", "Avid", "quality", "Computer science", "application", "Healthcare", "developer", "support", "applications"]}