{"JOB DESCRIPTION": "      Ruby on Rails developer with 6- 8 Years hands on experience with good understanding of Java script,  jQuery,  HTML,  CSS. The individual will need to be hands on with development,  unit testing,  performance optimization,  secure development process,  usability and coding standards of the product.    Should be good with following best practices (SCRUM,  refactoring and code standards    Should have a mix of excellent reasoning ability to document,  architect,  develop and test software with the commitment to excellence and defect free product before being deployed.    Should be able to work closely with all stakeholders to investigate,  fix,  optimize,  test and deploy high quality solutions.    Should have excellent hands on understanding of technical design,  implementation and maintenance of technical initiatives towards improving and scaling of products.    Should help support team in deploying product functionality and assist in troubleshooting in production environment.    Self- motivated and should rapidly incorporate new requirements and deliver successfully by self.    Effectively communicates with peers and stakeholders; gathers and clarify requirements from technical functional aspect,  Team working Mentoring    Follows software development process; consistently innovates processes to improve individual and team productivity and quality.    Strong Analytical,  Problem Solving Skills and participates in all activities with urgency,  should be result oriented and with strong work ethic.    Drive continuous adoption and integration of relevant new technologies into design    Experience with Agile development lifecycle with excellent understanding of feature estimation and ability to communicate issues and risks that may impact timelines or resources.     Key Skills      Web application (HTML,  CSS)      Test- driven development      Ruby      Rails      jQuery,  JavaScript      SQL      GIT      Should be able to efficiently do Code reviews      Cloud/SaaS based application development      Desirable Skills      JIRA      Object Oriented Design in Ruby: (SOLD principles,  OOP Design Patterns,  formal refactoring practices)      JSON,  JWT      prototype.js      MySQL      Continuous integration      RubyMine      Experience with financial/ERP systems   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["jQuery", "Coding", "Technical design", "Analytical", "Agile development", "HTML", "Scrum", "Unit testing", "Troubleshooting", "Ruby on rails"]}