{"JOB DESCRIPTION": "                      ABOUT THE POSITION:          Core Services Lead Engineer         The Core Services Engineering Teams leads the overall GTS Engineering Design, Development and establishment of shared services AWS, Nexus, Jenkin, Foreman, VMware, Git, SVN, Splunk, SonarQube  , Fisheye Crucible, Cloud Custodian, Packer, RHIM, FTS, Cloud Health, AquaSec, Automation / Orchestration using Terraform, Cloudify, Python, CloudFormation, Puppet and Ansible.        The successful engineer provides expertise in developing, managing, provisioning, and supporting services/server/cloud environments, with deep technical knowledge of Red Hat Enterprise Linux, Windows Server and AWS Operating Systems and Environments. As part of your daily job you will be working with DevOps to help identify areas of improvement and will help lead the reduction in technical debt within the Core Services area of responsibility. Examples of this could include areas where automation and orchestration is required to make everyday tasks more streamlined and automated (examples could be automated notifications for expiring passwords).          This position requires an experienced engineer who is goal-oriented, able to multitask, willing to mentor junior engineers and can work independently and in small groups. We need strong software engineers to help us automate our data centers. FICO needs to speed delivery of the company s many software products to customers and the cloud.          Work closely with FICO infrastructure, Networking, Core Services DevOps, Core Services SRE as well as software and hardware vendors.         Maintain awareness of industry trends and issues with hardware, operating systems, networking, security and any relevant new technologies and frameworks         Any AWS Certification is must         Red Hat certification - Red Hat Certified Systems Administrator preferred          REQUIRED EXPERIENCE           7-12 years of experience as a Lead or Senior Engineer, with concentrated experience with scripting, automation, orchestration and config management.              Understanding of development methodologies including Scrum, Agile, and test-driven development.                 Understanding of Continuous Integration and Continuous Delivery (CICD)              Experience with support of service request, release management, incident resolution and change management processes within a Development and/or Production environment           Hands-on development/administrative management experience supporting automation using tools like Jenkins, Terraform    and     CloudFormation           Knowledge of one or more scripting languages - Shell, Perl, Python, Ruby, etc.           Hands-on development/administrative experience supporting configuration management tooling such as Puppet and Ansible.            Hands-on development/administrative experience with RHEL and Windows Server Operating Systems.            Demonstrated experience with public cloud platforms such as AWS           Has helped to develop documentation of technical processes and workflows; policy, process, procedures and run books           Proven ability to strategically analyse the risks, benefits, and opportunities associated with a solution.           Knowledge of industry security principles and server vulnerability remediation practices           Non-technical Skills           Multi-task multiple projects at one time as well as work in a high-pressured, unstructured and yet customer-oriented environment.           Excellent written and verbal communications skills.           Experience with implementation strategies which preserve the availability, performance, integrity, stability, and scalability of systems, consistent with cost constraints.           Comfortable to work independently and in a small team atmosphere           Ensures technology and procedures remain current and compliant with GTS standards and policies               ", "ROLE": "Software Developer", "INDUSTRY TYPE": "KPO, Research, Analytics", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["VMware", "Change management", "Automation", "Configuration management", "Anti money laundering", "Agile", "Perl", "Windows", "Release management", "FICO"]}