{"JOB DESCRIPTION": " Job Description    To ensure that Visa s payment technology is truly available to everyone, everywhere requires the success of our key bank or merchant partners and internal business units. The Global Data Science group supports these partners by using our extraordinarily rich data set that spans more than 3 billion cards globally and captures more than 100 billion transactions in a single year.   The Payment Systems Risk team within Visa Data Product is responsible for building critical risk and fraud prevention applications and services at VISA. This includes idea generation, architecture, design, development, and testing of products, applications, and services that provide Visa clients with solutions to detect, prevent, and mitigate risk for Visa and Visa client payment systems.   Are you skilled at turning hard numbers into compelling stories and useful strategic insightsDo you solve complex data challenges with creative flairPut those skills to work answering strategic questions for one of the world's most respected and innovative payments companies.     Responsibilities    :     Design and develop critical systems with high-availability and high performance.     Design, code and integrate n-tier applications with different application components     Responsible for design and development of different products utilizing Visa's huge data.     Interested in Innovation and ideation. Contribute to development of new products by building quick POCs and converting ideas into real products.     Collaborate with business and technology stakeholders to deliver high quality products and services that meet business requirements and exceeds expectations while applying the latest available tools and technology.     Have a passion for delivering zero defect code.     Effectively communicate status, issues, and risks in a precise and timely manner     Work in Agile/Scrum teams and follow the guidelines.     Create documentation and procedures for installation and maintenance.     Collaborate with global and virtual teams on software development.   Identify opportunities for future enhancements and refinements to products, standards, best practices and development methodologies    Qualifications     5+ years of relevant experience with software design, architecture and development life cycle.     Bachelor or Master Degree in Computer Science or related engineering discipline.     Full Stack Software Development experience in large scale mission critical applications.     Mandatory experience with n-tier web application development and experience in Java/J2EE or other frameworks.     Solid experience in frameworks like Spring or Spring Boot, Sprint MVC, JPA, Hibernate.     Expertise with RDBMS systems like SQL Server, Oracle or DB2.      Experience working on UI/Web development using Angular/React, JavaScript, JQuery, and HTML/CSS technologies is required.     Proficient in Web Services/API Development using SOAP or REST, JSON and XML.     Proficient in GIT/Stash, Maven, Jenkins etc.     Passionate about delivering zero defect code that meet or exceed the proposed defect SLA and have high sense of accountability for quality and timeliness.     Ability to deliver on multiple projects and manage priorities based on changing directions     Leading a module/team or mentoring experience will be a plus.      Excellent presentation, collaboration and communication skills required.   Experience being part of an Agile/Scrum team and following processes    5 years of relevant experience with software design,  architecture and development life cycle.    Bachelor or Master Degree in Computer Science or related engineering discipline.    Full Stack Software Development experience in large scale mission critical applications.    Mandatory experience with n- tier web application development and experience in Java/ J2EE or other frameworks.    Solid experience in frameworks like Spring or Spring Boot,  Sprint MVC,  JPA,  Hibernate.    Expertise with RDBMS systems like SQL Server,  Oracle or DB2.     Experience working on UI/ Web development using Angular/ React,  JavaScript,  JQuery,  and HTML/ CSS technologies is required.    Proficient in Web Services/ API Development using SOAP or REST,  JSON and XML.    Proficient in GIT/ Stash,  Maven,  Jenkins etc.    Passionate about delivering zero defect code that meet or exceed the proposed defect SLA and have high sense of accountability for quality and timeliness.    Ability to deliver on multiple projects and manage priorities based on changing directions   Leading a module/ team or mentoring experience will be a plus.     Excellent presentation,  collaboration and communication skills required.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Hibernate", "jQuery", "Db2", "RDBMS", "XML", "Javascript", "HTML", "MVC", "Oracle", "SQL"]}