{"JOB DESCRIPTION": "We're ADVANCED       We re one of the UK s largestand fastest growing software companies. True partnership is the defining thingthat enables us to stand out from the competition. We pride ourselves ondelivering focused software solutions for the public sector, enterprisecommercial and health & care organizations that simplify complex businesschallenges and deliver immediate and high - quality value.     POST TITLE:     Senior Software Engineer      LOCATION:     Bangalore  -  India     REPORTING TO:     Respective Line Manager     EXPERIENCE LEVEL:     5 to 9 Years     PROJECT:     C&C      JOB DESCRIPTION:      A provensoftware lead developer with 8 - 9 years of strong JavaScript, Angular and ReactJS technologies and working on web OR UI/UX development experience and requiredto lead and work within a team for multiple products within Financial domain.Candidate will act as lead for UI/UX components who can coordinate, guide,mentor team of UI/UX developers.     Key Skills    1. Exceptional problem - solving skills and excellent skillsin Front End technologies like HTML5, CSS3, jQuery, JavaScript, Redux, ReactJS,NodeJS   2. Must have strong JavaScript experience   3. Knowledge ON(React JS OR NodeJS OR Angular JS)   4. Thorough understanding of SOLID architecture principles,dependency injection, MVC and MVVM   5. Good communication skills to work with team acrossgeographies and other departments   6. Team Leader and Player.   7. Good understanding of scrum framework and experience     8. Should have experience of leading, mentoring, guiding team including workallocation, tracking and resolving technical queries and implement bestpractices followed across org.      9. Should be able to lead and drive UI.UX development for multiple products,discuss with other teams within org to plan for any changes/enhancements.Should have exposure on to estimation in story points / days.       DesirableSkills      1. Desirable  -  MEAN (MongoDB,Express, Angular, Node.js) and MERN (MongoDB, Express, React, Node.js)   2. Knowledge onAWS / CI.CD / GitHub / GitPrime / JIRA / Jenkins / Harness / Scrum process/iONIC. Workingexposure with Architects/Designers.      3. Leadership skills to guide / mentor /resolve queries, Work allocation  -  Monitoring and tracking. Working withproject leads / managers to provide status updates.            ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["jQuery", "Front end", "MVVM", "Javascript", "Scrum", "MongoDB", "MVC", "JIRA", "Monitoring", "CSS3"]}