{"JOB DESCRIPTION": "JOB DESCRIPTION  \n Job Title: Senior Developer \n Reporting To: Development Manager \n Location: Bangalore\n  We are looking for an experienced software developer to join our high- performance agile development team enhancing and maintaining our suite of Care delivery products. You will need solid experience of working on enterprise level solutions with an emphasis on quality and automated testing. You will be using a range of development tools and languages,  from rich client applications written in C# .Net ,  sophisticated distributed back- end processing systems written in C# .NET and front- end technologies.\n As a Senior Developer you would be an ambitious high- achiever who has wide development background and strives for technical excellence from yourself and your team. Your key skill will be the delivery of high quality product increments through good agile development practices using a collaborative approach.\n  Main Duties and Responsibilities  \n\n Work with analysts,  IT professionals and other developers to coordinate large- scale development projects and meet deadlines. \n Under the guidance of the Technical Lead design and develop application architecture that is scalable,  reliable,  available and manageable. \n Define interactions between application packages,  databases,  and middleware systems in terms of functional coverage. \n Promote Agile and Test Driven Development practices within the team,  ensuring that Unit Test and Acceptance Tests are implemented to confirm that acceptance criteria (i.e. system behaviours) are met. \n Work with the Technical Lead to develop deployment strategy and enforce technical standards and tooling. Continually look for and drive improvement to processes and tooling.\n  Skills Required  \n\n C#  \n WinForms/ WPF/ ASP .NET  \n MVC Architecture  \n SQL Server \n ADO.NET/ Dapper/ Entity framework \n LINQ \n JSON \n C# 5.0  \n Dependency Injection \n VisualStudio.TestingTool \n Automated unit test \n Understanding of SSRS \n Web services/ Web API/ WCF services \n SOLID principles and Design patterns \n XML \n Scrum framework Join the A team! \n Join a business that embraces innovation,  gives you the scope to seize every opportunity and will help get you where you want to go. Life at Advanced begins in an unprecedented environment with a role that matters,  taking you on a fast paced journey of discovery,  however big that might be.\n We re one of the UK s largest and fastest growing software companies. True partnership is the defining thing that makes us different from the competition. We pride ourselves on delivering focused software solutions for public sector,  enterprise commercial and health & care organisations that simplify complex business challenges and deliver immediate value.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["server", "c++", "C", "technical", "software", "HTML", "tools", "sql", "Technical product configuration", "web", "xml", "design", "MySQL", "JavaScript", "ssrs", "json", "mvc", "wcf", "architecture", "middleware", "c#", "solid", "level", "integration PHP", "it", "quality", "linq", ".net", "scrum", "developer", "agile", "asp"]}