{"JOB DESCRIPTION": "  You are responsible for     As a Software Engineering Manager, you are responsible for the talent management, way of working and output of the team. You lead and manage the teams within the allocated budget, on time and with the highest level of quality. The work is based on a product and technology roadmap, covering studies, new product introductions, product maintenance activities and advanced field support.     Key areas of responsibility:       Leads a software department of approximately 20+ engineers      Defines group composition including required competencies, resources and skills      Ensures successful introduction and sustaining of high quality, manufactural, serviceable, and reliable products      Drives the technology roadmaps for the team      Defines and executes process improvement activities      Manages relationships with external stakeholders like suppliers and customers, and internal stakeholders like Innovation, Operations, Customer Services, Procurement and Marketing       To succeed in this role, you should have the following skills and experience       Bachelors , Masters degree or better in software engineering      15 years of experience , at least 5 years in a Leadership role      Several years of experience in leading a team, in an Agile SW environment , across global sites      Exposure to Agile project management on Azure Devops      Good Software Program management skills and knowledge of Software Quality processes , tools and methods      Several years of experience in a medical OR regulated environment, testing, and quality assurance is a plus      Several years of experience in a mechatronics environment is as plus      Knowledge and experience of international standards (e.g. FDA regulatory, IEC 62304, IEC60601, ISO13485, ISO14971) is a plus      Abstract, analytical and creative thinker with helicopter view. You drive (out-of-the-box) solutions to complex problems      Is communicative, a good listener, and is able to give good presentations to various levels in the organization      Has a continuous improvement attitude, is self-driven and leads through example      Organizational talent and ready to take responsibility      Communicative in all layers of the organization, orally and in writing      Fluent in English, written and verbal    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Medical, Healthcare, Hospitals", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization, CA in CA"}, "KEY SKILL": ["VXWorks", "Procurement", "C++", "Analytical", "Healthcare", "HTML", "Windows", "Customer service", "software quality", "Embedded software"]}