{"JOB DESCRIPTION": "      In this role you will:.     Learn our applications and become knowledgeable and proficient in their development.   Translate software requirements into concise and robust program code.   Work closely with the Product Owner to refine requirements, estimate development effort and gain their acceptance of the solution.   Working closely with the Test Analysts, use effective automated and manual testing techniques at various levels to ensure the software is correct, performant and robust.   Identify improvements to existing application code and designs, increasing flexibility and reducing future effort.   Produce and update technical product documentation that describes the system and its operation.   Provide support, investigating technical issues and advising internal support technicians.   Investigate and resolve software defects with the minimum impact and risk.   Liaise with third-parties to implement interactions with other systems and components.   Our people deliver excellence in everything they do. They act with pace, are fearless and always do the right thing. We work together and act as a team, so you will   Identify problems and take action and responsibility for resolving them   Aim for self-improvement and continuous learning   Ask for help and help others   Clearly explain and discuss technical points with both technical and non-technical people   Say what you will do by when and work to do it in time   Appreciate challenge and feedback from colleagues    About you    You have a passion for all things connected with software development and an avid interest in technology. So, it s no surprise that you have solid experience working as a software developer on high quality enterprise level solutions and can tell us about your experience across the whole software development life cycle.   You establish productive working relationships with your teammates and other colleagues, both technical and non-technical, and work collaboratively as part of a team to deliver on shared commitments. You are a self-starter and able to plan and manage your own workload. You enjoy working with technologies that are new to you and taking on additional roles that help the team make progress.     You have sound understanding and experience with:    Software development principles, patterns and practices   Best practice such as SOLID and TDD   Modern software language capabilities such as object-orientation, generics, first-class functions, dynamically and statically typed languages   Agile development methodologies and practices   Working as part of a high performing SCRUM team    You have a good understanding of:    Development of modern web applications with technologies such as these   o HTML5, CSS 3, Bootstrap3   o Javascript   o Front-end frameworks   o JQuery   o MVC 5   Server-side development in VB.NET and Visual Studio   Source Control with Git and GitHub   Transactional SQL, preferably using MySQL Server   CI/CD development infrastructure such as Jenkins, Team City   Packaging systems such as Nuget.    The following would be beneficial:    C#.NET   Healthcare software development including standards such as   HL7, FHIR, SNOMED, and OpenEHR   Experience with the UK based health market   Experience with HIPPA and/or US Healthcare  Duties An opportunity to join our high performing team of Senior Software Developers in India working on in-house products.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["jQuery", "Manager Quality Assurance", "Front end", "MySQL", "Javascript", "Packaging", "Scrum", "MVC", "Visual Studio", "SQL"]}