{"JOB DESCRIPTION": " Job Description    We are developing and executing a shared strategic vision for Business Solutions Data Services platforms and products that enable Visa to be the world-leading data-driven payments company.   As a Staff Software Engineer, you will be part of a world-class team of Engineers to define, drive and execute on this vision. We are looking for a self-motivated individual with software engineering skills and expertise with Big Data systems integration and technologies. The candidate will be extensively involved in hands-on activities including POCs, design, development, testing, and documentation. Candidate must be flexible and willing to switch tasks based on team's needs.    Design and develop mission-critical systems, delivering high-availability and performance.     Work on development of new products and enhancements to existing systems iteratively by building quick POCs and converting ideas into real products     Work closely with architects, business and technical stakeholders to develop high quality products and services that meet business requirements and expectations while applying the latest available tools and technology     Instill best practices for software development, and deliver high quality work on tight schedules.     Identify opportunities for further enhancements and refinements to standards and processes     Mentor junior team members, develop departmental procedures and best practices standards     Coordinate Continuous Integration activities, testing automation frameworks, and other related items in addition to contributing core product code     Present technical solutions, capabilities, considerations, and features in business terms. Effectively communicate status, issues, and risks in a precise and timely manner      Qualifications    Bachelor degree in a technical field such as computer science, computer engineering or related field required. Advanced degree preferred    Minimum of 8 years of software development experience (with a concentration in data centric initiatives), with demonstrated expertise in leveraging standard development best practice methodologies     Minimum of 3 to 4 years of experience in building large-scale applications using open source technologies. Design and coding skills with Big Data technologies like Hadoop, Spark, Hive, HBase and Map Reduce     Minimum of 4 years of hands-on expertise with Java or Scala     Experience with highly distributed, scalable, concurrent and low latency systems working with one or more of the following database technologies: DB2, MySQL and NoSQL data warehouses such as HBase     Deep knowledge of Unix/Linux     Deep knowledge of all DW-related components (Sourcing, ETL, Data Modeling, Infrastructure, BI, Reporting, Data Visualization, Predictive Analytics) and multiple tools to support those components     Strong foundation in computer science, with strong competencies in data structures, algorithms and software design optimized for building highly distributed and parallelized systems     Experience with Agile & DevOps methodologies     Excellent analytical and problem solving skills with a strong automation mindset     Ability to handle multiple competing priorities in a fast-paced environment     Good written and verbal communication skills. Ability to effectively communicate the logic and implementation plan to team members & managers     Quick learner; self-starter, detailed and thorough     Payment processing background is a big plus.   Bachelor degree in a technical field such as computer science, computer engineering or related field required. Advanced degree preferred    Minimum of 8 years of software development experience (with a concentration in data centric initiatives), with demonstrated expertise in leveraging standard development best practice methodologies   Minimum of 3 to 4 years of experience in building large-scale applications using open source technologies. Design and coding skills with Big Data technologies like Hadoop, Spark, Hive, HBase and Map Reduce   Minimum of 4 years of hands-on expertise with Java or Scala   Experience with highly distributed, scalable, concurrent and low latency systems working with one or more of the following database technologies: DB2, MySQL and NoSQL data warehouses such as HBase   Deep knowledge of Unix/Linux   Deep knowledge of all DW-related components (Sourcing, ETL, Data Modeling, Infrastructure, BI, Reporting, Data Visualization, Predictive Analytics) and multiple tools to support those components   Strong foundation in computer science, with strong competencies in data structures, algorithms and software design optimized for building highly distributed and parallelized systems   Experience with Agile & DevOps methodologies   Excellent analytical and problem solving skills with a strong automation mindset   Ability to handle multiple competing priorities in a fast-paced environment   Good written and verbal communication skills. Ability to effectively communicate the logic and implementation plan to team members & managers   Quick learner; self-starter, detailed and thorough   Payment processing background is a big plus.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Unix", "Automation", "Linux", "Db2", "Data modeling", "Coding", "MySQL", "Agile", "Data structures", "Open source"]}