{"JOB DESCRIPTION": " Job Description    Visa Corporate IT (CIT) group has embarked on a major transformation journey. We are transforming ourselves into a true engineering organization where we put customer experience and end user support first. As part of this strategy, we are consolidating several of our Operational functions into a single area focused on providing world-class operational support to our End users. Visa's Engineering,    Applications and Analytics team is looking for curious, creative, and technology experts to join our growing team. We focus on delivering and supporting integrated platforms that enables Visa's finance applications, which are used by Visa business partners to service Visa clients globally. We also develop analytics and reporting by using revenue data.    The successful candidate is expected to be expert in talend platform deployed on windows and linux systems. The selected candidate will be fully responsible for both service delivery and operational excellence of services built using Talend technologies.    Responsibilities:     Engineering of systems administration-related solutions for various project and operational needs     Collaborate with other teams and team members to develop automation strategies and deployment processes     Creating scripts to automate the day to day tasks and managing them     Hands-on experience on Installation and configuration of Talend platform dependent systems TAC, Job Server, Git, Jfrog Repository, Jenkins and MySQL     Connectivity with Hadoop eco-system such as Hive,HDFS, HBase     Strong in Talend debugging, monitoring end to end system     Proactive in communication and good in analytical abilities.     Strong in customer engagement and other stakeholders     Provide right and faster solution for any Talend issues.     Maintain best practices on managing systems and services across all environments.      Qualifications     Must have experiences:     4+ years of strong experience in Talend development, administration and Shell Scripting     Solid experience in any of the programming language's(Java/Python/Scala)     Strong experience in handling issues and resolve them in short time. business requirements and translating them into technical designs documents      Strong knowledge and experience working with Database systems, MongoDB and MySQL      Experience with build automation tool Jenkins     Exposure and good knowledge on talend product security and linux systems      Experience with waterfall and agile methodologies, including knowledge of Agile model and DevOps working model      Highly self-motivated and adaptable to learning and understanding new technologies      Strong written communication, oral communication, inter-personnel skills with attention to details      Strong analytical/problem solving skills      Able to effectively prioritize and manage multiple tasks to meet aggressive timelines      Team player with a can-do attitude      Bachelor's degree in a Computer Science or equivalent     Must have experiences:     4 years of strong experience in Talend development, administration and Shell Scripting   Solid experience in any of the programming language's(Java/Python/Scala)   Strong experience in handling issues and resolve them in short time. business requirements and translating them into technical designs documents    Strong knowledge and experience working with Database systems, MongoDB and MySQL    Experience with build automation tool Jenkins   Exposure and good knowledge on talend product security and linux systems    Experience with waterfall and agile methodologies, including knowledge of Agile model and DevOps working model    Highly self-motivated and adaptable to learning and understanding new technologies    Strong written communication, oral communication, inter-personnel skills with attention to details    Strong analytical/problem solving skills    Able to effectively prioritize and manage multiple tasks to meet aggressive timelines    Team player with a can-do attitude    Bachelor's degree in a Computer Science or equivalent   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Linux", "MySQL", "Shell scripting", "Debugging", "Agile", "Windows", "Analytics", "Monitoring", "Python"]}