{"JOB DESCRIPTION": "We're ADVANCED \n\nWe re one of the UK s largest and fastest growing software companies. True partnership is the defining thing that enables us to stand out from the competition. We pride ourselves on delivering focused software solutions for the public sector,  enterprise commercial and health & care organizations that simplify complex business challenges and deliver immediate and high quality value.\n\nPOST TITLE:  Senior Software Engineer(C#,  Asp.net,  WCF,  WPF,  Webservices) \n\nLOCATION:  Bangalore -  India\n\nREPORTING TO:  Respective Line Manager\n\nEXPERIENCE LEVEL:  6 to 9 Years\n\nJOB DESCRIPTION:  \n\nYOU HAVE SOUND UNDERSTANDING AND EXPERIENCE WITH:  \n\nCoaching and mentoring of developers,  and leading development projects\n\nSoftware development principles,  patterns and practices\n\nModern software language capabilities such as object- orientation,  generics,  first- class functions,  dynamically and statically typed languages \n\n Agile development methodologies and practices,  including Scrum\n\n C#/ .Net and visual studio \n\n WPF,  WCF,  SOAP,  WSDL,  REST applied enterprise environments\n\nSource control with TFS,  Git and GitHub \n\nYOU HAVE GOOD UNDERSTANDING OF:  \n\n1. CI/ CD development infrastructure such as Jenkins,  Team City \n\nPackaging systems such as Bower,  NPM,  NuGet,  Docker \n\nYOU ALSO HAVE:  \n\n1. A degree in Software Engineering or Computer Science or Equivalent qualification or experience.\n\n2. Good verbal and written English communication and presentation skills.\n\n", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["rest", "github", "development", "software", "Visual Studio", "WPF", "quality", "Computer science", "Web services", "GIT", "infrastructure", "C#.Net", "Packaging", ".net", "Scrum", "WCF", "agile"]}