{"JOB DESCRIPTION": "Primary ResponsibilitiesUnderstand the company's line of products and play a key role in the development and implementation of new technology platforms / API Products.Manage/Lead Product/Software development phases based on agile methodologyCoordinate with team/product owners (onsite-offshore model).Responsible for all phases of the Software product development lifecycle.Define requirements based on feedback/input from customers, stakeholders, senior management, and cross-functional teams.Research and document production and test environments and architecture. Review programming and environment changes and raise awareness for potential impacts.Analyze and think out-of-the-box to create/enhance the product base and vision.Participate in strategic planning discussions with technical, business, and client stakeholders and provide solutions. Work with senior management to create product plans and feature enhancements.Provide direction and training for less experienced Programmer Analysts.Help in recruiting and building a functional team.Key SkillsExperience developing and maintaining large scale web applications.Clear understanding of software design patterns and principles.Familiar with Agile framework.Broad technical knowledge and curiosity. Experience with different languages and web frameworks.Go, Kubernetes.API design, Architectural experience.Having some experience with Python, Java, Kafka, Elasticsearch, MySQL, Postgres, MongoDB, Terraform, PHP Laravel / Wordpress / Drupal1 and/or some frontend stack (React, Vue, etc) is considered as an added advantage.EducationBachelors/Master's degree in Computer Science, Information Systems or similar program. Or just a natural-born hacker who loves to code, but understands the fundamentals of great software development. Qualification Criteria and other Skills Minimum 5 years of experience in the Software / IT field Excellent oral and written communication skills, including presentation experienceInterested in Financial Markets or a Media JunkieLoves to build products people love", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers, MCA in Any Specialization"}, "KEY SKILL": ["Go", "API", "Kubernetes", "Java", "ElasticSearch", "Docker", "RDBMS", "Postgresql", "Python"]}