{"JOB DESCRIPTION": " WEBSPHERE MESSAGE BROKER DEVELOPER 3 to 9 yrs Message Broker development, Message Broker, Data power, WebSphere MQ Services, WebSphere SAP Adapter, Java, J2EE, SAP interfacing, Data power integration, WebSphere Message Broker , WMB Developer, WMB Intergation Bangalore, Pune, Mumbai, Kolkata, Hyderabad, Gurgaon, Chennai Pentagon Consultancy Services | HR Consultants | Placement Consultants | Recruitment | job consultants | manpower consultancy | Bangalore, India WEBSPHERE MESSAGE BROKER DEVELOPER POSITION Skills : Message Broker development, Message Broker, Data power, WebSphere MQ Services, WebSphere SAP Adapter, Java, J2EE, SAP interfacing, Data power integration, WebSphere Message Broker , WMB Developer, WMB IntergationDescription : With about 2 decades of experience in the Business of Manpower Consulting and staff Augmentations Pentagon Consultancy Services (PCS) is one among the most Progressive Multidimensional Consulting Group.  Our Multidimensional Consulting Approach makes us a very niche and Boutique Organization.  Due to this Hybrid Consulting Business Model we have brought a change in the conventional staffing approach and are committed to raise it to International Standards. We are given a mandate to hire WEBSPHERE MESSAGE BROKER DEVELOPER by one of our MNC clients for locations across India.  Please send us your updated profile or refer anyone you know who might be interested in the same. Job Summary: Role: WEBSPHERE MESSAGE BROKER DEVELOPERExperience: 3 to 9 yearsJob locations: Bangalore, Pune, Mumbai, Kolkata, Hyderabad, Gurgaon, ChennaiJob Description: WEBSPHERE MESSAGE BROKER DEVELOPERRoles and responsibilities: Will be involved in integration projects using IBM Websphere Integrator Message Broker tool kit. Responsible for design and develop maps, message flows and configure/ develop adaptorsResponsible for deploying integration components in development environmentsResponsibilities also include implementation of various WebSphere Message Broker and Data power integration applications. Responsible for preparing detailed design document and develop Integration solutions using Integration Bus. Testing of Message broker flows2+ years of experience in Message Broker developmentHands on experience working on Message Broker 8. 0/ IIB 9. 0 developmentExperience in Data power integrationExperience in Data power Xi52 and XG45, WebSphere MQ Services, WebSphere SAP AdapterExperience in ESQL, Java, XMLGood understanding of SAP interfacingSoftware Development Life-Cycle methodology and SOA methodologiesEngineering degree or equivalent", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Sc in Computers, BCA in Computers, B.Tech/B.E. in Computers", "PG": "M.Tech in Computers, MCA in Computers"}, "KEY SKILL": ["BPO", "Websphere", "Payroll", "SAP", "SOA", "Staffing", "XML", "Consulting", "Software development life cycle", "J2Ee"]}