{"JOB DESCRIPTION": "       You will take ownership and accountability of specific modules within an application and provides technical support and guidance during solution design for new requirements, problem resolution for critical / complex issues               You will Ensures code is maintainable, scalable and supportable.               You will present demos of the software products to stakeholders and internal/external customers, using knowledge of the product/solution and technologies to influence the direction and evolution of the product/solution.               You will investigate issues by reviewing/debugging code and providing fixes (analyzes and fixes bugs) and workarounds, will review changes for operability to maintain existing software solutions, will highlight risks and will help mitigate risks from technical aspects.               You will bring continuous improvements/efficiencies to the software or business processes by utilizing software engineering tools and various innovative techniques and reusing existing solutions. By means of automation, reduces design complexity, reduces time to response, and simplifies the client/end-user experience.               You will represent/lead discussions related to product / application / modules / team (for example, leads technical design reviews). Builds relationships with internal customers/stakeholders                   Bachelor's degree in Science/ IT/ Computing or equivalent.                            7- 8 years' experience as a software engineer or a software support engineer.                            Awareness of programming concepts and ability to write software code in at least one programming language -  mainly around Java,  Python,  advanced DBs.                 Advance -  cloud,  Linux,  containers and SQL/ No- Sql knowledge and experience.                Why you will love this job:       You will serve as an expert in specific technology.    You will take an active role in technical mentoring within the team.     ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Telcom, ISP", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Automation", "Linux", "Software support", "Technical design", "Debugging", "Amdocs", "Software solutions", "Technical support", "SQL", "Python"]}