{"JOB DESCRIPTION": "    About the role    As a Software Development Engineer II in Ascendon R&D, you will have the opportunity to work with an experienced team developing solutions for either Ascendon or core Singleview. You will leverage industry best practices and methodologies such as Agile, Scrum, test automation, Continuous Integration and Continuous Deployment.     What you will do?      Take part in an Agile team responsible for design, development, test and monitor all technical related aspects of our products.    Develop & deliver state-of-the-art cloud native Microservices to customers around the world.     Write performance-oriented code in in programming languages including C# , C++ , GoLang, while using cutting edge technology.      Take part in DevOps Monitoring and Deployment of applications, work in DevOps mode as required.      Write automation-oriented code to validate the functionality of your deliveries.      Mentor/Tutor junior team members.      Get involved in design of a solution/problem as required.     You will work collaboratively with other CSG delivery teams in Chicago, Bangalore, and Brisbane.      Mandatory Skills      Have a Bachelor s Degree in Computer Science, Computer Engineering, or related field.    Have at least     4 years   of technical experience in product development, and/or product implementation.    Demonstrate good programming ability in any   Object Oriented Programming language   (C++,C#,Java, GoLang)    Experience in   at least one   scripting language, such as   Shell/PowerShell/Python   .    Experience in any   SQL/No-SQL database   .    Experience in any code repository/Version control systems. e.g. : GIT, SVN etc.    Open to work on any programming language/technology as per the product needs.    Worked in Agile / Lean / SaFe      Good to have Skills      Experience/Knowledge in any public cloud (   AWS, GCP, Azure   )    Experience/Knowledge Infrastructure as code preferably     Terraform     Knowledge in     UNIX/LINUX   Scripting to develop, deploy, and manage applications.    Experience/Knowledge in telecom     OSS/BSS     domain is an added advantage.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Unix", "Computer science", "Automation", "C++", "Bss", "Version control", "Linux", "GCP", "Agile", "Python"]}