{"JOB DESCRIPTION": "        What you will be doing:         Participate in full life cycle C# / JAVA / Chef cookbooks software development. Codes or configures software functionality according to functional specifications that could include testing and debugging      Design and implement custom components on top of CSG s Enterprise systems including integrations with third party systems via web services (C#, Java, Webservices)      Supports system and solution integration testing, user acceptance testing and provides timely resolutions to problems encountered.      Participates in code reviews, design reviews, or other forms of team quality procedures.      Assists in Release Management, Configuration Management, Build Management, Stream Management and Ticket Management as required      Coordinates and communicates regularly with project team leaders and members.      Work effectively with client support and implementation consultants to resolve application issues.      Provide mentorship for junior level staff members        Requirements:         Bachelor s degree in Computer Science Computer Engineering MIS or a technically related field or equivalent.      3+ years of development experience required.      Experience with Chef, C# / Java, MVC, MS SQL Server, and Web Services.      Experience with C#/JAVA, Angular JS development      Experience with Jenkins, Subversion, MS SQL Server      Familiar with JSON, IIS is a plus.      Familiar with Atlassian JIRA is a plus      Self-motivated individual who works well in a team environment.    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - eCommerce, Internet Technologies", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "MS SQL", "IIS", "Configuration management", "MIS", "Debugging", "JSON", "MVC", "JIRA", "Release management"]}