{"JOB DESCRIPTION": "    You will provide technical leadership to software engineers by coaching and mentoring them throughout the end-to-end software development, maintenance, and lifecycle to achieve project goals to the required level of quality; promote team engagement and motivation.    You will provide input to the software engineering manager for estimates, resource needs, milestones and risks; and ensure effective delegation, monitoring tasks, identifying risks and handling mitigation and escalations.    You will provide hands-on technical and functional input to the design, maintenance, build, integration and testing of complex software components according to functional and technical design specifications; you will follow software development methodologies and release processes.    You will analyze and provide input for the requirements and provide impact assessment for new features or bug fixes. You will perform high-level design and establish technical standards.    You will represent and lead discussions related to product / application / modules / team and build relationships with internal customers/stakeholders.    You will enforce quality processes (such as performing technical root cause analysis and outlining corrective action for given problems), measure them and take corrective actions in case of variances, and ensure that all the project’s agreed deliverables are completed to the required level of quality.     Bachelors degree in Science/IT/Computing or equivalent.         Total Experience      - 6 to 9 years in as a Java software developer. 1 years experience working as a Scrum Master/Team Lead of at least 5-7 employees in a medium/large scale company in Agile/DevOps methodology.      2 years of working experience in projects on Microservices and Cloud.      Working experience on Spring, Springboot, Microservices, NoSQL, Couchbase, CI/CD implementation, REST framework knowledge/implementation, Containerization and Automated deployment. For example, Docker, Openshift/Kubernetes, Helm charts, DevOps practices      Working experience on CI processes (Jenkins preferred), version control (GIT preferred) and Artifact repositories (Nexus preferred) Significant proficiency/in-depth knowledge in business domain (Telecom Preferred) Previous experience in leading software engineers through project lifecycle.      Thorough understanding of software development methodologies using Agile principles and experience in conducting all key agile ceremonies.            Why you will love this job:       You will be challenged with the leading and mentoring of a small development team.    You will be challenged with leading the technical aspects of the project.    You will have the opportunity to work in a growing organization, with ever growing opportunities for personal growth.    You will have the opportunity to work with the industry’s most advanced technologies.          ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Telcom, ISP", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Telecom", "Software development methodologies", "Version control", "GIT", "NoSQL", "Agile", "Scrum", "High level design", "Amdocs", "Monitoring"]}