{"JOB DESCRIPTION": "    You will provide technical leadership to software engineers by coaching and mentoring them throughout the end-to-end software development, maintenance, and lifecycle to achieve project goals to the required level of quality; promote team engagement and motivation.    You will provide input to the software engineering manager for estimates, resource needs, milestones and risks; and ensure effective delegation, monitoring tasks, identifying risks and handling mitigation and escalations.    You will provide hands-on technical and functional input to the design, maintenance, build, integration and testing of complex software components according to functional and technical design specifications; you will follow software development methodologies and release processes.    You will analyze and provide input for the requirements and provide impact assessment for new features or bug fixes. You will perform high-level design and establish technical standards.    You will represent and lead discussions related to product / application / modules / team and build relationships with internal customers/stakeholders.    You will enforce quality processes (such as performing technical root cause analysis and outlining corrective action for given problems), measure them and take corrective actions in case of variances, and ensure that all the project’s agreed deliverables are completed to the required level of quality.      Bachelors degree in Science/IT/Computer Science or equivalent  Thorough understanding of software development and/or support methodologies, principles and procedures and related software management tools  Solid design, coding, testing and debugging skills      Capable to lead and guide a team of 5 to 6 team members       Able to give monthly feedback based on team members performance       Hands on with Java, Spring, Microservices and Spring Boot framework        Knowledge on NOSQL DB   - Couchbase/Cassandra/MongoDB        Knowledge on below tools:        GemFire/Redis and Elastic search       Kafka/DeepIO       Prometheus/Grafana/InfluxDb          CI/CD tools:        Docker, Kubernetes/ OCP, Helm, Jenkins, Groovy, Nexus                   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Telcom, ISP", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "software engineering team lead", "NoSQL", "Coding", "cassandra", "Debugging", "MongoDB", "High level design", "Amdocs", "Monitoring"]}