{"JOB DESCRIPTION": " Urgent : PHP(Shopify)Developer : NOIDA :Vinove Software Ltd.Greetings from Vinove Software Ltd.  \"Vinove Software & Services (P) Ltd.\", We have urgent requirements for 'PHP' and you can find the detailed job description and company information enclosed below for your reference.     Vinove Software & Services (P) Ltd.      Ground Floor, Infinity Business Parks,      Plot No. H-221, Sector 63, Noida, Uttar Pradesh  Exp : 3 to 7 YrsRequired Skills : PHP, MYSQL, LAMP, MVC.Web API,  CMS works - ShopifyJob Location: NOIDAJob ResponsibilityCollaborate with a team of full-stack and front-end developers to design, develop, and maintain web-based applications and websites.Keep up to date on web development trends and understanding how it applies to our customers- needs.Performance tuning, testing, refactoring, usability, and automationMaintain strong coding, compliance, & security standardsIntegrate / Develop to third-party APIsInteract with Product and Engineering teams and actively participate in feature/functionality design and provide valuable feedback.Required to work in LAMP environment (Linux, Apache, MySQL, PHP).Understanding of SQL/NoSQL databases and their declarative query languagesFull Stack Web application development experienceExperience with MVC and OOP design patternsStrong experience with PHP CMS ShopifyExperience in web development: HTML/CSS/JavaScriptExperience with relational databasesExperience working and integrating with third-party APIsFamiliarity with GitPayment processing integration experience in a PCI compliant environment is a plusUnderstanding of web and application security (OWASP)Proven ability to author clean, standards-compliant code20. Self-motivated and detail-oriented with the ability to work independently and collaboratively    Our Introductory Video (Recommended):   https://www.youtube.com/watch?v=HFAOmKg6bxw About the Company:  Vinove Software & Services is an ISO 9001:2008 and NASSCOM Certified IT Co. with 15+ years of experience in the Web & mobile industry. Being a specialized firm for providing web services and solutions, we have mastered in dealing with both, National & International Clients. Vinove serves as an umbrella for its top-notch ocular products and services because of its extensive background of using focused and proven strategies with technologies for all business requirements. Vinove is uniquely a strong combination of knowledge and experience. Its culture boasts of passionate, innovative and meticulous professionals.  We have 3 offices within India (Gurugram, Noida & Bengaluru) and a workforce of 450+ with expected team expansion to 750+ by December 2020.   Our service portfolio includes fully customized web design and application development, Mobile Apps eBusiness Solutions.  Please visit following URLs to know about our business.    http://www.vinove.com http://www.pixelcrayons.com http://www.valuecoders.com http://www.invoicera.com Achievements:  Winner: Deloitte Technology Fast 50 India  Winner: Deloitte Technology Fast 500 Asia Pacific  Winner: NASSCOM IT Emerge India 50 - 2011  Asia Red Hearing 100 Finalist  eRetail Solution Provider India 2011 - 12  Magento Solution Silver Partner  Proud DrupalCon Sponsors (Munich & Portland)   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["MySQL", "PHP", "Shopify", "CSS", "Front End", "Javascript", "HTML", "Web Application Development", "LAMP", "Web Designing"]}