{"JOB DESCRIPTION": "  Job Description Summary      .Net developer to build software using languages and technologies of the .NET framework. Receives assignments in the form of objectives and determines how to use resources to meet schedules and goals. Converts requirements into highly-visible applications by applying experience in application design and development. In addition, works alongside scrum master and product owner in an agile-based team environment to design and development all layers of the solution.      Key Areas of Responsibility:     Participate in full life cycle software development. Code or configure software functionality according to functional specifications that could include testing and debugging   Supports system and solution integration testing, user acceptance testing and provides timely resolutions to problems encountered.   Participates in code reviews, design reviews, or other forms of team quality procedures.   Assists in Release Management, Configuration Management, Build Management and Ticket Management as required   Coordinates and communicates regularly with project team leaders and members.   Test and deploy new functionality and fixes to both internal and production applications.   Work with Client facing teams to provide technical support and help resolve application issues   Conduct system maintenance and monitoring to ensure adherence to contracted service level agreements as well as ensure compliance with industry standards and best practices.       Preference     Has had experience working in an Agile and Scrum Environment. Knowledge in SAFe is a plus.   Strong communication and interpersonal skills, particularly the ability to quickly establish productive relationships with other key technical and business team representative throughout CSG.       Knowledge, Skills and Experience:     .Net Skills:     Write clean, scalable code using .NET programming languages (C# VB.Net)   Proficient in C#, with a good knowledge of its ecosystems   create applications from scratch, configure existing systems and provide application maintenance support.   Write Functional code with a sharp eye for spotting defects.   Test and deploy applications and systems   Revise, update, refactor and debug code   Strong understanding of object-oriented programming   Skill for writing reusable C# libraries   Creating database schemas that represent and support business processes   Proficient understanding of code versioning tools such as SVN and VSS       Other Skills:     Knowledge of Linux/UNIX/Window OS   Knowledge of C#, . Net, Python, or other high- level languages   Knowledge of KSH scripting or other scripting languages   Knowledge of database technologies such as Oracle, SQL Server, etc.   Self-motivated individual who works well in a team environment.   Ability to analyze problems and determine possible solutions.   Ability to communicate technical subjects with technical and non-technical employees.       Experience  :    Bachelor s degree in Computer Science, Computer Engineering, MIS or a technically related field or equivalent.   1- 3 years working in IT industry preferred  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Unix", "Linux", "Configuration management", "MIS", "Debugging", "Agile", "Scrum", "Release management", "Technical support", "Python"]}