{"JOB DESCRIPTION": "    Job Description     You will work as part of DevOps team in the Amdocs IT MIS unit responsible for the development and operations of applications used through all Amdocs business units.   The DevOps Engineer will be responsible for developing and maintaining the CI/CD pipelines for all Amdocs MIS development projects spanning a wide array of technologies on-premise and cloud.   You will receive requirements from development projects in order to analyze and propose creative solutions for implementing them into the DevOps pipeline in a generic way to can benefit the wider development community.   You will work in collaboration with development and architecture teams in order to continuously optimize DevOps processes and tools including identifying and automating manual tasks, improving pipeline performance, designing for scalability and availability, and driving feature reusability.       Tools:    Must Have - Jenkins, Sonarqube or equivalent code quality application, Nexus or equivalent artifact repository, Jira, Git, Kubernetes, Docker, OpenShift, AWS SAM and CloudFormation, Linux administration, NPM, NodeJS.  Good to Have - Checkmarx static code scanner, MS Team Foundation Server, Rancher, Azure DevOps, Terraform and Ansible.    Languages/Scripts:    Must Have - Bash, JSON/YAML/XML.  Good to Have - Python, PowerShell.    Experience Level:    Bachelor's degree in Science/IT/Computer Science or equivalent  At least 4 years experience as a Developer in Enterprise settings  At least 2 years experience as a DevOps Engineer in Enterprise projects  Experience working in working with Scrum in agile methodology  Experience in hands-on troubleshooting applications, Linux OS, and K8s issues  Experience in analyzing problems and suggesting solutions for resolution or optimization  Experience hands-on with K8s administration and deployments  Familiarity with Cloud Native application concepts  Familiarity with AWS or Azure Cloud deployments  Experience in developing complex CI/CD pipelines in Jenkins with multiple code scanning and verification tools.  Actual development experience with at least one popular development language such as C#, Java, JS (NodeJS, Angular, React, etc.), C , Python, GO, etc.  Experience in working independently to research and propose new solutions with new technologies for improving on current state  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Telcom, ISP", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "GIT", "Linux", "XML", "JSON", "Scrum", "Agile methodology", "Troubleshooting", "JIRA", "Python"]}