{"JOB DESCRIPTION": "     Position Details:      Work within a cross-functional team to deliver projects in a highly iterative fashion. Involves close collaboration with product owners, developers and testers across the globe.   Effectively use experience and technical skills to analyze and find solutions to requests as well as defects with minimal assistance.    Test and troubleshoot development across multiple platforms and browsers.    Work effectively in a fast-paced environment where multi-tasking is an absolute must   Work with leadership to implement best practices and department processes   Comfortably handle defects and change requests to provide quick and efficient solutions   Proactively provide ideas and solutions towards the improvement of the process   Coordinate and provide post install support for all application installs, upgrades, and patches    T  roubleshoot issues ranging from diagnosing hardware/software issues to large scale failures within a complex infrastructure   Identify and implement opportunities for automation and operational efficiencies.       Requirements      Bachelor s Degree (Engineering, MIS, or Computer Science) or equivalent experience required   4+ years of good Hands on as full stack developer.   A passion for software development with a strong desire for continuous improvement.   Strong knowledge in    Java/J2EE   Spring   Spring MVC   SpringBoot/Microservices   Webservices SOAP and REST    Javascript, CSS and web frameworks   must understand cross-browser and front-end development issues.     Experience with    XML   Struts   Web accessibility, WCAG and ADA standards and best practices     Knowledge in Database technologies, PCI and other security, Cloud, Java development technologies    Comfortable working with version control systems like Git   Flexible and open to change   Knowledge of responsive coding practices and testing   Constant desire to improve processes, people, and products.   Excellent written, verbal, and visual communications skills   Experience with 24 X 7 support model   Experience in Operational Support and DevOps technologies   Experience in SCRUM, Agile and Lean Practices.   IT knowledge in software development   methodologies/processes,   design, implementation, test, and documentation.   Self-motivated, good time management skills, excellent organizational skills, and a positive attitude.   Ability to work overlap time with US team on a permanent daily basis  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - eCommerce, Internet Technologies", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Automation", "Web services", "Front end", "Coding", "MIS", "XML", "Javascript", "Struts", "Continuous improvement"]}