{"JOB DESCRIPTION": " Job Description    Our team works together to build a wide variety of web experience that power, extend and showcase Visa's internal Cloud platform such as requesting and managing environments using either VMs, containers or bare metals, workflow automation tools, graphs and visualizations for relationships/utilization and a whole lot more. On this team, you'll create efficient and reusable systems with extensive test coverage and modern technologies. You'll also work in a rapidly iterative environment where we prototype new user interfaces and ship new code frequently. Ultimately, you'll have the opportunity to own projects by driving architectural, product and technological decisions.     Qualifications      Basic Qualifications      6 years of work experience with a Bachelor s Degree(B.E/B.Tech) or at least 4 years of work experience with an Advanced degree (M.E/M.Tech)     Experience of building REST based web services & web applications using Java and/or Spring framework      Preferred Qualifications       4-8 years of work experience and a Bachelor s Degree(B.E/B.Tech)     Experience writing unit and integration test cases     Solid understanding of Object-Oriented design and programming concepts     Experience of building software/frameworks for infrastructure automation/PaaS/Continuous Delivery     Extensive hands-on experience with Linux and Windows     Process oriented with strong analytical and problem solving skills     Work independently with minimal supervision     Work independently, driving projects end to end and provide guidance to Junior developers     Identify opportunities for future enhancements and refinements to standards, best practices     Collaborate and talk through your architecture and delivery decisions     Tackle the tough design and product problems     Strong interpersonal and communication skills      Additional Information      Essential Functions      Work independently, driving projects end to end and provide guidance to junior developers     Develop scalable, distributed, multi-threaded applications using Java/Spring     Build tools to automate our deployment pipelines     Build tools to report on status of operations and performance     Build automated tests and enable continuous delivery of the platform components     Collaborate with team members in design reviews, development and code reviews     Identify opportunities for future enhancements and refinements to standards, best practices and development methodologies.     Create documentation and procedures for development, deployment and maintenance     Work Hours:      Incumbent must make themselves available during core business hours.     Travel Requirements:     This position requires the incumbent to travel for work 5% of the time.     Physical Requirements:     This position will be performed in an office setting. The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment, such as telephones and computers, reach with hands and arms, and bend or lift up to 25 pounds.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Object oriented design", "Automation", "Prototype", "Linux", "Analytical", "PAAS", "Workflow", "Windows", "Test cases", "VMS"]}