{"JOB DESCRIPTION": " Job Description    As a Senior Staff Software Engineer, you will be part of our DDP Release Integration Solutions Engineering team to help design, enhance and build Release Certification by focusing on the System Integration and Client centric use cases coverage in an agile development environment. You will work with colleagues, who will support and challenge you daily. You will be taken leadership roles and shoulder the responsibility of working on multiple projects, developing the Integration test strategies, planning and certifying the products related to real-time transactional services, REST services API, VM and container based services that are highly functional, distributed, secure, scalable and resilient.    If this sounds exciting, we want to chat and tell you more about our work culture environment and see if this will be a good fit.    Responsibilities:    Help our customers achieve their real goals by understanding their requirements and how they respond to their business needs.   Build partnerships with product management, development teams, project management, release engineering and client facing teams to make sure that the products we are building deliver real value with quality.   Use technologies that include Java, REST, NoSQL, Docker and more.   Analyze business requirements, implementation and deployment, deep dive and understand the client use cases configurations, come up with System Integration validation strategies, test plans and work on automation suites that is robust, scalable, easy to maintain and complete the validations timely to assure the best quality delivered to end customer.   Your work and academic experience that will demonstrate proficiency and ease with programming languages, code quality initiatives, scripting languages, system integration and enterprise systems.   Work independently with minimal supervision, driving projects end to end and provide guidance to junior engineers. Be the go to person for technical support in the team.    Develop automation suites and tools which are scalable and ease to maintain, support faster certification cycles, able to handle on demand release validations. Identify right set of open source tools, frameworks and utilities which helps to increase the team productivity while maintaining the required quality.   . Collaborate with project stake holders on regular cadence, establish best partnerships to meet the organizational objectives and deliver engineering excellence.    Champion Shift Left Processes. Establish quality process measurements to ensure software quality in a continuous integration environment. Identify, record, document thoroughly, and track bugs. Maintain and/or update documentation that communicates the standards and procedures.   Qualifications    Bachelor degree in Computer Science or related field and 12+ years of Software Development Experience or a Masters with 10+ years of Software Development Experience.   Strong Software Engineering background is required with development and test automation experience in multi-tier enterprise architecture.   Hands on experience with languages Java, Javascript and tools Eclipse, IntelliJ, SOAPUI, TestNG, Selenium, Jmeter and etc. Ability to write clear and concise automation scripts.   Experienced Debugger by reviewing log file validation on a LINUX/UNIX server, Splunk. Excellent understanding of Infrastructure components like Systems, Virtual Machines, Database, Middleware, Storage etc.   Strong experience with Agile development incorporating Continuous Integration and Continuous Delivery, utilizing technologies such as GIT, Maven, Jenkins, Sonar, Splunk.   Proven experience as a technical leader with ability to understand the requirements and independently architect, design and build the solution.   Have the passion to work with people and help mentor your juniors to reach new heights. Strong work ethic to focus on goals and be great team player.   Process oriented with strong analytical and problem solving skills. Identify opportunities for future enhancements, refinements to standards and best practices.   Excellent collaborator, strong interpersonal communication skills, able to articulate effectively and proven experience in dealing with ambiguity.   Exposure to leading edge areas such as Machine Learning that lead to deeper customer insights, is a plus.      ", "ROLE": "Team Lead/Technical Lead", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Embedded, EDA, VLSI, ASIC, Chip Design", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Unix", "Automation", "Linux", "Project management", "Eclipse", "Javascript", "Selenium", "Open source", "Middleware", "Technical support"]}