{"JOB DESCRIPTION": "Hope you are doing good.While looking to hire a Software Engineer (DevOps), came across your profile and found it to be a good fit.Please find below the JD and let us know your interest.Software EngineerDo you love solving complex problems?Are you excited about working in a fast-paced goal-oriented team?Join our AkaTec Productivity Systems (APS) Team!The APS team is a strategic expansion to the Akamai Technical Support organization that develops, maintains and operates applications which increase the productivity of Support Engineers addressing customers' issues. The team works closely with all divisions in the organization to design solutions that make Engineers' work easier, faster and efficientPartner with the bestAs a DevOps Engineer, you will work closely with Software Engineers and Architects to help maintain applications, implement code changes, design deployment strategies, and help manage our infrastructure. The DevOps Engineer role combines the traditional roles and responsibilities of a Software Engineer and an Operational Engineer.As a Software Engineer, you will be responsible for:Maintaining applications - reviewing, triaging and working on code changes related to bug and enhancement requestsImplementing code and building internal tools to help with automation of daily DevOps tasksPlanning and executing deployment and integration of applications in staging and production environmentWorking independently and with team, project managers, architects and stakeholders to ensure all requirements are metParticipating in infrastructure planning and estimating capacity requirementsMonitoring availability of applications and infrastructureDo what you loveTo be successful in this role you will:Have Bachelor's degree in a technology related disciplineHave 1+ years' experience in Software Engineering/DevOps roleHave excellent problem-solving skillsHave good knowledge of Java or Python or GoHave knowledge of Operating Systems, especially UnixHave good knowledge of data structures and algorithmsWork in a way that works for youWe recognize that everyone is different and that the way in which people want to work and deliver at their best is different for everyone too.We are happy to discuss flexible working options in this role, please discuss your requirements with the recruiter when you apply.Working with usAt Akamai, we're curious, innovative, collaborative and tenacious. We celebrate diversity of thought and we hold an unwavering belief that we can make a meaningful difference. Our teams use their global perspectives to put customers at the forefront of everything they do, so if you are people-centric, you'll thrive here.Working for youAt Akamai, we will provide you with opportunities to grow, flourish, and achieve great things. Our benefit options are designed to meet your individual needs for today and in the future. We provide benefits surrounding all aspects of your life:Your healthYour financesYour familyYour time at workYour time pursuing other endeavoursOur benefit plan options are designed to meet your individual needs and budget, both today and in the future.About usInnovating on a global scale, we deliver our customers a fast, smart and secure intelligent edge platform. Working against a backdrop of digital collaboration, our highly skilled teams drive progressive solutions that have the scope to transform entertainment, business, and life in ways that we have yet to imagine.Join usAre you seeking an opportunity to make a real difference in a company with a global reach and exciting services and clients? Come join us and grow with a team of people who will challenge and inspire you!", "ROLE": "Other", "INDUSTRY TYPE": "Other", "FUNCTIONAL AREA": "Other", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Othe", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Any Doctorate in Any Specialization"}, "KEY SKILL": ["Data Structures", "Problem Solving", "Devops"]}