{"JOB DESCRIPTION": " Job Description      Design, implement and evolve highly scalable and fault-tolerant distributed components using core DevOps principles.      Hands-on experience in using Docker, Kubernetes with proper metrics instrumentation in software components, to help facilitate real time and remote troubleshooting/performance monitoring.      Design and build automated code deployment systems that simplify development work and make our work more consistent and predictable.      Work closely with Operations Infrastructure teams, developers and other stakeholders for cross-functional development activities.      Collaborate with security team to implement and verify secure coding techniques, integrate code security tools for Continuous Integration.      Automated deployment, Continuous integration, Continuous delivery and release engineering to Development, QA and Production environments.      Contribute to efficient development process pipeline by leveraging best-in-class CI/CD tools.      Lead developer productivity projects in the areas of environment automation.      Experience with configuration automation tools (Puppet/Ansible/Chef/Salt).      Experience with middleware and databases like Kafka, Aerospike, Cassandra, MySQL or similar.      Responsible for the stability and high availability of environments by using automation and self-healing principles.      Understand and own component security analysis, including code and data flow review.      Championing driving application, infrastructure enterprise security efforts, certificate management etc.      Collaborate with team to build performance test suite and run simulations with high throughput workload, analyze performance simulation results to fine tune component design and implementation.      Design and implement APIs, abstractions and integration patterns to solve challenging distributed computing problems.      Ensuring proper documentation and internal publishing of design tradeoffs, code best practices and lessons learned.      Support in triaging and troubleshooting of highly distributed services in production environment.       Qualifications      Extraordinary software engineering talent.      Minimum of 12-15 years DevOps experience.      BS or MS in Computer Science or related degree from recognized university.      Proficiency in scripting languages.      Knowledge of functional programming languages like Go, Scala, Erlang, Haskell, Clojure etc. or the ability to learn them quickly.      Working familiarity with the entire software development lifecycle including version control, build process, testing, and code release.      Experience with operating system internals, file systems, disk/storage and networking protocols.      Effective verbal and written communication skills.      Experience in working in highly agile environment.      Understanding of self-healing/immutable microservice based architectures, cloud platforms, clustering models, networking technologies.      Experience with operating system internals, file systems, disk/storage and networking protocols.      Effective verbal and written communication skills.      Previous experience with financial services or payments processing domain is a big plus.      Hands-on experience in Splunk, Sysdig, Elasticsearch, Prometheus, Grafana etc. is a big plus.      Experience with Docker Networking, Service Mesh, Proxies is a big plus.      Certifications from CNCF - CKA / CKAD is a big plus.      Experience with distributed database, distributed computing and high frequency transactions is a big plus.     Extraordinary software engineering talent.    Minimum of 12-15 years DevOps experience.    BS or MS in Computer Science or related degree from recognized university.    Proficiency in scripting languages.    Knowledge of functional programming languages like Go, Scala, Erlang, Haskell, Clojure etc. or the ability to learn them quickly.    Working familiarity with the entire software development lifecycle including version control, build process, testing, and code release.    Experience with operating system internals, file systems, disk/storage and networking protocols.    Effective verbal and written communication skills.    Experience in working in highly agile environment.    Understanding of self-healing/immutable microservice based architectures, cloud platforms, clustering models, networking technologies.    Experience with operating system internals, file systems, disk/storage and networking protocols.    Effective verbal and written communication skills.    Previous experience with financial services or payments processing domain is a big plus.    Hands-on experience in Splunk, Sysdig, Elasticsearch, Prometheus, Grafana etc. is a big plus.    Experience with Docker Networking, Service Mesh, Proxies is a big plus.    Certifications from CNCF - CKA / CKAD is a big plus.    Experience with distributed database, distributed computing and high frequency transactions is a big plus.   ", "ROLE": "Team Lead/Technical Lead", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Computer science", "Automation", "Networking protocols", "Networking", "Simulation", "Coding", "MySQL", "Agile", "Troubleshooting", "Middleware"]}