{"JOB DESCRIPTION": " Job Description    Visa is looking for an experienced leader who will help build Open VisaNet, Visa s Next generation payment processing platform developed on Open Systems, that would fuel growth in electronic payments globally and drive financial inclusion in many parts of the world.   Responsibilities include:    People management and project delivery.     Requirements management inclusive of partnering with business stakeholders to obtain and understand requirements, conduct fit-gap analysis, analyse options and designs for customer experience.     Provide leadership and oversight to a team of software engineers building solutions and capabilities at scale and high engineering and quality standards.     Engagement and collaboration with cross teams, architects and other stakeholders to deliver on a common goal.     Partner with internal and external stakeholders to understand business problems and then design and develop required solutions.     Drive the adoption of key engineering best practices to improve quality and reliability of team's deliverables.     Responsible for keeping the team engaged, motivated and operating with a high execution velocity.     Responsible for Evaluating, coaching and mentoring of direct reports.     Collaborate/communicate across global businesses and technology organisations, providing sound business analysis, process, and change leadership     Build a collaborative and conducive environment for the team to deliver the best of their ability      Qualifications     Bachelor degree in Information Technology, Computer Science or MIS, or equivalent.     At least 10+ years of work experience with particular focus on the development and support experience in cloud software.     Demonstrated ability to manage highly skilled technology teams that have delivered high quality enterprise class applications.      Proven ability to collaborate and work horizontally throughout a complex organisation.     Experience with leading teams using programming languages like GoLang/Java and developing Full Stack applications using distributed system architecture.     Experience of managing applications in production environment that support high-throughput / availability / resiliency low latency at scale and exposure to managing production outages and remediations.     Experience with container technologies like docker, K8S and NoSql databases and UI frameworks.     Understanding of self-healing/immutable micro-service based architectures, cloud platforms, clustering models, networking technologies.     Creative thinking and excellent problem solving skills.     Agile practitioner- practising SAFe or similar Scaled Agile frameworks. Process oriented and able to work independently with very minimal supervision.     Excellent oral and written English communication skills.     Experience designing large scale distributed systems with deep understanding of design impacts on performance, reliability, operations, and security is a big plus.      Bachelor degree in Information Technology, Computer Science or MIS, or equivalent.   At least 10 years of work experience with particular focus on the development and support experience in cloud software.   Demonstrated ability to manage highly skilled technology teams that have delivered high quality enterprise class applications.    Proven ability to collaborate and work horizontally throughout a complex organisation.   Experience with leading teams using programming languages like GoLang/Java and developing Full Stack applications using distributed system architecture.   Experience of managing applications in production environment that support high-throughput / availability / resiliency low latency at scale and exposure to managing production outages and remediations.   Experience with container technologies like docker, K8S and NoSql databases and UI frameworks.   Understanding of self-healing/immutable micro-service based architectures, cloud platforms, clustering models, networking technologies.   Creative thinking and excellent problem solving skills.   Agile practitioner- practising SAFe or similar Scaled Agile frameworks. Process oriented and able to work independently with very minimal supervision.   Excellent oral and written English communication skills.   Experience designing large scale distributed systems with deep understanding of design impacts on performance, reliability, operations, and security is a big plus.  ", "ROLE": "Technical Architect", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "System architecture", "Networking", "Business analysis", "MIS", "Agile", "Gap analysis", "Project delivery", "Information technology", "Distribution system"]}