{"JOB DESCRIPTION": "   Job Description    We are looking for a java backend developer (0-2 Years) to join our team. You will be responsible for the server side of our web applications. If you have excellent programming skills and a passion for developing applications or improving existing ones, we would like to meet you. As a Back-end developer, you ll work closely with our engineers to ensure system consistency and improve user experience.   Ultimately, you should be able to develop and maintain functional and stable web applications to meet our company s needs.    Responsibilities      Participate in the entire application lifecycle, focusing on coding and debugging      Write clean code to develop functional web applications     Troubleshoot and debug applications     Perform UI tests to optimize performance     Manage cutting-edge technologies to improve legacy applications     Collaborate with Front-end developers to integrate user-facing elements with server side logic     Gather and address technical and design requirements     Provide training and support to internal teams     Build reusable code and libraries for future use     Liaise with developers, designers and system administrators to identify new features     Follow emerging technologies     Skills and Qualifications      Proven work experience as a Back-end developer      In-depth understanding of the entire web development process (design, development and deployment)     Hands on experience with programming languages like Java(Springs, Hibernate, JSP, Struts)     Working experience in Rest API s     Familiarity with front-end languages (e.g. HTML, JavaScript and CSS)     Excellent analytical and time management skills     Teamwork skills with a problem-solving attitude     Any degree in Computer Science or relevant field  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Strategy, Management Consulting Firms", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "CVS", "Hibernate", "Backend", "Front end", "Coding", "JSP", "Web development", "Debugging", "Struts"]}