{"JOB DESCRIPTION": "Greetings!One of our IT Client, established in 2003, is headquartered in Mumbai and has offices in Ahmedabad, Pune and Bengaluru. With a team of 150+ professionals, we emphasize on unique skills like adaptability to new technologies and Japanese language capabilities. Globally, it is a Japanese group of IT companies, with offices in 5 countries(Japan(HQ), India, China, Thailand and Myanmar) and 11 cities. With a global headcount of 285+ professionals,We provide IT/ITES solutions to Japanese customers, in ASIA region. We work across various products/platforms in providing Business, Engineering and Enterprise solutions to customers across various Industries. Company is looking for either Fresher IT Software Professionals or junior IT Software developers interested in making career in MNC Company in long term.Selected IT Software Fresher or Junior IT Software Professional as Trainee for 6 Months and after that on regular employment as IT Software Developer.Position: Project Trainee Education Criteria: B.Sc IT / M.Sc IT/ MCA / BCA/B.Tech/B.E (IT/CE) Experience: Fresher or upto 2 Years in IT Software development.Gender: Male candidates only.Recruitment Criteria: CGPA should be 6 and above or Aggregate percentage should be 60% min. Stipend: Rs.8,000/- p.m. for initial 6 months and after 6 months? salary will be Rs.17,000/- p.m and then yearly increment as per company standards based on Performance.Bond of Two Years Continuous Employment of Rs. 60,000 at the time of joining the company.Job Location: Prahlad Nagar, Ahmedabad Interested candidates are requested to apply with latest resume.", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - ERP, CRM", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["IT Fresher Software Developer Software Engineer Programmer Software Company Profile Company Name An IT MNC Co client of Appoint Info"]}