{"JOB DESCRIPTION": " Job Description     To be a part of a product development team, to design, develop, document and maintain high quality software on-time that meets or exceeds the standards set by the company and meets the requirements and expectations of the client.        KOTT Software     is   a pion  e  er in   o  f  f  eri  n  g   clien  t  -centri  c  , robust bus  i  ness solut  i  ons based a  r  ou  n  d its enterprise solutions and ap  p  lications and is   ackn  o  wled  g  ed    a  s   leader amon  g  st   the    p  eers.   B  a  sed    o  n   the   g  r  owing   d  e  mands,   it   is has set up   e  xten  d  ed   a  p  pl  i  cations   d  e  ve  l  o  p  ment   a  n  d   sup  p  ort    t  e  a  m   in   Kochi  .   The    t  e  a  ms   will ha  nd  le   its   existing   appl  i  ca  t  ions   p  o  rt  f  olio   in   t  e   r  ms    o  f   product development    o  n  g  oing   su  p  port   and    m  ai  n  tena  n  ce,   d  e  ve  l  op   and deliver   solut  i  ons   f  or   n  e  w   i  n  itiati  v  es and al  s  o   part  i  ci  p  a  t  e in   ap  p  licat  i   o  n   m  o  derni  z  a  t  ion progr  a   m  . T  o   w  ar  d  s   this, Kott Software is    l  ooki  n  g   f  o  r   hig  h  ly skilled   developers      to   con  tri  b  ute    t  owards   the   product development and meet client    deliverable   and new   i  n  itiatives.     Responsibilities      Software Application Development in an Agile Product development environment for a niche US based domain/vertical.        Adhering to Agile Project management methodologies and meet product release schedules and client    deliverable         Understanding of functional requirements and application workflow         Requirements analysis, Design         Development and Coding         Adhering to coding standards, Unit Testing and Integration Testing         Perform Code review of peers         Participating actively in daily stand up meetings and other internal meetings         Communication with superiors on status/progress on a daily basis.        Technical migration, research and development to assess platform migration.      Qualifications      At least 1+ years of software application development experience in Microsoft Technologies        Experience in ASP.net with C# hands-on development         Experience in AJAX, JQuery and Bootstrap         Experience with working with HTML5, CSS         Experience in working with MS-SQL Server (Query, Functions, Stored procedures, )         Proven ability to trouble shoot and debug and resolve issues is a plus         Good communication and interpersonal skills         Good understanding to the Software Development Life Cycle process           General understanding or development exposure in SAAS / Cloud based applications is a plus               Selected candidates will be given technical and domain level orientation, exposure to project management methodology tools and quality management process        Remuneration will be based on relevant skills and hands-on experience and not a constraint for the right candidates       Selected candidates will need to be working in office (being in current pandemic scenario) as training and orientation is mandatory for all new recruits and the need to meet the enterprise product development goals.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "CA in CA"}, "KEY SKILL": ["MS SQL", "jQuery", "Coding", "agile project management", "Project management", "Software development life cycle", "Application development", "Engineer Project Management", "Ajax", "Quality management"]}