{"JOB DESCRIPTION": "Job Description : The Software Engineer implements and maintains new or improved software products,  procedures and techniques. Provides innovative and cost-effective engineering solutions according to the project technical objectives and timing. Keeps updated on software technology and process. Will with increasing experience and seniority supervise and mentor younger engineers,  and participate in activities to define and implement frameworks and design practices,  as well as knowledge sharing activities in the local and global community. Desired Candidate... Software Trainee Position - Iblesoft Inc Type and press enter to search Job Description :The Software Engineer implements and maintains new or improved software products,  procedures and techniques. Provides innovative and cost-effective engineering solutions according to the project technical objectives and timing. Keeps updated on software technology and process. Will with increasing experience and seniority supervise and mentor younger engineers,  and participate in activities to define and implement frameworks and design practices,  as well as knowledge sharing activities in the local and global community.Desired Candidate Profile:Coding with PHP 5 or above,  MySQL,  AJAX and JQuery is desirable.Should have best development practices and coding standard.Strong understanding in OOPs concept and MVC ArchitectureExperience in 1 or more PHP based MVC frameworks like Zend Framework,  CakePHP,  CodeIgniter is an added advantageMust have good analytical and problem solving skills.Must be a good team player,  good learner and self starter.Dedication to delivering high quality work and adhering to timelines.Ability to analyze the requirements,  problems and solving them with the best solution.Education:UG B.Tech/ B.E. Any SpecializationPG M.Tech Any Specialization,  MCA,  M.Sc Any", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["development", "technical", "software", "Zend framework", "quality", "Software Trainee", "jQuery", "Coding", "Analytical", "MySQL", "design", "oops", "PHP", "zend", "CakePHP", "mvc", "MSC", "Ajax"]}