{"JOB DESCRIPTION": "IntroductionAs a Hardware Developer at IBM, you’ll get to work on the systems that are driving the quantum revolution and the AI era. Join an elite team of engineering professionals who enable IBM customers to make better decisions quicker on the most trusted hardware platform in today’s market.Your Role and ResponsibilitiesIn this role, you will be a graduate Developer writing code, for a container-native storage and data management solution. The solution focuses on containerized, highly scalable workloads, in a hybrid and multi-cloud architecture.Two key areas of code are I/O path (C/C++) and control path (GO). Agile development methodologies are followed with a strong focus on quality. SStorage and Cloud knowledge are highly desirable.Develop & deliver state-of-the-art storage / cloud technology to thousands of customers around the worldTake part in an Agile team responsible, development, test and all technical related aspects of our products.Write performance-oriented code in C , C++ , GoLang platform, while using cutting edge technology and handling different storage platformsWrite automation-oriented code to validate the functionality of your deliveriesAccept the challenge of building the highest performance and most reliable data management systems on the planet.Work with a success-driven international teamRequired Technical and Professional Expertise0-5 years of industry experienceExpertise using C++, C, or Python/JavaProven written and verbal communication skillsAbility to think critically and solve problems with a strategic mindsetTeam player who thrives working on cutting edge technologySolid Academic backgroundPreferred Technical and Professional ExpertiseYou love collaborative environments that use agile methodologies to encourage creative design thinking and find innovative ways to develop with cutting edge technologiesAmbitious individual who can work under their own direction towards agreed targets/goals and with creative approach to workIntuitive individual with an ability to manage change and proven time managementProven interpersonal skills while contributing to team effort by accomplishing related results as neededUp-to-date technical knowledge by attending educational workshops, reviewing publications", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Java", "Platforms", "C++", "C", "Cloud Computing", "Artificial Intelligence", "Build", "Go", "Agile Development", "Python"]}