{"JOB DESCRIPTION": "Job DescriptionSoftware Programmer - IT Jobs\n\n 1.5 - 3 Year \n\n1,50,000 - 3,00,000 Per Annum \n\n ChennaiOur client is a leading IT company and is currently hiring for a software programmer for their Chennai located office.\n\nPosition : \n\nPermanent\n\nLocation : \n\nChennai\n\nSalary :\n\n1,50,000 - 3,00,000 Per Annum\n\nJob Details:\n\nJob Title: Software Programmer\n\nLocation: Chennai\n\nDepartment: Application Development\n\nReporting to: Team Leader\n\nExperience:1.5 - 3 Year\n\nCTC -1,50,000-3,00,000 (Salary negotiable to the right candidate)\n\nMode of Interview: Face to face HR Round\n\nJob Responsibilities and Duties:\n\nListed below are some key responsibilities and description of the job position.\n\nThe Software Programmer has a responsibility to code, unit test and design the product development life cycle activities through Team Leads or as an Individual.\n\nThe candidate will be part of software analysis, requirements gathering and understanding, identifying, mitigating risks, coding, unit testing the application. Providing on-time deliverables and assisting the team leads and senior developers are the additional responsibilities for the candidate in this position.\n\nDesign and Develop web-based applications using C# language and having MySQL/SQL Server database knowledge.\n\nThe Front-end technologies like JavaScript, HTML, CSS is desirable.\n\nCarries out routine duties independently; uses appreciable originality on system assignments; discusses or seeks approval on complex matters.\n\nCommunicates and articulates design decisions in a concise and clear manner to internal and external stakeholders.\n\nAbides by all Company policies and procedures.Job Requirements:\n\n0 to 2 years experienced candidate with Strong SQL and Programming Skillset in Microsoft or any other technology.\n\nIn specific, Dot Net MVC with C# and SQL Server / MySQL are the work experience the candidate should possess.\n\nAny candidate with no relevant experience will be considered as a Level 1 Programmer under the Programmer Designation.\n\nThe requirements for Level 1 programmer would be a good high-level programming knowledge with strong SQL knowledge with a willingness to learn new technologies with quick time at work.\n\nThe candidate should also have strong communication skills in English.The nice to have experience/knowledge on the below skills\n\nNET Core / MVC\n\nFramework (MVC / Angular JS)\n\nSSRS\n\nJavaScript\n\nBootstrap or any other UI framework Also, the candidate should have basic knowledge on the below skills\n\nMulti-Threading\n\nCaching\n\nPerformance Tuning", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Performance tuning", "Coding", "MySQL", "SSRS", "Javascript", "HTML", "Application development", "MVC", "microsoft", "SQL"]}