{"JOB DESCRIPTION": "Roles and Responsibilities  Hi,Greetings From Futures and Careers..!!Urgent requirement for Senior Full Stack Java developer position for Product Based MNC Company in Bangalore.Pls find the details Below..Total Exp: 3 yrs to 7 yrsLocation: BangaloreDesignation :Full Stack Java Developer Working Hours : Regular and flexibility to work with client team (US) Detail JD: Essential Duties and Responsibilities:  Identify and resolves technical or product problems  Maintain existing applications by enhancing software and troubleshooting issues  Collaborate with team members and partner with others to ensure successful completion of assigned software development tasks  Participate in code reviews and incorporates recommendations   Participates in software project meetings and provides status reports        Work within Azure Cloud environment     Design and develop software at all layers Create and maintain software design specification documents Practice good software engineering techniques and standards to reduce coding errors and ensures robustness and efficiency of work products Applies Object Oriented Design principles and design patterns in creating System level solution designs  Partner with technical team members to develop and improve software engineering processes Assumes full responsibility for assigned tasks and end-to-end accountability for end-product delivery. Skill Set:  Advanced hands on experience building solutions using Java and Web2.0 technologies Experience building Responsive UI with Bootstrap and Javascript (JQuery and JQWidgets) Experience with frameworks like Spring Strong working knowledge of SQL in Microsoft SQL Server and Oracle RDBMS Object Oriented Analysis and Design (OOAD) SOAP & REST Web Services Web Application Architecture Familiar with tools such as Maven, GIT, Jenkins Working in a fast-paced Agile environment Experience with web containers like Tomcat Experience working within Microsoft Azure Cloud Platform. If your interested please send resume tosowmya.moily@ futuresandcareers.comThanks &Regards, Sowmya KSr.Recruitment Consultant http://jobs. futuresandcareers.com   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Any Doctorate in Any Specialization"}, "KEY SKILL": ["Java", "angular", "Software Development", "Design Patterns", "Javascript", "Object Oriented Design", "Bootstrap", "Software Project", "JQuery", "Spring", "SOAP", "microservices"]}