{"JOB DESCRIPTION": "  Job description         What You ll Do     The responsibility of this position includes authentication, authorization, identity provisioning, de-provisioning, life-cycle events management, RBAC, and maintaining compliance requirements.   You will work with Twitter platform and connected teams to manage authentication and authorization for services on premise and in the cloud.   You will build systems to enable seamless and secure access to applications that support our internal customers and their operational needs while keeping Twitter systems stable and secure.     Who You Are     To continually strengthen our growing team, we are looking for an experienced Identity and Access Management engineer, to help guide the design and development of highly scalable solutions.   This position will be responsible for developing creative solutions in support of our partner s evolving requirements.   If this sounds like you, you probably have experience with these responsibilities:   Oversee the design, development and deployment of identity and access based solutions   Mentoring junior team members, and supporting a best-in-class IT engineering team   Provide leadership and guidance to develop or improve process automation solutions, specifically around the authentication and identity lifecycle   Collaborate with architects and other engineers to develop technical designs and solution recommendations   Partner with internal Product Managers and work with multiple business partners to develop solutions against departmental roadmaps   Partner with internal engineering teams and third party vendors to develop consistent and scalable solutions   Collaborate with internal audit and compliance teams to identify, remediate, and prevent issues risks   Responsible for guiding design, code review, and release management as part of the oversight of our internal software development lifecycle   Collaborate with production operations team to deploy functionality and provide post-production support     Qualifications            Bachelors Degree or Masters degree in Computer Science, MIS/CIS or equivalent work experience   Demonstrated technical leadership in the area of Identity and Access management    Proven experience in development, and implementation of identity, authentication, access management and system integration software solutions   Ability to translate business needs into requirements, design documents and technical solutions   Exceptional analytical and problem solving skills   Strong design and architecture skills   Well-developed interpersonal, written and verbal communication   Ability to effectively interact across all levels of the organization   Meticulous in Software Engineering best practices like design docs, unit tests, code reviews, debugging and troubleshooting   6+ years of enterprise wide experience in the identity access management domain   6+ years of working with production environments, supporting operational issues   Good understanding of authentication and authorization   Experience in WebServices design and development   Developed applications/services in Java/Scala/Ruby/Python    Experience working with GCP and AWS environments   Experience adding authentication and authorization layer to existing services to consume OAuth, OpenID and SAML protocols   Experience with service to service authentication   Experience in developing security/entitlement architecture for applications so that they can be consumed by an entitlements and policy engine   Proficiency working within a defined SDLC process   Experience working within an Agile development framework   LDAP directories experience a plus.     ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Media, Entertainment, Internet", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["SAN", "Web services", "Production support", "LDAP", "Access management", "MIS", "Debugging", "Troubleshooting", "SDLC", "Python"]}