{"JOB DESCRIPTION": "         Job description             Who You Are     You are curious and open to new ideas   You have strong opinions but are willing to change your mind   You love to collaborate, mentor and learn with a great team   You care about delivering high-quality software in a team environment   You want to iterate quickly and safely on high scale systems   You ll work closely with our internal customers, including ones who build user-facing revenue products, to ensure their requirements get implemented - in a generic fashion - on the platform level.     What Youll Work On     Given the enormity of the tasks we face, you will help us build and evolve the mission-critical systems that deal with money:   Payments you ll help us rebuild the entire set of payment services to produce a generic, Twitter-wide payment processing platform that any paying customer could use - be it for ads, data products, or other products or services Twitter provides.   You ll work closely with our internal customers, including ones who build user facing revenue products, to ensure their requirements get implemented - in a generic fashion - on the platform level.     Qualifications      BS, MS, or Ph.D. in Computer Science or equivalent work experience   6+ years developing on high-traffic systems   Familiarity with the payment ecosystem   Experience with distributed systems   A disciplined approach to writing unit and integration tests   Experience mentoring and growing engineers     Bonus Points     Experience with building payment systems.   Contributions to the open-source community   Experience working with Java and Scala   Experience building UX using modern front end technologies ( Nice to have)   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Media, Entertainment, Internet", "FUNCTIONAL AREA": "IT Software - Other", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "SAN", "French", "Front end", "Payment processing", "PDF", "Payment systems", "Open source", "Analytics"]}