{"JOB DESCRIPTION": "Roles and Responsibilities You will develop new features in RMN services that support the weband mobile platforms.You will maintain and improve our software responsible for ingestingthousands of new offers per day.You contribute to the overall system design, architecture, security,scalability, reliability, and performance of applicationsYou solve and assist with production support issues.You stay ahead of new technologies and recommend technologiesthat best fit the teams needs.Desired Candidate Profile Are:You have a Bachelor degree in computer science or a comparablefield or equivalent self-study.You bring a proven understanding and application of computerscience fundamentals: data structures, algorithms and designpatterns.You have at least 7 years of experience developing software andservices using Node.js, Java, Python, or other server-side languages,and a minimum of 3 years of experience with React, Angular, or otherclient-side JavaScript frameworks.Strong understanding of systems architecture technologies includingLinux, Amazon Web Services, and Docker.Experienced developing software on a cloud platform, preferablyAWS.You have experience with common software engineering tools such asGit, JIRA, TeamCity, Confluence or similar.Ownership attitude and a track-record of successful high-qualityresults. You identify any ambiguous requirements and provide claritywhen needed.Perks and Benefits We offer an opportunity to be an integral part of a company that eagerly pursuesdisruption in its space to continue to drive innovation and lead the competition. We arecommitted to providing an equitable and competitive compensation program that willattract and retain high performing, diverse talent at all levels.Benefits: RetailMeNot offers all employees a comprehensive and competitive benefitspackage that includes, but is not limited to, group health insurance, paid leave, paidholidays, and retirement.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - eCommerce, Internet Technologies", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Electrical, Electronics/Telecommunication, Computers"}, "KEY SKILL": ["Linux", "Docker", "Software Engineering", "Node.Js", "React.Js", "AWS", "Javascript frameworks", "Python"]}