{"JOB DESCRIPTION": "Roles and Responsibilities Responsibilities include, but are not limited to:Design, code, test & debug and deliver new features and enhancement to SimplifyEm products following best practices of agile software developmentDeliver features on time and to specification with a very high degree of quality, extensibility and scalabilityDevelop and maintain automated functional testsPerformance tuning and improvement of product features and infrastructureEvangelize and enforce strict design/code reviews as well as test driven developmentResolve technical issues and development impediments faced by team membersActively participate in daily SCRUM meetings and perform daily risk analysis of backlogs Work very closely with developers, architects and product management to deliver technologies that not only meet requirements but excites customersTake advantage of new technologies and techniques  in enterprise web programming to keep SimplifyEm products at the forefront of technologySupport, maintain and document features developedMaintain processes, templates, and other documents that support best practicesPersonal QualitiesMust be a team player, self-driven, creative and passionate about creating the best and most stable softwareAlways up-to-date with the latest technologies Qualifications 6-8 years experience in working with software product companies.  Experience in working on      Software-as-a-Service (SaaS) products with start-up companies highly preferredBachelors or masters degree in Computer Science or related fieldMUST have a strong grasp of fundamental computer science concepts: data structures, algorithms and object oriented designSTRONG design experience with UML/Design PatternsMUST have experience in Ruby/Java or any of the object oriented programming languagesMUST have experience in developing UI. Good experience with JavaScript libraries JQuery, Angular JS etcMUST have experience in developing back end services. Good experience with frameworks like Ruby on Rails will be advantageous. MUST have experience in working with open source relational databases like MySQL. Good experience with NoSQL databases like MongoDB will be advantageousExperience in working with globally distributed virtual teams will be advantageous", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Other", "DOCTORATE": "Other Doctorate"}, "KEY SKILL": ["AngularJS", "Java", "Design Patterns", "SaaS", "J2EE", "Ruby on Rails", "RoR", "UML", "MySQL", "Javascript", "MongoDB", "Amazon AWS", "Ruby", "Startup"]}