{"JOB DESCRIPTION": "   Key Duties and Responsibilities     Design, develop and automate applications, modules and tasks using Java/J2EE and related Technologies     Design and develop applications, modules using JavaScript, HTML, CSS, JQuery, AngularJS 1, Angular 8 AND/OR React.     Develop web-based user interface for the chrome extensions and other web applications     Transform non-technical, business requirements into technical requirements     Break down program specifications into its simplest elements and translate this logic into a programming language.     Prepare effort/cost estimates which consistently demonstrate minimum deviation from plan.     Accountable and responsible for meeting project timelines     Work with minimum guidance from senior resources, and collaborate with internal team members, shared services teams (e.g., Server team, Network, etc.) as well as external stakeholders as needed throughout each project s lifecycle     Independently perform all necessary end-to-end setup (software middleware) on development, testing production environments.     Proactively identify bottlenecks and bugs, and devise solutions to mitigate and resolve these issues     Develop and maintain code quality, organization, and automatization     Proactively contribute to and shape quality deliverables, particularly during the design phase     Anticipate and participate in code reviews to ensure quality deliverables     Practice and encourage knowledge sharing with a focus on establishing best practices     Ready to work in flexible time zone as per client requirement(s).    Qualifications and Experience Required     Bachelor s Degree in Computer Science required; Master s degree preferred.     5+ years of experience in application development with Java/J2EE Technologies.     3+ years of experience in Web UI Technologies like AngularJS 1.x & Angular/React.     Web development experience using HTML5, CSS and AJAX/JQuery, and Bootstrap.     Development experience in Restful Web Services using Spring or Jersey Frameworks     Development experience using any ORM (JPA/Hibernate)     Demonstrable working knowledge of CI/Build tools like Maven, Ant and Jenkins     Strong knowledge of Test Driven Development     Exposure to any Unit test framework like Junit/Test NG and Mocking frameworks (e.g. Mockito)     Exposure to any Unit test framework like l like Jasmine ,Karma or Pratractor frameworks     Have knowledge of design pattern, which includes java, j2ee design pattern.     Familiarity with mainstream application servers like WebSphere 8.0, Apache Tomcat.     Have working knowledge of UNIX commands and scripting.     Candidates with demonstrable development experience in cognitive technologies such as IBM Watson, Amazon Alexa, Microsoft LUIS will be preferred     Proven working experience in SQL and Database programming.     Working knowledge of Test Driven Development     Excellent written and verbal communication skills. Must be able to effectively communicate across all levels of the organizations with regard to all aspects of a project solution with managers, client and project team.     Strong interpersonal abilities to collaborate across teams     Can think creatively and provide innovative designs and solutions to problems.     Experience/knowledge of entire software lifecycle process/SDLC.     Experience developing and deploying solutions/applications across various environments (on premises and cloud (AWS, Azure, Amazon, etc.).     Experience in contact center domain and multi channel customer engagement platforms like Genesys, eGain, Avaya) preferred     Can think creatively and provide innovative designs and solutions to problems.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Unix", "Hibernate", "jQuery", "Javascript", "HTML", "Application development", "microsoft", "SDLC", "SQL", "Ajax"]}