{"JOB DESCRIPTION": "      Job Responsibilities     Develops software solutions by studying information needs, studies systems flow, data usage, and work processes.   Investigates problem areas, following the software development lifecycle.   Develop features across multiple subsystems within our applications, including collaboration in requirements definition, prototyping, architect, design, coding, testing and deployment.   Understand how our applications operate, are structured, and how customers use them.   Provide engineering support when building, deploying, configuring and supporting systems for customers.   Participate with the engineering and operations teams to define plans for standardizing, scaling and enhancing our products and the services utilized to deploy/install/release those products.   Investigate, analyze and make recommendations to management regarding technology improvements, upgrades and modifications   Documents and demonstrates solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code.   Prepares and installs solutions by determining and designing system specifications, standards, and programming.   Improves operations by conducting systems analysis, recommending changes in policies and procedures.   Knowledge of design principles and patterns.          Candidate should possess 2 to 5 years of experience.   Analyzing Information, Software Design, Software Documentation, Software Testing, Teamwork, General Programming Skills, Software Development Fundamentals, Software Development Process, Software Requirements, Software Architecture (Knowledge).   Experience in working on web-based and client server-based software systems, utilizing N-tier architectures, dynamic content, highly scalable approaches, and security models/implementations.   Experience in building, packaging, installing applications on virtual and distributed platforms.   Proficiency developing and troubleshooting complex software systems that run in mixed environments.   Experience in Enterprise application integration is a plus.   Experience in scalable, globally distributed applications.   Experience in refactoring or reengineering solutions.   Experience working in Agile teams.     Educational Requirements:     UG: B.Tech/B.E. -Any Specialization, Computers, Electronics/Telecommunication   PG:MS/M. Sc(Science) -Any Specialization, Computers, M. Tech -Any Specialization, Computers, Electronics/Telecommunication, MCA -Computers, Other.      Technical Requirements       Experience in one or more:      Core Technologies: Java, J2EE, Spring, Python Micro   Services: Spring boot, OpenFaaS   Security: CSRF/CORS/XSS and other OWASP protocols.   Middle Tier: Open API, YAML, Web API, RESTful Services.   ORM: Hibernate/ JPA (Java Persistent API)   Search and Retrieve: Lucene, SPARQL, GraphDB   Parsing: JavaCC, ANTLR   Message Queuing: RabbitMQ, Kafka   Unit Testing: JUnit, Mockito   Database: SQL/Oracle or any RDBMS   Containers / Managing / Deployment / Storage: Virtual Box, Docker, Kubernetes, MinIO, Swagger,PaaS   IDE: IntelliJ   Build and Deploy: Maven, Gradle, Jenkins   OS: Unix, Linux     Qualifications Skills       Works well as a member of a group   Devoted to a task or purpose with loyalty or integrity     Ability to Make an Impact   :   Inspired to perform well by the ability to contribute to the success of a project or the organization     Inspired to perform without outside help    Bachelors or better in Computer Engineering or related field.   Bachelors or better in Computer Science or related field.    2-5 years   You are using an unsupported browser.    To use this site, please use a supported browser.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - System Programming", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Production/Industrial, Any Graduate in Any Specialization", "PG": "MCA in Computers"}, "KEY SKILL": ["Unix", "Maven", "Hibernate", "Linux", "RDBMS", "Coding", "Agile", "Troubleshooting", "Testing", "Python"]}