{"JOB DESCRIPTION": "    You will design, develop, modify, debug and/or maintain software code according to functional, non-functional and technical design specifications.  You will follow Amdocs software engineering standards, applicable software development methodology and release processes, to ensure code is maintainable, scalable, and supportable, and demo the software products to stakeholders.  You will investigate issues by reviewing/debugging code, provide fixes and workarounds, and review changes for operability to maintain existing software solutions.  You will work within a team, collaborate and add value through participation in peer code reviews, provide comments and suggestions, and work with cross functional teams to achieve goals.  You will assume technical accountability for your specific work products within an application and provide technical support during solution design for new requirements.  You will be encouraged to actively look for innovation, continuous improvement, and efficiency in all assigned tasks.        Bachelor's degree in Science/IT/Computer Science or equivalent   2 to 4 years Cobol IMS DB   Demonstrable experience with the Spring framework components - Spring Boot, MVC, Integration, Security, etc.   Strong understanding of RESTful APIs and open systems     Cobol, IMS-DB, VSAM, JCL           Why you will love this job:     You will be challenged to design and develop new software applications.  You will have the opportunity to work in a growing organization, with ever growing opportunities for personal growth.          Spftware Engineer (Cobol IMS DB)                                        Perks And Benefits                Treat yourself with generous holidays gifts from Amdocs         Access tons of complementary learning and upskilling programs to stay on top of what's new in your field                Enjoy our generous paid parental leave policy         Enjoy a wide range of fun company activities for you and your family                Secure your and your family's future with Life and Disability insurance         Take paid time off to volunteer for the causes that you're passionate about               Explore internal mobility opportunities. Experience different roles within Amdocs            ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Telcom, ISP", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "VSAM", "JCL", "Cobol", "MVC", "Continuous improvement", "Application software", "Amdocs", "IMS", "Technical support"]}