{"JOB DESCRIPTION": "Please click the link below to apply for this position:https://atlas.bamboohr.com/jobs/view.php?id=51 Work Remotely. Collaborate Virtually. Improve Flexibility. Are you ready to part of an outstanding team with world-class products and serving global clients?Do you want to work from the comfort of your home and improve your work-life balance?Do you want to save countless commuting hours?Do you want to be part of an organization that stood with its employees during Covid-19 with no pay cuts, no layoffs, and no furloughs?Ideal Candidate is: Expertise in Jasper reporting framework.Administering, Managing, Instance Configuration for Jasper      server(s).3+ Years Experience in Development of Jasper Reports with      customization experienceExpert in creation and Implementation of Jasper reports.Design advanced jasper reports to support different data sources,      complex charts, tables and multiple sub reports.Knowledge on JBOSS,Tomcat Apache is added advantageKnowledge on SQL & reporting concepts.Knowledge & working experience with SQL, JSP, Javascript.is      added advantageComfortable with working in US time zone(EST).Excellent communication skillsAbility to work in and enjoy fast paced environment and willing to      take the ownership.Detail oriented, very responsive and committed to qualityIndependent, Self-starter and needs minimum guidanceAble to demonstrate problem solving skills in past projectsUtilizing creative solution approaches Able to challenge status quo and innovative with out of the box      solutionsResponsibilitiesComprehend business requirements and develop reports in a timely and quality mannerMeet timelines and ensure overall targets set from time to time are metShould be working as an Individual contributor, take the ownership to maintain and support the Reports and come up with the innovative thoughts on improving the existing environment and reports.A home office that provides the right ambiance to focus on workDesktop / Laptop with minimum i5 processor, Windows 7 or later, minimum 8GB RAM", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["Software Engineering"]}