{"JOB DESCRIPTION": " DMI (Digital Management, LLC.) is looking for a Dynamics 365 Sr. Software EngineerJob description mentioned below please review before applying. We are looking for early joiner, max who can join us with in 30 days. Mandatory Skillsets required -  Dynamics 365,  D365 ( Dev ),  JavaScript and/or TypeScript,  C#,  Little bit of Angular/.NET Framework Web App experience.Good to Have :- Microsoft Channel Integration Framework (CIF) Model-driven PowerApps Automated testing and CI PRIMARY ROLE AND RESPONSIBILITIESDesigning, and developing Dynamics 365 customizations through best practices based on business requirementsInteracting with customers to better understand business problemsSupport development needs in team-based projectsContribute to the design of well-structured solutions/frameworks to solve business problems Understands, and pushes others to use/develop Clean Coding standards. Able to think holistically about project goals to design a working Dynamics 365 custom coded solutions Proficient understanding of the Dynamics 365 platform and all that it offers Able to configure complex coded solutions within Dynamics 365 Integrating disparate systemsAbility to test, train, and troubleshoot key developed featuresCan setup ane execute automated testing and CI Experience with multiple Client/Server frameworks Understands and can use multiple design patternsCan manage and maintain the entire D365 ALM correctly across multiple environments (sandbox through production) REQUIRED SKILLS3-5+yrs Development Experience in Dynamics 365Proficient with JavaScript and/or TypeScriptProficient with C#Some Angular/.NET Framework Web App experienceExperience Microsoft Channel Integration Framework (CIF)Model-driven PowerAppsAble to work through and complete assigned project tasksSelf-starter capable of working in a team-based environmentGood communicator with problem-solving skills Able to articulate complex technical solutions to non-technical individualsUniversity Degree in a Technology related field or strong proven experience Must be able to speak, read, and write English fluently DESIRED SKILLSMicrosoft Dynamics CertifiedSome Office 365 experienceSome Agile/Scrum experienceLocation - Noida, Pune, Chennai, Bangalore ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["C#", "Dynamics 365", "Angularjs", "Software Engineering", "Javascript", ".Net"]}