{"JOB DESCRIPTION": "WE ARE LOOKING FOR 12 AIWOZO CERTIFIED RPA DEVELOPERS FOR IMMEDIATE DEPLOYMENT. PRIOR EXPERIENCE IN BANKING, INSURANCE, LIFE SCIENCES, RETAIL BUSINESS AND HR AUTOMATION USING AIWOZO, UIPATH OR BLUE PRISM WILL BE AN ADDED ADVANTAGEPosition SummaryAt least 2 years of relevant hands-on automation  experience using Aiwozo, UiPath or Blue Prism.  Experience in programming in VB, C#, .NET is a must.  Knowledge of programming in Java and HTML will be a plus.  Preferred experience in VBA and Excel Macro.  Ability to interpret and visualize business process  flows and translate the same into automation solutions.  Bot Deployment and Management/Exposure to Control room  and release management.  Basic DBMS skills and SQL skills.  Document the proposed solution which includes a  definition of the user interfaces, functional processes, and data within the  proposed system.  Strong knowledge of Software Development Life Cycle.  Good knowledge on HTML and CSS concepts to understand  the properties of web components for efficient and quick troubleshooting and  analysis. Roles and Responsibilities  Design, develop and deploy Robotics Process Automation  (RPA) solutions using different tools, design principles and conventions.  Configure robotics processes and objects using core  workflow principles in an efficient way; ensure they are easily maintainable  and easy to understand.  Understand the existing processes and facilitate  change requirements as part of a structured change control process.  Solve day-to-day issues arising while running robotics  processes and provide timely resolutions.  Maintain proper documentation for the solutions, test  procedures, and scenarios during UAT and Production phase. Job LocationDelhi NCR, Bangalore, Hyderabad, Chennai, Mumbai", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization, Post Graduation Not Required", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": [".net", "uipath", "c#", "rpa", "java", "software development", "web technologies", "vb", "sql"]}