{"JOB DESCRIPTION": " Job Overview :We are looking to hire a Senior Software Engineer /  Software Engineers to join our dynamic software development team. You  should be able to produce and implement practical software solutions.  You will be working with the senior management to define software needs.  You will take the lead on technical and operational projects.As a Software Engineer / Senior Software Developer, you will be- Collecting, analyzing and summarizing the requirements- Determining operational feasibility of the gathered requirements- Designing, developing and implementing the software- Playing a significant role in developing documentation of the software-  As you are responsible to lead a team, you will be working  independently with little supervision. Therefore, we expect you to have  outstanding organizational, problem-solving and leadership skills.-  You should be able to speed up our the team operations by conducting  timely performance reviews.If you have experience in software  development and agile methodologies, we certainly would like to see you!Responsibilities :- Develop superior software architecture and design- Identify, prioritize and properly execute activities in the software development cycle- Develop software solutions by studying new technologies, if required- Develop applications and tools by producing efficient, clean code- Automate tasks via appropriate scripting and development tools- Review and debug code on a regular basis- Conduct system analysis to determine possibility of upgrades- Perform validation and verification testing- Collaborate with the vendors and the internal teams to improvise the products- Document the software development phases and examine systems- Ensure that the program is up-to-date with the latest programming technologies- Ensure the agile processes improves operations and team productivity- Stay up-to-date with latest technology trendsRequirements :- BE / BTech or ME / MTech in Computer Sciences and related fields- Proven 2- 4 years of experience as a Software Engineer or Team Lead role.- Experience in Fintech Domain working with Highly Scalable, Enterprise Level Applications.- Sound understanding of software development, scripting, as well as, project management- Extensive experience in using different system monitoring tools and automated testing frameworks- Knowledge of different operating systems and cloud hosting such as Linux and AWS (Amazon Web Services)- Strong expertise in selected programming languages such as Java / J2EE, SpringBoot, MySQL- Outstanding leadership and organizational skills- Ability to work independently as well as in a team- Excellent leadership and communication skills .", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Java", "scripting", "software architecture", "software development", "Software Engineering", "MySQL", "J2Ee", "SpringBoot"]}