{"JOB DESCRIPTION": "   You will be responsible for designing developing CPQ Solutions using platforms like Tacton / PROS, will need to interact with the business teams to understand the requirements, and help to realize the requirements efficiently.    Developing Web based UI applications/API using the defined technology stack.   Design and implementation software based on defined architecture.   Coding of features, bug-fixing and delivering solutions adhering to coding and quality guidelines.   You will be involved in requirement engineering, prepare user stories, derive use cases and subsequently product requirements.   Required to conceive ideas and prepare quick pre-development prototypes for internal review and to assess the technical feasibility of the use cases.      What you need to make real what matters      We need an engineering graduate with 3 to 5 years of experience in design and development and exposure working with multi-site global teams.    Java/J2EE, Servlets, JDBC, Hibernate, Spring, Microservices, Spring Boot, AOP, Spring Security, JPA, Rest services, Tomcat, and Web logic - Advanced Skill Level   Python, AWS Lambda, R, Hadoop, Spark, Star UML   Intermediate skill level of TACTON (CPQ Platform) and advanced knowledge on Object Oriented thinking, Design principles and patterns, Analytical and Problem-Solving Skills, REST services and unit testing concepts, Software development process and Database (MSSQL / MYSQL).   Full stack development experience working with Node.js and Git /Bit-bucket   Knowledge of Continuous Integration Continuous Deployment    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Hibernate", "Tomcat", "GIT", "UML", "Coding", "MySQL", "JDBC", "JPA", "Unit testing", "Python"]}