{"JOB DESCRIPTION": " S/4 ABAP on HANA Technical /   ODATA Developer /  UI5/Fiori Developer / ABAP TechnicalCompany Name: Exikon TechnologyJob description 1. S/4 ABAP on HANA TechnicalHands on experience of ABAP on HANA. Strong WRICEF experience in enhancements, user exits, substitution rules, Badi's, ALV Reports, Interfaces (IDOCS and file based), Conversions using BDCs and BAPIs, Smart forms, Adobe forms Able to deliver build of complex WRICEF objects with minimal supervisionHANA - CDS Views, AMDP and Fiori basics, ABAP 7.5 usage. O-data will be added advantage. Should be able to translate functional specifications into SAP ABAP technical specifications Strong communication skills, Verbal and Written communication. Nice to have 2. ODATA Lead Developer. ODATA Framework & SAP Fiori, OO ABAP & Gateway development. HANA - CDS Views, AMDP and Fiori basics, ABAP 7.5 usage.   End-to-end estimating, design and delivery experience Quality control of developments (e.g. unit test results review, system test cases preparation and review)3. UI5/Fiori Developer.Strong knowledge and Experience web development technologies like UI5, HTML 5, jQuery, CSS, JavaScript, ABAP, JSON and XML Knowledge on extending the fiori application, in App extension and side by side extension.Hands on experience in SAPUI5 Custom applications development by consuming SAP NetWeaver Gateway, OData protocol.Experience in configuring SAP Fiori application on FIORI 2.0 by using all the best approaches HUB, embedded.Experience in designing responsive apps which runs on any devices such as mobile, tablet and desktop.Knowledge/Hands-on experience in SAP NetWeaver Gateway, OData services building and extension.4. ABAP Technical.Experience in Core ABAP. SAP ABAP programming Report, Enhancements, Conversion Programs, SAPscript, and Smart Forms, Screen Painter BDC, LSMW, User Exits, ALV Reports, Dialog Programming, Data Dictionary, RFC, ABAP Query, ALE, BAPI, BADI and InterfacesMust have worked on interfaces using IDOCs, FTP/SFTP, ALE, Proxies, EDI & RFCGood to have exposure on ODATA Framework & SAP Fiori, OO ABAP & Gateway developmentGood to have hands on experience on HANA.  Role: Software DeveloperIndustry Type: Software DevelopmentFunctional Area: IT Software - Application Programming, MaintenanceEmployment Type: Full Time, PermanentRole Category: Programming & DesignEducation: UG: Any Graduate in Any SpecializationPG: Not RequiredIf you are interested in the above positions with us kindly share your resume on priyankas@exikontech.com", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["Sap Fiori", "Odata", "SAP ABAP", "OOPS", "Data Structures", "JSON", "Rest Api", "Rabbitmq", "Software Development", "Algorithms", "NoSQL", "GIT", "MongoDB"]}