{"JOB DESCRIPTION": "Roles and ResponsibilitiesDescription :- We are seeking a Sr SW Engineer to work closely with others to investigate, design, prototype and develop new capabilities for our monitoring fabric. The ideal candidate will show industry experience in providing innovative solutions for networking equipment or other embedded systems devices with scalable fabric solutions. - The successful candidate must be comfortable working in highly collaborative and fast paced environment.- The right candidate will help design and develop major components of GigaVUE, with emphasis in system platform and driver areas. Working as part of a growing, dynamic team, the candidate will thrive in a cross-functional team environment to lead and achieve project deliverables and will have the opportunity to make a significant impact to the product linesResponsibilities :- Contribute to overall product requirements, architecture and design.- Work closely with product management organization to evaluate product solutions.- Conduct feasibility analysis for proposed solutions.- Develop new and improve existing processes for software development.- Produce functional specifications and design documents.- Work effectively with all stakeholders and engineers throughout the lifecycle of the product.- Deliver competitive product on time with the right quality.- Troubleshoot complex issues discovered in-house as well as in customer environments.- Maintain existing code base and resolve customer issues.- Work with customers and third-parties to understand product requirements.Required Qualifications :- MSEE / CS preferably in networking.- 3years to 6yrs of professional experience in designing and developing complex software.- Expert in C / C++ coding.- Experience developing switching software and solutions around BRCM switching devices will be plus- Proven successful technical leadership experience.- Solid background in data structures and algorithms.- Understand complex issues in software modularity, performance bottlenecks, etc.- Experience contributing at all stages of software development life-cycle.- Experience in software-based packet handling.- Experience developing software for networking protocols including TCP/IP and Ethernet protocols.- Experience developing system-level software in Linux/Unix development environment.- Knowledge of security technologies including VPN and Firewalls and Telecom protocols.- Hands-on experience with multi-core, multi-threading systems.- Excellent written/oral communication skills and strong analytical and problem-solving skills.- Self-motivated individual with the ability to work in a high-achieving team or independently.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "MS/M.Sc(Science) in Computers, Electrical Engineering", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["C++", "C", "software development", "TCP/IP", "Algorithm", "SDLC", "Data Structure"]}