{"JOB DESCRIPTION": " Job Description : We are looking for highly motivated application engineers who have more than four(4) years of experience in Kondor customization Responsibilities:Software design, development and testing relating to the Kondor+ platformProvision of Level 3 Technical Support across the full range of software developmentUnderstand requirements and translate to a Kondor+/K+ TP technical solution.Responsibility for ensuring that all software developments are prepared and deployed in accordance with the agreed Methodology and Change Management procedures.Responsibility for unit testing and preparation of software releases for deployment into production.Should be able to work in European time zone. Mandatory technical skills:Should be comfortable working on Custom Windows Open Reports and Stored Procedures in Kondor Application.Should have experience in configuration and development of SWIFT and PDF in K+TP. Should be expert in SQL and TSQL in Sybase and MS SQL.Should have expert knowledge in JavaShould be expert in UNIX along with shell scripting.Should have experience in interface development.Should have working experience in XML XSD and XSLT files.Should have basic functional knowledge in Treasury and Capital Market DomainShould be capable of working in multiple projects.Should have involved in full Life Cycle Development of product development. Should have excellent communication skills and inter personal skills Interested candidates submit your resume to careers@prokximity.com or apply through Naukri portal. ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["XML", "Kondor", "Swift Payments", "MS SQL", "Life Cycle", "Software Development", "Unit Testing", "Configuration", "Stored Procedures", "Shell Scripting", "XSD", "XSLT"]}