{"JOB DESCRIPTION": "You will provide technical leadership to software engineers by coaching and mentoring them throughout the end-to-end software development, maintenance, and lifecycle to achieve project goals to the required level of quality; promote team engagement and motivation.  You will provide input to the software engineering manager for estimates, resource needs, milestones and risks; and ensure effective delegation, monitoring tasks, identifying risks and handling mitigation and escalations.  You will provide hands-on technical and functional input to the design, maintenance, build, integration and testing of complex software components according to functional and technical design specifications; you will follow software development methodologies and release processes.  You will analyze and provide input for the requirements and provide impact assessment for new features or bug fixes. You will perform high-level design and establish technical standards.  You will represent and lead discussions related to product / application / modules / team and build relationships with internal customers/stakeholders.  You will enforce quality processes (such as performing technical root cause analysis and outlining corrective action for given problems), measure them and take corrective actions in case of variances, and ensure that all the project s agreed deliverables are completed to the required level of quality.Bachelor's degree in Science/IT/Computer Science or equivalent       Thorough understanding of software development and/or support methodologies, principles and procedures and related software management tools       Solid design, coding, testing and debugging skill       6-8yrs Extensive experience in Java technology frameworks including: Spring Boot, JDBC, JPA and Hibernate.       1-2 Experience with designing and developing microservices based, linearly scalable applications.             Why you will love this job:     You will be challenged with the leading and mentoring of a small development team.  You will be challenged with leading the technical aspects of the project.  You will have the opportunity to work in a growing organization, with ever growing opportunities for personal growth.  You will have the opportunity to work with the industry s most advanced technologies.          Amdocs is an equal opportunity employer. We welcome applicants from all backgrounds and are committed to fostering a diverse and inclusive workforce    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Hibernate", "Coding", "Debugging", "JDBC", "JPA", "High level design", "Amdocs", "Monitoring", "Testing"]}