{"JOB DESCRIPTION": "        About the Role          Need to place a senior software engineering role that is expected to create and maintain an end-to-end test automation solution for a portfolio of payment applications.           We are building an automated Test Engineering Solution which covers the full life cycle of testing for a suite of payment applications which have User Interface and IBM MQ based entry/exit points. The desired solution will include the following features: an automated comparison of actual and expected results, determination of the test suite s code coverage, determination of the test suite s coverage of functional requirements, a reusable test data management mechanism, and a test artifact management mechanism that links test scripts, test data, and requirements. This role demands a person who has expertise in object-oriented and component-based software architectures and who can demonstrate how these skills will be applied to the automated testing solution.           Responsibilities           Responsibility for designing, building and maintaining extensible test frameworks,                  Develop and maintain test scripts based on that framework,           Work closely with dev teams in defining tests efficiently,           Execute the tests regularly, debug and fix any issues promptly and           Effective communication within the team and with other teams             Expected to provide overall leadership on test strategy, script design,           script execution, automation framework, all combined to reduce the costs of testing, increase test coverage and effectiveness and shorten testing cycles            Works with diverse group of developers, business subject matter experts with assertiveness and tact            Coding, testing and reviewing given business and technical requirements and ability to write technical design documents and provide timely and meaningful feedback              Creating detailed, comprehensive and well-structured test plans and test cases                Estimate, prioritize, plan and coordinate quality testing activities                Requires coordinating and working with teams between US and India            Essential Qualifications            Bachelors/Master s degree in Computer Science or equivalent                Experience in building test automation frameworks (using off-the-shelf and/or custom components), strong knowledge of automation framework concepts, and best practices. Demonstrated expertise in designing, implementing and documenting automation tests for Messaging systems based on JMS, IBM MQ and UI using Selenium, TestNG, Cucumber etc.                Demonstrated leadership, autonomous problem-solving, and communication skills                Expertise in object-oriented and component-based software development, preferably Java or other platforms such as .NET                9+ yrs. of hands-on IT experience in designing, developing and testing complex, highly integrated, distributed applications using Java/JEE, Selenium, SQL Oracle, web services, Junit/TestNG and other technologies / frameworks.                Design test plans, scenarios, automation scripts and develop testing programs to build automation test suite for large scale applications.                Experience in understanding the requirements, current/future state of enterprise design and architecture.                Good experience in DevOps tools Git, Gradle, Maven, Artifactory, Jenkins and uDeploy                Good to have experience on microservices and cloud                Good to have working experience in banking domain and agile methodology         ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "JMS", "Maven", "Data management", "Test scripts", "Coding", "Selenium", "Test cases", "Analytics", "Testing"]}