{"JOB DESCRIPTION": "  In this role, you will have the opportunity to:      Develop high quality software which meets requirements, promotes re-use of software components, and facilitates ease of support.    Diagnose, isolate, and implement remedies for system failures caused by errors in software code.    Provide input and technical content for technical documentation, user help materials and customer training.    Conduct unit tests, track problems, and implement changes to ensure adherence to test plan and functional/nonfunctional requirements    Analyze, design and implement software mechanisms to improve code stability, performance, and re-usability. Participates and leads code review sessions.    Participates with industry groups, stays current with technology and industry trends, disseminates knowledge to team members, forms best practices. (Retail and Self-service Retail Industry groups)    Communicate with Solution Management and other internal teams. Participates in cross-functional collaboration within the organization.     Required Skills and Experience:       Bachelor s Degree in Computer Science or related field    A minimum of 5 years of experience in software design and development    Deep understanding of Computer Science fundamentals    Strong development, debugging and troubleshooting skills    Excellent written, verbal communication skills. Able to work in teams and collaborative fashion.      Languages/Technologies  :  o React / React Native / Node.js using JavaScript / TypeScript   o Working knowledge of C# and C++   o Bitbucket/JIRA/GIT Workflow  Operating Systems:   o Linux  o Windows    Knowledge of software development standards and protocols: PCI    Preferred Skills and Experience  :     Database Design experience    Performance Optimization    Champion of Agile Scrum methodologies    Experience with continuous integration systems like Jenkins     Deep knowledge and understanding to create secure solutions by design    Experience with multi-threaded backend environments with concurrent users    Experience with tools or languages like:  o Perl, Bash  o Docker  o Kubernetes  o Google Cloud Platform and Azure   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Hospitality", "Backend", "C++", "Linux", "Workflow", "Perl", "Windows", "Troubleshooting", "Recruitment"]}