{"JOB DESCRIPTION": "Senior Software Engineer Java (Bangalore/Gurgaon) - Mobileum   Senior Software Engineer Java (Bangalore/Gurgaon)   Senior Software Engineer Java (Bangalore/Gurgaon)        This position reports into the Senior Manager engineering at Mobileum and would be responsible for development, support, maintenance and implementation of small to medium complex components of the assigned module.    Job Responsibilities:     Help define and understand the product in details   Find out existing platform components that can be used   Find out technical unknowns and get them resolved   Help prepare design documents   Help prepare test plans   Create tasks and assign them to a team   Provide technical assistance to the team   Develop and test a deliverable thoroughly   Provide inputs to other functions e.g QE, PSO ,Support and documentation   Conduct Code Review   Perform purify and code coverage on every module before delivering it to QE     Desired Profile:     Educational Qualification:     B.E. / B.Tech. , M.E. /M. Tech. or M. Sc. in Computer Science / Electronics Engineering / MCA from top and reputed institutes/university.     Skill Set:     Hands on experience in object oriented development using Core Java/J2EE. Knowledge of Webservices, JSON, Java scripting will be an added advantage   Knowledge of scripting languages like Perl, Shell, & TCL is desirable.   Exposure to relational database like Oracle & MySQL is required.   Understanding of LTE, GSM, Diameter is not mandatory though nice to have.   Experience in developing application mobile telecom domain for billing/ Charging, wholesale and Revenue assurance.     Work Experience:     Three to Five years experience in development. Product development experience is must       ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Telcom, ISP", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["GSM", "Computer science", "Core Java", "Web services", "MySQL", "Billing", "Java Software Engineer", "Perl", "JSON", "Oracle"]}