{"JOB DESCRIPTION": "    About the Role        8+ Years of hands-on experience in Architecture, Design and application development using JAVA, Spring3.x+, Hibernate, Microservices.          This candidate will be a key member of the Wholesale Digital and Transformation Technology team performing SDLC tasks such as design, develop, test, document and support the application.         This candidate is required to lead vendor resources on delivery, collaborate with other team members and partner with upstream/downstream application teams.          This candidate should be comfortable working on multiple deliverables and in agile teams. Strong technical skills are needed to succeed in this role.        Responsibilities       Responsible for developing and executing customer experience solutions for online applications in Business Tools.                 Accountable for creating complex industry-leading user interface design solutions.                 Serves as design advocatewith the ability to forecast and assess industry trends and their impact on the companys product design alternatives.                 Establishes and promotes design guidelines, best practices and standards.                 Accountable for overseeing the execution of strategic design projects that influence design and strategic direction                 Identify and lead implementation through business tools and partnerships with technology and other key business organizations throughout Wholesale Banking.                 Build alliances with the lines of business, technical operations, and architecture teams to achieve strategic objectives.                 Provides product usability, evaluation and support to product development teams.                 Presents and defends designs and key milestone deliverables to peers and stakeholders        Essential Qualifications:        Atleast 8+ years of hands on experience on Java based web development with strong expertise on Spring Framework v3 or newer Spring Core, Spring Data, Spring Security, Spring AOP and Spring MVC)         Experience RESTful webservices, axis or cxf Webservices,         Experience with Subversion, Github         Experience with Maven or Gradle         Experience with deploying applications in WebSphere Application Server or Tomcat.         Experience with jUnit and Mockito         Experience identifying and remediating security vulnerabilities         Should be well versed with test driven development and be knowledgeable on associated tools and practices         Should be able to understand business requirements and translate to technical design         Strong verbal and written communication skills         Ability to work independently with minimum supervision.         Ability to Work directly with US partner teams         Ability to lead by example, motivating team to produce excellent results         Should be good with SDLC processes and agile methodologies          Desired / Good to Have Qualifications (Technical Skills):           Experience with Cloud based development         Experience with Microservices         Experience with Powermock and Jacoco         Experience with SONAR and Fortify         Experience with Clean Coding concepts   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Hibernate", "Tomcat", "Web services", "User interface designing", "Coding", "Product design", "Application development", "microsoft", "Wholesale", "SDLC"]}