{"JOB DESCRIPTION": "    About the Role      Need to play Senior Developer role that expected to perform front end and back end related design, development and maintenance activities for DAT applications in DODCT area in CSBBT. Candidate needs to work with US partner teams and it demands to be available as per the delivery timelines     Responsibilities       Works with diverse group of developers, business subject matter experts, project management from multiple teams with assertiveness and tact    Technical point of contact for all technical issues and partner with the team to analyze, investigate and resolve open issues, vulnerabilities, secure coding etc.    Contribute to the design discussions, contribute towards design discussions, perform PoCs where ever required to support/back up design decisions.    Provide technical expertise to support team during incident/problem resolution.    Ability to do the reviews and follow the process methodologies and documentation         Essential Qualifications      Bachelors/Master s degree in Computer Science or equivalent    6-8 yrs. of hands-on IT experience in developing complex, highly integrated, web-based applications using Java/J2EE,Spring web services, Micro services, Spring MVC, Spring boot, Hibernate and worked in Agile teams.    Should have strong work experience in UI tech stack - HTML5, JavaScript(ES5 & ES6) ,Object oriented JavaScript, Ajax, JSON, , Angular/React JS frameworks and Responsive web development.    Knowledge working with GIT, Maven/Gradle , JIRA tools    Experience in implementation of Java, J2EE and JS Design patterns.    Hands-on experience in MSSQL / Oracle databases    Experience in writing unit cases using Junit, Mocha/Jasmine/Jest libraries.    Should be able to deploy the application in non-production environments on Linux platforms.    Experience in Agile methodology      Desired Qualifications       Good verbal and written communication skills    Good problem solving and analytical skills    Should be detail oriented, able to multi task      Nice to Have - Skills:       Experience in PLSQL and other DB concepts are added advantage.    Banking Applications experience   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Hibernate", "Linux", "Coding", "Project management", "Web development", "Javascript", "JSON", "Oracle", "Information technology", "Ajax"]}