{"JOB DESCRIPTION": " POSITION SUMMARY KEY AREAS OF RESPONSIBILITY:    Primary function of role is translating customer IT services requirements into customer solutions/contracts that secure customer loyalty, drive acceptable profit margins and are delivered with fidelity   Create solution designs that deliver customer requirements and are used by development resources to build and deploy.   Exposure to DevOps process  oAutomate processes.  oContinuously deliver high-quality systems.  oReact quickly to feedback to continuously improve processes.   Exposure to Agile methodologies.    Primary function of role is managing technical resources to build and deploy customer financial industry solutions.   Required to qualify and develop a solution that is mutually acceptable to the client and NCR   Required to assist sales with growing the revenue (within existing and new accounts) and ensuring the integrity of the WCS operation is not compromised;    Position provides thought leadership around market-based pricing strategies and is fully accountable for the operational and legal terms agreed to in the services agreement and SOW   Engage subject matter experts (SMEs) as required and manage SME resource team to assist with solution costing/ development   Ensure the appropriate due diligence is carried out both with the client and within the proposed NCR delivery organization   Provide sales team with technical and service presales support; Prepare and deliver services presentations to current and prospective customers   Acts as the technical lead in Region deployment engagements   Ensures the program meet established time, cost, technical and customer objectives   Ensures the program s change control procedures area developed and managed    BASIC QUALIFICATIONS:    Bachelor s Degree in a related discipline   9-12 years of related experience focused on the self-service financial industry and CEN XFS based solutions.   5-7 years of self-service financial industry software design and development experience.   Ability to lead development resources under tight timelines in a demanding environment   Related operational experience   Excellent verbal and written communication skills   Strong presentation skills   Ability to takes a leadership role in challenging standard approaches   Ability to work under tight timelines in a demanding environment    TECHNICAL SKILLS:    Experience with working on Windows Forms Programming with C#.NET 2.0 and above at least for 4 years   Through understanding of exception handling and error logging   Knowledge of secure coding is a plus.   Experience using .NET framework 3.0 Workflow Foundation, .NET WCF is a plus.   Tomcat, Web Services, REST, SOAP, Java, Springs, Oracle / SQLServer / PostgreSQL, Git Spring, NPM, Bower, Grunt     Agile Practices:    Provide input and technical content for technical documentation for user help materials and customer training.   Experience in Agile practices like Kanban/SCRUM   Through understanding of Root cause analysis   Experience of working in Continuous test and build environments    PREFERRED QUALIFICATIONS:    Able to evaluate risk independently and propose contingency plans   Good business acumen and ability to negotiate up-sell and margin improvement   Able to provide Business Impact Analysis at an enterprise level  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["IT services", "Hospitality", "Due diligence", "Costing", "Coding", "Quality systems", "Workflow", "Oracle", "Operations", "Recruitment"]}