{"JOB DESCRIPTION": " POSITION SUMMARY KEY AREAS OF RESPONSIBILITY:    Designs, modifies, implements, and documents software application changes within electronic payments-related products.   Tests and supports applications internally and externally.   Participates and leads others in analysis, design, testing, and review processes.   Provides estimations of work based on requirements.    Writes product specifications, designs, and technical manuals.   Able to lead implementation teams; Provides leadership of small to medium size projects; collaborates with product managers and other cross-functional team members.   Works directly with third-party products and specifications, evaluating requirements/documentation and translating requirements to our clients as needed.   Responsible for integrating NCR products with other NCR and non-NCR solutions.   Maintains responsibility of assigned tasks by using experience/knowledge of environment to make design/development decisions.   Responsible for technology in a given work area.   Educates others (technical and non-technical) on areas of expertise.   Responsible for training/leading developers in remote locations across the globe.   Works under the supervision of an Engineering Manager.   Provides development level support for assigned products and projects throughout the development lifecycle.    REQUIRED EDUCATION AND/OR EXPERIENCE:    Formal education level: Bachelor s degree in a related area (Computer Engineering, Computer Science, Computer Information Services, Management Information Services).    Specific Skills Proficiency Level:     Microsoft Visual C/C++   Microsoft Win32 API (SDK)   TCP/IP Socket level communications   Extensible Markup Language (XML)   Familiar with source control software (i.e. BIT Bucket, TFS Source Control)   Able to troubleshoot complex systems including hardware and software systems   Experienced w/ Software Engineering best practices (design patterns, coding style, etc.)   Able to convey technical concepts with non-technical audiences   Must excel in verbal and written communications    Experience:     In developing applications using C/C++, Windows operating system platform   Experience developing object oriented solutions   Point of Sale system and electronic payment interface experience is preferable  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Telecom", "Hospitality", "C++", "Coding", "XML", "Windows", "microsoft", "Gaming", "Recruitment"]}