{"JOB DESCRIPTION": " We are looking for an experienced Senior Oracle Applications Developer.     The primary function of this job is to analyze, design, develop, test, tune, and maintain the existing software applications and develop new software applications as per the given requirements.    This senior application developer is expected to own and drive assignments through all stages (requirements, development, testing, UAT, production support) to completion with high level of quality and within project timelines.     The senior application developer should be able to engage in design discussions, and demonstrate the ability to see the application from the users point of view. The senior engineer must possess excellent verbal communication skills and ability to interact with clients.     The software engineer should have the ability to self-direct, set goals, and meet aggressive project deadlines.      Responsibilities     Evaluate customer requests/estimate effort to develop solution   Create/modify packages, stored procedures, triggers, indexes, etc.   Create/modify shell scripts for transmitting   Respond to warnings/alerts concerning oracle databases (on call support)       Incumbent Should Have     Excellent written and oral communication skills   4-7 years of experience as DB developer in Oracle    3-4 years of working experience on PostgreSQL    Be Proficient in Oracle PL/SQL   Should possess Oracle Database Administration skills   Ability to create packages, procedures, triggers, as well as the shells scripts that would be used to execute them.   Ability to work within tight deadlines and effectively prioritize and execute tasks in a high-pressure environment.   Excellent understanding of coding methods and best practices.   Experience in banking industry applications is preferred   Experience in UNIX, Linux, perl and c languages will be helpful  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Unix", "Hospitality", "Linux", "Production support", "Coding", "Postgresql", "Oracle DBA", "Perl", "Stored procedures", "Recruitment"]}