{"JOB DESCRIPTION": "    About the Role     This position is an Information Security Engineer will perform an Individual contributor role in Enterprise Information Security Program (EASP) who needs to contribute to EASP practices from EGS.     Job Responsibilities      Contribute to the Static Application Security Testing Stream (SAST) to enable tools, Deprecate Unsafe Functionality (DUF) practices from EGS and contribute to the EASP program.    Contribute to security coding guidelines for different programming languages.    Understand the EASP program and its implementation across the organization and stay abreast with the changes to the program.    Enable the program by creating, on-boarding, maintaining and supporting SAST tools in EASP.    Suggest and execute changes to the program and implement the changes to the enabling tools.    Integrate with the state side leads to understand requirements and implement them in the practices and tools.    Develop and leverage the ability to execute any EASP stream assigned from EGS.    Associate with Application Security Champions, Architects and Application development teams in Governance, oversight and enablement of EASP.    Apply knowledge of information security and application development industry trends and technology to drive organizational change and position to properly manage and remediate vulnerabilities.    Coach junior team members in the team to understand and deliver based on the requirements of the program.     Essential Qualifications      8+ years of Overall IT experience    6+ years of application security Experience    3+ years of experience with all or some of the following practices like Security Requirements, Application Threat Modeling, Static Analysis, Application Security Risk Assessments, Security Design requirements.    SAST (Static Analysis Software Testing) experience with tools like Fortify and Checkmarx is a must.    Knowledge and experience in working with various application security tools and systems.    Knowledge and understanding of secure SDLC (System Development Life Cycle) methodologies.    Experience in drafting application security coding standards.    Knowledge and experience in identifying and suggesting mitigations to OWASP top 10, CWE/SANS top 25 to development teams.    Application security experience with banking/financial services applications.    Ability to manage multiple priorities in a fast-paced dynamic environment.    Advanced problem solving skills, ability to develop effective long-term solutions to problems.    Excellent verbal and written communication skills    Excellent inter-personal skills contributing to cordial team environment.     Desired Qualifications      Knowledge and understanding of information security practices and policies, including Information Security Frameworks, Standards, and best practices    Ability to manage highly complex issues and negotiate solutions    A Bachelor s degree or higher in information technology    Knowledge and understanding of Application security threat management and mitigation domain.    Knowledge and understanding of Information Security Tools Development Unix and Windows.    Knowledge and understanding of threat modeling and assessment of potential and current information security risk/threats.    Certified in Industry renowned certifications like CSSLP, CEH etc.,  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Unix", "Coding", "Information security", "OWASP", "Application development", "Application security", "Windows", "Information technology", "SDLC", "Financial services"]}