{"JOB DESCRIPTION": "IntroductionSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do. Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide. At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.Your Role and ResponsibilitiesAs a Cloud Brokerage Sales Engineering Solutions Developer, you will work closely with Cloud Brokerage Sales, Center of Competency, Sales Engineering Architects / Developers to articulate the value proposition to current and potential Cloud Brokerage customers by providing subject matter expertise within the Cloud Brokerage platform and develop custom solutions to bridge the gap between customer’s business / technical needs and current functionalities of current Cloud Brokerage products. Responsibilities:Works closely with Sales Engineering Architect to create initial presentation of the Cloud Brokerage product to the customers and providing strategic envisioning of a solution which will work with CB product and customer’s legacy systems. Integrates customer's public and private cloud service providers like AWS, Microsoft Azure, IBM Softlayer, OpenStack, VMware, etc. with IBM Cloud Brokerage productsProvides broad guidance for linking technologies to business requirements. Provides integration technology concepts and creates proof of concept (PoC) or pilot implementation to the customer. Provides product demonstrations and customization capabilities to current and potential customers. Participates in sales initiatives acting as Cloud Brokerage technical and integration expert. Coordinates with Architects to map customer business needs to Cloud Brokerage functionalities and needs for new functionalities development and integration. Works with internal Product Management and Engineering organizations on providing feedback for new functionalities required by customers during deployment stage and on the roadmap to implement them. Works closely with other sales engineers and architects to co-own PoC delivery ensuring that the proposed architecture is properly scoped and in-line with customer goals and business / technical requirements. Required Technical and Professional ExpertiseBachelor’s degree in Information Technology / Computer Science field of study. 5+ years of experience as Software Developer.Strong background and knowledge of all levels of software development. 2+ years of experience in Cloud technologies (private and public). Demonstrated experience with cloud applications integration. Solid understanding of centralized configuration management and provisioning technologies, such Ansible, Chef, Puppet, etc. Proven experience with Software Development Lifecycle (SDLC) and agile/iterative methodologies required. 3+ years of experience in programming with one of the following languages: Python, C#, PowerShell, or Java. Strong Unix skills and proficient with at least one shell and high-level scripting language (bash, perl, python). Experience scripting with JavaScript, Python, or Bash.Familiarity with professional application of Docker and Containers. Preferred Technical and Professional ExpertiseAbility to work in a distributed team throughout the worldYou love collaborative environments that use agile methodologies to encourage creative design thinking and find innovative ways to develop with cutting edge technologiesKnowledge Storage technologies including SAN, NAS, Quantastor, NetApp, OpenStack Cinder/Swift, and backup/recovery toolsAmbitious individual who can work under their own direction towards agreed targets/goals and with creative approach to workIntuitive individual with an ability to manage change and proven time managementProven interpersonal skills while contributing to team effort by accomplishing related results as needed", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "BCA in Computers, B.Sc in Computers, B.Tech/B.E. in Computers", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Software Development Life Cycle", "C#", "Java", "Sales Engineering", "Cloud Applications", "Powershell", "Ibm Cloud", "Javascript", "Programming", "Microsoft Azure"]}