{"JOB DESCRIPTION": "        Position summary      As a member of the core technology platform s tools team you will be involved in all technical aspects of product delivery you will design, test, deploy and maintain software solutions. You will work on a specific project critical to Nuance s needs with opportunities to switch teams and projects as you and our fast-pasted business grow and evolve.     The successful candidate will be recognized as a powerful voice within the RD org, able to articulate deep and broad technical knowledge in a SaaS environment. You will be required to take complete ownership of issues and of the success of your customers and peers.     Principal Duties and Responsibilities      Demonstrate unusually high levels of ownership, accountability and follow-through   Drive architectural evaluations including requirements gathering and POCs for technology within the platform space.   Participate in and strongly contribute to architectural reviews and discussions of testrelease process.   Work on products that bring Enterprise grade Conversation AI solutions to both private and public cloud.   Bring your ideas to the table and help others to achieve their potential.   Keep up with the latest technology trends, always focusing on how to build a better solution.   Institute and champion best practices for a cloud native architecture, from consistency and readability to maintainability and documentation.   Follow documented and participate in the process for delivering the Product(s).   Collaborate with team members in every aspect of creating the product demonstrate end-to-end understanding of the process (CICD, Docket, Kubernetes, microservices, etc.)   Mentor other developers and foster a collaborative environment of shared growth learning      Knowledge, Skills and Qualifications:      Required Skills:          Programming background in programming language: JAVA   Ability to learn new concepts, architectures, APIs, etc as needed.   Experience with Micro-services   Proficient in Linux, Docker and related tools   Knowledge of communication protocols: HTTP1.1, HTTP2, GRPC, WebSocket   Knowledge of Cloud Native tool and architecture (e.g. CICD, Docker, Kubernetes, )      Preferred Skills:              Academic background in computer science   Positive attitude and able to work well with others.   Knowledge of Postgres, Redis   Passion for creating and refining efficient processes.   Comfortable communicating with, presenting to, and receiving input from a variety of people, including senior management.   Speak and write unusually well. You understand that the quality of your communication is a top priority.          ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - System Programming", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Communication protocols", "Linux", "Architecture", "Artificial Intelligence", "Cloud", "Healthcare", "HTML", "Application development", "Principal"]}