{"JOB DESCRIPTION": " Position Title: Software Engineer  Permanent Position  MorningstarMorningstar, Inc., incorporated on May 16, 1984, is a provider of independent investment research in North America, Europe, Australia, and Asia. The Company focuses on creating products that help investors reach their financial goals.https://www.morningstar.com/companyLocation  Navi Mumbai (Office Located near to station)Shift  General shift Notice Period  Immediate to 30daysThe Area: Morningstar® Data for equities provides comprehensive coverage of global stock markets from as early as 1975. We are continuously broadening our coverage and creating new products to help clients prepare for regulatory changes and other industry shifts. Our data features proprietary statistics and is developed using stringent quality screens to ensure accuracy. From APIs to data feeds, our solutions are delivered quickly to help institutions meet a broad range of functions.The Role: n this role, you will collaborate with team leader, scrum Master, data analysts, and developers to build technology solutions for Morningstar`s Equity applications. You should have strong understanding of Core Java, JSP, Spring, SQL, Component based architectures and create scalable, flexible technical solutions. You would support existing systems, study their enterprise complexities and develop/implement better systems with modern software development practices. Developing good understanding of existing systems on other platforms and its database is a beginning step.Responsibilities:Design & develop web and enterprise solutions to be flexible, scalable & extensible.Improve complex data flow, data structures and db design to move to next platform.Enforce good agile practices like test driven development, Continuous Integration.Hands-on development will be an integral part of the responsibilities.Develop areas of continuous and automated deployment.Introduce and follow good development practices, innovative frameworks and technology solutions that help business move faster.Follow best practices like estimation, planning, reporting and improvement brought to processes in every day work.Requirements: 2 -3 Years of experienceHands-on in Java/ Web-services / Spring /SpringBootVery Strong knowledge of databases and hands on MS SQL/MySQL/PostgreSQL and NoSQL DB DynamoDB/MongoDB.Hands-on experience on AWSBe aware of activity in the open source world. Contributing back to open source is a big plus.Participation in full life-cycle system development with teams of developers, analysts, and testers.Completed Bachelor’s degree in EngineeringExperience with modern development practices in areas of Product design, Requirement Analysis, Test Driven Development, Automation & Unit Testing, in a product development environment.Excellent listening, written and verbal communication skills.Interested candidates can apply on below mentioned link https://morningstar.wd5.myworkdayjobs.com/Americas/job/Mumbai---Platinum-Park/Software-Engineer_REQ-018252Please note, we are considering candidates who have immediate to 30days of notice period.Regards,Aarti Chaudhari", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Other", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["Java", "Software Engineering"]}