{"JOB DESCRIPTION": "Roles and ResponsibilitiesResponsibilities (not exhaustive)  Build and ship reliable software practicing robust software design and in-depth code reviews. Build efficient, clean and reusable features / libraries / components Collaborate with our design and product teams on defining and delivering new features to ensure a great experience for our users. Analyse and optimize existing UI and Server-side code for security, efficiency and performance. Be a voice in ensuring the team stays true to the technical vision. Write clean, scalable code in mobile-based programming languages and/or .NET  Write SQL Stored Procedures Test and deploy applications and systems Collaborate with technical lead to produce software design and architecture Translate designs and style guides provided by the UI/UX team into functional user interfaces, while ensuring cross-browser compatibility and performance.  Unit-test the code across platforms and browsers, to ensure functional consistency of delivered output. Education / Skill Set - Engineering / MCA degree from a top school with an excellent academic record Object oriented programming knowledge is a must. High level of Proficiency in Web-based technologies - JavaScript, HTML/CSS Knowledge of any one JS framework like React Native, Angular, or the like, is a plus Formal knowledge in below areas will be an added advantage ASP.NET MVC Entity Framework Core/LINQ. Bootstrap framework SQL DatabasesExperience - Minimum 5 years’ experience in front-end development of software products using Web-based technologiesExperience doing Full-stack development is a great plus.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Mobile", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "MCA in Computers", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["linq", "css", "SQL database", "full stack development", "entity framework", "JavaScript", "asp.net", "Mobile App Development", "html", "react native", " angular", "bootstrap"]}