{"JOB DESCRIPTION": "Roles and ResponsibilitiesIntroductionSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do. Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide. At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.Your Role and ResponsibilitiesAs DB2 Engineer, you be working on open, dynamic, flexible, fun-spirited, collaborative environment and desire creative freedom to work on high performing teams.Responsibilities:Design and development for the service layer and DB for the payment cloud application.Work across IT teams and with business users understand the business needs and translate it to implementation.SQL Tuning techniques to prevent performance degradation and understanding on how to use Explain Plan/Query Analyzer/Optimization Tool is required.Required Technical and Professional ExpertiseMinimum 5-7 years of experience working in DB2 Databases.Strong background in database programming using SQL/PLSQL i.e. stored procedures, functions, triggers and packages is required.In-depth understanding of database concepts i.e. normalizations/de-normalizations, schemas, table spaces, temporary tables, views, indexes, sequences, partitioning etc. is required.DB2 developer and Java skills mandatorySQL Tuning techniques to prevent performance degradation and understanding on how to use Explain Plan/Query Analyzer/Optimization Tool is required.Working experience in database security, primarily on Encryption and decryption concepts is plus.Solid understanding of Linux Platform is required and on programming languages i.e. Java will be a major plus.Hands on in web services developmentExperience in complex development projects supporting huge Database structuresPreferred Technical and Professional ExpertiseYou love collaborative environments that use agile methodologies to encourage creative design thinking and find innovative ways to develop with cutting edge technologiesAmbitious individual who can work under their own direction towards agreed targets/goals and with creative approach to workIntuitive individual with an ability to manage change and proven time managementProven interpersonal skills while contributing to team effort by accomplishing related results as neededUp-to-date technical knowledge by attending educational workshops, reviewing publications", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - DBA, Datawarehousing", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Java", "Software Development", "Stored Procedures", "Web Technologies", "Programming", "Agile", "PLSQL", "Technology Consulting", "Web Services", "SQL"]}