{"JOB DESCRIPTION": "Roles and ResponsibilitiesGeneral Responsibilities: - Design, develop, debug, and modifies components of software applications and tools. - Drive technical direction at the application product level for small to mid-sized projects. - Design, spec, schedule and provide quality implementation of a component or feature (typically 1-3 months induration). Provide alternative solutions to a given problem. - Resolve problems and roadblocks, with management assistance if required. - Follow through on details and drive issues to closure. - Complete documentation and procedures for installation and maintenance. Actively participate in grouptechnology reviews to critique work of self and others. - Work collaboratively with all members of technical staff. Collaborate with program management and testing peersin the development of assigned components. - Participates in and provides input to requirements definition. Usually provides solid judgment calls and tradeoffanalysis.- Do you write code on the bleeding edge that's tuned for performance, well structured and works on any device.- Then the Client-Side Engineering Team wants to meet you! - We're looking for a highly talented, front-end ninja who develops highly optimised, lightning-fast client-side codethat will reach millions of users to join our team. Responsibilities Include: - Architect reusable functional components for use across our global sites (i.e. form widgets, content modules, etc) - Optimize everything for speed, speed, speed. Know the rendering engines in each browser and their weaknesses - Develop and optimize plug-ins for jQuery for internal use - Be offended by and eliminate any and all sub-standard code - Contributing to documentation (instructional and technical specification) - Contributing to development standards working closely with the Dev Manager and Technology Lead. - Discussing technical solutions with peers and providing innovative new ideas to solutions. - Maintaining a high awareness of industry issues and trends, particularly in regard to accessibility, usability, and emerging technologies Your Skills: - Expert HTML, CSS and JavaScript knowledge - Experience with jQuery, ES6 or other JS libraries - Up-to-date familiarity with emerging W3C standards (HTML5, CSS(4), etc) - Knowledge of working with JavaScript frameworks to create rich interactive content - Experience integrating with server-side code to produce dynamic pages (JAVA, PHP etc) - Extensive knowledge of cross-browsermulti-device support; mobile-first - Experience using version control systems (Git, SVN, etc) - Solid understanding of Web Accessibility, Experience building sites to at least an AA standard Level up if you- 1) write Object-Oriented JavaScript 2) have expert knowledge of template languages such as Handlebars 3) have experience with Assistive Technologies (VoiceOver, Jaws, NVDA) and can test code for accessibility. 4) ever created, or contributed to an extensive code library or framework 5) have experience automation testing your own code (Jasmine, qUnit, PhantomJS), 6) say - Hadouken- when you fix bugs or ship code. ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "BCA in Computers, B.Sc in Any Specialization, B.Tech/B.E. in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Java", "CSS", "Software Development", "jQuery", "Git", "Javascript", "PHP", "HTML", "SVN"]}