{"JOB DESCRIPTION": " Job Title : Sr. Software Development Engineer Experience: 2-3 yearsJob Location : PuneWorking days: 5 DaysMandatory Skillset & Tools1. React JS,  HTML5, CSS3, Java script Primary Skill2. HTML5, React, UI design aspects, Java script, J Query, GIT & version control, Responsive design.3.  Android and IOS app development, Progressive web app, Testing &  Debugging skills, JIRA, Bug Zilla, Confluence, Share points.Secondary Skill1. Spring MVC, Java 1.8 and above, Angular, UI Load testing, REST Web services, Basic shell commands.2. Linux, Good written, verbal and presentation skills, Soft spoken, Pro-active KeyObjectives/Responsibilities of this Role:- Understand the design requirements from UX- Development of UI and the implementation of frontend business logic- Collaboration with UX and backend team for data population- Working experience into Agile and scrum methodologies.Preferred Qualification: BE/B.Tech in any streamIf  interested for the same, please share below required information with  updated resume to proceed further, based on the Inputs provided, we will  get back to you for further discussions.-  Current Salary:-  Expected Salary:-  Notice Period:-  Current location:-  Total Experience:-  Have you ever applied in last 6 months:-  Highest qualification & CGPA/ Percentage:-  Are you  working in any good product firm :-  Relevant years of experience in React Js :-  Relevant years of experience in Front end Development :-  Reason for Leaving: ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Java", "Front End", "Spring Mvc", "UX", "Html5", "Javascript", "JQuery", "Responsive Design", "Angular", "Web Services"]}