{"JOB DESCRIPTION": "  Job Summary:    The Engineer, Development will design, develop, and implement new ideas and products for software applications and solutions. The Engineer, Development will be accountable for anticipating and resolving problems that impact design of current or developing products. The Engineer, Development will perform the research, design, definition and implementation of the product software applications.    Essential Duties & Responsibilities:     Development and testing of new software applications and solutions.   Builds and assembles prototype assimilations of software applications and solutions as directed.   Writes code, completes programming and debugs software applications and solutions. Deliver high quality software applications and solutions that are extensible and scalable within the specified timeline.    Contributes to Code Reviews    Reviews projects against goals and provides status reports.    Demonstrate creativity in identifying effective approaches to software and solution development process and promote opportunities for product innovation Identify product requirements and potential improvements and discuss them with the Product Development Manager.    Participate in the complete software development life cycle from requirement gathering to deployment of the product.    Write and review documentation needed for installation, usage and maintenance of applications and solutions. When requested, interface with the product marketing, global services team and Customer/Partners to address issues in the field.   Cultivate strong working relationships with co-workers.   Undertake any other assignments for which the company s management may request your participation from time to time     Job Requirements:     Minimum Education: B.E/B.Tech Minimum Experience and Skills: 2-4 Years of Experience in ASP.NET, C#. MVC.   Excellent oral and written communication skills.    Able to cultivate interpersonal Customer/Partner relationships and cohesive team interactions and communications   Assertive self-starter with excellent organizational skills  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["ERP", "Supply chain management", "Prototype", "Product innovation", "Software development life cycle", "MVC", "Application software", "Product marketing", "Recruitment"]}