{"JOB DESCRIPTION": "Your Role and ResponsibilitiesAs a Orchestration Developer you will be involved in to design, develop and deliver automated, secure and compliant managed/ unmanaged environment for clients based on different offering in the hybrid multi-cloud platforms, including Cloud on cloud, IBM Cloud, OCI, AWS, GCI, Microsoft Azure, etc.Responsibilities:Design, develop and deliver automated, secure and compliant managed/unmanaged environment for clients based on different offering in the hybrid multi-cloud platforms, including Cloud on cloud, IBM Cloud, OCI, AWS, GCI, Microsoft Azure, etc. Provisioning automation from client on-boarding, network automation and compute build automation for different environment thru centralized serviceMake sure the builds delivered as per design and offering standard and registered with corresponding managed tools, CMDB, etc with no manual intervention. Expected to provide solutions for cloud / virtualization network and compute automation workflowRequired Technical and Professional ExpertiseMinimum 7+ years of experience in IT industryProficient in Programming languages like Java and GOExperience in scripting languages like Python, JavaScript (NodeJS)Expertise in popular virtualization technologies (e.g. VMware, Openstack, Power, NSX) and micro services architectureSolid understanding in build automation frameworks - Bash, PowerShell, Chef, AnsibleAPI development and integrationContainer environment like KueUnderstanding of Hybrid cloud environmentAble to work with SQL and no-sql Dbs – mysql, mongo, etc.Preferred Technical and Professional ExpertiseGood scripting and API development skills.knowledge in Security concepts (CIS, ITCS104, PCI, Nessus)Expertise in cloud infrastructure automation tools (Terraform)In-depth knowledge in container platforms (e.g. Docker) and container orchestration (e.g. Kubernetes)Knowledge of problem and change management toolsAwareness of ITIL processes and procedures.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Orchestration", "Java", "Software Development", "API development", "MySQL", "Javascript", "Go", "AWS", "SQL", "Python"]}