{"JOB DESCRIPTION": "Roles and ResponsibilitiesIntroductionSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do. Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide. At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.Your Role and ResponsibilitiesOrchestration team belong to Orchestration tribe under GTS Infrastructure Foundational Services organization. Our goal is to design, develop and deliver automated, secure and compliant managed/unmanaged environment for clients based on different offering in the hybrid multi-cloud platforms, including Cloud on cloud, IBM Cloud, OCI, AWS, GCI, Microsoft Azure, etc. As Developer, you are responsible for: Provisioning automation from client on-boarding, network automation and compute build automation for different environment thru centralized service. Make sure the builds delivered as per design and offering standard and registered with corresponding managed tools, CMDB, etc with no manual intervention. Expected to provide solutions for cloud / virtualization-based network and compute automation workflow.Demonstrate expertise on Redhat based tools like Openshift, Ansible, kubernetes and other cloud based automation tools. Required Technical and Professional ExpertiseMinimum 8 years of experience in IT Industry, with minimum 3 years relevant experience in application developmentProficient in programming languages like Java and GOValidated experience in scripting languages like Python, JavaScript (NodeJS)Expertise in popular virtualization technologies (e.g. VMware, Openstack, Power, NSX) and micro services architectureSolid understanding build automation frameworks - Bash, PowerShell, Chef, AnsibleHands-on experience on API development and integration, Container environment like KueExposure to Hybrid cloud environment and ability to work with SQL and no-sql Dbs – mysql, mongo, etc.Proven experience in Redhat tools like Openshift, Ansible, kubernetesPreferred Technical and Professional ExpertiseProven scripting and API development skills and valid knowledge in Security concepts (CIS, ITCS104, PCI, Nessus)Experience in cloud infrastructure automation tools (Terraform) and knowledge in container platforms (e.g. Docker) and container orchestration (e.g. Kubernetes)You love collaborative environments that use agile methodologies to encourage creative design thinking and find innovative ways to develop with cutting edge technologiesAmbitious individual who can work under their own direction towards agreed targets/goals and with creative approach to workIntuitive individual with an ability to manage change and proven time managementProven interpersonal skills while contributing to team effort by accomplishing related results as neededUp-to-date technical knowledge by attending educational workshops, reviewing publicationsAny Degree, BE/B.Tech or MCA from a reputed institute.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization, B.Tech/B.E. in Any Specialization", "PG": "MCA in Computers", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Java", "Software Development", "Terraform", "MySQL", "Scripting Languages", "Go", "Javascript", "Bash", "AWS", "Kubernetes"]}