{"JOB DESCRIPTION": "     LTE Software Development,  you will play a critical role in designing software architecture , development,  testing and validation LTE SW solutions for Cellular Wireless Base- station. The job responsibilities include,  but not limited to the following:    \n\n \n    Architect ,  design,  implement and test real- time L2/ L3 software for LTE/ LTE- A Cellular base station.   \n    Port LTE L2/ L3 SW on real- time embedded platform,  optimize the stack for performance,  memory utilization and ensure that design meets performance requirements.   \n    Work with Systems and Test teams to take SW through unit tests,  integration tests and stress tests using testing tools and real UE Help IOT team with IOT,  characterize and optimize L2/ L3 stack performance in lab and in the field using test equipments and commercial UEs   \n \n\n    Requirements:    \n\n \n    8  years of experience in developing LTE SW for Mobile Wireless Standards such as LTE, UMTS,  CDMA2000/ EV- DO   \n    Prior experience with L2/ L3 SW implementation for LTE is a strong plus   \n    Comprehensive understanding of LTE / LTE- Advanced Standards is strongly desired   \n    Must have experience with various aspects of LTE L2/ L3 SW delivery:  Real- time implementation,  debugging,  system test,  validation and SW qualification   \n    Prior experience in SW development for multicore is a strong plus.   \n    Strong expertise in C, C  ,  Linux and embedded programming concepts:  SW task scheduler,  Multi- threaded system,  Memory management.   \n    Must have experience in testing/ debugging software on Real Time development platform. Sound theoretical background in Communications and Signal Processing is a plus.   \n    Must have the ability to multi- task in a fast paced environment.   \n    Must have effective interpersonal,  teamwork,  and communication skills.   \n    Demonstrates good analysis and problem- solving skills.   \n    Linux programming experience is a strong plus.   \n \n  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - Telecom Software", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["umts", "development", "software development", "c", "software", "l2", "testing", "mobile", "developing", "mac", "linux", "design", "debugging", "wireless", "lte", "embedded", "programming", "architecture"]}