{"JOB DESCRIPTION": "  Position Summary     Evolent Health is looking for a Software Engineer who will be responsible for building and maintaining healthcare software solutions while working and collaborating with our cross-functional teams in San Diego, Chicago and India.     Essential Functions     Research, troubleshoot, debug and support Aldera Web Portal products     Develop and maintain Aldera software products based upon technical specifications and/or verbal direction.     Document changes, perform basic unit testing tasks, maintain versioning requirements and uphold all company development standards as related to the software development life cycle     Devise and create test data, test plans and benchmark measures of application performance     Assist Quality Assurance teams in debugging and testing developed software products     Perform peer reviews of software development efforts to ensure accuracy and maintainability     Communicate and interact with Quality Assurance, Business Analysis, Hosting Services/IT and Project Managers to ensure project success measure by timelines and quality measures while adhering to the SDLC.     Perform other duties as assigned     Key Competencies / Skill / Success Factors:     Proven working experience on Front end technologies like HTML5, JavaScript, CSS3, Jquery     Knowledge of Web Services JAX-RS, JAX-WS     Experience working with web servers like JBoss, Tomcat or similar     Hands on experience in designing and developing applications using Java EE platforms     Object Oriented analysis and design using common design patterns.     Insight of Java and JEE internals (Classloading, Memory Management, Transaction management etc)     Excellent knowledge of Relational Databases, SQL and ORM technologies (JPA2, Hibernate)     Experience with test-driven development     Qualification and Experience:     Required      BS degree in Computer Science, Engineering or a related subject     Proven hands-on Software Development experience     Proven working experience in Java and JavaScript development (3-5 years)     Big plus      Healthcare experience a plus     Experience with Salesforce and Jira  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["SAN", "Hibernate", "Tomcat", "Web technologies", "jQuery", "JBoss", "Business analysis", "Javascript", "SDLC", "SQL"]}