{"JOB DESCRIPTION": "       About the Role            This is a Senior Full Stack Engineer, lead/individual contributor role. Individual will be working as a developer as well as responsible for test automation. The team member will be part of the agile team, collaborate with stakeholders & multiple middleware teams to support development and maintenance of applications.            Responsibilities:             Build efficient and high performing solutions to meet business requirements                Analyze and suggest optimal tool and Framework appropriate for the use case instilling best practices of software development                   Drive the design conversations to arrive at best possible solutions for multiple parallel initiatives                   Provide Business value through innovation and continuous improvement                   Continuously find opportunities to refactor and reduce technical debt                   Demonstrate strong written and oral communication skills; proven ability to work with end users to understand and transform requirements to solutions                   Conducts peer code reviews and design reviews                   Perform Impact Analysis for Functional / Non Functional for release epics                   Lead and mentor junior technical team members                   Necessary presentation and documentation for technical artefacts                    Ensure Release software meets all requirements of Security, Quality, Extensibility, Performance, Reusability                   Shall use/perform modern build strategies, continuous integration, unit testing, test driven development, static analysis, and automated integration tests.                   Implement Test-Driven Development (TDD) and Behavior-Driven Development (BDD) practices                   Should be able to contribute actively to In sprint automation                   Facilitate communications within the team and facilitate knowledge sharing amongst the team and other personnel.                   Define & execute the test strategy                 Essential Qualifications             10+ years of web application development using Java/J2EE                Strong knowledge of Java, Spring, Hibernate, JQuery, Angular JS, HTML, JSON, XML, WebLogic/Tomcat and Web Services                   Proficient in ReactJs/Angular Front end framework                   Hands on working experience in cloud technology platforms like Amazon Web Services or Pivotal Cloud Foundry                   Should have strong knowledge of Microservices and associated design patterns and Spring Boot                   Knowledge of Junit, Mockito and other testing frameworks                   Strong hands on experience in OOAD, Multi-threaded application development, design and implementation of web applications, data structures and design patterns.                   Strong working experience in Test Driven Development (TDD) practices                   Working experience of development ecosystem of applications like Jira, Confluence, ALM etc.                   Experience in working with globally distributed teams following Agile methodology and Scrum                   Experience in working with RDBMS and noSQL databases.                   Experience in working with modern CI/CD tools and related ecosystem of applications - Bamboo, uDeploy, Jenkins, Artifactory, Maven etc.                   Experience using source control tools like Git, SVN etc.                   Proficiency in using code analysis and debugging tools                   Should have strong communication and presentation skills               Desired Qualifications             Exposure to Splunk dashboards and App dynamics                Knowledge of Event Driven Architecture                   Experience in Behavioral Driven Development (BDD) & Domain Driven Development (DDD)                   Prior experience in development of enterprise scale banking applications will be a plus.          ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Hibernate", "jQuery", "XML", "Weblogic", "OOAD", "HTML", "test driven development", "JSON", "Application development", "Middleware"]}