{"JOB DESCRIPTION": "      About the role:-   Define, Design, Develop, Review solutions to meet the business and strategic requirements.   Design, Develop, test, enhance, implement new/change existing features/functionalities, develop new tools and work on POCs.         Essential Qualifications   Bachelors Degree with 6+ years of Java development experience. This includes full life cycle development and understanding of application development methodologies, as well as experience in n-tier architecture.   Strong skills in JAVA/J2EE, Spring Modules(Core, MVC, Batch, Integration, Boot, Messaging), JAX-RS, SQL, PL/SQL, UNIX, XML, JSON.   Good to have knowledge and experience with industry standard messaging products like IBM MQ, Apache Kafka, ActiveMQ, RabbitMQ etc.   Demonstrated Object-Oriented Design (OOD)/Object-Oriented Programming (OOP) skills.   Experience in desktop & mobile development, design patterns and principles.   Working experience in TDD - JUnit and mocking frameworks to write Unit tests.   Hands-on experience with Fortify, Sonar and other Static code Analyzers, Knowledge on OWASP Top 10 Vulnerabilities. Understanding of architecture frameworks and development methodologies of n-tier systems   Experience with Cloud Migrations and Cloud Native App Development, 12 factor, PAAS, SAAS,PCF,AWS   Extensive experience in designing patterns of Java, Spring Core, Spring Boot based green-field development projects.         Desired Qualifications   Good to have an understanding of BDD   Experience working with Front End Technologies like Node JS, Angular JS , REACT JS , HTML5, jQuery, AJAX, CSS    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Unix", "SAN", "jQuery", "XML", "PLSQL", "Application development", "JSON", "MVC", "Apache", "Ajax"]}