{"JOB DESCRIPTION": "         About the Role     Developers with solid experience into microservice architecture, having an innovative mindset and with a blend of scripting, developing, and testing skills with exposure to devops process10 years experience of hands-on IT experience in developing highly integrated, secure web-based applications using Java/J2EE Work with development teams and product owners to ideate software solutions       Responsibilities              Design client-side and server-side architecture              Build the front-end of applications through appealing visual design               Develop and manage well-functioning databases and applications               Write effective APIsTest software to ensure responsiveness and efficiency               Create security and data protection settings               Build features and applications with a mobile responsive design               Write technical documentation               Work with architects and analysts to improve software.               Perform peer code reviews               Experience of testing frameworks ex; Junit/Selenium/Cucumber.               The developer is expected to write and execute functional test cases as part of Agile team               Relationship experience with business partners (SMES, stakeholders, PMs) and technology partners (data analysts, application developers, QA analysts)               Ability to assess and solve problems, grasp concepts quickly, and design solutions               Essential Qualifications               Bachelor in engineering or in equivalent discipline with 10+ years of experience              Proven experience as a full stack developer               Experience developing desktop and mobile applications               Familiarity with common stacks               Knowledge of multiple front-end languages and libraries               Knowledge of multiple back-end languages and javascript frameworks               Familiarity with databases, web servers and UI/UX design               Wide Core Java Development experience.               Experience developing solutions on a web application platform, Development expertise in the following web technologies: Java, Spring, Hibernate, Web Services etc.               Hands on Experience with Microservies, Sprint boot, Spring Cloud and Netflix cloud ecosystem of technologies               Must have Experience in deploying application in Cloud, preferably Pivotal Cloud Foundry               Must have Experience in deploying applications using Event driven architecture using KEES (Kafka Enterprise Event Streaming)Rich experience working in Agile environment               Hands on experience adopting and implementing engineering practices such as TDD, BDD, Developer lead functional automation, Automated deployment               Experience in recommending changes to application architecture with knowledge in infrastructure aspects and good ability to articulate to stakeholders.               Skilled in configuration management aspects incl. Jenkins, Maven, UDeploy, Apache Ant usage               Direct experience with one of Tomcat and WebLogic               Familiarity with mortgage data and lending processes        ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Hibernate", "Core Java", "Automation", "Tomcat", "Weblogic", "Configuration management", "Javascript", "Agile", "Selenium", "Apache"]}