{"JOB DESCRIPTION": "  Experience:   3+ years    Strong design and development skill in C     Job Responsibilites:    Be an individual contributor to the assigned modules and to support the team technically    Being the subject matter expert for the given subsystem or module and be the focal point of contact for them.    Acquire and impart domain knowledge to the team members.    Implement new features and extend existing functionality; take up complete ownership of the assigned work as part of Scrum team    Work closely with technical leads and architects to gather detailed requirements to design and implement features.    Work closely with hardware team to enable board bring up for new devices.    Work with fellow developers on software for timely delivery of products.    Review/Write design documents for new features and drive sign-off.     Technical Skills:    Linux Embedded SW development (kernel and user space)    Debugging on target (JTAG, gdb)    Exposure to network or any automation tools    Wi-Fi 802.11 protocol and application development will be an added advantage.    Has worked independently in incorporating small to medium features and delivering the product to other teams.    Experience in working on Network protocol level, Management plane is a plus.    L2/L1 Networking knowledge is added advantage.    Exposure to RDK- B will be added advantage    Good communication skills. Email communication and documentation should be clear and crisp.    Exposure to Agile methodologies, specifically Scrum    SW development/mgmt tools - knowledge of source versioning systems (GIT), JIRA, Coverity is a plus  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["JTAG", "GIT", "Linux", "Networking", "Debugging", "Agile", "Application development", "Scrum", "Subject Matter Expert", "JIRA"]}