{"JOB DESCRIPTION": "  Job Overview    This position involves development of software applications, modules, libraries, and tools for configuration, operation, and management of the base station. The team targets its solutions for multi-server, multi-core, real time networked Linux and embedded platforms that generate a rich set of diagnostic data used in system verification. Development will be done in C/C++ and Python.     The base station program provides internal solutions for prototyping and verifying of the latest modem technologies. Projects within this program currently provide solutions in 5G NR, 4G LTE, IoT, and C-V2X standards. Product teams are comprised of multiple disciplines (Software, Test, Systems, and Hardware Engineers) providing custom designed, cutting edge, end-to-end solutions.     The ideal candidate will have experience in software application lifecycles, work collaboratively within a team, be capable of debugging and troubleshooting system level problems, and learn new technologies as needed.     All Qualcomm employees are expected to actively support diversity on their teams, and in the Company.    Minimum Qualifications    4-6 years of software experience in following areas    Experience with C++/C application development   Experience developing in Python   Experience with a modern source code version control system   Experience with basic IP networking concepts and programming   Experience in Software application development lifecycle   Experience with the Linux command line environment   Experience working collaboratively within a team   Experience in debugging and troubleshooting problems     Preferred Qualifications     Experience with CentOS Linux     Willingness to learn new technologies as needed.   Experience in developing Object Oriented Frameworks and reusable software modules.   Experience in using Linux System Calls, Networking, Inter Process Communication etc.   Experience with CentOS Linux and real time tuning   Experience with trouble shooting performance issues for real time systems.   Understanding of 4G/5G wireless systems.     Keywords     Python, C++, Linux, Networking, CentOS, Development     Educational Requirements     Masters/Bachelors degree in Computer/Electrical/Electronics Communication Engineering  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Wireless", "C++", "Version control", "Linux", "Networking", "Debugging", "Application development", "Troubleshooting", "Communication engineering", "Python"]}