{"JOB DESCRIPTION": "       Position Summary & Key Areas of Responsibility    Retail DevOPS/Build Engineer (SCM) is responsible for the CI/CD process, systems administrator, VM management and build generation for the Advanced Checkout System (ACS). The candidate must have strong communications and technical skills in order to maintain the customer source code archives/branches. The candidate must also be able to facilitate the delivery of software updates to the customer on an as needed basis. The candidate will work closely with developers and testers to gather and submit code versions and configuration information in reference to the ACS Software Suite.     Essential Functions:     Act as the gatekeeper to the customer source code archives/branches.   Monitor activity within each customer archive/branch.   Monitor customer build JIRA statuses to ensure builds are generated in a timely manner.   Perform periodic, non-production builds of the archive/branches.   Maintain and provide information about past deliveries and historical archive information.   Maintain and revise customer operating environments.   Maintain communications with customer contact points (Level 3: Customer Facing Team Members; Project Managers)   Provide consultation services in reference to the customer software and delivers.   Implement process improvements to gain operational efficiencies.   Must possess excellent oral, written and troubleshooting skills.    Basic Qualifications     Bachelor s degree in a related area (Computer Engineering, Computer Science, Computer Information Services, Management Information Services) or equivalent industry experience.   Must exhibit good judgment in decision making.   Ability to work independently - willing to ask tough questions and investigate / experiment to find answers.   Previous experience with software development, infrastructure development, or development and operations.   InstallShield Development experience.   Experience with database SQL, CI/CD tools, scripting such as JavaScipt, PHP, Python, Perl, Ruby, .NET, and Agile workflow methodologies.   Familiar with Installation procedures/mechanisms for Visual Studio 2008     Preferred Qualifications    Experience:    3+ years with DevOps, Build Engineer or System Configuration Manager experience.   Build automation.    Preferred Skills:    Knowledge of Agile methodologies   Experience with some of the following.    Jenkins automation   InstallShield developer   GitHub     Experience with designing and implementing software installation / upgrade processes for user sites (e.g., Windows Installer, InstallShield) a plus.   Experience automating build and installation processes.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Automation", "Agile", "PHP", "Workflow", "Perl", "Windows", "Visual Studio", "Troubleshooting", "Ruby", "Python"]}