{"JOB DESCRIPTION": "Roles and Responsibilities  Development      and deployment of integrated solutions to enhance, consolidate, and      coordinate independently designed applications enterprise-wide; assist in scheduling      and coordinating project deliverables.Determine      how existing applications, legacy systems, third-party applications,      databases, web/mobile interfaces, and hardware, possibly running on      multiple platforms, integrate to meet new and emerging enterprise      requirements;Develop      efficient methods to reuse existing components.Strong      experience in program design, coding, benchmark testing, debugging, and      documentation under general supervision.Applies      thorough technical knowledge and understanding of business applications      required to facilitate the development of supporting knowledge      architecture and standards.Collaborate      with cross-functional teams to determine business requirements.Assist      in component and data architecture design, software, production      evaluation, and buy/build recommendations.Possess      expertise in process and data modeling, architecture development and IT      planning methodologies, as well as extensive knowledge of enterprise      business and decision-making processes.Strong      team skills to gain credibility with business users, stakeholders, and      must possess the ability to work with other IT team members to ensure      solid cross-functional decisions are made by the team.Design,      execute, assess, and troubleshoot software programs and applications.Provides      support in configuration, coding, developing, and documenting software      specifications throughout the project life cycle.Prepare      Oracle Functional, Technical Design documents and Unit test documents for      the related areas.Performs      other duties as assigned.Desired Candidate Profile  Four (4)      year degree or equivalent experienceAt least      7 years experience in using Oracle eBusiness applications, strong understanding      in Oracle ‘Procure to Pay’ process and experience in implementation and      customization for the following modules: Purchasing, Procurement,      Sourcing, iSuppler, Inventory and Order Management.At least      7 years of Development experience with Oracle EBS. Strong experience in Developing,      extending, customizing and retrofitting Business requirements using Oracle      development tools and languages. At least      5 years of development experience with Oracle Framework (OAF)      technologiesShould      have Strong development experience using languages like SQL, PL/SQL, JAVA and      Unix. Should      have good working experience on RICE components like; XML Publisher,      Workflows and Interfaces (API)Should have good working experience with      CEMLI and should have done handful of customizations, extensions and      personalization’s. Preferred      knowledge/experience with Web services, XML gateway and SOA.Its nice      to have OTM knowledgeDemonstrates      strong knowledge of concepts and theories in own discipline.Perceived      internally and externally as technically knowledgeable in the specific      modules assigned.Demonstrates      ability to teach others the technical and functional knowledge and skills      needed to achieve results at the optimum level of performance.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["Unix", "Java", "Rice Components", "SOA", "Oracle E-Business Suite", "OTM", "cemli", "SQL", "Interfaces", "OAF", "Oracle Application Framework", "XML Publisher Reports", "API"]}