{"JOB DESCRIPTION": "     You will provide technical leadership to software engineers by coaching and mentoring throughout end-to-end software development, maintenance, and lifecycle to achieve project goals to the required level of quality; promote team engagement and motivation.   You will provide input to the software engineering manager for estimates, resource needs, milestones and risks; ensure effective delegation, monitoring tasks, identifying risks and handling mitigation and escalations.   You will provide hands-on technical and functional input to design, maintenance, build, integration and testing of complex software components according to functional and technical design specifications; Follow software development methodologies and release processes   You will analyze and provide input for the requirements and provide impact assessment for new features or bug fixes. Make high-level design and establishes technical standards.   You will represent and lead discussions related to product / application / modules / team and build relationships with internal customers/stakeholders   You will enforces quality processes (such as performing technical root cause analysis and outlining corrective action for given problems), measure them and takes corrective actions in case of variances and ensure all the project agreed deliverables are completed to the required level of quality.                6 years of experience.                   Previous experience in leading software engineers through project lifecycle.                   Thorough understanding of software development methodologies using agile principles and experience in conducting all key agile ceremonies.                   At least 5 years? hands-on experience as a Java software developer                   At least 1 years? experience working as a Scrum Master/Team Lead in a medium/large scale company in Agile/DevOps methodology.                   At least 2 years? working experience in projects on Microservices and Cloud.                   Experience in managing a team of at least 5 to 7 employees                   Working experience on Spring, Containerization and Automated deployment. For example, Docker, Openshift/Kubernetes, Helm charts                   Working experience on CI processes (Jenkins preferred), version control (GIT preferred) and Artifact repositories (Nexus preferred)                 Why you will love this job:      You will be challenged with leading and mentoring a small development team   You will be challenged with leading the technical aspects of the project   You will have the opportunity to work in a growing organization, with ever growing opportunities for personal growth   You will have the opportunity to work with the industry most advanced technologies         ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Root cause analysis", "Software development methodologies", "software engineering team lead", "Version control", "GIT", "Technical design", "Agile", "Scrum", "High level design", "Monitoring"]}