{"JOB DESCRIPTION": "  POSITION SUMMARY & KEY AREAS OF RESPONSIBILITY:       Expected to stay current with technologies and to learn new technologies, processes, and trends. Expected to seek a greater understanding of the business, and business processes, disseminate knowledge to team members, form best practices.       Design and Develops high quality software which meets requirements, promote re-use of software components and facilitates ease of support, possess good understanding of design patterns.       Analyse, design and implement software mechanisms to improve code stability, performance, and reusability.        Assist others in estimating task effort and dependencies, responsible for team commitments within the Sprint. Pro-actively identify and implement process, best practices and tools improvements to improve quality and performance.       Provide input and technical content for customer facing documentation, user help materials and customer training.       Required to be a source of innovative ideas not only for products but also processes affecting the development projects and personnel.       Have a strong desire for quality, and an attention to detail; excellent analytical skills. Ability to multi-task and prioritize in a fast-paced environment. Ability to work effectively in a team environment composed of peers and cross-functional members       Judgment skills needed to assess high-risk areas of a system problem, on which to focus efforts. Work independently with limited supervision.       Solid troubleshooting & problem-solving skills involving complex systems. Strong aptitude for learning quickly                       BASIC QUALIFICATIONS:      Bachelor s Degree in a technical discipline     4-8 years of related experience      REQUIRED SKILLS:     Very strong skills in Core Java.   Strong object-oriented programming skills   Good understanding of XML, multi-threading and serialization   Having .Net, Message queues with STOMP and Protobufs is an added advantage   Good understanding of Test Automation frameworks.   Good understanding of Continuous Integration and Delivery practices   Good understanding of Secure Development Lifecycles.   Good understanding of Windows 7 and Windows 10.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization, B.Tech/B.E. in Production/Industrial", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Hospitality", "continuous integration", "Core Java", "XML", "Healthcare", "Support services", "Windows", "Troubleshooting", "Object oriented programming", "Recruitment"]}