{"JOB DESCRIPTION": "   Required Skills/Experience      Bachelor's degree or foreign equivalent in Computer Science or Information Technology   7+ years of experience developing and designing software applications using Java   Expert understanding of core computer science fundamentals including data structures, algorithms, and concurrent programming   Expert in analyzing, designing, implementing and troubleshooting software solutions for highly transactional systems.   Expert in OOAD and design principals, implementing micro services architecture using JEE, Spring, Spring Boot, Spring Cloud, Hibernate, Oracle, CloudSQL PostgreSQL, BigTable, BigQuery, NoSQL, Git, IntelliJ IDEA, Pub/Sub, Data Flow.   Experience working in Native & Hybrid Cloud environment.   Experience with ETL tools.   Experience with Agile development methodology.   Excellent communication and team player with can-do attitude.   Ability to analyze user and business requirements to create technical design requirements and software architecture   Experience must also include:     Java   Java IDE like Eclipse or IntelliJ   Java EE Application servers like Apache Tomcat   Object-oriented design, Git, Maven, and a popular scripting language   JSON, XML, YAML, Terraform scripting languages          Preferred Skills/Experience:      Champion of Agile Scrum methodologies   Experience continuous integration systems like Jenkins or GitHub CI   Experience with SAFe methodologies   Deep knowledge and understanding to create secure solutions by design   Multi-threaded backend environments with concurrent users   Experience with tools or languages like:     Ruby, Python, Perl, Node.js and bash scripting languages   Spring, Spring Boot   C, C++, Java and Java EE development experience   Oracle   Docker   Kubernetes    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["C++", "Hibernate", "XML", "OOAD", "Eclipse", "Data structures", "Perl", "JSON", "Oracle", "Python"]}