{"JOB DESCRIPTION": "     About the Role        This is a Senior Java Engineer,      individual contributor role.      Individual will be working as a developer as well as responsible for test automation. The team member will be part of the agile team, collaborate     with stakeholders & multiple middleware teams to support development and maintenance of application under fraud management.         Responsibilities:           Build efficient and high performing solutions to meet business requirements           Analyze and suggest optimal tool and Framework appropriate for the use case instilling best practices of software development           Drive the design conversations to arrive at best possible solutions for multiple parallel initiatives           Provide Business value through innovation and continuous improvement           Continuously find opportunities to refactor and reduce technical debt           Demonstrate strong written and oral communication skills; proven ability to work with end users to understand and transform requirements to solutions           Conducts peer code reviews and design reviews           Perform Impact Analysis for Functional / Non Functional for release epics           Lead and mentor junior technical team members           Necessary presentation and documentation for technical artefacts            Ensure Release software meets all requirements of Security, Quality, Extensibility, Performance, Reusability           Shall use/perform modern build strategies, continuous integration, unit testing, test driven development, static analysis, and automated integration tests.           Implement Test-Driven Development (TDD) and Behavior-Driven Development (BDD) practices           Should be able to contribute actively to In sprint automation           Facilitate communications within the team and facilitate knowledge sharing amongst the team and other personnel.           Define & execute the test strategy                    Mandatory Skills              12 + years of experience in Java/J2EE Web Application Development, , Spring        (Core, MVC, AOP, Batch), Sprint boot, Selenium, HP ALM, GIT, Maven/Gradle,       Hibernate, JSP, Servlets, HTML5, JavaScript, Ajax, jQuery, XML, JSON, Angular/React JS,       Kafka (streaming technologies), integration technologies,                   Strong knowledge and understanding on Cloud Technologies (AWS/PCF), and NoSQL database                     Strong in OOAD, Multi-threaded application development, design and implementation of web applications, Design Patterns                      Hands on Experience in using BDD testing frameworks (Cucumber, karate etc)                       Excellent understanding of defect life cycle, hands on experience in HP ALM, test plan & test case design, execution, defect management and analyzing results.                       Good understanding on service virtualization & Web Services (REST, SOAP etc.)                       Experience with Applications Performance Tuning, Scaling, Security, Resiliency Best Practices                       Hands on experience in delivering high value projects in Agile (SCRUM) methodology using preferably JIRA tool.                      Experience with Product Development, Large Enterprise Scale Integrations (preferably in design/development of customer facing large enterprise applications)                     Problem solving & critical thinking                      Good business communication skills in English            ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Business communication", "Automation", "Enterprise applications", "XML", "Application development", "Continuous improvement", "Information technology", "Virtualization", "Analytics", "Ajax"]}