{"JOB DESCRIPTION": "      About the Role        This is an individual contributor role. The team member will be part of the agile team, collaborate with stakeholders & multiple middleware teams to support development and maintenance of application under fraud management.         Responsibilities:                  Build efficient and high performing solutions to meet the business requirements              Participate effectively in the entire software development life cycle                 Define and Design solutions to meet the business and strategic requirements                 Organize, lead and motivate development resources to meet expected deliverables and quality standards across multiple releases                 Provides technical direction to the project team and perform code reviews                 Collaborate with team to design, develop, test and refine deliverables that meet the objectives                 Should be able to contribute actively to In sprint automation                 Handling all production support escalations and EACO calls during India day hours                 Motivate team members and promote a strong sense of support, ownership and urgency                 Facilitate communications within the team and facilitate knowledge sharing amongst the team and other personnel.              Collaborate with Product Managers, System Architects, Analysts and any other stakeholders as needed              Define & execute the test strategy across the consumer banking applications.                                 Mandatory Skills           Core skills 8 to 11 years Java/J2EE Web Application Development, Spring (Core, MVC, AOP, Batch), Sprint boot, Kafka (streaming technologies), integration technologies, knowledge on Cloud Technologies (AWS/PCF), Oracle, NoSQL database.              Strong in OOAD, Multi-threaded application development, design and implementation of web applications, Design Patterns                 Product & Design Knowledge - Experience with Product Development, Large Enterprise Scale Integrations (preferably in design/development of customer facing large enterprise applications)                 Experience in Consumer Banking or any complex middleware applications                 API - driven development - Experience working with remote data via SOAP, REST and JSON.                 Experience with Applications Performance Tuning, Scaling, Security, Resiliency Best Practices                 Hands on experience in delivering high value projects in Agile (SCRUM) methodology using preferably JIRA tool.                 Unit Testing (JUnit preferred)/ TDD - Scripting & Automated Testing, Continuous Integration and deployment (Jenkins)                 Good business communication skills in English                 System Knowledge & Analysis                 Problem solving & critical thinking                             Skills and Certifications:              Technical requirements include the following:    (1) 4 year or graduate degree in Computer Science or engineering  (2) 7-11 years of hands-on software architecture, design and development experience  (3) Experience in Java/J2EE, Spring, spring boot, , Hybrid Application development  (4) Strong knowledge in OOAD, Multi-threaded application development  (5) Experience in Behavioral Driven Development (BDD) & Domain Driven Development (DDD)  (6) Certification in AWS Associate level / Pivotal Cloud Foundry (PCF) developer  (7) Work experience with SVN, Maven, GIT, Gradle, AppDynamics, Splunk etc. DevOps tools.      ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Business communication", "Maven", "Automation", "Production support", "Enterprise applications", "Application development", "Oracle", "Information technology", "Analytics"]}