{"JOB DESCRIPTION": "         You will take ownership and accountability of specific modules within an application and provides technical support and guidance during solution design for new requirements, problem resolution for critical / complex issues.           You will ensure code is maintainable, scalable and supportable.           You will present demos of the software products to stakeholders and internal/external customers, using knowledge of the product/solution and technologies to influence the direction and evolution of the product/solution.           You will investigate issues by reviewing/debugging code and providing fixes (analyzes and fixes bugs) and workarounds, will review changes for operability to maintain existing software solutions, will highlight risks and will help mitigate risks from technical aspects.           You will represent/lead discussions related to product / application / modules / team (for example, leads technical design reviews). Builds relationships with internal customers/stakeholders                Bachelor's degree in Science/IT/Computing or equivalent            Excellent functional and technical knowledge on Cramer 8 or higher version             Excellent Communication (verbal & writing) and analytical skills.           Excellent skills on Java, web services and Angular JS             Why you will love this job:          You will serve as an expert on specific technology and domain.            You will take an active role in technical mentoring within the team.           You will have the opportunity to work in a growing organization, with ever growing opportunities in other domains.          ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Telcom, ISP", "FUNCTIONAL AREA": "IT Software - Systems, EDP, MIS", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Analytical skills", "Solution design", "Java web services", "Technical design", "Debugging", "Manager Technology", "Javascript", "Amdocs", "Software solutions", "Technical support"]}