{"JOB DESCRIPTION": "    You will design, develop, modify, debug and/or maintain software code according to functional, non-functional and technical design specifications.  You will follow Amdocs software engineering standards, applicable software development methodology and release processes, to ensure code is maintainable, scalable, and supportable, and demo the software products to stakeholders.  You will investigate issues by reviewing/debugging code, provide fixes and workarounds, and review changes for operability to maintain existing software solutions.  You will work within a team, collaborate and add value through participation in peer code reviews, provide comments and suggestions, and work with cross functional teams to achieve goals.  You will assume technical accountability for your specific work products within an application and provide technical support during solution design for new requirements.  You will be encouraged to actively look for innovation, continuous improvement, and efficiency in all assigned tasks.       Bachelor's degree in Science/IT/Computer Science or equivalent  Years of experience : 3.5 - 5.5 years   Must Have  Full Stack Python Developers  Strong Work Experience in Python  Experience working on Kubernetes/Docker/Jenkins  Automation Testing   Good To have   Product Development Experience  Experienced working in C1/D1  AWS Certifications  FinOps Exposure ( AWS Trusted Advisor, Cost Explorer, Athena etc)  AWS Development - Lambda Functions etc        Why you will love this job:     You will be challenged to design and develop new software applications.  You will have the opportunity to work in a growing organization, with ever growing opportunities for personal growth.      ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Telcom, ISP", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Solution design", "Automation testing", "Technical design", "Continuous improvement", "Application software", "Amdocs", "Software solutions", "Technical support", "Python"]}