{"JOB DESCRIPTION": "  What part will you play      Senior Full Stack Developer Responsible for Design Development of software solutions based on requirements and within the constraints of architectural /design guidelines.   Requirement elicitation, Functional specifications, Feasibility analysis Estimation    Client Server-side architecture Usage Design   Work with development teams and product managers to ideate software solutions   Write effective APIs as per design complexity   Test software to ensure responsiveness and efficiency   Troubleshoot, debug and upgrade software   Knowledge of Git ( as code repository )   Own and deliver modules    Create security and data protection settings      Use your skills to move the world forward!      We need a BE / B. Tech / MCA / ME / M. Tech graduate in CS/IT/Electronics Engineering from a college/university of repute and having an excellent academic track record with 7 to 8 years of experience in IOT/Cloud software development. Experience in Industrial automation domain is an added advantage.   Experience in working on IOT/Cloud based projects   Programming experience in Angular, NodeJS, Opensource Database (SQLite/MongoDB/PostgreSQL)   Strong knowledge of IoT communication protocols: MQTT, OPC UA, REST APIs   Knowhow on Linux OS and internals   Strong knowledge in Object Oriented JavaScript programming skills, Design principles patterns   Excellent communication skills and ability to take up technical challenges   An analytical mind   Familiarity with common stacks   Working knowledge of Cloud Technologies (Azure/AWS), EC2, Cloud Architecture.   Knowledge of working with IOT 20XX(2040/2050) / Raspberry Pi / Beagle Bone hardware platforms   Experience on Industrial Protocols like Modbus, HART, and also FTP, SMTP, Serial Port and data formats like XML and JSON.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["SMTP", "FTP", "GIT", "Linux", "XML", "Postgresql", "Analytical", "SQLite", "Javascript", "JSON"]}