{"JOB DESCRIPTION": "      Join the Engineering teams and make an impact right away:             Develop highly scalable and mission critical applications and platforms using modern Cloud Technologies and Programming Languages (e.g., Java, Golang, Python, JavaScript)            Function as core members of agile teams building products and solutions on a wide range of technology domains including Distributed Real-time Transaction Processing, Big Data and Analytics, AI/ML, omnichannel capabilities on native iOS, Android, Social Integration and Services/APIs            Work in collaboration with highly talented engineers in day to day activities and helping in review of design, coding and the other Software Development Life Cycle tasks            Be part of a culture of innovation and experimentation, constantly purse and learn industry leading/innovative technologies and solutions, and always be ready to try new concepts without fear of failure             Join the Service Assurance / Delivery teams and make an impact right away:             Provide support to Cloud and Native Infrastructure including Data Center Operations, Application Maintenance, Service Assurance and Operations Engineering.            Be accountable to create a frictionless customer experience by ensuring availability, performance, monitoring and faster incident response of platforms and services with optimal value along with vendor partner channels.            Develop and leverage expertise in the use of enterprise observability and service management tools.            Leverage the power of telemetry and operational data to analyse and recommend / implement service improvements and feature enhancements.            Be a champion of Automation to deliver superior Customer and Developer experience.            Contribute to the modernization of our core engineering platforms for Cloud, Network, Storage, Messaging etc. through the engineering and development of modern IaaS, PaaS and IaC (Infrastructure as code) capabilities.            Be part of a culture of innovation and experimentation, constantly purse and learn industry leading/innovative technologies and solutions, and always be ready to try new concepts without fear of failure             We have the know-how, technology and global reach to make nearly any idea a reality. All thats missing is you! Do you have?             Passion for technology and strong desire to learn.            Curious mind to explore new possibilities and act to them.            Never settle attitude and continuously looking for improvements.            Customer focus to think differently and deliver value to customers.            Data driven nature to drive decisions and results based on data.             Educational Requirements             The Candidate must earn bachelor s or masters degree in Computer Science, Computer Engineering, or other related technical discipline by June 2021.     ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Service management", "Computer science", "Engineer Trainee", "Automation", "Service assurance", "Coding", "Javascript", "Customer service", "Operations", "Analytics"]}