{"JOB DESCRIPTION": " Description:   Immersive Radical Digimedia is a specialized Digital Marketing and development Agency with a main aim to support its clients in increasing their business goals through online marketing activities. We want to change the way businesses market themselves using Digital media. Post Covid-19; there has been no other time as important as Now; where the world needs more marketing specialists. We are trying to play a small but significant role in this new normal to build a Digital Marketing company that has its customers at its core of its business. Here is our vision on what we as a company would like to offer with our Digital Marketing & Web Development service portfolio  You must have following key skills   Communication & Presentation Skills   HTML5, CSS3, Bootstrap, JavaScript, JQuery, Ajax, Mobile Responsive, Email Newsletter Design, WordPress  What is the purpose of hiring for this position    To build websites & applications that focus on making money for the business   To make a difference and change the lives of small business owners   To build and nurture a team of exceptionally talented people   To build an environment of Trust, Leadership & Good corporate governance   Responsibility to perform day to day basis:    This is an end to end client facing job , where you are expected to reach to the client to get the requirement, find out solution, coordinate with the team as per our SOP and deliver within deadline   Creative ideas when choosing or implementing solutions   Participate in the wireframe and PSD Design creation, take inputs from designers, share your inputs, get the approval from client, and translate designs into code.   You will have to be responsible for blog updation, speed optimization, security settings, SEO on page optimizations   Design, build, and maintain efficient, reusable, and reliable front-end code.   Identifies, troubleshoots, and resolves site and application issues; recommends and implements preventive measures to avoid future problems. Follow our checklist, SOP and concentrate on detailing.   Provides on-call support to customer or get further requirement as per service requirement   Maintains knowledge of emerging technology and best practices in website and application design and development.   Performs other related duties as assigned.   Identifying problems uncovered by customer feedback correcting or referring problems to appropriate team member for correction   Evaluating code to ensure it meets industry standards, is valid, is properly structured, and is compatible with browsers, devices or any operating systems   We need talented people who are:    Passionate about your work   Troubleshooting and problem-solving is at your core   Willing to commit to learning and continuous improvement   Disciplined in your approach & Motivated to give your best when it matters the most   Can blend in a team with ease and take on roles that can challenge your fears  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Construction, Engineering, Cement, Metals", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Front end", "jQuery", "Online marketing", "Web development", "Javascript", "Troubleshooting", "SEO", "Digital marketing", "Continuous improvement", "Ajax"]}