{"JOB DESCRIPTION": "Java Developer/Web Developer will provide technical support to SIGS customers and create unique solutions to meet various customer requirements using a combination of Web Technologies (JavaScript, Java, and HTML), SQL, and CAD or 3D modeling \"BIM\" tools used in ARCHIBUS Integrated Workplace Management Software. Support requests from strategic customers typically originate from system administrators or system integrators looking for assistance integrating their business processes with ARCHIBUS applications or solving problems that result from database customizations or data corruption.The Developer will participate in customer projects by developing solutions, testing results, and documenting the procedures under the direction of the Professional Services Solutions Manager. The person may be asked to independently investigate new deployment techniques as needed and may also be asked to participate in the development of web forms using the ARCHIBUS Web Central platform and its API's.ResponsibilitiesProvide technical support for customers.Review, analyze and report progress on assigned issues.Accept ownership for incoming issues from receipt through resolution.Support mission critical customer production environments.Create end user documentation and internal knowledge base.Required Skills/ExperienceStrong technical background with problem solving skills, troubleshooting ability, and attention to detail.Excellent verbal and written communication skills with both technical and non-technical individuals.Outstanding customer service skills.Ability to establish and maintain strong working relationships with key internal and customer personnel.Willingness to take on new challenges.Self-motivated with an intense appetite to learn.Web application experience (HTML5, JavaScript, Java).Experience developing on Oracle or SQL Server Databases.DesirableFamiliarity with AutoCAD or Revit.Experience with Eclipse Software Development Environment.Experience with Apache Tomcat or other Web Application Server Containers for J2EE.Previous Experience in Facility Management, Healthcare, or Higher Education industries.Experience with PHP, XML.Experience with Web services (SOAP or SOA).", "ROLE": "Software Developer", "INDUSTRY TYPE": "BPO, Call Centre, ITeS", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["SOA", "AutoCAD", "CAD", "Tools", "Healthcare", "PHP", "Oracle", "Troubleshooting", "Facility management", "Technical support"]}