{"JOB DESCRIPTION": "Analyzes, develops, designs, programs, debugs and implements embedded systems for the organization's products and systems. Develops testing and troubleshooting strategies, devices, and systems for firmware. Integrates firmware to maintain functionality, throughput and consistency. Develops user documentation.          Responsibilities       5 years of experience in software development   5 or more years of extensive experience in Java/J22, Spring, Spring Boot developing complex enterprise applications and B2B and B2C products   2 years of creating REST and SOAP webservices   Proficiency with testing tools (Junit)   1 year of experience with writing complex SQL queries and DSL queries   1 years of experience working with NOSQL or Elastic Search databases   Expertise in caching mechanisms and understanding of Java/J2ee design patterns   Ability to write clean, reliable and highly maintainable code   Thorough understanding of the responsibilities of the platform, database, API, caching layer, proxies, and other web services used in the system   Creating custom, general use modules and components which extend the elements and modules middle tier   Experience with AWS development is a plus   Experience with continuous integration and Continuous delivery is a plus   High level of comfort with git   Proven problem-solving abilities and affinity to take on complex challenges   Work with a team using Agile methodologies and Scrum   Professional with ability to properly handle internal and external confidential data   Ability to handle multiple projects/tasks, prioritize and meet deadlines   Persistence to follow up with all stakeholders to ensure requirements are met   Excellent communication skills both oral and written      Qualifications       Bachelor's or Master's degree   5 years work experience     ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Web services", "GIT", "NoSQL", "Testing tools", "Enterprise applications", "Agile", "Scrum", "Firmware", "Troubleshooting", "DSL"]}