{"JOB DESCRIPTION": " NextGen Healthcare Team: API Job Description:  Work closely with India development team and US leads to help drive the API development effort.  Design and develop software that meet the current and future requirements.  Chose and create tools and processes to increase development productivity.  Ensure the system will meet quality, security and scalability needs.  Build prototypes and POCs to validate and illustrate technologies and best practices.  Keep up to date with industry standards and trends, and initiate change when opportunities are identified.  Understand the business opportunities and company vision that guide the software architecture. Required Skills:  Minimum 3 years of experience in software development. (3 6 years)  Strong hands on experience on C#, REST, JSON, Web Service, WebAPI, Unit Test, SQL Server.  Understanding and solid programming skills in developing SQL queries, stored procedures, views and tables using SQL Server Strong understanding of object-oriented programming Experience in the designing and implementing CI/CD pipeline processes  Experience of working on Build and Release Process & DevOps related Activity with tools like Git, TFS and Perforce Exposure in working with AWS Cloud - EC2, Container, Lambda, S3, API Gateway etc Strong communication skills, analytical skills and presentation skills.  Knowledge on product development process, and systems architecture.  Knowledge on Cloud development, infrastructure and security.  Knowledge on multitenant and Web scale products.  Knowledge on broad mix of development technologies in the Microsoft and Web stacks.  In line with the current latest developments with the Microsoft and Web stacks.  Experience with SDLC/PDLC and Agile based scrum teamDesired Skills:  Experience with API development and developer programs. Exposure to US HealthCare domain  Experience with NextGen Ambulatory software.  Experience with medical IT standards and organizations such as HL7 and HIEs.  Knowledge of medical terminologies, data models and coding systems.  Experience at multiple levels of medical IT integration (Ambulatory, Inpatient, HIE, etc.) Required Education:  Bachelor’s degree in Software Engineering/Computer Science OR equivalent degree. Roles and Responsibilities Desired Candidate Profile Perks and Benefits ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["TFS", "Software Development", "Web Api", "Rest", "Web Technologies", "JSON", "SQL Server", "Object Oriented Programming", "AWS", "SDLC"]}