{"JOB DESCRIPTION": "Role: HL7 Interface Developer (Mirth) Summary of Position: As a HL7 Interface Developer, you will participate in the Requirements analysis and Development of different HL7 interfaces assigned to you. You will also be involved in doing the Unit Testing, Peer reviews and verification of test results against requirements. You will be interacting with onsite team member regarding the delivery, setting the proper expectation with him/her on delivery. You will also ensuring the deliver with high quality and standards to demonstrate the Accolite core value of excellence. Key Responsibilities:  Analyze the Requirements and prepare Technical Design Specifications document  Carry out Development and Unit testing activities  Carry out code reviews  Carry out testing and verify the test results against the expected results as per the requirements Qualification:  Experience in interface development using on leading healthcare integration engine Mirth.  Sound knowledge of JavaScript, HL7 and XML.  Exposure to SQL is must.  Knowledge of professional software engineering practices. Understanding of full software development life cycle, including coding standards, code reviews.  Strong technical Design and Development skills.  Ability to work effectively under pressure in a dynamic environment.  Ability to switch across multiple teams / products / applications and perform.  Experience in translating requirements into technical design specifications and documentation, as  well as executing development projects from conception to delivery.  Excellent verbal and written communication skills. If you are interested share your CV to mamatha.gedipudi@i2nexus.com ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["Software Development", "Life Cycle", "HL7", "Unit Testing", "Mirth", "Software Engineering", "Coding", "XML", "Javascript", "SQL"]}