{"JOB DESCRIPTION": " What we are looking for:  - Proficient in HTML5 and CSS3 - Expertise in atleast one JavaScript framework/library (like React, Angular, Vue etc) - Strong coding - Ability to create reusable components that run at 60fps - Familiarity with browser developer tools - Understanding of visual aesthetics Bonus Points: - Knowledge of SPAs and build tools (like webpack, parcel etc) - Experience with performance optimization of applications - Good command over data structure, algorithms Key Deliverables: - Develop very high sense of ownership, the zeal to build scalable applications  - Develop a deep understanding of the start-up ecosystem  - Work with a performance oriented team driven by ownership and open to experiments  - Build customer facing technology product for global customers  - Collaborate with development teams to help identify and develop reusable platforms/libraries. What we have to offer: - Work with a performance oriented team driven by ownership and open to experiments - Learn to design system for high accuracy, efficiency and scalability - No strict deadlines, focus on delivering quality work  - Meritocracy driven, candid culture. No politics - Very high visibility regarding which startups and markets are exciting globally About Tracxn:Tracxn (www.tracxn.com) is a Bangalore based product company providing a research and deal sourcing platform for Venture Capital, Private Equity, Corp Dev and professionals working around the startup ecosystem. We are a team of 600+ working professionals serving customers across the globe. Our clients include Funds like Andreessen Horowitz, Matrix Partners,GGV Capital and Large Corporates such as Citi, Embraer & Ferrero. Founders:Neha Singh (ex-Sequoia, BCG | MBA - Stanford GSB)Abhishek Goyal (ex-Accel Partners, Amazon | BTech - IIT Kanpur)", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required, Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required, Any Doctorate in Any Specialization"}, "KEY SKILL": ["front end", "front end developer", "css", "ui developer", "sse", "senior developer", "ui development", "data structure", "HTML5 & CSS3", "bootstrap", "javascript", "react.js", "d3.js", "node.js", "webpack", "web development", "software engineer", "software developer", "angularjs", "express.js", "frontend"]}