{"JOB DESCRIPTION": " What will you contributeReporting to the Development Manager, the Senior Java Developerdesigns, develops, analyzes, and maintains high-quality software product applications. This position is located in Bangalore.     ESSENTIAL DUTIES AND RESPONSIBILITIES    ?To perform this job successfully, an individual must be able to perform the essential duties and responsibilities satisfactorily. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.    ? Is responsible for a robust and efficient implementation   ? Suggests solution for short and long term   ? Participates and leads software design meetings and analyzes user needs to determine technical requirements.    ? Collaborates with team members and across groups to prepare technical specifications.    ? Designs and develops high-quality code.    ? Tests, debugs, analyzes and fixes application problems/ issues. Works closely with stakeholders to fix issues in a timely fashion.    ? Follows the software development lifecycle process. Suggests and implements techniques for software or development process improvements.    ? Participates in code reviews in accordance with program specifications and coding standards, practices and conventions, new designs, changes and enhancements.    ? Provides direction to less skilled employees. May design and implement training plans.    ? Interacts with internal and/ or external stakeholders to support product releases and/ or resolve program problems.    ? Researches and remains informed of new technology and development tools.    ? Other duties and projects as assigned.     QUALIFICATIONS REQUIRED KNOWLEDGE AND SKILLS    ? Knowledge of Agile software development methodologies and the software development lifecycle.    ? Familiar with standard Java libraries and frameworks (Jax, Spring, . . . )   ? Distributed Ledger (Corda) knowledge is a major plus.    ? Ability to provide solutions to a variety of technical problems of complex scope and complexity independently.    ? In-depth technical, analytical, and development skills.    ? In-depth knowledge of Java.    ? Effective verbal and written communication skills; effective customer service skills.    ? Ability to mentor less skilled software engineers.    ? Ability to work independently or within a team environment and handle multiple projects simultaneously.    ? The above statements describe the general nature and level of work being performed by people assigned to this job. They are not intended to be an exhaustive list of all responsibilities, duties, and skills required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Software design", "Software development methodologies", "Coding", "Analytical", "Agile", "Software development life cycle", "Mentor", "Customer service", "Sales Executive", "Spring"]}