{"JOB DESCRIPTION": " Job Title:  Software EngineerAbout PrimeSoft:PrimeSoft Solutions, Inc. is an outsourced Product Development   and Software services provider. We offer Product Development, Enterprise   Applications, Mobile Applications, Quality Assurance and DevOps Support Services   to clients from venture funded startups to publicly traded companies in Networking,   Telecom, Healthcare and Banking. About the Project:The client is a US based organization, serving smart manufacturing   companies globally and a leader in products and solutions for factory automation.   The clients IT infrastructure is hosted in AWS cloud platform and PrimeSoft   has been engaged by the client to provide DevOps Support for designing,   building and supporting production and non-production environments.Job Description:PrimeSoft is seeking senior software development engineers with extensive work experience in C#,   ASP.NET, ADO.NET, SQL Server (or other RDBMS), WCF, etc. to design, develop   and deploy enterprise applications. The Sr. Software Engineer will be responsible for designing and   developing new features, enhancing, optimizing and refactoring existing features   and work closely with internal team to improve the application deployment   & configuration process. The desired candidate is expected to fulfill the following   expectations:Ability to learn new   technologies and acquire necessary skills quicklyParticipate in   iterative development process with cross-functional teams (Development, QA,   Product Management, Customer Support, etc.)Participate in activities   such as collaborative coding, unit testing, and compliance with coding   standards to enhance quality of produced softwareAbility to work   independently and collaborate in a team-oriented environmentShould have   experience working with clients, and client driven projects.Desired Skillset:1. Good understanding   of SDLC including Requirements Analysis, Design, Development, Deployment and   Support2. Fundamental   understanding of SOLID object oriented design principles3. Good experience and   knowledge in software development involving analysis, design and development   with ASP.NET MVC models4. Excellent design and   coding skills using C# (3.0 or later), .NET (2.0 or later) on Windows 32 and   64 bit OS or equivalent5. Knowledge and   working experience in Windows Forms Applications, Windows Console   Applications, WPF Applications, WCF, Unit Testing Frameworks, Scripting, Web   Forms, MVC and .NET Core is a plus,6. Experience with Code   review tools like Sonar / Resharper etc.7. Knowledge of   building, packaging software and hands on experience in Windows / MS   Installer is desired8. Experience in   writing automated unit tests using NUnit, Microsoft Unit Test Framework,   xUnit.NET, etc.9. Should have   experience in database design fundamentals, constraints, relationships etc.   and hands-on experience with SQL Server or other RDBMS10. Experience with Git   /Github / Gerrit and Visual Studio IDE is desired11. Good knowledge HTTP   and familiarity with UI technology stack (HTML, CSS, JavaScript, etc.) is   desired12. Knowledge in   JavaScript frameworks such as Angular / React is a plus13. Hands on   experience with PowerShell is plus14. Knowledge of   industry standards in coding and documentation15. Proven ability to   work in a fast paced Agile-Scrum environment with frequently changing   priorities and stringent deadlines16. Excellent verbal and   written communication skills is desired17. MCSD or other certifications   is a plus", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers"}, "KEY SKILL": ["C#", ".Net Core", "CSS", "Software Development", "ADO.Net", "HTML", "SQL Server", "WCF", "ASP.Net MVC", "Javascript Frameworks"]}