{"JOB DESCRIPTION": " We are looking for an experienced Java Developer to join the Ayla Engineering team.      What You Will Be Doing     The ideal candidate will design, build, and maintain efficient, reusable, and reliable Java code in order to drive strong user information solutions. This candidate will have excellent coding abilities and be able to create useful applications based on outlined criteria.   Work with product team to define stories and acceptance criteria.   Research and proof-of-concept initiatives in new and emerging technology spaces.   Be part of the entire Software Development Life Cycle.   Contribute unit, functional and performance tests to certify your work is good.   Drive evaluation and learn new tools and technologies to keep technology stack modern as needed for the Product solution.   Mentor other engineers within the team as well as partner with engineers across the supply chain to share successful architectural patterns   Highly technical individual, preferably with leadership experience, possessing expertise and experience working across multiple components or one entire application.   Experience of working in an Agile team     Minimum Qualifications      3 ~ 4 years of software development experience with at least one full cycle implementation from requirement to production   Proficiency in Java programming skills   Experience in building highly scalable distributed systems   Excellent written communication skills and ability to document technical content     Desired Qualifications     Experience building and scaling RESTful APIs and event driven platforms.   Experience Spring Platform (E.g. Spring Boot | Spring MVC | Spring Rest and Spring technologies).   Experience building high through put applications using non-blocking technologies.   Experience with event driven architecture using technologies such as Kafka or similar.   Awareness of new and emerging technologies.   Strong organizational, mathematical, analytical, and problem solving skills   Bachelor's degree in Computer Science or relevant experience  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Supply chain", "Computer science", "spring boot", "Spring mvc", "Architecture", "Coding", "Analytical", "Agile", "Software development life cycle", "Distribution system"]}