{"JOB DESCRIPTION": "Galaxy.AI is looking for an entrepreneurial, creative, passionate, self-motivated Product and Software Engineer who also has ability to implement Machine Lachine learning algorithms. The person should have strong background in scaling enterprise applications and implement algorithms through APIs. Ideally, the candidate should be an analytical thinker who can contribute to the product strategy and any systems architecture experience will be a bonus. If you are hungry to learn and grow in a fast-growing seed stage company then we should chat!Desired Candidate Profile Bachelors or Masters in an area relevant to Computer Engineering or Information Systems.The candidate must have the ability to implement deep learning algorithm in production for actual business problems.Experience with Agile software development and Scrum methodologies.API engineering and implementation experience through Node.js.High level of proficiency in programming with Python, Node.js, RestfulAPI development and AI models deployment in the product pipeline.Experience with implementing and scaling product in cloud infrastructure (AWS, GCP and Azure).Devops experience - SCM & CI / CD integration with Jenkins, Bitbucket.Strong skills in written and verbal communication of technical concepts.2+ years of experience in implementing and scaling software product and algorithms.Roles and Responsibilities Develops information systems by designing, developing, and installing software solutions.Determines operational feasibility by evaluating analysis, problem definition, requirements, solution development, and proposed solutions.Agile development through collaborating with business and QA.Ensuring the quality, architecture and accuracy of released code.Documents and demonstrates solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code.Prepares and installs solutions by determining and designing system specifications, standards, and programming.Improves operations by conducting systems analysis and recommending changes in policies and procedures.Obtains and licenses software by obtaining required information from vendors, recommending purchases, and testing and approving products.Protects operations by adopting latest security policies and maintains security documentation.Hands-on contributor and as well as able to guide and mentor team members.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers"}, "KEY SKILL": ["Node.Js", "React.Js", "Python"]}