{"JOB DESCRIPTION": "    About the role    We are seeking an experienced and skilled candidate with passion for designing, evolving and developing Java based applications. Ideal candidate would be Java developer with 6+ years of hands on experience in Java/JEE technologies. You should also be a team player with a knack for visual design and utility, responsible for CI/CD with a TDD mindset and familiar with Agile methodologies.     Responsibilities      Guide and mentor junior members of the team      Work with development teams and product managers to ideate software solutions      Design server-side architecture      Follow Software Development Life Cycle      Test software to ensure responsiveness and efficiency      Troubleshoot, debug and fixing bugs      Identify the gaps and come up with working solutions      Write technical documentation and user guides      Work with other architects, leads, team members in an Agile Scrum environment      Review code and establish best practices      Look out for latest technologies and match up with use case and solve business problems efficiently      Write well designed, testable code     Requirements      6+ years of experience in Java and Java frameworks      Hands-on development experience      Strong hands on experience with Java 8+, Spring Boot, Spring MVC, Spring, Hibernate/JPA, JSP, Servlet      Familiarity with Unit test frameworks Junit.      Practical skills in CI/CD: Git, Maven/Gradle, Docker, Jenkins, Jira      Good command of TDD/Unit Testing, Clean Code      Excellent problem solving and critical thinking      Ability to take ownership of business problems and technical solutions      Strong communication and interpersonal skills      Strong skills in algorithms and data structures      Hands on with engineering excellence and continuous integration practices      Knowledge of common design patterns and SOLID design principles      Good knowledge and experience with security constructs OpenID, OAuth 2.0, TLS, OWASP      Experience with Agile framework.      Strong database skills.      Proven experience in handling several aspects of software including, but not limited to performance, scalability, security and testing.      Nice to have     Knowledge of Microservices & Spring cloud      Hands on experience with Keycloak, Sonarqube.      Experience with AWS (S3, Lambda, DynamoDB, API Gateway etc.)   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Maven", "Hibernate", "TDD", "JSP", "Agile", "Data structures", "Healthcare", "JPA", "JIRA", "Technical documentation"]}