{"JOB DESCRIPTION": "  Java developer to contribute to the Social Messaging API team. The team is responsible for building interfaces to support popular social messaging channels (Facebook Messenger, WhatsApp, Apple Business Chat, ) on the Nuance NDEP Platform that provides Agent and Virtual Agent services. The team builds microservice adaptors on a Java platform and is looking to convert to Cloud Native (Docker) packages.       Principal duties and responsibilities:       Actively participate as a scrum team member in all phases of the development process     Software design, development, unit testing and test-automation     Design, implement and execute unit tests for code modules or components to ensure high quality code releases     Perform peer design and code reviews     Automation of the CI workflows     Work with Operation teams to automate and implement a CD workflows     Produce and maintain high quality, scalable enterprise software     Effectively work with multiple stakeholders and teams located in different geographical locations     Follow secure coding practices following different security and data processing compliances (PCI, GDPR, PII, )       Knowledge, skills and qualifications       Education:        Undergraduate degree in computer science, software engineering or a related field        Required skills:       Experience in JAVA and Spring framework     utithreading exposure for development     Experience with DB, building queries in SQL and using Hibernate     Experience debugging JAVA applications     Experience building Web Application and Services     Experience building APIs and Client/Server Architecture     Experience with writing unit test and unit test friendly code     Experience with Maven build scripts       Preferred skills:       Knowledge of microservices architecture     Knowledge of Cloud Native tool and architecture (e.g. CI/CD, Docker, Kubernetes, , )     Knowledge of communication protocols: HTTP1.1, HTTP2, GRPC, WebSocket     Cloud services experience (AWS, Google, Azure)   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Maven", "Automation", "Hibernate", "Software design", "Coding", "Debugging", "Healthcare", "HTML", "Scrum", "SQL"]}