{"JOB DESCRIPTION": "  About the Role   We are looking for skilled & motivated engineers to help build core web components & flows for the Risk Hyderabad team. The Risk Experience team plays a crucial role in our mission to weed out the bad actors in our system while ensuring powerful, intuitive and frictionless user experiences for our customers (riders, eaters etc). This is a very high impact role that will give you a holistic perspective on the business and brings with it the opportunity to collaborate and interact with a global cross-functional group.   As an engineer on this team, you will contribute to projects and initiatives that:  Build rich user experiences for our consumer-facing applications and make the user's interaction with Uber clear and intuitive.  Detect fraudulent behavior by leveraging signals from entities (users, organizations, devices, payment profiles) and the environment (Sensing & Perception data)  Prevent fraudulent behavior by introducing the right level of friction at the right time in the user experience to validate the authenticity and intent of various Uber entities (riders, drivers, organizations, restaurants and more)  Design and build reusable components that can be used across a variety of services across Uber to provide a customized experience while enabling key risk checks.    What the Candidate Will Need / Bonus Points   At least 7+ years of individual contributor experience as a software engineer developing, releasing, and maintaining web applications  Coding chops, clean, elegant, bug-free code   Strong hands-on experience in HTTP, HTML, CSS, Javascript, Node.js, React and Stateless/stateful Web interactions in websockets, long-polling, serve push and other web technologies  Expertise in web technologies and APIs and a solid understanding on fundamentals of TCP/IP, HTTP, JavaScript engines  Skilled at building solutions with apt architecture and design. Architect efficient and reusable front-end systems for complex web applications  Prior experience as a tech lead who has mentored/led small teams in building product features at scale  The ability to go deep, but also appreciate the challenge of going broad. Uber has a huge stack, and we're all over it: backend services, real-time dispatch, machine learning, mobile, web development, data and analytics, infrastructure, marketing systems.  Intelligence. High adaptability. Ability to learn quickly.  Bias for bold action. Our growth requires embracing change with sureness and boldness. We expect our engineers to be proactive about addressing both operational and scalability challenges as we grow.  Ownership, drive and passion. Engineers at Uber know what it means to truly own their services. Quality, performance, and robustness are expected of all services. Engineers take ownership of the uptime of their services, and they are empowered with the tools to do what is needed to keep them running. Great monitoring, alerting, and test coverage are championed at Uber and we provide engineers with the tools to do so.  Obsessive collaboration. We work closely with other business and Eng groups. We communicate proactively to address new challenges, work through requirements, and improve our operational efficiency.  Strong desire to learn and grow, while building the best in class systems  Strong flair for effective communication and collaboration - you know when to push on and when to step back  Collaborate with UX Designers, UX researchers, Product Managers to deliver magical user experiences  An ability to have fun while working on the hardest problems ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Travel , Hotels , Restaurants , Airlines , Railways", "FUNCTIONAL AREA": "IT Software - Other", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Backend", "Coding", "Web development", "Machine learning", "HTML", "HTTP", "Individual Contributor", "Operations", "Analytics", "Monitoring"]}