{"JOB DESCRIPTION": "We are hiring Senior Software Engineer- Java for a premium client (Renowned Healthcare MNC) at Bangalore Location . Job Summary We are looking for a Java (JEE) Developer to join its product engineering team responsible for developing solutions within product portfolio. Your primary focus will be on the development of server-side logic and integrating front-end elements with the server-side components. You will work with an engineering team in a collaborative model to develop these solutions. This role is a web application full-stack developer, so a solid foundation of server-side Java web application development is required including competence in front-end technologies such as HTML5, CSS3, and client-side JavaScript. Job Description  Hands-on coding / development for both server-end and client-side packages as required  • Follow the agile development methodology implemented in the engineering team. • Actively participate in testing and support / maintenance activities. • Peer review code and participate in quality improvement initiatives within the engineering teamDesired Profile (Education, Experience, Key Skills)Experience  5+ years of relevant experience 5+ years of experience in developing web applications using Java server-side technology. • Knowledge of Spring Boot 2 framework, particularly MVC, and libraries • Good understanding of HTML5, CSS3, and JavaScript including jQuery • Proficient in code versioning tools such as Git and SVN • Ability to write quality code that is reusable, testable, and efficient • Experience in following an agile development process • Any Graduate", "ROLE": "Software Developer", "INDUSTRY TYPE": "Medical, Healthcare, Hospitals", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["Java", "Web Application Development", "JEE", "Front End", "Html5", "Web Technologies", "Javascript", "Spring Boot", "MVC", "JQuery"]}