{"JOB DESCRIPTION": "  Job Scope:     Alation is seeking a talented and highly technical Senior Engineer to join our fast-growing team in Alation, India. The ideal candidate will communicate fearlessly to build trust.    We need leaders who take active roles in shaping the future of engineering while embodying our core values.     What does the Capture Team do   The Capture team owns the foundational component of the Alation product integrating with a multitude of technologies and tools in HDFS, BI, Data Lake, Warehousing, and Databases to bring in metadata and insights through our pipelines to power our industry-leading Data Cataloging solution.    As a member of the Capture team, you will drive and own multiple product initiatives from inception through delivery. You will own the decisions on prioritization and technical tradeoffs.   As part of Team Capture, you will    Design and own new user experiences that enable customers to gain insights     Work with our amazing product and design team to build a core product experience Build the next generation of frameworks and solutions that simplify the complexity and enable the next level of scale     Design both internal and customer-facing APIs that are fast and flexible     Make smart scoping and priority decisions to ship fast, impactful code   You may be a perfect fit if you :    Have a CS degree and 8+ years of experience working as a software engineer     Have 3+ years of experience designing, developing, and shipping software products and services with a distributed backend     Have a good command of architectural conventions such as RESTful API design, concepts of algorithmic complexity     Have experience working with data at scale and exposure to building frameworks to solve integration problems is desired.     Have strong software design and architecture skills with an eye toward avoiding and reducing technical debt     Have hands-on experience independently building and shipping features      Have worked with Relational Databases - Postgres is a plus!     Demonstrate clear leadership and communication skills     Are collaborative and measure your success through impact  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Software design", "metadata", "Backend", "Architecture", "Machine learning", "Venture capital", "data governance", "Silicon", "Analytics", "Salesforce"]}