{"JOB DESCRIPTION": " Software Engineer Location: Bengaluru, IndiaExperience: 3 - 5 years About Aurigo: We are Americas leading enterprise SaaS provider helping public sector agencies plan and deliver over $450 billion worth of capital infrastructure projects and realize up to 5% in savings.  Aurigo performs the entire configuration, implementation, and delivery of its enterprise software solutions. These are multi-million-dollar projects typically spanning 6 months to two years.  Our customers include State agencies, Airports, large cities and counties, and major transit authorities who spend anywhere from $15K ARR to $3M ARR on our software subscription plans. Role Summary: In this role, you will be part of our Product Engineering Team of our award-winning flagship product suite Aurigo Masterworks, working in a highly collaborative, fast-paced environment. You will be charged with designing, developing, and supporting some of the most critical features of the Masterworks suite of Products. The ideal candidate will be excited for the challenge to make an impact and think critically on many computer science disciplines including product design, usability, and user-centric online applications, business logic, scaling performance, and 24x7 reliability.  Desired Skills and Experience: B.E/B.Tech Degree in Computer Science or related technical discipline. 3+ years of experience in software design, development, and algorithm related solutions. 3+ years of programming experience in Microsoft Stack (Strong C#, ASP.NET Webforms, .Net core, JavaScript, JQuery, SQL Server, HTML, CSS). Good to have knowledge on PostGRE SQL and experience with 3rd party integration3+ years of experience in building internet-facing highly secured performant Web Applications. Experience in building and delivering the highest quality products incrementally using Agile methodology in an extremely fast-paced environment. Knowledge of AWS or any other public cloud computing platform will be preferred. ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["C#", "CSS", ".Net Core", "Web Technologies", "Postgresql", "Javascript", "ASP.Net", "HTML", "SQL Server", "JQuery"]}