{"JOB DESCRIPTION": "Roles and ResponsibilitiesProfile:Software Engineer PHPLocation: Sector 62, NoidaRoles & Responsibilities :- Developing application using Php Frameworks.- Interacting with Client- Project Management, Planning & Estimation- Be a good team player- Open for any research based work- Willing to explore new technologies & work on them whenever required-Database DesigningTechnical Requirement for this position :1. Open Sources (Drupal, Joomla, Wordpress, Open -cart, etc) (Would be preferable)2. UI knowledge - Should have great eye for look n feel.3. Management Skills - Can manage work, client, deadlines, etc4. Angular & Node experience will be preferable.5. Great database design skills are mandatory6. Knowledge about latest industry standards & technologies7. Frameworks (Cake PHP, CodeIgnitor, Laravel, Symphony, etc) (Any One)Non -Technical Requirements :1. High level of analytical skills2. Great logical problem solving skills3. Client handling skills4. Positive thinking5. Good Human6. Quick Learner7. ProactiveBenefits for being a part of Ucodice Family :- No late sitting for employees at Ucodice (Except Urgencies) - Because everyone has its personal life.- Salary on-time - As we all work for money. Money on time is always a positive symbol. Salary never got delayed since we started the company.- Surprise appraisals- Every human loves positive surprises.- Surprise Project bonus to appreciate the good work & higher level of satisfaction. - All sudden money into account gives you wings.- Fun loving environment at Ucodice - Employee spend most of the time in office, so should always feel fresh at work place.- Generic training for the employees - We are running behind our technical expertise but generic training are \"feathers on the hat\" to boost your career.- Movie plans - \"WOW its amazing\" movie plan with all staff.- In-house games - Sometimes we feel bore doing coding whole day so its better to refresh our mind by playing in house games.- More new exciting things in Plan.- Picnic for the employees - Most awaited day of the year \"Outdoor picnic\" and if it is out of station its wonderful moment of life.- Music During work hours.- Great learning- Always updated with new technologies- Equal Chance to grow- We give chance to everyone to grow.- 99% International Projects.- Overall Personality Development", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Sc in Any Specialization, BCA in Computers, B.Tech/B.E. in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Drupal", "Open Source", "OpenCart", "Symfony", "CodeIgniter", " Wordpress", "Database Design", "PHP", "CakePHP", "Laravel", "Joomla"]}