{"JOB DESCRIPTION": " Job Responsibilities     Work on a high scale production-ready micro Front End application development in a relaxed and sometimes crazy environment   Good understanding of React JS application development using Redux.   Hands-on experience in writing unit testing   Good in OOPS design concepts where he/she can create robust web applications   Good to have micro front end application development knowledge   Experience in creating reusable components/ contributed to opensource   Prior experience in Working on AGILE application development   Need to talk to the client on daily basis to resolve the requirement gaps and technical issues     Requirements    React JS, ES6, Redux, ES5 concepts   HTML5, CSS   Unit testing using JEST or any other equivalent framework     What you ll Love about Opteamix:      Great Company Culture  :   Dream Company Awardee   We have ranked #11 Dream Company to Work For by the World HRD Congress for Innovative HR practices & CSR.    We are Remote Work Ready   Why Go to Work when you can work from wherever you want to be Here s your opportunity to get connected to the roots of your soil. Work with us from your city/shift your workstation to your Hometown You don t have to choose between Home and Work anymore.    Health Benefits:   For you and your loved ones along with routine health check-ups    Skill Development Sponsorship:   To help you speed up your career progression    Leave Encashment:   100% reimbursement (on Gross CTC) for unutilized leaves    Performance Rewards:   Brilliance at work will never go unnoticed    Easy Commute:   We are situated in the heart of the city (metro station a minute away)  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "BPO, Call Centre, ITeS", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Process automation", "Vice President Marketing", "Front end", "PDF", "enterprise mobility", "Agile", "Application development", "Unit testing", "HRD", "Business solutions"]}