{"JOB DESCRIPTION": " Job Responsibilities    As a Senior Software Engineer, you will be responsible for developing systems integration services using one of many integration technologies available such as Microservices/API in NodeJS/JavaScript, AWS Lambda, Talend, RPA. The ideal candidate will take ownership of the use case, perform detailed technical analysis, and build a solution without much supervision/guidance.    Requirements    5+ years of back-end Software Development, Systems/Data Integration experience using technologies NodeJS/JavaScript, AWS Lambda, API/REST/JSON, NoSQL, RDBMS.   Strong analytical skills with the ability to analyze business process flow, integration scenario, and challenges.   Experience with waterfall and/or agile SDLC methodologies. Experience with JIRA is a plus.   Should have excellent communication skills in both written and verbal English.   Passion to learn new technologies create Proof of Concepts.     What you ll Love about Opteamix:      Great Company Culture  :   Dream Company Awardee   We have ranked #11 Dream Company to Work For by the World HRD Congress for Innovative HR practices & CSR.    We are Remote Work Ready   Why Go to Work when you can work from wherever you want to be Here s your opportunity to get connected to the roots of your soil. Work with us from your city/shift your workstation to your Hometown You don t have to choose between Home and Work anymore.    Health Benefits:   For you and your loved ones along with routine health check-ups    Skill Development Sponsorship:   To help you speed up your career progression    Leave Encashment:   100% reimbursement (on Gross CTC) for unutilized leaves    Performance Rewards:   Brilliance at work will never go unnoticed    Easy Commute:   We are situated in the heart of the city (metro station a minute away)    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "BPO, Call Centre, ITeS", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Business process", "Vice President Marketing", "RDBMS", "Javascript", "Agile", "Application development", "JSON", "JIRA", "Business solutions", "SDLC"]}