{"JOB DESCRIPTION": "ISSQUARED is hiring for Sailpoint IIQ DeveloperExperience: 4-8 years( in which 3 years should be in Sailpoint Development)Notice Period: Immediate to 30 daysShifts: Should be flexible to work in PST/ EST working HoursKey Activities for the IIQ Developer include:Be the owner of the SailPoint IIQ environments.Architect, administer, manage and maintain SailPoint IIQ environment. Align new and existing applications and systems to IAM/RBAC framework. Provide technical and governance oversight on the SailPoint IIQ projects. Serve as a Subject Matter Expert in the analysis, design and implementation of all SailPoint IIQ projects, estimate timelines and be responsible for their successful delivery while meeting the overall security and integrity of the solution. Monitor operational and performance statistics for managed systems to ensure reliability and availability, perform preventative maintenance, and automate routine procedures. Maintain production change control schedule and participate in change control processes.Troubleshoot problems and respond to escalations, and perform repairs as needed.Conduct routine hardware and software audits of servers and applications to ensure compliance with established standards, policies and configuration guidelines.Create and maintain documentation such as requirement/design documents, operational drawings, standard operating procedures, manuals, etc.Be the technical liaison and the escalation point between client teams and the ISSQUARED offshore/onshore team.Independently handle client projects without management oversight.The position requires an overlap with the Pacific Time Zone.Qualifications: 3-4 years of hands-on development experience on SailPoint IIQ. This includes customizing workflows/policies/rules, developing connectors, debugging issues, setting up SSL, etc. Experience with patching/upgrades of SailPoint IIQ and the middleware. Knowledge of other Identity Management/Governance products (IBM Security Identity Manager (ISIM), IBM Security Identity Governance and Intelligence (IGI), Oracle Identity Manager, etc.) will be a plus.Strong knowledge of Application Servers (preferably Apache Tomcat), Databases (e.g. MS SQL, Oracle, DB2) and LDAP (ODSEE, IDS).Very strong programming and scripting skills such as Java, BeanShell, JavaScript, PowerShell, VB Script, etc. Experience with web technologies such as SOAP, REST, etc. Experience with software development/testing and ticketing tools.  Excellent written and verbal communication skills is a must. Working knowledge of Single Sign-On technologies (Okta, Siteminder, Ping) and Privileged Identity Manager (CyberArk, Lieberman/Bomgar) will be a plus. Experience and knowledge of working in regulated environments such as SOX, GxP Privacy, etc. will be a plus. If Interested, please share cv to dpolluko@issquaredinc.com or connect with me on 9182886335", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["Java", "Rest", "MS SQL", "Software Development", "Oracle Identity Manager", "Sailpoint", "Web Technologies", "Identity Management", "Apache Tomcat", "SOAP"]}