{"JOB DESCRIPTION": "   We are solving some of the most exciting and complex problems out there both in terms of technology and design.      The opportunity is to solve them, in a scalable and future-proof way, with a team of similarly passionate and driven people.   You ll be a part of a platform team, working on Jira s frontend together with other senior frontend engineers and architects. If you are excited about coding standards, frontend technologies, frontend DevOps and library usage, this might be the right opportunity to delve further deep into and create a high impact.  On your first day, well expect you to have:    6+ years of experience designing and building a production-level large scale web application.     Proven experience building responsive & intuitive front-end web applications using HTML, CSS, JavaScript (we use React, Redux, Webpack, GraphQL and more).     Experienced building single-page applications in JavaScript/TypeScript      Architect, design and Build complex user interfaces from the ground up using the latest web technologies from gathering requirements, design, build, deploy and ownership.     You will own the front-end development for one or more of our product / services.     You are comfortable conducting code reviews and giving feedback to ensure high standards of code maintainability and extensibility     Address complex problems at both an application and system level     Experience building a service from the ground up is preferred be product-focused, driving the design, development, and implementation in order to turn a user s pain-points into simple and elegant solutions that are loved.     Experience with AWS infrastructure and/or Microservices is preferred.   If youve got some of these skills, even better:    Hands-on experience building an Atlassian plugin of any size.     Experience with Spring framework.     Experience with Maven plugin development.     Experience in TDD techniques & Continuous Integration.     Familiarity with Agile software development methodologies.      Address complex problems at both an application and system level     Proven expertise in building high-available, resilient, scalable, low latency services in distributed architecture.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["SAN", "Maven", "Software development methodologies", "Coding", "TDD", "Javascript", "Agile", "HTML", "JIRA"]}