{"JOB DESCRIPTION": "Roles and Responsibilities Responsibility for delivery of enhancements,   interfaces, technical patches as per pre-determined release cycle.On time delivery of the tasks Complying with engineering processes that includeVersion control, Build and   release managementEstimated versus actual effort trackingChange management process (including patch releases)Defect analysis and product documentation managementEffective unit testing to ensure minimal rework. Provide the required support for the productAbility to be hands on and be able to take up individual contributor role as well as leading small teams, as and when required by the team and/or organization. Desired Candidate Profile   Experience in design and development, preferably for a product company involving   development of customer facing android/IOS applications. Good understanding of Microsoft stack  C#, .NET and   SQL server. Good understanding of either MVC, WEB API or .Net   Core. Knowledge of Azure Services, Multithreading, OWASP Vulnerabilities,   database performance tuning is an added advantage. Knowledge of database design fundamentals. Knowledge of enterprise applications design    development  testing - engineering concepts. Proficient in technology and design especially in Microsoft technology stack Work with minimal direction in a rapidly changing environment Should be able to understand lifecycle like support, design, coding, testing and   implementation.Perks and Benefits ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Electronics/Telecommunication, Computers", "PG": "MCA in Computers, CS in CS, M.Tech in Computers"}, "KEY SKILL": ["WEB API", "Design", "Software Development", "Unit Testing", "Coding", ".Net", "ASP.Net", "SQL Server", "MVC", "Implementation", "Release Management", "SQL"]}