{"JOB DESCRIPTION": "Job Title Software Engineer (Python-Django) Department Research & Development (RND)Travel required No | Position type Full-timeJOB PURPOSEAs a Software Engineer, you will be responsible for developing features for INETs flagship product, AIR, an Integrated Business Intelligence System (IBIS) for consultants, contractors, and suppliers.ROLE & RESPONSIBILITIESAs a Software Engineer, you must operate in line with management directives and in accordance with the Company's policies, standards, and procedures that form the organization's quality management system.You will be responsible for developing and maintaining REST APIs required for the weband mobile version of AIR. You will also be assigned to manage the deployments and management of our applicationand database servers.The operational responsibilities of this position are:1. Developing back-end APIs(Application Programming Interface) as per the business requirement2. Managing the Elastic search engine3. Creating indexes and updating logic on Elastic search4. Managing the Postgres database of AIR5. Create ORM( Object Relation Mapping) models based on feature requirements6. Writing scripts to and scheduling cronjobs to run as background jobs7. Deploying applications on AWS EC2 machines8. Managing ELB( Elastic Load Balancer), RDS(Amazon Relational Database Service) and EC2( Secure CloudServices) service on AIR9. Coordinating with internal teams to understand user requirements and provide technical solutions10. Documentation of all work executedIn addition to the above, you will be expected to complete any other tasks assigned by your Supervisor. REQUIREMENTSEducation Bachelor Degree in Engineering in a related discipline (Computer Science, InformationTechnology, Engineering, etc.) or a combination of education and related experienceExperience 5+ years of professional coding experience, using Python 2/3Knowledge Knowledge of RDBMS (PostgreSQL) and Working knowledge of MS SQL databases integration with Python environment. Familiar with ORM and REST Concepts. Understanding of APIs and JSONS data structureSoft Skills Agile development Practices, Knowledge of HTML, CSS, JavaScript, AngularJS and Angular 4 framework, Knowledge of Linux/Unix server management.Qualities Team player, Tech savvy, Self-starter, Quick learner, Pro-active, Strong sense of responsibility and ownership for assigned projects.Technical Skills Ability to develop using Django framework, Ability to create and modify REST APIs, Experience in managing Elastic search engine, Ability to design and architect high-performance scalable distributed software.Languages Strong written and verbal communication skills to easily work across the organizationPersonality You must be a team-playerKPIsPerformance can be measured through:1. Number of business requirements solved in timely fashion2. Number of user stories completed in assigned sprints", "ROLE": "Software Developer", "INDUSTRY TYPE": "Construction, Engineering, Cement, Metals", "FUNCTIONAL AREA": "IT Software - System Programming", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers"}, "KEY SKILL": ["Django", "Elastic Search", "Python", "Angularjs", "CSS", "Rest", "Postgresql", "Web Technologies", "Javascript", "HTML", "Angular"]}