{"JOB DESCRIPTION": " Position: Informatica Developer  (Immediate Joiners)Location: Bangalore/MangaloreMResult Corporation specializes in Data Analytics, Business Intelligence, SharePoint Portals and Software Development that help companies plan, build and manage solutions designed around their missions, goals and people rather than specific technologies. Responsibilities:Experience as Data      Warehousing and ETL developer (Informatica) implementing data integration      and complex ETL solutions for data marts using advanced ETL tools and SQL Experienced in developing      workflows and mappings for data integration from various source systems      using ETL tools like Informatica power centre and Informatica Cloud. Proficient in writing      queries using Hive and developed complex ETL logics and data flow for data      marts and aggregate tables specific for reporting requirements. Strong problem solving and      analytical skills with ability to learn and adapt to new technologies      quickly Skillset:Bachelors degree in Information Technology, Computer Science, or related      discipline required. 4+yrs of total experience and at least 3+yrs of relevant experience  in Informatica Power Centre Work experience in AWS is a plus. MResult Services is an equal opportunity employer that is dedicated to create a diverse environment. All qualified candidates will receive due consideration for employment regardless of race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.CONFIDENTIALITY: We appreciate all expressions of interest, however, as a practical matter, only selected candidates whose backgrounds best match our client's requirements will be contacted. All resumes are retained and treated confidentially for consideration against future opportunities.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["Informatica", "ETL", "Business Intelligence", "Hive", "Software Development", "Computer Science", "Data Warehousing", "Data Analytics", "SQL", "Data Integration"]}