{"JOB DESCRIPTION": " Job Description     Developer with 3-9 years of experience required    Education: Bachelor’s degree in Computer Science, or equivalent    Excellent skills in Microsoft technologies, including C#, ASP.NET, Microsoft .NET Framework    Excellent skills in Angular.js, Bootstrap, CSS, CSS3, jQuery, JavaScript and HTML5, XML, REST Web API, SOAP Web Services    Strong skills in database technologies (Microsoft SQL Server or Oracle) including database development (T-SQL or PL/SQL).    Good knowledge of web architectural and design patterns    Solid working knowledge of current technologies including Object Oriented analysis and design practices (Object modeling, use cases, activity diagrams, and UML).    Familiar with various forms of SSO and an understanding of security best practices such as OWASP    Familiar with Software Development Life Cycle, various development methodologies, and able to independently participate in each phase.    Ability to design and implement solutions that are reliable, scalable, and perform at a high-level to meet the service levels associated with mission-critical solutions.    Ability to work well within a team environment that includes geographically distributed team members.    Ability to work within tight deadlines and effectively prioritize and execute tasks in a high-pressure environment.    Strong communication skills (verbal and written) and an ability to communicate with internal and external customers and all levels of management, including communicating technical information to nontechnical audiences.    Ability to design and build flexible and extensible systems with focus on code reuse and generation.    Experience with writing detailed technical specifications for developers; design, validate and execute software test plans.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Strategy, Management Consulting Firms", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "MS SQL", "jQuery", "UML", "XML", "OWASP", "Software development life cycle", "Microsoft technologies", "CSS3", "database development"]}