{"JOB DESCRIPTION": "Are you ready for a  challenging and exciting endeavor that will require the investment of a lot of  hard work, dedication and all your experience? Are you ready to bring your  skills, competencies and experience to develop and support our global  applications? This includes Working on multiple applications, you will apply  your advanced proficiency in creating innovative solutions that meet or exceed  expectations? You might be exactly the new team member we are looking for Software Engineer/Senior Software Engineer Bangalore, India As a development  engineer, you will work closely with peer Application Developers, Database  Administrator, Project Managers, and Business Analysts. Your responsibilities Systems and process  support 1. Lead the  Requirements Gathering, Analysis, and Development phases of multiple  projects   2. Research and recommend solutions to existing business challenges   3. Mentor junior team members in technical and functional tasks   4. Provide timely and accurate information to external and internal customers  5. Ensure adherence to standards, and help develop policies and development  guidelines  6. Strong Communication and the experience must be with large scale enterprise.  7. Transaction based experience a plus. travel industry experience is also a  plus. Communication support 1.  Manage and prepare bid  information updates to tools client specific programs via various sources  (email, fax or electronic bid system) 2.  Respond to incoming  supplier requests and inquiries directly via telephone and email 3.  Serve as support desk  to assist customers/bidders with inquiries related to third party tools and  resolve technical issues  We are looking  for you if your profile matches the following -- 1. C# - 6 years (3 or  more years of C# and remaining on VB.Net will be fine)  2. Javascript/Jquery - 4 years (at-least 3 years)  3. MVC - 3 years (at-least solid 2 years)  4. Web services (with WCF & REST) - 4 years (at-least solid 3 years)  5. IIS (must have skills to configure IIS)  6. SQL Server - 5 Years  7. Javascript/Jquery - 4 years (at-least 3 years)  *LLOCS Bangalore IN What we offer  you:  This is an exciting job within an international work environment. You'll be  working with a great international team of colleagues. And, we offer you a  competitive package, training, career development, flexible hours and a dynamic  work environment.    You'll be joining a company that cares about its  people - BCD is the first global travel management company to be awarded  Investors In People (IIP). We recognise the importance of having a diverse  employee base which reflect the geographies, customers and communities within  which we serve. We celebrate our different backgrounds, varied experiences and  unique points of view.   How to apply:  Is this your next career move?  Don't wait any longer. Create a profile in our job portal on our website and  upload your CV and cover letter.    Get to know us BCD Travel helps companies make  the most of what they spend on travel. For travelers, this means keeping them  safe and productive, and equipping them to make good choices on the road. For  travel and procurement managers, it means advising them on how to grow the  value of their travel program. In short, we help our clients travel smart and  achieve more. We make this happen in 109 countries with more than 13,500  creative, committed and experienced people. And it's how we maintain an  industry leading client-retention rate of 95%, with 2017 sales of  US$25.7billion. For more information, visit www.bcdtravel.com. This position is not open to third-party recruiting  agencies. I-KC1  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Graduation Not Required, Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization, Post Graduation Not Required", "DOCTORATE": "Any Doctorate in Any Specialization, Doctorate Not Required"}, "KEY SKILL": ["c#", "Software Developer", "web services", "web technologies", ".net", "wcf", "mvc", "vb.net", "sql server", "jquery"]}