{"JOB DESCRIPTION": "We are looking to hire a Full stack web developer who will be responsible for the creation and enhancement of web applications according to the company's specifications.  As the role takes into consideration user experience and function, a certain level of both functional domain experience and computer programming is necessary. To be successful in this position, you will be required to demonstrate a detailed knowledge of the industry's best practices in software development, development expertise in back-end technologies and must have a professional track record of effective technical management, information analysis, and experience in latest web technologies.You should have in-depth knowledge of object-oriented PHP programming, understanding of MVC designs, and working knowledge of front-end technologies including HTML5, JavaScript, and CSS3.Responsibilities1. Write efficient codes.2. Code, design, and manage the layout of web applications and suggest enhancements using standard HTML/CSS practices.3. Work closely with other web designers and programmers to produce web applications. 4. Write back-end code and build efficient PHP modules.5. Develop back-end portals with an optimized database.6. Technically design complex backend applications.7. Troubleshoot application and code issues.8. Integrate data storage solutions.9. Respond to integration requests from front-end developers.10. Finalize back-end features and test web applications.11. Update and alter application features to enhance performance.12. Integrate with 3rd party application APIs and plugins.13.Guide team members for design and implementation of tasks14. Coordinate end-to-end implementation.Requirements1. 5+ years of professional experience working with PHP, web frameworks including Yii, Laravel, CodeIgniter-Preferred2. 8+ years of professional software development experience-Preferred3. Meaningful experience working on large, complex system integrations4. Knowledge of front-end technologies including CSS3, JavaScript, and HTML5.5. Previous experience creating scalable applications.6. Proficient with code versioning tools including Git, Mercurial, CVS, and SVN.7. Familiarity with SQL/NoSQL databases.8. Ability to project manage.9. Good problem-solving skills10. Ability to take extreme ownership over your and teams work11. A positive mindset and can-do attitude12. Forensic attention to detail13. English Skills (ability to effectively communicate via written and spoken English)In case you wish to apply for the above position, please mail your resume to surabhi.kumar@cityfurnish.com/ vinit.jain@cityfurnish.com or reach out at 7303801950 ( Surabhi Kumar)", "ROLE": "Software Developer", "INDUSTRY TYPE": "Other", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization, BCA in Computers"}, "KEY SKILL": ["Javascript", "PHP", "Java", "CSS", "HTML", "IT", "Web Designing", "Laravel", "Codeigniter", "Full stack developer", "SQL", "Software Development", "Front End", "jQuery", "Coding", "Web developer", "Web Application", "Bootstrap", "software developer", "PHP developer", "System Integration", "Web Development"]}