{"JOB DESCRIPTION": "Dear CandidatesWe have a Immediate requirement of Full Stack Developer for one of our Client at Hyderabad Location.SummaryLocation:  HyderabadExperience: 4+  years experience level is required.Position: Full Stack DeveloperImmediate joines preffered within 15 days joiners acceptable.JD for Full Stack Developer:4-6 years relevant experience as a software developer, software engineerExperience: Strong understanding of SDLC Experienced in the Agile Development methodologies. Application architecture and design patterns Must be experienced in Microservice architecture Must possess a deep knowledge of the Scrum methodology and good learningskills. Must possess technical knowledge and skills of software analysis, softwareprogramming or coding, UI design, or software testing capabilities. Should have excellent team skills that can help them collaborate and work withother team members. Demonstrate strong experience in an iterative development environment, usingScrum practices Must understand the basic framework of an Agile process, its architecture,design, along with the core benefits of an efficient Agile-based softwaredevelopment life cycle. Should be experienced in continuous integration in Agile developmentenvironment and involved in configuring of the CI systems for generating dailyor hourly builds and also integrates execution of unit test cases and otherartefacts. Must be cross-functional, self-sufficient, self-organized. Should be focused and committed to the team's goal. Ability to learn new languages and technologies Excellent communication skills Demonstrate strong experience in an iterative development environment, usingScrum practices Must understand the basic framework of an Agile process, its architecture,design, along with the core benefits of an efficient Agile-based softwaredevelopment life cycle. Should be experienced in continuous integration in Agile developmentenvironment and involved in configuring of the CI systems for generating dailyor hourly builds and also integrates execution of unit test cases and otherartefacts. Must be cross-functional, self-sufficient, self-organized. Should be focused and committed to the team's goal. Ability to learn new languages and technologies Excellent communication skillsSpecific Skill Requirement:Knowledge in Coding languages (C#, Java, C++, Java Scripts) and object orienteddesign skillsRegardsNaveen Kumar N Mail id: naveen_k@trigent.comContact no: 9108228912 (Call between 9:30 Am to 6:30 Pm on Weekdays only)", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["Software Development", "Life Cycle", "Full Stack Developer", "Unit Testing", "Software Engineering", "Coding", "Design Patterns", "Software Analysis", "Iterative", "Test Cases", "SDLC"]}