{"JOB DESCRIPTION": " Job DescriptionJOB TITLE: Senior Software DeveloperLocation- Mumbai (Malad West) MAIN PURPOSE OF JOB:  .Net Application DevelopmentKEY ACCOUNTABILITIES:KEY ACTIVITIES Interact with stakeholders to understand their requirements and business needs and objectives. Provide justifiable (feasible and optimal) software (automation) solution designs. Devise modular and /or project-wise timelines and plans. Document application designs and relevant plans and/or project-workflows. Implement the predefined and approved application designs using best technical methodologies, available (like: Object Oriented Programming, coding standards, Secure Software Development Life Cycle parameters, Web 2.0 /Enhanced user experience features, tier based/driven code-logic implementations, etc). Deliver project solutions with innovative ideas while meeting customer/stakeholder requirements, keeping in mind the business needs and objectives along with apt timelines and quality. Maintain and support existing applications with a keen acumen towards business objectives and customer satisfaction. Provide technical assistance to other team members. Help in building client relationships. Project management and team building. Manage projects single handedly. Project and Business stakeholder engagement to judge the pulse of teams productivity.KEY CUSTOMERS:  Operations  in UK, Ireland, AustraliaWORKING RELATIONSHIP WITHIN BUSINESS UNITS:  InternalGraphics TeamInfrastructure TeamDepartmental-Management.ExternalProjects/Business Requestor ContactsIT Change Management TeamCost-centre stakeholders and prioritization heads (like system delivery and other business verification teams). EXPERIENCE & QUALIFICATIONS: Experience: [E]Minimum 3-5 years in software development.Qualification:[E] Graduation (Any Discipline)[D] Preferred: Engineering, Computer Application, Computer ScienceRequired Skills: [E]ASP.NET 4.5MVCC#SQL Server 2008/2016Entity Frame work / Angular JSJavaScript/ J-Query/ JSonWeb Services / WCFMS Visual Source, TFSExcellent verbal and written communication skills.People Skills; Team player; ability to put across ideas/thoughts.Project and team management skills.  Preferred Skills: [D]WPF, WWFShare Point, knowledge of devopsInterested Candidates can share their resumes with CTC details on ishaan.vasavada@techmahindra.com", "ROLE": "Software Developer", "INDUSTRY TYPE": "BPO, Call Centre, ITeS", "FUNCTIONAL AREA": "IT Software - Telecom Software", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["TFS", "Software Development", "Web Technologies", "WWF", "Javascript", ".Net", "JSON", "WCF", "JQuery", "ASP.Net MVC", "Angular"]}