{"JOB DESCRIPTION": "   Job description        The Senior Software Engineer is responsible for designing and developing SFDC applications for EMEA region while working in close collaborations with the Global Teams.        As a Senior Software Engineer, the candidate will be a strong contributor in the execution of the strategic direction for the company, the success of this position will be measured by the usability, quality, and timeliness of applications delivery.      You will participate on architecture, design, and implementation of these applications.      The ideal candidate is expected to have proven extensive experience in developing scalable and secure applications in SFDC.             In this role, you will           Responsible for SFDC system configuration and customisation for the regional requirements      Should have good understanding of configuration vs customisation options and when to choose what      Responsible for contributing to and being a champion of SFDC best practices.      Hands on experience on Lightning migration and experience on custom lighting components configuration and development      Responsible for design and implementation of integrations of SFDC with other enterprise applications.      Should have a continuous improvement mindset to identify and implement improvement actions      Design and build solutions using REST API, lightning components, process builder, workflows, lightning flow and other SFDC components.      Understand the different Force.com APIs and is able to design solutions using the appropriate API.      Should be able to work with an existing configured system and work on improvements      Define and document architecture and design of the system.      Ensure issues are identified, tracked, reported on and resolved in a timely manner.      Stay abreast of the Salesforce releases and recommend enhancements based on features released.      Work in close collaboration with local and regional commercial teams.             In this role, you ll need            QUALIFICATIONS         A can do attitude, high energy, and creativity are required along with organizational skills and ability to handle multiple tasks.      Strong interpersonal, oral, written, and visual communication skills, with ability to present findings concisely and effectively.      Ability to collaborate effectively with developers, program management, and commercials about objectives, requirements and design constraints.      Solid understanding of agile development principles, careful attention to detail, as well as ability to design solutions for multiple product requirements.      An ability to articulate and clearly communicate complex problems and solutions in a simple, logical and impactful manner.      High level of technical aptitude and ability to learn new technical systems and tools quickly.         EDUCATION and EXPERIENCE         BS/MS degree or equivalent years of experience.      Approximately 8+ years of overall software development experience, preferably secure, scalable cloud solutions.      Around 5+ year s proven experience in SFDC.      Proficiency in Salesforce development (including APEX, Visual Force, Salesforce APIs, Lightning, Java and Java Script).      Experience in implementing Salesforce Cloud solutions along with integrations to different systems legacy and external applications (With and without a middleware E.g. Mulesoft).      Experience on common integration patterns used on the Force.com Platform.      Excellent knowledge of Salesforce.com technical Architecture.      Experience in large scale SFDC implementation.      Certifications in any of these is a must        Platform developer I      Platform developer II      Certification in any SFDC Architect Domain will be an advantage: e.g. Data Architecture and Management, Integration Architecture, Development Lifecycle and Deployment etc.         Nice to have         Good working knowledge on Sales Cloud, Service Cloud and CPQ solutions      Working Knowledge on Einstein Analytics would be appreciated      Knowledge on health cloud / commerce cloud would be a plus.    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Medical, Healthcare, Hospitals", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Medical devices", "Material science", "SFDC", "Enterprise applications", "Machine learning", "Genetics", "Continuous improvement", "Middleware", "Analytics", "Data architecture"]}