{"JOB DESCRIPTION": "JOB ROLE\n\nSr. Software Engineer/  Software Engineer\n\nBangalore /  Mangalore\n\nJOB SKILLS\n\nC++/ VC++/ C#\n\nWORK EXPERIENCE\n\n4 to 6 years\n\nRoles & Responsibilities:\n\nCandidate will work within a growing research and development team to improve existing and build new products.\n\nThe role will be to develop or enhance innovative products and applications.\n\nWill also conduct lot of research and solve a variety of problems that have been never solved before.\n\nSkills & Experience: \n\n4- 6 years of work experience in the field of software engineering\n\nStrong background and fluency in C++/ VC++/  C# (Server side)\n\nStrong background on scripting languages like Javascript.\n\nStrong background on WCF,  REST API and SOAP.\n\nExperience on web- socket implementations.\n\nBasic understanding on networking protocols and concepts.\n\nGood understanding on design patterns.\n\nAbility to learn new programming languages quickly.\n\nGood Understanding on Webrtc technology.\n\nExperience working on large scale software projects.\n\nMust have proficiency in developing applications in C++ in windows and linux environments.\n\nContact Centers & Unified Communication domain exposure is desired.\n\nNice to have developing experience on OMNI Channel (VOIP based) applications that deals with real- time messaging communications /  telephony systems.\n\nPrior experience in VOIP CTI Integrations with leading VOIP dealers Avaya,  Cisco,  and Genesis would be desired and best match for this role.\n\nUnderstanding of Avaya TSAPI,  JTAPI,  TAPI,  DMCC,  Cisco Finesse API s and XMPP,  RTP,  RTCP,  SIP protocols would also be the best match and desired.\n\nMust be a detail- oriented,  self- motivated and should be able to deal with challenging problems.\n\nAbility to make decisions and take responsibility for projects and tasks.\n\nWillingness to learn and grow professionally in a team environment.", "ROLE": "Software Developer", "INDUSTRY TYPE": "Media, Entertainment, Internet", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["C++", "Networking protocols", "Linux", "Javascript", "VOIP", "CTI", "Windows", "WCF", "SIP", "cisco"]}