{"JOB DESCRIPTION": "JOB ROLE\n\nSr. Software Engineer/  Software Engineer\n\nBangalore/  Mangalore\n\nSKILLS\n\n.NET \n\nWORK EXPERIENCE\n\n4 to 7 years\n\nPreferred Technical Experience:\n\n4 to 7 years of experience in ASP.NET programming\n\nShould have performed the role of Designing an Application or Software module using ASP.NET MVC 4.0\n\nWell proven proficiency in C#,  XHTML,  CSS,  XML,  and XSL\n\nAbility to create functional,  user friendly database- driven web sites.\n\nKnowledge and experience of MS SQL server 2000,  2005,  2008\n\nSkills in database design,  business analysis,  requirements capturing and technical specification\n\nMust have integrated web design with back- end coding\n\nExperience in building and maintaining content management systems are preferable\n\nConceptual understanding about cross- platform and cross- browser issues\n\nMust be well conversant with latest design patterns.\n\nShould be strong in Object Oriented Programming Concepts\n\nHands on working experience with HTML,  JavaScript frameworks like Angular JS,  Bootstrap,  JQuery\n\nProgramming experience in HTML5/  CSS3/  jQuery (with MVC at client side,  object- oriented Java scripting),  jQuery,  Knockout.js,  Backbone.js\n\nEntity Framework,  Web API,  LINQ are added advantages\n\nShould have worked in standard SDLC process environments\n\nCollaborate,  define and maintain effective and efficient development processes,  including but not limited to: coding standards,  design philosophy,  testing methodology,  usage of design patterns,  UI standards,  development and coding tools and procedures\n\nContact Centers & Unified Communication domain exposure is desired.\n\nPrior experience in Developing Voice XML or agent CTI application would be a perfect fit for this role.\n\nExpected Functional Skills: \n\nVery Good technical & communication skills to be exhibited in all the roles to be performed\n\nCandidates are expected to be creative and innovative in providing complex enterprise integration solutions to large financial institutions across the Globe.\n\nAbility to adapt quickly and manage difficult situations while remaining upbeat and positive always.\n\nHands- on experience in revamping any existing software into new business effective and user- friendly applications by solving complex technical problems /  known issues with new systems.\n\nMust have functional experience in designing applications to develop integrated solutions for voice & multi- media related applications.\n\nAbility to think outside the box as needed,  with an instinct to innovate.", "ROLE": "Software Developer", "INDUSTRY TYPE": "Media, Entertainment, Internet", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["MS SQL", "jQuery", "LINQ", "Business analysis", "Coding", "Database design", "XML", "XHTML", "MVC", "SDLC"]}