{"JOB DESCRIPTION": "Our professionals balance analytical skills, deep market insight and independence to deliver solid, defensible analysis and practical advice to our clients. As an organization, we think globally. We create transparency in an opaque world, and we encourage our people to do the same. That means when you take your place on our team, you’ll discover a supportive and collaborative work environment that empowers you to excel. If you’re ready to share your perspective with the world, then you can make a real impact here. This is the Duff & Phelps difference.  Our Analysts receive world-class training, outstanding benefits, strong career progression, competitive salaries and relocation assistance when applicable.  Duff & Phelps is looking for a Software Release Engineer to join its Corporate and Cloud Operations team.  This position is responsible for organizing, directing and managing the process with building and maintaining software releases into non-production and production environments.  In addition, ensuring the quality and consistency of internal and customer facing releases.  The qualified candidate will lead releases by working with cross functional teams including infrastructure, networking, software development, architecture, business intelligence, quality assurance, product development and operations.  We are looking for a candidate currently working as Software Release Engineer, Software Engineer or having solid foundational experience ready to take the next step in their career. At Duff & Phelps, your work will help protect, restore and maximize value for our clients. Join us and together we’ll maximize the value of your career. Responsibilities: Create and manage release schedules and release notes  Plan and communicate how a release will be managed, including risk/issue management, change control, and communication plan  Create deployment documents that outline the steps required for each release Identify and manage risks, dependencies, and resolve issues that affect release scope, schedule and quality.  Work closely with project teams to ensure that each release is completed with quality and meets established development standards for code management Facilitate cross-functional release management meetings to discuss current and upcoming releases  Participate in CAB meetings to discuss release scope  Participate in application roll-out implementation meetings and enterprise change review meetings Cultivate processes, best practices and tools for release management  Create and maintain metrics relative to the successfulness of a release based on user impact and release quality  Develop automated build scrips where applicable to build, integrate, and deploy software releases Manage pre-production environment consistency throughout the release process Skills in performance, stability, and reliability monitoring of complex systems Skills in root cause analysis and risk mitigation plans Communicate in an effective manner that promotes healthy relationships with both internal and external team members Work flexible hours to support releases  Requirements: 2-4+ years’ experience as a Release Manager or directly relevant position Bachelor's degree in Computer Science, Software Engineering, or similar; or equivalent combination of education and experience Experience with Azure DevOps or similar issue tracking software  Experience in a change management environment Excellent written and verbal communication skills that help represent diverse communities Experience working with diverse teams Strong Technical skills including: SQL Git TFS Docker/Dockerfiles Visual Studio .NET Core (C#) React Angular Bash PowerShell  Solid understanding of Azure DevOps YAML and Classic pipelines  Must have a passion for learning new technologies and applying them to software solutions Agile framework experience (Scrum / Kanban) Experience with Continuous integration (CI) / continuous delivery (CD) highly preferred Understand fundamentals of software development processes and procedures In order to be considered for a position at Duff & Phelps, you must formally apply via careers.duffandphelps.jobs Duff & Phelps is committed to equal opportunity and diversity, and recruits people based on merit.", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Other", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Senior Software Engineer"]}