{"JOB DESCRIPTION": " The IDC Platform Engineering team in Servicenow is a growing team of extremely talented engineers who innovate every day and work on our next generation technology stack in the Servicenow cloud platform.   Come join us if you want to learn and work on cutting edge technologies and impact the design and architecture of future web applications which will impact the lives of millions!    Role    You will have the opportunity to work on exciting technologies like mobile, UI Componentry, predictive intelligence, workflow automation and various developer tools. In this role you will be able to contribute in designing and architecting web-based solutions which will be used by millions.    What do you get to do in this role    You will help in designing and architecting complex solutions   You will work along with a talented team and learn from each other through collaborative efforts everyday   You will be responsible for the overall development and maintenance of a product / product chain   You will build core platform features/frameworks which will be used by both internal and external agencies   You will get a chance to learn from more experienced people and also get an opportunity to mentor juniors    In order to successful in this role, we need someone who has:    BE / B Tech/ ME / MS / MTech in Computer Sciences, Electronics and Communications or Electrical Engineering fields with a proven academic track record.   5+ years of experience in Software development using Java / C++ /C#/ Javascript   Must have sound knowledge in software design, REST, HTML and XML   Full stack development experience is desirable   Knowledge of NodeJS, React/Redux, Polymer etc. is desirable ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "M.Tech in Electronics/Telecommunication"}, "KEY SKILL": ["Electrical engineering", "Automation", "Software design", "Web technologies", "XML", "Javascript", "Workflow", "HTML", "Architecting"]}