{"JOB DESCRIPTION": "Senior Software Engineer -   Media Platform (SSE-  MP) is responsible for design and development of Saranyu's Cloud based distributed multimedia (Video /  Audio /  Image) platform and its components. This includes design /  implementation of media streaming protocols (Apple HLS,  MS Silver Light,  Adobe RTMP/ HDS,  RTSP,  MPEG-  DASH),  distributed media pipelines based on FFMPEG,  GST,  x.264,  Intel Codecs,  and media DRM like Playready /  Flash Access on Cloud Computing platforms like Amazon AWS. SSE-  CMP is also responsible for developing RESTful APIs,  application /  service layers above the platform and testing the same with Client platforms like iOS,  Android,  Flash,  J2ME and others.\n\nDeveloping Proof of Concept Applications for Media Services \n\nEnsure all of functionality,  performance,  scalability and reliability of Media Services built on Saranyus Media Platform Bachelors/ Masters degree in Computer /  Information Science Eng.,  Electrical/ Electronics and Communications Eng.\n\nCandidates must have experience in Software Engineering,  Cloud Computing,  Multimedia Software,  and Internet Technologies ranging from 1 to 5 years. \n\nMust have independently built Client /  Server Software,  Multimedia Algorithms Systems,  Cloud Computing and Internet Applications. \n\nMust have exposure and development experience on Cloud Computing Environments like Amazon AWS,  Microsoft Azure,  any PaaS,  etc. Technical Skills\n\nStrong and proven Skills in C/ C and/ or Ruby /  Java /  Python Programming \n\nGood knowledge of Cloud Computing and /  or Internet Technologies like HTML,  WML,  CSS,  PHP,  Ruby on Rails,  Java Frameworks,  SQL/ No-  SQL databases and others. \n\nExperience in Linux based software development,  multi-  threaded client /  server programming is a must \n\nSkills in GStreamer or similar media frameworks,  Media algorithms (video /  image processing) development,  Mobile Media,  Smartphone frameworks (iOS,  Android) would be added advantage \n\nSoftware Processes,  Configuration Management,  Test Planning and Execution. Soft Skills\n\nAbility to handle multiple tasks in parallel \n\nExcellent communication and writing skills Senior Software Engineer Web and Mobile Applications Software Engineer -   Web Mobile Applications (SSE-  WMA) is responsible for design and development of compelling media (video,  audio,  imaging) rich applications using Saranyu's Cloud multimedia platform. The applications has to be designed for seamless multiscreen experience across Desktops,  Smartphones,  Tablets and Feature phones. SSE-  WMA is also responsible for innovations in user interface design and interaction to enhance the user experience across devices. \n\nDeveloping compelling demos that show cases capabilities and features of Saranyu's Cloud based Multimedia Platform \n\nEnsuring optimized implementation of media applications on variety of mobile and connected devices Bachelors degree in Computer /  Information Science (BE /  BTech) or Master's in Computer Applications\n\nCandidates must have 1 to 2 years of experience in designing and developing Web and Mobile Applications. \n\nMust have independently built User Interfaces,  Integrated SDKs and done application testing \n\nMust have exposure and development experience on any of the iOS /  Android /  Symbian /  Windows 8 Application platforms \n\nStrong and proven Skills in HTML5 ,  CSS3 ,  Javascript,  jQuery,  PHP. \n\nExperience in iOS,  Android,  Blackberry,  Windows Phone,  and other application development platforms \n\nExperience in developing audio/ video applications would be an added advantage \n\nGood knowledge of Media Streaming Protocols (like RTSP,  HTTP-  PD,  HLS,  RTMP,  and Silverlight) would be an added advantage \n\nSoftware Processes,  Configuration Management,  Test Planning and Execution", "ROLE": "Software Developer", "INDUSTRY TYPE": "BPO, Call Centre, ITeS", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["C++", "jQuery", "Blackberry", "Linux", "Javascript", "PHP", "HTML", "SQL", "Android", "Python"]}