{"JOB DESCRIPTION": "Roles and ResponsibilitiesRuby on Rails Software Engineer for MNC IT Co. at AhmedabadRuby on Rails Software EngineerSummaryThe Ruby on Rails Software Engineer will play a critical role in developing new features, eliminating tech debt and maintaining our our web services. We have many exciting projects planned such as upgrading to the latest version of Ruby on Rails, moving our services into AWS and docker, and migrating our legacy PHP services to Ruby on Rails.What’s in it for you?An opportunity to drive our product forward and make a direct impact on revenue and customer satisfaction. Gain exposure to modern CI/CD tooling such as Github Actions, Docker, Kubernetes and Harness.Joining a collaborative environment where creativity and innovation are our priority. We are always excited to use the best technologies available to solve real world problems.A front-row seat to the casting industry, insights and perspectives on how they work and the opportunity to build software that helps shape their future direction.You’ll need to have:Solid experience with Ruby on Rails and Vue.jsUnderstanding of MySQL databases and data structuresExperienced with development using Docker containersFamiliarity in working with AWS services such as ElasticSearch and RedisComfortable working with DevOps methodologies with a focus on test driven developmentExcellent written and verbal communication skills.Flexible schedule to overlap working our US based team membersWe’d love to see:Experience with PHP and migrating PHP applications to Ruby on RailsFamiliarity with ReactOpen mindset to receive constructive feedback and turning it into process improvementsWillingness to help your teammates, share your knowledge and learn from themEducation: B.E/B.Tech (CS /IT), MCA, M.Sc.(IT)If you're excited by these challenges, have a passion for technology and a flexible, “outside the box” approach to problem solving, we want to talk to you!Interested candidates are requested to apply with latest resume, current salary, expected salary, notice period.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "MS/M.Sc(Science) in Any Specialization, MCA in Computers", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["  MySql", " Vue.js", " Ruby on Rails", " Elastic Search", "PHP", " Kubernetes", " Github"]}