{"JOB DESCRIPTION": "Roles and ResponsibilitiesSenior Software Engineer - MagentoRelevant Experience: 3 to 6 YearsLocation : Indore (M.P)Qualification: Any Graduate with relevant experienceResponsibilities :- Develop and manage e-commerce websites, web applications & web sites.- Analyze, design, code, debug, test, document & deploy applications.- Participate in project & deployment planning.- Experience in modules/extensions development/customization.- Exposure in Theme integration/customization.- Exp. In API creation/integration.- Development,Troubleshoot, test and maintain the core product- Write clean, well-designed code- Software and databases to ensure strong optimization and functionality- Contribute in all phases of the development lifecycle- Follow industry best practicesTechnical Skills :- Should be well versed with PHP, HTML, MYSQL / Maria DB, Javascript, Jquery and require.js.- Exposure on Magento 2, CMS and JavaScript frameworks such as jQuery.- Demonstrable knowledge of XML, XHTML, CSS, Modules i.e. API integration, Payment Gateways, XML with a focus on standards.- Demonstrable source control experience- Two or more published website in E-Commerce.- Build a highly scalable product right from scratch- To create own themes based on requirements from HTML scratch- Having good experience in Design Pattern- Knowledge of Customization of themes & pluginsAdditional Skills :- A lot of passion for problem solving, programming & web-development.- Should possess good communication capabilities. Should be a very good team player with a go getter attitude, results driven, adaptable, inspirational, organized and quality focused- Understanding of best standards, guidelines etc. and actually cares about adhering to them- Ability to handle complex problems from design to execution and deliver in time bound manner under constraints.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["API Integration", "jQuery", "Payment Gateway", "XML", "Magento", "Magento Integration", "MySQL", "Javascript", "CMS", "MariaDB", "Magento 2"]}