{"JOB DESCRIPTION": "Roles and ResponsibilitiesSr.Software Engineer - SDL TridionLocation : Indore / RemoteExperience : 5-7years Qualification : BE / BTec/ MCA / MTec / ME / Msc.Technical Skills :-- At least 2 prior SDL upgrades / implementations (version 8.5 or above).- Extensive experience in Asp .NET, Asp .Net core, MVC, SQL, XML, HTML, JavaScript/JQuery, Web API Web services.- At least one implementation with DXA2.0- Experience in using and configuring SDL Web 8.5/ Tridion Sites 9 with Core Services APIs- Should have good Knowledge in Topology Manager, Smart Target implementation and Tridion Microservices- Tridion TOM.Net experience to understand existing API setup, Tridion Event System implementation- Should have knowledge about working in MS Azure and Integration API- Knowledge of DXA2.0 with MVC is a MUST in .NET background - Experience with a strong background in large-scale, CMS-driven web application development., - Schema Design, Component & Page Templates, SiteEdit, Workflow, Event System, Smart Targe, DXA, Content Services, OData- Tridion Core Service, DD4T Framework, Content Broker, Archive Manager, Content Interaction Services. Responsibilities:-- Design, Implement and maintain .net application(SDL Tridion) in all phases- Drive best practice, consistency, and Quality within the design and development phases- Provide Technical Support, and consultation for .net Application- Establish, refine, and integrate development and test environment tools and software as needed.- Develop technical design for application development- Ability to handle complex problems from design to execution and deliver in time bound manner under constraints.- Ability to write unit testing cases.Soft Skills :- Should be a very good team player with a go-getter attitude.- Should possess good communication capabilities.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "MCA in Computers, M.Tech in Any Specialization, MS/M.Sc(Science) in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Azure", "API Integration", "SDL Tridion", "jQuery", "WebAPI", "Javascript", "CMS", ".Net", "Webservices", "MVC", "ASP"]}