{"JOB DESCRIPTION": " Roles and Responsibilities  Review end to end processes and provide   procedural/systematic approach to address business needs Configure new modules in WMS i.e. Labor management to suit   to customer business needs Propose systemic modifications to enhance existing   processesDesired Candidate Profile  Should have experience in supporting the Manhattan WMS in following areasIn-depth knowledge and understanding on   warehouse operations i.e. inbound, outbound, inventory management,   waving, pick and packing etc., Hands on   configuration experience in Manhattan WMS systemUnderstand,   assess and provide procedural / systemic modifications to address         business needsGather         requirements and design the most accurate and effective solution         possible.Analyzing the repetitive failed processes to  drive out risk.Strong proficiency in oracle SQL, Unix and/or  Linux servers for application development.Participate in all phase of implementation and         support of application and components in multi-technology,         business-critical systems.Document requirements and solutions according    to the business SDLC process.Work to establish, maintain and update  strategy used in implementing the supply chain systems.Able to resolve the configuration related  issues in WMS application.Excellent communication skillsGood To Have Stay up-to-date on current and future warehouse execution technologies, capabilities and trends.Establish and maintain strong working  relationships with co-workers, the business community and customers. Outgoing, action-oriented self-starter who enjoys fast packed dynamic environments who works well individually and in a team.Good to have SCI architecture.Skills in creating presentations and scorecards. ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["Unix", "Application Development", "Communication Skills", "Labor Management", "Oracle SQL", "Inventory Management", "Inbound", "WMS", "Supply Chain", "Warehouse Operations"]}