{"JOB DESCRIPTION": "You have to work with,  collaborate with,  and integrate into the larger engineering team working from the same development plan and coordinating tasks and objectives effectively. \n\nMobile Marketing Platform To Grow User Acquisition &  Engagement Lead Software Engineer APPLY NOW \n\nExperience:  5-  7years Bangalore Technical Skills Required \n\nB.E /   B. Tech preferred in Computer Science from a premium educational institution \n\n5-  7 years of professional software development experience developing mission-  critical applications in a production UNIX environment with at least 2 years in a technical leadership role \n\nStrong technical skills in C++/  Java,  MySQL,  Oracle,  UNIX,  Apache,  Netty and Tomcat \n\nExpertise in two or more of these fields is mandatory:  Databases (or Large Data stores) /   Networking /   OS /  Distributed Computing /   Grid Computing /   Web Services In-  depth Experience with \n\nCommon web services protocols (DNS,  HTTP,  SSL,  REST) \n\nUnderstanding of scalability considerations in designing high-  performance servers \n\nUnix operating systems (especially Linux) and system calls \n\nTCP/  IP networking and network programming \n\nHashing and caching,  disk/  memory tradeoffs \n\nMemory management,  threads,  I/  O performance optimization \n\nAbility to drive the problem resolution process from start to finish \n\nExcellent communication,  interpersonal,  and problem solving skills \n\nThrive in a cross functional team on high profile,  critical projects \n\nStrong skills and proven record of designing and implementing multi-  tier web solutions \n\nStrong debugging/  diagnostic and analytical skills \n\nAbility to work independently and with a team \n\nCan learn and implement new technologies quickly and effectively \n\nExcellent communication and interpersonal skills \n\nHistory of delivering successful software products on time \n\nDegree in Computer Science or equivalent \n\nExperience with entire software development lifecycle including requirements,  specification,  documentation,  testing,  release and maintenance Nice to have /   willing to learn:  \n\nBackground in 24x7 operating environments will be very valuable", "ROLE": "Software Developer", "INDUSTRY TYPE": "Telcom, ISP", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Production/Industrial", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Unix", "C++", "Tomcat", "Linux", "MySQL", "Debugging", "DNS", "HTTP", "Oracle", "Apache"]}