{"JOB DESCRIPTION": "     Responsibilities/What You ll Do:     This is a technical role that will be accountable for the design and implementation of efficient applications and services for the Microsoft Azure, AWS or GCP Platform .     Passionate about building great products, a great communicator of ideas solutions and a lateral thinker when faced with complex performance or production issues     Work closely with Solution Architects and Product Managers and will communicate regularly with Developers, Testers, customers, partners and business people.     Must be a self-starter, quick learner, well organized, and detail-oriented. Should be comfortable working in a start up like environment.     Familiarity with Cloud Security and compliance requirements (e.g. PCI, CIS, ISO, CSA, HIPAA etc.)     Seeing projects through architectural and security reviews, deployment and production support        Qualifications/Your Background:     Technical degree (Computer Science or Math) or equivalent professional experience     Microsoft Azure or/and AWS platform related certifications is a plus      5+ years of experience in implementing using Azure Serverless and PaaS services like Durable Functions, web sites, web/worker roles, SQL Azure database, storage, service bus.       Development experience in C#, React.js, JavaScript/jQuery, HTML5, ASP.net MVC (Web API), and CSS3      Experience in implementing, debugging & troubleshooting enterprise applications using Azure platform services, like Azure app service, Azure SQL, Microservices     Prior experience on Microsoft Azure & Azure Active Directory, Rest API       Designing solutions using one or more AWS features, tools and technologies such as EC2, EBS, Glacier, S3, ELB, CloudFormation, Lambada, CloudWatch, VPC, RDS, Direct Connect, AWS CLI, REST API     Experience on AWS Security: Compliance, Cloud Security Architecture, third-party security tools/platforms, encryption/KMS/STS, Inspector, Macie, IAM policies/roles, Shield, WAF, etc.     Expertise towards integration with AWS Trusted Advisor, AWS Config, AWS Security Hub and AWS Control Tower     Hands-on experience in container-based deployments and orchestration tools (e.g. Kubernetes, Docker, AKS, EKS, GKE)     Experience in scaling and   performance tuning of large systems       RESTful web services (hands-on experience on RESTful APIs)      Cloud and Service Oriented design and engineering experience      Experience on TFS or Visual Studio Online CI/CD      Excellent proactive analytical and problem solving skills     Verbal, Written communication and presentation skills     Comfortable working in a dynamic environment and developing flexible solutions to meet evolving requirements.     Experience in addressing security aspects with various distributed infrastructure and web based solutions.     Experience with SDLC and Agile/iterative methodologies required.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Performance tuning", "jQuery", "Production support", "Active directory", "Agile", "HTTP", "Troubleshooting", "SDLC", "SQL", "Firewall"]}