{"JOB DESCRIPTION": "  Position summary       Be a part of an application development IT shop through the requirement, design, development, QA SDLC cycles with a focus on C#, ASP.NET, and relational database technologies    Lead aspects of our services based solutions and internal applications to ensure consistency, quality, architectural integrity, scalability, and availability    Investigate and integrate advances in software engineering technology and practices into the overall development process; these areas should include, but are not limited to programming languages, relational database systems, application frameworks, software processes, software automation, and system optimization scaling    Help to resolve questions of program intent, software requirements, and inclusion of internal checks and controls    Collaborates with team and business owners in the development andor execution of all types of software development considering the objectives of the organization    Participate in the full systems life cycle with solution design, development, implementation, and product support using scrum and other agile methodologies.    Maintain source-code repository, and participate in deployment of code into production.    Help explore and implement new technologies.    Communicates the status and forecasting of these projects to the internal clients through a variety of methods    Identifies new technologies that will benefit short and long-term department goals.    Produces and implements enhancements to existing designs as needed.          Essential functions          Strong technical knowledge of C# and experience in .Net framework 4.6 (or newer) or .net Core    Strong technical knowledge of SQL and experience in SQL Server 2012 or newer    Experience in scripting languages such as Python or JavaScript    Experience using a unit testing framework    Ability to consistently operate with a strong focus on attention to detail    Ability to produce work with an exceptional high level of accuracy    Anticipates, recognizes and proactively solves problems effectively    Worked in an Agile environment    3+ years experience working in software engineering related occupations    Bachelor's degree from an accredited university in a related field    Specific vision abilities, including close vision, operate computer screen for extending periods of time    May be required to sit or stand for extended periods of time    Ability to read, write and speak the English language fluently     Preferred     Qualifications     :       Experience using Automation Anywhere RPA (Robotic Process Automation) or other process automation      Adept at writing SQL queries and T-SQL stored procedures. Fundamental understanding of relational databases and MS SQL Server      Proficient with design patterns, security, performance, UI components and caching      Track record in establishing strong relationships with other team members and business-related people.      Intense intellectual curiosity and an ability to view old problems with a fresh perspective      Excellent written computer and oral communication skills      Experience working in a healthcare related field            ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["MS SQL", "Javascript", "Agile", "Application development", "Scrum", "Stored procedures", "Unit testing", "Information technology", "SDLC", "Python"]}