{"JOB DESCRIPTION": "Roles and Responsibility :\n 1.         Design, create and maintain production-ready data/ML pipelines and ML pipelines\n\n 2.         Drive optimization, testing and tooling to improve quality\n\n 3.         Review and approve solution designs and architecture for data and ML pipelines\n\n 4.         Experience in developing rest API services using one of the scala frameworks\n\n 5.         Experience [Within Last 3 Years]:\n\n 1.         Scala: Min 2 Year\n\n 2.         Spark: Min 2 Year\n\n 3.         Hadoop: Min 2 Year\n\n 1.         Security\n\n 2.         Spark on yarn\n\n 3.         Architectural knowledge\n\n 4.         Hbase: Min 2 year\n\n 5.         Hive ? 1 Year Exp.\n\n 6.         RDBMS (MySql / Postgres / Maria) ? 2 Years Exp.\n\n 7.         CI/CD 1 Year Exp.\n\n 8.         Best coding practices in Scala\n\n 9.         Good to have:\n\n 1.         Kafka\n\n 2.         Spark Streaming\n\n 3.         Apache Phoenix\n\n 4.         Caching layer (Memcache / Redis)\n\n 5.         Spark ML\n\n 6.         FP (Scala cats / scalaz)\n\n 7.         Good time management and multitasking skills to work to deadlines by working independently and as a part of a team.\n\n Responsibilities\n\n ?Design and implement a fine-tuned production-ready data/ML pipelines in the Hadoop platform\n\n ?Understand business requirement and solution design to develop and implement solutions that adhere to big data architectural guidelines and address business requirements\n\n ?Following proper SDLC (Code review, sprint process)\n\n ?Identify, design, and implement internal process improvements: automating manual processes, optimizing data delivery, etc\n\n ?Build robust and scalable data infrastructure (both batch processing and real-time) to support needs from internal and external users\n\n ?Review and approve high level & detailed design to ensure that the solution delivers to the business needs and align with the data & analytics architecture principles and roadmap\n\n ?Understand various data security standards and use secure data security tools to apply and adhere to the required data controls for user access in Hadoop platform\n\n ?Support and contribute to developing guidelines and standards for data ingestion\n\n ?Work with data scientist and business analytics team to assist in data ingestion and data-related technical issues\n\n ?Design and document the development & deployment flow.\n\n The ideal candidate should possess\n\n ?Bachelor?s degree in IT, Computer Science, Software Engineering, Business Analytics or equivalent with at least 2 years of experience in big data systems such as Hadoop as well as cloud-based solutions.\n\n ?Ability to troubleshoot and optimize complex queries on the Spark platform\n\n ?Expert in building and optimizing ?big data? data/ML pipelines, architectures and data sets\n\n ?Excellent experience in Scala\n\n ?Knowledge of modelling unstructured to structured data design/modelling,\n\n ?Experience in Big Data access and storage techniques\n\n ?Experience to do cost estimation based on the design and development\n\n ?Excellent debugging skills for the technical stack mentioned above which even includes analyzing server logs and application logs\n\n ?Highly organized, self-motivated, proactive, and ability to propose best design solutions\n\n ?Ability to analyse and understand complex problems\n\n ?Ability to explain technical information in business terms\n\n ?Ability to communicate clearly and effectively, both verbally and in writing\n\n ?Strong in User Requirements Gathering, Maintenance and Support\n\n ?Excellent understanding of Agile Methodology\n\n ?Good experience in Data Architecture, Data Modelling, Data Security experience\n\n Job Perks\n\n ?Attractive variable compensation package\n\n ?Opportunity to work with an award-winning organization in the hottest space in tech ?\n\n artificial intelligence and advanced machine learning\n\n Scala, Spark, CI/CD", "ROLE": "Software Developer", "INDUSTRY TYPE": "Strategy, Management Consulting Firms", "FUNCTIONAL AREA": "IT Software - System Programming", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "RDBMS", "Coding", "Application programming", "MySQL", "Debugging", "Machine learning", "Distribution system", "SDLC", "Recruitment"]}