{"JOB DESCRIPTION": "  The Person We Need Has:     A love of, and alignment with, the 75F mission, virtues values.     An Extremely High Technical Aptitude we are an extremely high- tech company!     A love of technical architecting and technology platform solutioning.     Integrity. At all times and in all situations. No compromise here.     Enthusiasm Passion     Insanely superb written and verbal good communication skills and a high level of professionalism along with the ability to effectively collaborate with cross functional teams.     Strong time management skills     A fast learner, comfortable teaching yourself with new skills and can thrive in a complex and fast-paced environment.     A love for analytics and various User experience aspects.     Detail-oriented and highly motivated approach     Quality-first approach for development implementation and team processes     Desire for continuous learning and improvement     Desire to work outside comfort zone     Required Education     Bachelor s Degree or higher in Computer Science, Software Engineering, or closely related technical discipline     And the following Skills:     4+ years of relevant experience with a Cloud infrastructure service provider mandatorily Azure.     Prior experience in automating the infrastructure using ARM templates preferably some Infrastructure as a Code using Ansible/Terraform     Strong Programming skills in one or more languages (Python/Java/Shell scripting etc)     Experience in handling end-end responsibilities which include CI/CD, Monitoring, Performance, Cost Management.     Ensure a smooth system deployment with the intended functionality     Plan and execute all deployment of system features and monitor for successful integration, maintaining the system throughout its lifecycle     Recommend software solutions to emerging needs.     Experience working in a Docker containerized environment     Work with other members of a planning team to develop a prototype delivery for an system when needed     Experience with designing databases, programming on Azure services and function apps is an added plus     And the preferred experience:     Previous work exposure in IoT industry / embedded / M2M industry (i.e. home automation, business automation, health, asset tracking, smart utilities, etc.)     Experience with distributed teams are highly desired     Ability to technically drive solutions across various features. Must be able to seek input when required, prioritize and drive results.     Knowledge of implementing maintainable and well-tested software and relevant support technologies (e.g. Git, SQL/NoSQL databases, build pipeline automation, etc.)     Ability to develop resilient and high-scalability applications     Ability to learn quickly and adapt to change in a fast-moving environment     Highly collaborative approach to technical delivery from the standpoint of business domain and requirements  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Other", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Automation", "Prototype", "GIT", "devops", "Shell scripting", "Analytics", "Monitoring", "SQL", "Python"]}