{"JOB DESCRIPTION": "    Job Description  :     Experienced mid-level developer with experience in software design, coding and debugging. The developer will gain exciting real-world software engineering experience in a fast paced, dynamic environment of a thriving company.       We frequently work in small teams to solve problems, explore new technologies, and learn from one another. The ideal developer for this environment will be a core hands-on individual who s enthusiastic and collaborative.       Role and Responsibilities:        Build high performance, scalable and extensible applications using Riversands data platform         Understand technical requirements and design and develop efficient code         Deliver in an agile fashion         Ability to work within a small/large team         Collaborate with Team Leads, Business Analysts, and QA        Mandatory skills:        4+ years of professional software development experience         3+ years of experience leveraging object-oriented design practices in Java with good understanding of REST API and JSON, XML Structures         Working knowledge of Nodejs, JavaScript, Python, Kafka, Big data         Must have experience working with cloud resources (Azure)         Sharp analytical abilities, proven design skills and a track record of delivery.         Working knowledge of front-end user interfaces through to back-end systems and all points in between.         Knowledge of professional software engineering practices & best practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations, modularity, use of abstractions, defensive coding, etc.         Experience influencing software engineers best practices within your team.         Bachelors or Masters in Computer Science, Engineering         Ability to work as an individual contributor & work with remote teams      Desired skills:        Working knowledge of Nodejs, JavaScript, Python, Kafka, Big data would be an added advantage         Ability to manage the work of the team members when required   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Procurement", "Software design", "Coding", "XML", "Debugging", "Javascript", "Agile", "HTTP", "JSON", "Python"]}