{"JOB DESCRIPTION": "Roles and Responsibilities  Cvent’s Technology Team has a great opportunity for you to:Work on Internet scale applications, where performance, reliability and scalability, are critical design goals not after-thoughts.Create beautiful, interactive and easy-to-use web applications using rich client-side code and MVC based server-side code.Learn the nuts and bolts of Service-Oriented Architecture (SOA) and Event-Driven Architecture (EDA) in real-life applications.Gain experience with different database technologies, ranging from traditional relational to the latest NoSQL products such as Couchbase.The prerequisites for joining our development team are simple. We care more about your attitude and aptitude than the specific tools and technologies you have used in the past. You need to have a strong passion for software development and must take pride in your coding. You should also have great analytical skills and ability to handle complex, modular software development in a collaborative team-based environment. Desired Candidate Profile In addition to this, you will have a leg up if you also meet the following criteria:4 to 6 years of hands-on programming experience with Java / CoreJava, Spring MVC and Struts framework.Working with RESTful Web Services and API development using dropwizardExperience with one or more of the following databases: SQL Server, MySQL, PostgreSQL, Oracle, Couchbase, Cassandra or other NoSQL technologiesExperience of working with open source technologies such as RabbitMQ, ActiveMQ, Elasticsearch will be plusExperience / knowledge into JavaScript + Angular / React Js is preferred.B.Tech / M.Tech in Computer Science OR related technical disciplinePerks and Benefits ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Graduation Not Required"}, "KEY SKILL": ["Java", "Spring Mvc", "NoSQL", "Couchbase", "Couchdb", "MongoDB", "Microservices"]}