{"JOB DESCRIPTION": " This role analyzes, designs, programs, debugs, and modifies software enhancements and/or new products used in local, networked, or Internet-related computer programs. Code is used in applications that variously support Bioclinica s radiologists, clinical data managers, operations staff, clients and partners. Using current programming language and technologies, writes code, completes programming, and performs testing and debugging of applications. Completes documentation and procedures for installation and maintenance. May interact with users to define system requirements and/or necessary modifications.          Primary Responsibilities        Ensures software applications are built with quality while conforming to corporate and regulatory processes and practices by     Performing requirements analysis, proactively identifying deficiencies, ambiguities, and outstanding questions    Identifying and communicating clear distinctions between business requirements, design, and implementation constructs    Following established software patterns and development processes    Writing simple concise unit tests with appropriate code coverage    Identifying, documenting, and communicating steps to reproduce and workarounds for bugs    Identifying gaps and deficiencies in requirements, design, development, testing, support processes    Delivering tested code in consistently timely fashion with a high degree of efficiency and a low frequency of bugs (or reopened bugs)    Identifying design alternatives, questions, and tradeoffs    Identifying gaps, problems, and weaknesses in software solutions by performing code and design reviews    Demoing application features and fixes with product management and users    Providing advice and instruction to software quality assurance team in identifying points of emphasis in regression testing efforts      Ensures software applications are built on schedule and on budget by      Escalating risks to quality and timelines appropriately    Effectively transitioning between unrelated tasks    Troubleshooting and support coding    Appropriately seeking help/mentoring      Estimating development efforts based on detailed design      Ensures software applications are effectively supported by      Definitively isolating problems/bugs to a component    Troubleshooting and support coding outside of your personal or company experience background      Maintains quality service and departmental standards by      Reading, understanding and adhering to organizational Standard Operating Procedures (SOPs)         Secondary Responsibilities        Contributes to team effort by     Exploring new opportunities to add value to the organization and departmental processes    Helping others to achieve results    Performing other duties as assigned      Maintains technical and industry knowledge by      Attending and participating in applicable company-sponsored training    Maintaining a strong understanding of software development trends and technology    Maintaining a strong understanding of the regulatory requirements applicable to software development in clinical trials         Qualifications:      Education:     Bachelor s Degree strongly preferred     Experience:      3+ years of software development experience     Experience working with clinical trials and/or within pharmaceutical environment preferred    Working knowledge of the drug development process including knowledge of FDA requirements for GxPs and 21 CFR Part 11    Proven problem solving abilities     Additional skill set:     Ability to work in group setting and independently; ability to adjust to changing priorities    Unwavering commitment to service and product excellence    Strong interpersonal and communication skills, both verbal and written    Strong documentation and organizational skills    Ability to project and maintain a professional and positive attitude   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Pharma, Biotech, Clinical Research", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Product management", "Coding", "Pharma", "Debugging", "Clinical trials", "Regression testing", "Troubleshooting", "Application software", "Software quality assurance", "clinical data"]}