{"JOB DESCRIPTION": "  As a Data Engineer, you will be responsible for developing, testing and boosting our data pipeline architecture, develop and standardize data pipes for utilization by our cross functional teams. The Data Engineer will support our software developers, data architects, data analysts and data scientists throughout the lifecycle of the data projects.    Job Responsibilities      Design, create, test and maintain data pipeline architecture in collaboration with the Data Architect.     Build the infrastructure required for extraction, transformation, and loading of data from a wide variety of data sources using SQL and AWS technologies.     Support the translation of data needs into technical system requirements. Support in building complex queries required by the product teams.     Build data pipelines that clean, transform, and aggregate data from disparate sources     Develop, maintain and optimize ETLs to increase data accuracy, data stability, data availability and pipeline performance.     Engage with Product Management and Business to deploy and monitor products/services on cloud platforms.     Stay up-to-date with advances in data persistence and big data technologies and run pilots to design the data architecture to scale with the increased data sets of consumer experience.     Handle data integration, consolidation and reconciliation activities for digital consumer / medical products.      Job Qualifications:      Bachelors or master's degree in Computer Science, Information management, Statistics or related field     5+ years of experience in the Consumer or Healthcare industry in an analytical role with focus on building on data pipelines, querying data, analyzing and clearly presenting analyses to member of the data science team.     Technical expertise with data models, data mining.     Hands on Knowledge of programming languages in Java, Python, R and Scala.     Strong knowledge in the Big data tools like snowflake, AWS Redshift, Hadoop, map reduce etc.     Having knowledge in tools like AWS Glue, S3, AWS EMR, Streaming data pipe lines, Kafka/Kinesis is desirable.     Hands on knowledge in SQL and No-SQL database design.     Having knowledge in CI/CD for the building and hosting the solutions.     Having AWS certification is an added advantage.     Having Strong knowledge in visualization tools like Tableau, QlikView is an added advantage     A team player capable of working and integrating across cross-functional team for implementing project requirements. Experience in technical requirements gathering and documentation.     Ability to work effectively and independently in a fast-paced agile environment with tight deadlines     A flexible, pragmatic and collaborative team player with innate ability to engage with data architects, analysts and scientists.    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Medical, Healthcare, Hospitals", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Product management", "Computer science", "Database design", "Agile", "Healthcare", "QlikView", "Information management", "Data mining", "Python", "Data architecture"]}