{"JOB DESCRIPTION": " Description     Threat intelligence analysts at Infoblox have the unique opportunity to research threats, analyze malware behavior and campaigns, build their own detectors and create labeled data sets to protect our customers. Our analysts enjoy the creative environment and ownership that comes with working projects largely from ?soup to nuts.? Members of our team are also integral parts of the creative and technical development of our proprietary intelligence processing tools and packages - often designing and building them up to the point of deployment.      We consider the ideal candidate to be an experienced intelligence and malware analyst who knows and understands DNS (protocols, datasets, tunneling). We are also looking for someone familiar with intelligence processes, requirements, collection and reporting. Individuals with strong logic, correlation, analytical, communication and technical skills, as well as the motivation to continuously learn will fit well on our team. Candidates with malware research experience and an understanding of attacker methods and objectives will be given preference.     Responsibilities:     Collect, analyze and exploit data from various sources   Develop actionable information in the form of technical indicators, reports, lists, rules, signatures, or indicators and warnings   Perform analysis on new indicators to detect prior compromise   Research and analyze malware, and develop detection algorithms   Research emerging threats, threat actors, TTPs   Develop and use predictive analytics to counter threats by tracking attack campaigns   Triage and respond to incidents or requests for analysis     Requirements:     8 years of experience with Python and other scripting languages   Proficiency operating on Unix/Linux systems,   Commitment to self-study, and maintaining proficiency in the technical cyber security industry   Fluency in additional European languages highly desirable     Additional Preferred Experience:     Proficiency in building/architecting AWS; comfort operating it via the command line    Pivoting off data points to find additional information and other intelligence processes/cycles (PFM, F3EAD, etc.)   Understanding of DNS, TCP/IP, common networking ports, protocols, and traffic flow   Experience using virtual environments for analysis of suspicious sites and files   Experience using reverse engineering tools such as IDApro, OllyDbg, etc.   Development of new detection mechanisms for various families of malware, preferably in Python   Tracking and reporting on threat actor tactics, techniques, and procedures (TTPs)   Writing intelligence reports and presentations    Education:    S. in CS, CE or EE or 4 years of relevant work experience  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Unix", "Linux", "cyber security", "Reverse engineering", "Analytical", "DNS", "TCP/IP", "Research", "Predictive analytics", "Python"]}