{"JOB DESCRIPTION": "   What you get to do in this role:       ServiceNow is seeking a Staff Software Development Engineer, to join our rapidly growing team building highly scalable Cloud Automation software. The team is looking for passionate staff developers/technical leader    s    , with a strong track record, who are in search of an exciting environment and innovative technology. As a Staff SDE    in    CloudX    team    , you will be a key member of a strong team of developers    building the Next Generation of Technology Products & Solutions for increasingly Cost (& Performance) Efficient      Cloud    .    .          The    broader    Cloud    Automation    team is focused on building a highly scalable and robust lights-out cloud automation manageability suite that automates various customer life cycle events like provisioning, cloning, load balancing thousands of ServiceNow customer instances across thousands of server farms globally distributed across the world. We leverage high-scale distributed computing fabric in concert with powerful orchestration logic to automate our Cloud.      .          In order to be successful in th    is role, we need someone who is     :       Polyglot Programmer: S    trong    (expert level)    knowledge of one language    (like Java)    and ability to switch languages as required        Ability to understand the business requirements & build product from concept to business impact        Ability to reduce problem statements to software requirements: Possess strong C    omputer    S    cience    fundamentals      knowledge and be capable of applying it in practice        Strong experience and understanding of Database Design (RDBMS in specific)    is    required.        Understand distributed systems: experience with problems at scale is preferred        Understands code management: a strong sense of organizing code is preferred, being hands-on with collaboration tools and code management tools    -    is a plus        Experience of application development on enterprise platform is a plus        Clear understanding of AI/ML is    required    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - eCommerce, Internet Technologies", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Automation", "orchestration", "RDBMS", "Database design", "Cloud", "Manager Technology", "Application development", "Load balancing", "Distribution system", "Team building"]}