{"JOB DESCRIPTION": "Roles and Responsibilities Job Summary:  Do you have a  passion for driving and delivering change and innovation? Lowe's is looking for  passionate Engineers who can deliver engineering and operational excellence  using best in class technology for our Stores and Supply Chain products. We are  looking for a fast learner who is always looking at multiple different ways of  solving problems.   The Lead Engineer  is a key technology leader who will provide technical leadership to a product  or suite of products. These products would need to be developed and supported  with cloud agnostic architecture and having the deployment flexibility. This  role requires you to be completely hands on. You will be part of high  performing teams that has functional ownership of Stores and Supply Chain  products.   Roles and Responsibilities:  The  responsibilities listed below could span across multiple key products based on  the size and complexity of the product. The roles and responsibilities include:  1.  Lay out  design patterns for your products with enterprise architecture alignment 2.  Perform  POCs and provide the guidance to the teams with the pros and cons derived from  the POC outcomes 3.  Design  and develop solutions independently using modern architectural approaches based  on event driven architecture and microservices 4.  Choose  appropriate algorithms and data structures to optimize non-functional needs of  the system 5.  Design  and build appropriate observability (monitoring, tracking, logging, alerting)  solutions from an operational excellence standpoint 6.  Identify  and build common enterprise components and platforms that can be leveraged by  multiple products 7.  Directly  contribute to the business stories as well as tech depth / engineering stories  in to the product backlog 8.  Influence  teams to incorporate engineering excellence and operational excellence in their  work.  9.  Problem  solve critical issues during development cycle as well as production issues 10.  Innovate  and help build everyday innovation culture 11. Build and  coach the team on engineering best practices among engineering as well as  leadership community 12.  Help  recruit engineering talent   Years of  Experience:  1.  9 +  years in software / IT development 2.  5 +  years of experience in design, build and supporting distributed architecture 3.  3 +  years of experience in microservices and event driven architecture 4.  2 +  years of product engineering 5.  2+  years of agile software delivery 6.  2+  years of experience in coaching and mentoring engineers  Requirement  Minimum Qualification: 1. BE / BTech  Must have:  You must be a full  stack engineer having hands on experience in designing, building and supporting  more than 2 complex and distributed applications and platforms. Following is a  list of MUST have areas where in you should have deep rooted experience:  1.  Microservices,  API gateway 2.  One or  more cloud interface (GCP/AWS/Azure) 3. Performance engineering 4. Distributed architecture 5.  Java  and other object oriented programming languages  6.  One or  more relational and one or more NoSql databases 7.  One or  more messaging and streaming technologies (Kafka will be an added advantage) 8.  More  than 1 Test frameworks such as BDD, TDD etc., 9.  CI/CD  pipelines including Docker, Kubernetes  10.  Building  applications for Unix / Linux OS   Good to have: 1.  Retail  domain experience 2. Resiliency engineering 3. Scaling workloads up or down 4. Caching technologies", "ROLE": "Software Developer", "INDUSTRY TYPE": "Retail, Wholesale", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "BCA in Computers, B.Tech/B.E. in Any Specialization, B.Sc in Any Specialization", "PG": "MCA in Computers, M.Tech in Any Specialization, MS/M.Sc(Science) in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Java", "Technical architect", "Algorithms", "NoSQL", "OS", "Software Engineering", "Design Patterns", "Data Structures", "Kafka", "Object Oriented Programming", "Microservices"]}