{"JOB DESCRIPTION": "Engineering\n\n\n\nExperiencedJOB TITLE: SENIOR SOFTWARE ENGINEER -  DATA INFRASTRUCTURE\n\nLOCATION: MUMBAI,  INDIA\n\nOUR STORY:\n\nJioSaavn is South Asia s leading music streaming service. We are over 200 entrepreneurs,  across New York,  California,  Mumbai,  Gurgaon,  and Bangalore,  who help music lovers access,  discover,  and listen to their favorite songs across languages and genres. In early 2018,  a merger between JioMusic and Saavn was announced; creating a combined entity valued at over$1billion.\n\nWe blend digital technology,  data analysis (which we have affectionately coined Music Science),  and a strong,  fearless business acumen to reach all corners of the globe. Through partnerships with Apple,  Google,  Amazon,  Facebook,  Twitter and Shazam -  to name a few -  JioSaavn reaches more music fans across the world. Our award- winning mobile products,  partnerships,  innovations and thought leadership have been featured in some of the world s leading publications,  from The New York Times,  to The Wall Street Journal,  The Economic Times to Forbes,  and many more. We are well- funded by some of the world s most successful institutional investors and global media companies as well as a number of strategic individuals. Beyond investing,  they are advisors and supporters of our vision,  our passion,  and our collective ability to deliver a revolutionary music experience as the leader in India.\n\nOUR CULTURE:\n\nAt JioSaavn,  we ignite passion and performance to work towards a collective goal: creating the perfect mobile entertainment ecosystem that delivers the best possible music experience to millions of listeners around the world. Our default mode is that of perpetual innovation. Together,  we form a concerted rhythm that goes beyond borders. We don't just go with the flow,  we create it.\n\nJioSaavn offers a dynamic and unconventional work environment,  full of fun wholesome experiences from in- office performances by some of the world s most beloved musicians to opportunities for international travel. We believe creativity and technology blend together like sweet melodies. When you choose JioSaavn,  you join a diverse world of high- calibre techies,  artists,  and inventors hailing from companies like Yahoo!,  Twitter,  LinkedIn,  Google,  Qualcomm,  HBO,  Microsoft,  Flipkart,  Amazon,  Paytm,  Quikr,  MSN,  and NDTV. We are one of the few digital companies to provide employment opportunities that meet the Silicon Valley benchmark right here in Mumbai! Figures,  since we ve got Silicon Valley covered,  too.\n\nOur value- based,  people- first work culture is about empowering every individual in our global team to be catalysts for change in this dynamic digital world. Every day is an opportunity to bring your vision to life,  and to expand,  learn and grow. No idea is left unconsidered. No voice is left unheard.\n\nWith listeners speaking multiple languages in almost every country in the world,  we like to think we have the most diverse user base on the planet. This has only been made possible because of the value we place on radical inclusivity in our offices across the globe. We believe different is wonderful,  and what sets us apart is also what brings us closer. JioSaavn prides itself on being an equal opportunity employer. We have committed ourselves to creating a safe environment with fair and equal access and opportunities,  sans discrimination. We encourage everyone to be open to experiences and perspectives beyond their normal; divergent thinkers create differentiated products,  and even better music.\n\nIf our vibe matches with yours,  we'd love to hear from you.\n\nROLE:\n\nJioSaavn is looking for an experienced and passionate Senior Software Engineer to join our Data engineering team in Mumbai/ Banglore. You ll lead or help lead,  the innovation and development of a plethora of in- house tech like user targeting systems,  real- time/ batch data processing systems and overall scalability of many other systems.\n\nRESPONSIBILITIES:\n\nMaintain and monitor ETL jobs as part of Data pipeline using airflow.\n\nDeveloping and deploying distributed ETL jobs using open source frameworks such as Hive,  Spark,  Presto,  Storm etc.\n\nManage data warehouse and design schemas.\n\nBuild scalable infrastructure and tools for engineering,  product and other teams.\n\nDetect performance bottlenecks and come up with novel solutions to resolve them\n\nContribute in the planning and design of new systems or applications.\n\nMentor fresh engineers in the team.REQUIREMENTS:\n\nExperience with one or more of these technologies: Hive,  Spark,  Presto,  Airflow, ,  Kafka,  Storm,  Kafka Streams,  Spark Streaming\n\nExposure to ORC / Parquet file systems.\n\nExcellent problem solving skills.\n\nExpertise in writing distributed ETL jobs.\n\nFamiliarity with working in linux environments\n\nEagerness to explore,  embrace and excel in adapting to new technologies\n\nSelf motivated and Good communication skillsBONUS SKILLS:\n\nIdeally,  you ll also excel at least a few of the following:\n\nAbility to work with core AWS services like EMR,  EC2,  RDS,  S3 and VPC.\n\nSome hands- on experience with very elementary DevOps work,  and proficiency with bash scripting.\n\nBasic know- how of full stack web development.\n\nExperience with one or more of these technologies: MongoDB,  Cassandra,  Sqoop,  Druid,  Jupyter NotebooksBENEFITS AND PERKS:\n\nAt JioSaavn,  we blur work and play,  and you get all the perks of a global company. You will get to work with a dynamic group of entrepreneurs,  who are delivering results and working zealously across time zones to make a difference in the way the world experiences music. We love what we do,  and we think you will too.\n\nGroup Mediclaim\n\nFun Fridays\n\nFlexible vacation policies\n\nFree healthy (and unhealthy) lunches & snacks\n\nJioSaavn- sponsored team outings", "ROLE": "Software Developer", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - Other", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Data analysis", "Linux", "cassandra", "Web development", "Infrastructure", "Data processing", "MongoDB", "Silicon", "microsoft", "Open source"]}