{"JOB DESCRIPTION": "     Job Description    You will design, develop, modify, debug and/or maintain software code according to functional, non-functional and technical design specifications.  You will follow Amdocs software engineering standards, applicable software development methodology and release processes, to ensure code is maintainable, scalable, and supportable, and demo the software products to stakeholders.  You will investigate issues by reviewing/debugging code, provide fixes and workarounds, and review changes for operability to maintain existing software solutions.  You will work within a team, collaborate and add value through participation in peer code reviews, provide comments and suggestions, and work with cross functional teams to achieve goals.  You will assume technical accountability for your specific work products within an application and provide technical support during solution design for new requirements.  You will be encouraged to actively look for innovation, continuous improvement, and efficiency in all assigned tasks.             Bachelor?s degree in Science/IT/Computers or equivalent               2- 3 Years? experience as a Software Engineer                Development experience in Java                Development Experience in micro services architecture Sprint boot               Experience working with Cassandra/Postgre Or SQL Server                Expert in UNIX Shell Scripting.               Exposer on Spark and Kafka.               Added advantage if have exposer on Docker Containerization, Ansible.               Self-motivated, Self-learner takes initiative, a team player, while being organized and responsible.                      Excellent communication skills, Analytical Ability, Learning Ability and strong attention to detail      ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Telcom, ISP", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["cassandra", "Technical design", "Analytical", "Continuous improvement", "Application software", "Amdocs", "Software solutions", "Technical support", "Unix shell scripting", "SQL"]}