{"JOB DESCRIPTION": "     Job Description    You will design, develop, modify, debug and/or maintain software code according to functional, non-functional and technical design specifications.  You will follow Amdocs software engineering standards, applicable software development methodology and release processes, to ensure code is maintainable, scalable, and supportable, and demo the software products to stakeholders.  You will investigate issues by reviewing/debugging code, provide fixes and workarounds, and review changes for operability to maintain existing software solutions.  You will work within a team, collaborate and add value through participation in peer code reviews, provide comments and suggestions, and work with cross functional teams to achieve goals.  You will assume technical accountability for your specific work products within an application and provide technical support during solution design for new requirements.  You will be encouraged to actively look for innovation, continuous improvement, and efficiency in all assigned tasks.      2-7 years of practical experience working with UNIX and/or Linux operating systems. Applicants must demonstrate good working knowledge of system commands and diagnostic functions.   Knowledge of telecom domain ( GSM, LTE) , network architecture ( including SGW, PGW,GGSN, MME, PCRF, OCS ) and hands-on experience on diameter protocol.   Good understanding of network interface like Gx, Gy, Sy   A working knowledge of networking concepts (TCP/IP and UDP), and network diagnostic tools such as Wireshark.   Scripting knowledge   Experience with troubleshooting techniques and tools for telco applications and protocols   Bachelor's degree in Science/IT/Computing or equivalent     Nice to have / Preferred experience     Experience in DB operations and troubleshooting from application perspective   Experience on Intelligent Routing Controller, Load balancer   OpenStack, Kubernetes, Docker, VMWare knowledge  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Telcom, ISP", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Unix", "GSM", "VMware", "Linux", "Diagnostics", "Troubleshooting", "Continuous improvement", "Amdocs", "Technical support", "WireShark"]}