{"JOB DESCRIPTION": " KEY RESPONSIBILITIES    Design and develop of software platforms/products/product components using Java EE.   Strong problem-solving capability. Analyse business issues and technical problems independently, and come up with smart, logical solutions.    Participate in product releases through requirement reviews, development, deployment, setting up environments; documenting release notes and technical details regarding functionality and configuration.   Ensure quality of developed code. Review test plans with QA drive the code reviews within the team.     QUALIFICATIONS    Good knowledge of the .NET 3.5/4.0 Framework, including Visual Studio, VB.NET, ASP.NET, MVC, ASMX and WCF Web Services, ADO.NET and ASP.NET AJAX.    Proficiency with Microsoft SQL Server in designing and optimizing queries and stored procedures.   Working knowledge of HTML, Java script, CSS, jQuery and Angular.    Experience in working with ETL tools like Microsoft SSIS is a plus.   Experience in developing high performance and scalable web applications with large databases is a plus.   Strong experience designing and working with n-tier architectures (UI, Business Logic Layer).    Experience in development of BI tools is a plus.   Team player with an inclusive approach to decision making.   Experience with Agile methodologies like Scrum and Test-Driven Development is a plus.    Excellent verbal and written communication skills.   Salary including benefits will be based on prior experience qualifications and will match industry standards.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "BPO, Call Centre, ITeS", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["jQuery", "Agile", "HTML", "Scrum", "test driven development", "WCF", "Visual Studio", "Stored procedures", "SSIS", "microsoft"]}