{"JOB DESCRIPTION": "  About the Role     Engineers at Uber have a deep impact across a wide variety of business and technology decisions spanning multiple projects. They are passionate and pragmatic technologists who are able to design, implement and deliver scalable and resilient systems. They are approachable, collaborators and mentors to engineers.    Our engineering culture is the same across all our engineering offices: in Hyderabad, this is no different from San Francisco or our other locations.    We are looking for someone with a passion for designing, building and scaling highly-available, mission-critical systems that support millions of users during their payment experience on a daily basis. Our systems ensure accurate and on-time payouts to our partners and seamless payment experience for our users along with providing a choice of payment methods (global and local).    We also provide necessary tooling for our internal business stakeholders. This is a unique opportunity for an experienced engineer who is collaborative, has a healthy sense of curiosity and acts with responsibility to join Uber, work with talented people across the board and help improve our next generation payments systems, scaling it to the next level. This is a very high impact role where you will interface with all major infrastructure & platform teams at Uber. Does this sound exciting to you Are you a tested team player, strategic thinker and executor    What the Candidate Will Need / Bonus Points    What the Candidate Will Need / Bonus Points     MS/BS in Computer science and at least 5 years of individual contributor experience as a software engineer  Coding chops, clean, elegant, bug-free code in any of the following languages - Java, C , GO     Prior experience as a tech lead who has mentored/led small teams in building product features at scale     The ability to go deep, but also appreciate the challenge of going broad. Uber has a huge stack, and we're all over it: backend services, real-time dispatch, machine learning, mobile, web development, data and analytics, infrastructure, marketing systems.     Solid understanding of distributed systems architecture - consensus, convergence, load balancing, data consistency and performance/efficiency constructs     Identify and resolve performance and scalability issues     Intelligence. High adaptability. Ability to learn quickly.     Strong desire to learn and grow, while building the best in class systems     Strong flair for effective communication and collaboration - you know when to push on and when to step back     An ability to have fun while working on the hardest problemsAt Uber, we ignite opportunity by setting the world in motion.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "SAN", "Backend", "Coding", "Software Engineer II", "Web development", "Machine learning", "Load balancing", "Distribution system", "Analytics"]}