{"JOB DESCRIPTION": "IntroductionSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do. Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide. At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.Your Role and ResponsibilitiesAs a Cloud Provisioning Engineer you will be responsible for recovering provisioning failures and will be first point of contact for any provisioning related issues. You will need to interface with cloud development teams to open defects and triage any issues. The engineer must review each provisioning request / incident and plan the activities with minimal impact to customer environmentResponsibilities:Responsible for recovering provisioning failures and will be first point of contact for any provisioning related issuesInterface with cloud development teams to open defects and triage any issues. The engineer must review each provisioning request / incident and plan the activities with minimal impact to customer environmentGood understanding of Cloud (Any Cloud like IBM cloud, AWS, Azzure)Worked on cloud provisioning and orchestrationUnderstanding on CHEF and AnsibleAble to work in 24X7 environmentExperience in handling provisioning related issuesWorking knowledge of Service NowKnowledge of vmWare and IBM power system would be added advantage.Knowledge of any storage solution would be added advantage.Working knowledge of Cloud automation managerIf you thrive in a dynamic, collaborative workplace, IBM provides an environment where you will be challenged and inspired every single day. And if you relish the freedom to bring creative, thoughtful solutions to the table, there's no limit to what you can accomplish hereRequired Technical and Professional ExpertiseMinimum 3+ years of experience in IT domainWorking knowledge of Cloud orchestration, VmWare and Power system knowledge and simple scripting capabilities.Ability to follow standard procedures along with basic knowledge of ITIL and ticketing standards.Experience in end-to-end management of Cloud provisioning recoveryProficient in Cloud technologies across any environmentScripting knowledge would be an added advantage.Preferred Technical and Professional ExpertiseYou love collaborative environments that use agile methodologies to encourage creative design thinking and find innovative ways to develop with cutting edge technologiesAmbitious individual who can work under their own direction towards agreed targets/goals and with creative approach to workIntuitive individual with an ability to manage change and proven time managementProven interpersonal skills while contributing to team effort by accomplishing related results as neededUp-to-date technical knowledge by attending educational workshops, reviewing publicationsAbout Business UnitAt Global Technology Services (GTS), we help our clients envision the future by offering end-to-end IT and technology support services, supported by an unmatched global delivery network. It's a unique blend of bold new ideas and client-first thinking. If you can restlessly reinvent yourself and solve problems in new ways, work on both technology and business projects, and ask, \"What else is possible?\" GTS is the place for you!Your Life @ IBMWhat matters to you when you’re looking for your next career challenge?Maybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.Impact. Inclusion. Infinite Experiences. Do your best work ever.About IBMIBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.Location StatementFor additional information about location requirements, please discuss with the recruiter following submission of your application.Being You @ IBMIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Orchestration", "Software Development", "Ibm Cloud", "Cloud Development", "Build", "Ansible", "Technology Consulting", "Design Thinking", "Global Delivery", "AWS"]}