{"JOB DESCRIPTION": "    You will design, develop, modify, debug and/or maintain software code according to functional, non-functional and technical design specifications.    You will follow Amdocs software engineering standards, applicable software development methodology and release processes, to ensure code is maintainable, scalable, and supportable, and demo the software products to stakeholders.    You will investigate issues by reviewing/debugging code, provide fixes and workarounds, and review changes for operability to maintain existing software solutions.    You will work within a team, collaborate and add value through participation in peer code reviews, provide comments and suggestions, and work with cross functional teams to achieve goals.    You will assume technical accountability for your specific work products within an application and provide technical support during solution design for new requirements.    You will be encouraged to actively look for innovation, continuous improvement, and efficiency in all assigned tasks.             Requirement: Full Stack Developer (2 - 6yrs)           Expert in API development in NodeJS using express/Nestjs     Should have experience in DevOps setup     Should have knowledge of ReactJS/VueJS, web markup     Docker, Github knowledge preferred     2 years of experience         Responsibilities         Responsible for full stack development in NodeJs and VueJs     Development of API in NodeJs (Express/ NestJs)     Front-End Development of reporting VueJS components (Charts, Schedulers, calendars) with use of a framework, as part of a reporting builder or custom dashboards and templates     Build reusable APIs     Ensure the technical feasibility of UI/UX designs     Optimize application for maximum speed and scalability     Implement basic functionality testing     Collaborate with other team members          ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Telcom, ISP", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Solution design", "github", "Front end", "Technical design", "Continuous improvement", "Application software", "Functionality testing", "Amdocs", "Software solutions", "Technical support"]}