{"JOB DESCRIPTION": "  About the Role    We are looking for exceptional engineers to build systems for our very own employees. Our mission is to enhance Uber's corporate speed, reliability and worker happiness by building products, integrations and platforms.    You will work closely with a highly capable team of engineers, data scientists, designers and product managers to ensure Uber's internal products and platforms are a powerful and innovative business advantage.   The Data Solutions and Workflow Automations team is a part of IT Engineering that builds scalable, reliable, near realtime and robust enterprise integrations of a plethora of applications and services we build and use at Uber.    What You'll Do:    You'll work with your teammates in a disciplined agile development environment to solve diverse technical challenges.    You'll build products and services that are highly available and scalable to serve our employees and global business groups.    You'll build integration solutions based on enterprise integration patterns and messaging technologies    You'll build modern web applications, integrate cloud services, and help drive projects to successful completion    What You'll need:    Strong coding/debugging abilities: You have advanced knowledge of at least one programming language and are happy to learn more. When working on backend, you'll primarily be working in Java.    To be a fast learner: We're looking for software engineers who thrive on learning new technologies and don't believe in one-size-fits-all solutions.    You should be able to adapt easily to meet the needs of our massive growth and rapidly evolving business environment.    A team player attitude: You believe that you can achieve more on a team - that the whole is greater than the sum of its parts. You rely on others' candid feedback for continuous improvement.    Design and business acumen: You understand requirements, whether you're working on an API used by other developers, an internal tool consumed by our operation teams, or a feature used by millions of customers, your attention to details leads to a delightful user experience.    Data: Experience querying data using SQL    Comfortable driving development from a sketch to a polished product    Bonus Points if:    Solid understanding or experience in Apache Camel or Mulesoft or any other EIP    Solid understanding of the full web technology stack    Experience designing, developing, and maintaining APIs    Experience with Internal products. ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["apache camel", "Automation", "Backend", "Enterprise integration", "Coding", "Agile development", "Debugging", "Workflow", "Continuous improvement", "SQL"]}