{"JOB DESCRIPTION": "  What you'll do    Ensure proper platform design, implementation and operations of Uber's EPM platform hosted in AWS    Establish and implement administrative and operational best practices for team    Design and implement rollout/rollback product strategies including automated regression testing capabilities    Documenting and developing new product features, and writing scripts for automation    Update our processes and design new processes as needed to optimize performance    Designing and implementing solutions around monitoring and alerting    Manage code deployments, fixes, updates and related processes    Building and maintaining tools, solutions and microservices associated with development and deployment of backend platform, ensuring to support infra requirements for Engineers on the team    What the Candidate Will Need / Bonus Points     Primary Skill Sets    Strong SQL and/or MDX Skills    Strong in Data Warehousing and Data Modelling concepts    Experience in building ETL Data Pipelines    Performance Troubleshooting and Tuning on Linux platform    Strong scripting/coding ability, including Python, Ruby, Java, C etc.    Hands on experience with cloud platforms (AWS preferred)    Secondary Skill Sets (Plus to have)    Experience/Exposure to Enterprise Performance Management Systems/Tools (eg. TM1, Anaplan, Essbase, Hyperion, Oracle EPM, etc.)    Experience in working with Puppet or Chef for automation and configuration    Financial Planning and Analytics domain knowledge is a big plus    Exposure to TM1 Server Administration    Exposure to TM1 Application Development ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Automation", "Linux", "Coding", "Hyperion", "Application development", "Oracle", "Troubleshooting", "Ruby", "SQL", "Python"]}