{"JOB DESCRIPTION": "  Summary     As part of the Tools team, the successful candidate will work with an international team supporting    the tooling environment for a large-scale software development community.     We are seeking a dynamic team member who can support the software development lifecycle for set of diverse teams. Working collaboratively to maintain a consistent set of tooling and processes. Planning the ongoing evolution of our toolset.      The team is spread across multiple time zones, so good communication skills are a must.     Responsibilities      Troubleshoot user issues and tooling performance issues.     Perform various admin tasks for user/team onboarding, workspace configuration, etc      Work with tooling vendors to resolve issues and integrations support.     Plan and implement ongoing changes to the environment.     Plan for security and scaling improvements to the environment.     Test and plan tooling upgrades in our sandbox environments.     Ensure developer experience is consistent across teams and remote locations around the world.      Support teams with metrics generation to inform opportunities for efficiencies improvements.     Work with the infrastructure team to coordinate system changes and upgrades.     Support planning and implementation for tool migration initiatives.     Maintain add-ons and integrations across tools the environment.     Source code management, software repository manager, continuous integration server, bug trackers and other engineering related systems.     Investigate, develop and integrate new tools into build/release process     Collaborate with Engineering, QA, and hosting teams during and after service incidents to resolve problems quickly and build processes or improvements.      Required Skills       Bachelor's degree in Computer Science or a related field     5+ years experience   administering Atlassian and other tools   suites   (GitLab, GitLab   CI/CD, JIRA, Confluence, Artifactory      Passion and enthusiasm for release management processes and tooling.     Experience customising JIRA projects and Confluence spaces.     Experience working with   Agile   (Scrum / Kanban) teams in a fast-paced environment.     Experience supporting solutions with 99.5%+ availability SLAs.      Experience with Groovy scripting, MySQL, JQL, shell scripting     Good working knowledge of JIRA boards, filters, sprints, for Agile teams     Experience with Git and one or more of the following GitLab, GitHub       Preferred Skills       Experience automating release and build processes using Jenkins, GitLab CI/CD, GitHub     Hands on Public Cloud Experience Azure (Preferred), AWS, GCP.     Working knowledge of containers, Docker and Kubernetes.     Experience of working in virtual/global teams.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "GIT", "MySQL", "Shell scripting", "Agile", "Healthcare", "HTML", "Scrum", "JIRA", "Release management"]}