{"JOB DESCRIPTION": " Looking to hire an Asp.Net MVC Developer who has extensive experience in developing web applications including front end and back end. We are looking for an individual who can quickly adapt to rapidly changing priorities and assume ownership of technical deliverables and deadlines. We value team members who like to be challenged and who are eager to shine independently as well as to support their team.Roles and Responsibilities  Design develop and test .net applications.Responsible for evaluating new technologies to be implemented on web and device apps.Excellent knowledge of programming (troubleshooting, debugging, tuning, and optimization of SQL queries and stored procedures)Working knowledge of asynchronous programmingWork closely with key business partners during the entire lifecycle of the projectProvide technical support & troubleshooting for production issuesPassion for learning new technologies and eagerness to collaborate with other creative minds.Experience working as a team, collaborating effectively with clear communicationGood overall programming experience.Committed to test-driven developmentDesired Candidate Profile  Hands on experience with ASP.NET, MVC, C#, and writing simple and elegant codes.Work experience in MY SQL / MS SQL server programming.Work experience in AJAX and JQuery.Strong knowledge of ASP.NET and design practices.Experience using/building applications using an Entity Framework.Strong front-end skills including HTML, CSS, JS, and Angular.Perks and Benefits 15K take home for Freshers, Internet reimbursement, GMC, GPA and etc.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers"}, "KEY SKILL": ["C#", "ASP.Net MVC", "Web Development", "CSS", "Html5", "JQuery", ".NET Framework", "angular", "Software Development", "ADO.Net", "MySQL", "UI Development", "C#.Net", "Javascript", "ASP.Net", "Ajax"]}