{"JOB DESCRIPTION": " As the Lead Tool Developer you will be responsible for leading a team of software developers to support, maintain and improve the tools used by our artists to produce our award winning Visual Effects work. You will work closely with senior stakeholders to determine the development roadmap for improving our tools, while working closely with the artists to understand their needs and requirements for tool creation, written in Python and C++.    Our Lead Developers are highly technical and are enthusiastic leaders. You will be regularly required to:    establish technical requirements and specifications for improvements to our tools    ensure that appropriate software development practices are followed by your team    contribute to the design, development and delivery of tooling for artists    work with a project manager to manage your team s workload and manage the expectations of key stakeholders    ensure that bug reports and support requests are dealt with swiftly and efficiently    You will be a supervising presence for your team of Tool Developers, who will look to you as a mentor to develop their skills and as a coach to provide them with guidance through the software development life-cycle.    You will also be the primary point of contact for artists to ensure they are supported by the work your team produce, so your ability to communicate accurately and succinctly between technical developers and non-technical artists will help you thrive in this role.    This is a fantastic opportunity for someone with excellent technical leadership skills to join DNEG s Production Technology department and lead a team of talented Tool Developers. You will be responsible for driving improvement of the suite of tools which are used by artists throughout the facility on the exceptional VFX work ranging from blockbuster epics to television dramas.      Must have:      A bachelors degree in Computer Science or similar subject, or equivalent industry experience    Extensive experience writing artist software in Python and C++    Demonstrable experience leading a team of software engineers    Practical experience writing extensions for industry standard industry software such as Mocha, Silhouette, PFTrack, 3D Equalizer, Nuke and Maya      Nice to have      Experience with automated software testing methodologies and tools    Working knowledge of additional programming languages    Working knowledge of the visual effects pipeline  ", "ROLE": "Team Lead/Technical Lead", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["python", "c++", "software development", "testing", "Lead Tool Developer"]}