{"JOB DESCRIPTION": "IT-Alliances is an expert Technology Solutions and IT Staffing firm headquartered in Iselin, New Jersey focused to addressing our clients business and IT challenges by delivering highly skilled, precisely matched talent. We have years of experience providing top quality talent and excellent customer service to our Fortune 500 and mid-size clients, as we are rapidly growing to be the #1 choice of customers.  We are looking to immediately hire 4 full-time Software Developers for in-house projects for a large global customer. These opportunities are positioned to assist you grow in your career. In this role, you are required to build and implement functional programs. You will work with other Developers and Product Managers throughout the software development life cycle. You should be a team player with a keen eye for detail and problem-solving skills. If you also have experience in popular coding languages (e.g. JavaScript), we would like to meet you.Location: J.B. Nagar, Andheri East, MumbaiExperience: 4-12 years experience (Mid to Senior level) Education :  Bachelors degree in computer science, engineering, or a related fieldSalary : Market EquivalentSkills Required :Angular - Javascript / Typescript - HTML / CSS (Bootstrap or Material Experience) - NodeJS - GIT - mongodb - Relational Database Knowledge (SQL or Postgres) -Optional Skills: Nestjs, lambdaInterested candidates,  Please submit your resumes to hr@it-alliances.com with below details:Relevant Exp :Current Location:Current CTC :Expected CTC:Notice Period :", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Sc in Computers, BCA in Computers"}, "KEY SKILL": ["Angularjs", "Javascript", "HTML", "Java", "Software Development", "CSS", "Bootstrap", "Node.Js", "MongoDB", "Relational Database Knowledge", "SQL"]}