{"JOB DESCRIPTION": "     Job Information   Mean Stack Developer (mongodb,  Experess JS,  Angular JS and Noad JS) IT/ Software       Bangalore,  Pune,  Mumbai       2 - 5 yrs    Keyskills :  Javascript,  Mean Stack,  Angularjs,  Node.Js,  Html5,  MongoDB,  Web Development,  Software Development ,  GIT,  Docker,  Full Stack Developer,  angular,  UI Developer,  Web UI Developer,  css3   Job Description :   Strong knowledge of MEAN stack (MongoDB,  ExpressJS,  AngularJS,  Node.js,  HTML5,  CSS3,  SASS)+ years in a development role,  preferably on a SaaS Product (CMS/ Commerce/ Retail development would be preferred). Experience in a role on large,  single-page application website development project(s) (MongoDB,  Express.js Angular.js,  Node.js,  HTML5,  CSS3). Experience working in cloud container environments such as Docker or Kubernetes.  2+ years with the Agile Scrum software development methodology. Expert in Git. A demonstrated track record of successfully delivering complex projects with demanding deadlines. Experience in AWS and familiarity with container technology (Docker,  Kubernetes). Ability to translate technical information to the non-technical,  and likewise,  to translate non-technical speak into code. Attention to details,  and ability to stay on task. Ability to effectively deal with ambiguity,  uncertainty,  and incomplete information when evaluating alternatives and making recommendations.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Angularjs", "technical", "software", "Node.Js", "cloud", "Mean Stack", "Docker", "ui", "web", "Javascript", "UI Developer", "Web  Software Development", "website", "Web UI Developer", "Html5", "angular", "Full Stack Developer", "GIT", "saas", "scrum", "MongoDB", "developer", "agile", "aws", "css3"]}