{"JOB DESCRIPTION": " Job DescriptionAre you looking for a new and challenging job where you will be widely involved in all kind of software architectural, design, development and support activities? Then look no further!Your departmentResearch and Development India (R&D India) is an extended arm of R&D Netherlands and plays a key role in the continuous investment in new products and technologies to strengthen our position and differentiate our products. Software has become an integral part of our products and systems therefore we invest in people to create the most added value!Your responsibilitiesAs a Senior Software Engineer, you are responsible for designing, implementing and testing high quality equipment control software running on a real-time operating system. You will set up and review requirements to develop efficient solutions together with stakeholders within the organization.During this process you will analyze risks, solve problems, decompose bottlenecks and generate recommendations for improvements. As an experienced software engineer, you will be actively involved in team effort through different development stages.In this challenging role, you will be widely involved in all kind of architectural, design, development and support activities. Your qualifications and skillsIf youre an experienced, enthusiastic and versatile software engineer, you will excel at:BE. / B. Tech/ M.E / M. Tech (Any Discipline) degree from a recognized University / Institution;You have at least 7-8 years of relevant working experience;Knowledge of Software Development (C/C++);Experience in soft and/or hard real-time operating systems, preferably Linux;Knowledge of object-oriented design and UML;Experience in Agile way of working is a plus;Industrial Automation using Siemens IPC, industrial networks like Profinet, Profibus, ASi  experience is a big plus;Knowledge of Software Configuration Management (based on Git);Background in managing development environments, services and tools (Jira, Bitbucket, Bamboo, Jenkins, SonarQube);Personal Profile Good command over English;Agile mindset / team player;Soft skills essential for R&D job: Taking Initiative, Creativity, Cooperation, Learning Ability, Advising, Systemic Thinking, Analysing & listening.Not afraid to take responsibility in a dynamic working environment;Drive to win, result and goal oriented attitude.", "ROLE": "Software Developer", "INDUSTRY TYPE": "Office Equipment, Automation", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "M.Tech in Any Specialization"}, "KEY SKILL": ["C++", "Software Development", "Software Engineering"]}