{"JOB DESCRIPTION": " Senior Software Engineer (Java)As a Java developers with at three to seven years of overall software development experience, specifically in Java development. Prior experience in working with fin tech /finance/banking domain will be an added advantage but is not mandatory. We are looking for quick learner candidates.Responsibilities Creates user information solutions by developing, implementing and maintaining Java based components and interfaces. Contribute to team meetings, develop new applications that serve existing software systems and further develop current software. Support continuous improvement by investigating alternatives and new technologies. Explore opportunities to add value to job accomplishments, Assist with building a culture of continuous delivery and improvement, ensuring that key systems are regularly analyzed, maintained and improved.RequirementsThe skillset required to excel in this role is broad, with the right individual needing to demonstrate strong capabilities within the majority of the following areas: 3+ years' experience in similar role, with recent experience in the technologies below. Experience in Spring Boot framework, Java 8, Hibernate, MySQL, git, TDD, BDD. Experience with CI/CD platforms. Agile/Lean ways of working. Exposure to JIRA & Confluence tools. An understanding of payments and regulatory changes would be beneficial.complex problem solving and critical thinking skills.In return you'll get an opportunity to; join a truly growth-embracing culture, which will commit to help you grow personally and professionally. part of a dynamic and very ambitious team and, at the same time, in an informal and pleasant working environment. join a company imbued with entrepreneurial spirit and passion, where open communication and collaboration are supported. work in a rapidly growing and technologically changing sector.", "ROLE": "Technical Architect", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers"}, "KEY SKILL": ["Java", "Hibernate", "Software Development", "GIT", "Bdd", "TDD", "Confluence", "MySQL", "Spring Boot", "JIRA"]}