{"JOB DESCRIPTION": "Software developer for an AI based Startup,  working on a ground breaking AI and BigData Analytics based product for IT operations.\n\nWant to a part of a fast growing startup that is disrupting the Enterprise IT and Application landscape with an unique Big Data Analytics and AI solution \n\nJob Description\n\nSoftware developer for an AI based Startup,  working on a ground breaking AI and BigData Analytics based product for IT operations. \n\nVuNet Systems(www.vunetsystems.com) has an award winning AI product to vastly im-   prove IT operations for the new age digital enterprises. Our core offering is a Big Data An-   alytics and AI based software product,  which brings together and correlates real time infor-   mation across applications,  business transactions and infrastructure. Our customers choose VuNet to improve their customer experience in the new digital world. VuNet Systems is headquartered in Bangalore,  India and is expanding globally. Founded in 2014,  by a group of innovators,  VuNet Systems has solid funding from top tier firms. \n\nRoles and Responsibilities\n\nPrimary responsibility is to take up product development as a full stack developer and ability to work with the larger product team,  arrive at best architectural approach,  choose most appropriate frameworks,  code and deliver \n\nShown success as an individual contributor. Should have consistently demonstrated ability and commitment to deliver major initiatives in a timely manner \n\nEmbrace good development practices including design specification,  coding standards,  unit testing and code reviews \n\nA self starter,  who loves to take on hard problems,  loves solving service scalability problems,  enjoys breaking things and enthusiastic to learn new technologies and working in startup environments Skills and Experience\n\n3 5 years of relevant experience \n\nExcellent Programming skills on one of the programming languages (Python,  Java or Ruby) \n\nStrong communication skills \n\nAbility to work in a team \n\nEye for detail and identifying problems \n\nGood analytical skills \n\nShown success as an individual contributor and ability to communicate in great detail \n\nKnowledge/ Experience in the following technologies will be an added plus: \n\nElastic search,  MongoDB,  Big Data,  SQL databases,  ELK stack,  REST APIs,  web ser-   vices,  JMX) \n\nInterest and aptitude to learn new technologies and domains (Python,  nosql databases,  Big data,  ML) Along with a competitive salary,  we offer a generous employee stock option plan and a fun work atmosphere,  with other talented,  motivated and interesting co-  workers. You will also be working on cutting edge technologies,  where you take ownership of end to end development. You will get ample opportunities to learn and grow your abilities and be part of a very enriching journey. \n\n. But what we would also like to see is some code you have written. We look forward to hearing from you.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - System Programming", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["code", "analytical", "software", "NoSQL", "java", "Coding", "web", "design", "Ruby", "programming", "Python", "rest", "development", "solid", "testing", "Unit testing", "it", "Analytics", "SQL", "JMX", "application", "service", "MongoDB", "developer", "IT operations"]}