{"JOB DESCRIPTION": "            Summary of This Role      Works throughout the software development life cycle and performs in a utility capacity to create,  design,  code,  debug,  maintain,  test,  implement and validate applications with a broad understanding of a variety of languages and architectures. Analyzes existing applications or formulate logic for new applications,  procedures,  flowcharting,  coding and debugging programs. Maintains and utilizes application and programming documents in the development of code. Recommends changes in development,  maintenance and system standards. Creates appropriate deliverables and develops application implementation plans throughout the life cycle in a flexible development environment.      What Part Will You Play?      Develops moderately complex code using both front and/or back end programming languages within multiple platforms as needed in collaboration with business and technology teams for internal and external client software solutions. Designs,  creates,  and delivers moderately complex program specifications for code development and support on multiple projects/issues with a wide understanding of the application / database to better align interactions and technologies.     Provides broad and in-depth knowledge of analysis,  modification,  and development of complex code/unit testing in order to develop concise application documentation. Performs and advises on testing,  validation requirements,  and corrective measures for complex code deficiencies and provides systemic proposals.     Participates in client facing meetings,  joint venture discussions,  vendor partnership teams to determine solution approaches.     Provides advise to leadership on the design,  development and enforcement of business / infrastructure application standards to include associated controls,  procedures and monitoring to ensure compliance and accuracy of data. Applies a full understanding and in-depth knowledge of procedures,  methodology and application standards to include Payment Card Industry (PCI) security compliance.     Develops,  administers and recommends billable hours and resource estimates on complex initiatives,  projects,  and issues.     Assists with on-the-job training and provides in-depth expertise and advice to software engineers.          What Are We Looking For in This Role?       Minimum Qualifications         BS in Computer Science,  Information Technology,  Business / Management Information Systems or related field     Typically minimum of 6 years - Professional Experience In Coding,  Designing,  Developing And Analyzing Data.   Typically has an advanced knowledge and use of two or more opposing front / back end languages / technologies from the following but not limited to; t    wo or more modern programming languages used in the enterprise,  e   xperience working with various APIs,  external Services,  e   xperience with both relational and NoSQL Databases         Preferred Qualifications       BS in Computer Science,  Information Technology,  Business / Management Information Systems or related field     8 years professional Experience In Coding,  Designing,  Developing And Analyzing Data and experience with IBM Rational Tools       What Are Our Desired Skills and Capabilities?       Skills / Knowledge - Having wide-ranging experience,  uses professional concepts and company objectives to resolve complex issues in creative and effective ways. Some barriers to entry exist at this level (e.g.,  dept./peer review).     Job Complexity - Works on complex issues where analysis of situations or data requires an in-depth evaluation of variable factors. Exercises judgment in selecting methods,  techniques and evaluation criteria for obtaining results. Networks with key contacts outside own area of expertise.     Supervision - Determines methods and procedures on new assignments and may coordinate activities of other personnel (Team Lead).   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["MS SQL", "jQuery", "Linux", "Db2", "Cics", "MySQL", "Cobol", "Oracle", "Android", "Python"]}