{"JOB DESCRIPTION": "  About The Role:    Proficient in developing automated test code, test data creation, test code execution, test result documentation, logging defects and test summary creation. Work with the Development team to capture and reuse automated Unit Test Cases, Test Stubs and Drivers, and other Development test objects. Able to gather existing manual test cases in the project and automate them to achieve efficiency.    Responsibilities:     To gather and understand applications test automation requirements   To design automation flow and scripts conforming to team s automation framework   To execute automated test cases for applications teams during SIT and regression test cycles.   To generate test summary report with statistics on the SIT and regression runs.   To work with application team to analyze and adapt failed test cases due to applications new changes.   The candidate should come up with new architectures or architectural/design changes for the new requirements and enhancements   Assures quality, security and compliance requirements are met for supported area and oversees updating and testing of the business continuation plan.     Essential Qualifications:     7 Years of Total IT Experience   5+ years of total work experience   Experience in creating Automation framework using Selenium WebDriver, Java\\\\C#, Appium , TestNG   Experience in all aspects of software lifecycle - application structure, debugging, performance, security and deployment.   Working knowledge of Text extraction, Table data extraction and OMR value extraction using format locator, table locator, Zone locator etc.   Experience in configuring Kofax import connectors and Kofax export connector ( EG: Email import connector, Folder import connector, XML export connector)   Knowledge of creating projects in the project builder and synchronizing to KC Admin.   Knowledge of creation of Index fields Validation form layouts and custom form layouts.    Knowledge of integrating validation forms with .Net services.   Knowledge of the usage of KTM extraction locators and Evaluators and assigning to fields.   Knowledge of usage of Dictionaries, Flat file Data sources and ODBC Data Sources with KTM project builder.   Excellent written and verbal communication.   Expert knowledge of QA and SDLC processes, associated best practices.   Test case development and maintenance.   Knowledge of Issue Tracking Systems like Jira/ClickUp etc. (Defect management tool).   Exposure to PostMan scripting   Experience with Agile, Scrum processes.   Experience in unit testing frame works using mocks and dependency injections   Experience in implementing CI/CD processes   Prior experience with tools like Jenkins, GitHub, uDeploy  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["automation framework", "ODBC", "XML", "Debugging", "Selenium", "Test cases", "microsoft", "JIRA", "SDLC", "Data extraction"]}