{"JOB DESCRIPTION": "  About the Role:    Design, develop, and implement Kofax or any other OCR systems with several upstream and downstream interfaces with engineering mindset. Provide technical solutions by working with onsite and offshore teams. Strives for excellence and demonstrates continuous improvement culture    Responsibilities:     The successful candidate for this position will be able to function at the highest technical level with respect to web services, web pages using Microsoft .NET or Java Technologies.   Scope of this work will include process automation and document automation across Commercial Banking and Corporate and Investment Banking, including Shared Services, Commercial Capital, Treasury Management, Middle Market Banking, WCOO, CRE and CIB.   This work will be delivered in an Agile fashion with monthly business value delivered.    The Developers will work on federated Team for OCR along with support from ECM team.   The candidate should come up with new architectures or architectural / design changes for the new requirements and enhancements   This position acts as an expert technical resource to programming staff in the development, testing, and implementation of web services and interfaces using .NET \\\\Java Technologies     Essential Qualifications:     7 Years of Total IT Experience.   10 to 12 of Expertise in Enterprise image capture software s like Kofax Capture 10/11, KTM 6.x.   Experience in below aspects, in either Kofax or any other Capture/OCR tool.   Working knowledge of Text extraction, Table data extraction and OMR value extraction using format locator, table locator, Zone locator etc.   Experience in configuring Kofax import connectors and Kofax export connector ( EG: Email import connector, Folder import connector, XML export connector)   Knowledge of creating projects in the project builder and synchronizing to KC Admin.   Knowledge of creation of Index fields Validation form layouts and custom form layouts.    Knowledge of integrating validation forms with .Net services.   Knowledge of the usage of KTM extraction locators and Evaluators and assigning to fields.   Knowledge of usage of Dictionaries, Flat file Data sources and ODBC Data Sources with KTM project builder.   5+ years of full stack experience including web services and web applications using Microsoft .NET or Java technologies   Proven expertise in MVC Frameworks, WebAPI using C# or Java   Developing experience using Visual Studio 2017 and later versions.   Strong experience in writing SQLs, Stored Procedures using SQL Server 2014 or later   Should be able to develop and support legacy .Net applications as well as new technology areas.   Experience in unit testing frame works using mocks and dependency injections   Experience in implementing CI/CD processes   Prior experience with tools like Jenkins, GitHub, uDeploy  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["ODBC", "XML", "Agile", "MVC", "Visual Studio", "Stored procedures", "Investment banking", "Unit testing", "microsoft", "SQL"]}