{"JOB DESCRIPTION": "  Job Description Summary:    Software Engineer III for the Online Ordering team, working on back end services, front end user interfaces and systems, and APIs.    Responsible for maintaining and developing new functionality for table-service and quick service restaurants, with millions of dollars of transactions flowing through the system daily.      You have:      Bachelors Degree in Computer Science preferred, but equivalent experience considered.    Experience   designing and developing highly scalable web applications     Experience with HTML, JavaScript, CSS and XML     Experience developing applications using ASP.net (C#)     Experience developing object oriented solutions via Microsoft .Net Framework     Experience with Agile development methodologies     Experience with Web Services (WCF, WebAPI, REST, etc.)     Understanding of JavaScript driven development and front end testing     Experience with response designs and implementations   Even better if you have the following:     Ability to learn existing and new applications and become familiar with them in a short amount of time.     Ability to work under pressure in a fast moving environment, while balancing multiple concurrent projects of varying priorities     Ability to work independently with moderate supervision     Ability to effectively communicate with peers, and supervisors, and to work cooperatively in a teamwork environment     Exhibits excellent communication skills, both oral and written     Ability to work quickly and meet defined project deadlines     Ability to design highly effective and attractive user interfaces     Expertise with modern frameworks such as Angular, Ember, React, Flux     Experience with FitNesse    ESSENTIAL FUNCTIONS:      Develop and maintain high-performing applications that enable an optimal consumer experience    Design,   modify, and support complex systems or subsystems     Perform design changes for product   improvements/upgrades      Analyze, program, debug, and modify computer programs for business middleware and user interface applications     Work with customers, Product Managers, Project Managers, Services and Support departments to understand and implement business requirements     Write and execute unit tests of software configurations     Provide accurate estimation of development effort and input into project timelines     Provide technical guidance to the team ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Web technologies", "Front end", "XML", "Javascript", "Windows", "WCF", "microsoft", "Middleware", "Android", "Recruitment"]}