{"JOB DESCRIPTION": "          Job Summary        Senior Java engineer is responsible for designing, implementing and deploying new features for our client and internal facing web application. This role is a key technical delivery position working with both internal development teams as well as key contacts within the client s development organization. This individual will also be tasked with determining simpler, more automated ways of deploying and delivering our solution to increase ease of configuration and improve productivity for users. Clients that uses this web application include ATT, Comcast, Bank of America, and other Fortune 500 companies.      Principal Duties and Responsibilities:        Design, implement and deploy new features and initiatives from start to finish     Work with product managers to flush out requirements and designer to finalize user interface and user experience     Help define and drive architectural designs and coding guidelines    Communicate and work effectively with remote members and teams         Knowledge, Skills and Qualifications      Education:                Bachelor s degree in related field is preferred                  Required Skills:        Develop and maintain complex client facing web application    Advanced level Java expertise    Multi-threading and concurrent programming    Spring, Spring Boot    BasicIntermediate level SQL expertise    Architect, design, implement, and consume REST API    Familiarity with Agile processes and comfortable driving a scrum team    Substantial programing experience in JAVA and Spring framework    Strong Multithreading exposure for development    Experience with DB, building queries in SQL and using Hibernate    Considerable experience Debugging JAVA applications    Experience building Web Application and Services    Experience building APIs and ClientServer Architecture    Experience with writing unit test and unit test friendly code    Experience with Maven build scripts       Preferred Skills:              Ability to oversee and lead the server side development    Experience with security, performance, monitoring, and authentication of client facing REST API    Experience with Test Driven Development    Experience with Agile and Scrum in a CICD project    Experience with Javascript and Javascript Framework like AngularJS or React    Experience with Java UI framework like GWT or SGWT    Knowledge of microservices architecture    Knowledge of Cloud Native tool and architecture (e.g. CICD, Docker, Kubernetes, , )    Knowledge of communication protocols: HTTP1.1, HTTP2, GRPC, WebSocket    Cloud services experience (AWS, Google, Azure)          ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - System Programming", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Architect", "Maven", "Hibernate", "Coding", "Debugging", "Javascript", "Agile", "HTML", "Scrum", "SQL"]}