{"JOB DESCRIPTION": "   About the Role:     Senior Java Engineer with good Design, hands on development technical skills along with good interpersonal skills       Responsibilities:      Build efficient and high performing solutions to meet the business requirements    Participate effectively in the entire software development life cycle    Define and Design solutions to meet the business and strategic requirements    Organize, lead and motivate development resources to meet expected deliverables and quality standards across multiple releases    Provides technical direction to the project team and perform code reviews.Facilitate communications within the team and facilitate knowledge sharing amongst the team and other personnel.    Collaborate with Product Managers, System Architects, Analysts and any other stakeholders as needed       Essential Qualifications          4 year or graduate degree in Computer Science or engineering    Core skills 7 to 11 years Java/J2EE Web Application Development, Spring (Core, MVC, AOP, Batch), JQuery, Web Services (REST, SOAP etc.), JS frameworks, Hybrid Application development, Cloud Technologies (AWS/PCF), Microservices knowledge on Oracle database.    Hands on experience in Client Side Scripting (JavaScript, Node.JS) and Server Side Scripting with respect to Web Development    Strong in OOAD, Multi-threaded application development, design and implementation of web applications, Design Patterns    Product Design Knowledge - Experience with Product Development, Large Enterprise Scale Integrations (preferably in design/development of customer facing large enterprise applications)    Experience in Digital Banking/eCommerce or any complex customer facing applications    API - driven development - Experience working with remote data via SOAP, REST and JSON.    Experience with Enterprise Mobility Applications Performance Tuning, Scaling and Security Best Practices      Desired Qualifications      Experience in Behavioral Driven Development (BDD) Domain Driven Development (DDD)    Certification in AWS Associate level / Pivotal Cloud Foundry (PCF) developer     Technical Requirements include the Following:     4 year or graduate degree in Computer Science or engineering   7-11 years of hands-on software architecture, design and development experience   Experience in Java/J2EE, Spring (Core, MVC, AOP, WebFlow, Batch, Quartz), JQuery, Web Services, JS frameworks, Hybrid Application development, Microservices, Cloud   Strong knowledge in OOAD, Multi-threaded application development   Very Good Experience in design and implementation of web applications   Well versed with App servers, Web servers and IDEs,   Experience in Behavioral Driven Development (BDD) Domain Driven Development (DDD)   Certification in AWS Associate level / Pivotal Cloud Foundry (PCF) developer   Work experience with SVN, Maven, GIT, Gradle, AppDynamics, Splunk etc. DevOps tools.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Performance tuning", "jQuery", "Enterprise applications", "OOAD", "Web development", "Javascript", "Application development", "JSON", "MVC", "Information technology"]}