{"JOB DESCRIPTION": "   Mandatory Skills       1. Excellent communication & Presentation skills,      2. Good grasping power and positive body language,      3. Good Subject Knowledge,      4. Deliver lectures for long hours,      5. Must have prior training experience and should have working knowledge according to Job Description.       Job Description    1. Looking for Professionals software Trainer to deliver Embedded System Development to budding engineers .. Deliver workshop/training must have training experience or fresher, 2. Must have good experience in Microcontroller/ARM/Automotive Programming and Work experience protocols & interfacing like I2C, SPI, CAN, Must have good Programming skills in languages like C & C++ is must,Linux programming is added advantage, must be able to produce professional project documentation & presentations ,Confidence and Strong communication skills to interact with Students & Clients, 3. Explore industrial Topics and include into training course, Passionate about learning and teaching, delivering classroom sessions and practical Embedded systems Preparation of content/curriculum,Capable of evaluation, content creation and mentoring during the session.       Requirements    1. The candidate should be a Graduate in any field, 2. Excellent communication skills written and verbal and negotiation skills, 3. Knowledge of functioning of academic institutions and placement process, 4. The candidate should have good interpersonal skills and networking in the market, 5. Minimum 3 years of Technical Training/Teaching experience preferred, 6. Multi-tier architecture knowledge, 7. Excellent self-management skills (task lists, status reports, prioritisation), 8. Commitment to quality and timely deliverable, 9. Desire to understand the business.     ", "ROLE": "Trainer/Faculty", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Othe", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Linux programming", "Software Engineer Faculty", "Technical Trainer"]}