{"JOB DESCRIPTION": "   Your responsibilities     Participate as the DevOps expert in the development projects and maintenance activities to provide the best infrastructure and automation for continuous integration, continuous (unit) testing and releasing.     Take ownership for activities such as setting up build and test management frameworks, managing archives in a version control system and take care of software releasing.     Gather requirements, create a design and align with the stakeholders during the implementation of the solution.     Investigate existing solutions and provide insights on possible improvements.     Translate the software architecture concepts into a configuration management implementation in cooperation with project architects, test- and integration managers.     Define and implement build and test improvements that enables the effective software development processes and high quality of software deliverables taking into account maintenance responsibility for released products over range of 10+ years.     You are a part of    The Image Guided Therapy Systems (IGT-S) development organization consists of 450 people, from which 110 people work in software development. Software is developed by teams, each focusing on a specific part of the system. The global DevOps team is responsible for the Software Development Infrastructure that includes Software Sets, Version Control, Tool validation, IT Security and frameworks for continuous integration, continuous (unit) testing and releasing. By ways of automation, the relatively small team is able to support all IGT system projects including the entire software development community    To succeed in this role, you should have the following skills and experience     Bachelor degree in SW Engineering, Informatics, Computer Science or equivalent.     Minimum of 5+ years experience in DevOps engineering.     Experience in Azure and Github     Experience with scripting languages like Python, Perl and PowerShell.     Experience with common Continuous Integration technologies. (Jenkins, TFS build, ADS)     Experience in configuration management (configuration items identification, version control, build management, release management, change management)     Experience in VMWare, Dockers, Kubernetes and Artifactory     Optional: ELKStack, Ansible,RTC source control  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Medical, Healthcare, Hospitals", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "VMware", "Automation", "Change management", "Configuration management", "HTML", "Perl", "Unit testing", "Release management", "Python"]}