{"JOB DESCRIPTION": "      Summary of This Role             Works throughout the software development life cycle and performs in a utility capacity to create, design, code, debug, maintain, test, implement and validate applications with a broad understanding of a variety of languages and architectures. Analyzes existing applications or formulate logic for new applications, procedures, flowcharting, coding and debugging programs. Maintains and utilizes application and programming documents in the development of code. Recommends changes in development, maintenance and system standards. Creates appropriate deliverables and develops application implementation plans throughout the life cycle in a flexible development environment.             What Part Will You Play?             Develops basic to moderately complex code using front and / or back end programming languages within multiple platforms as needed in collaboration with business and technology teams for internal and external client software solutions. Designs, creates, and delivers routine to moderately complex program specifications for code development and support on multiple projects/issues with a wide understanding of the application / database to better align interactions and technologies.           Analyzes, modifies, and develops moderately complex code/unit testing in order to develop concise application documentation. Performs testing and validation requirements for moderately complex code changes. Performs corrective measures for moderately complex code deficiencies and escalates alternative proposals.        Participates in client facing meetings, joint venture discussions, vendor partnership teams to determine solution approaches.        Provides support to leadership for the design, development and enforcement of business / infrastructure application standards to include associated controls, procedures and monitoring to ensure compliance and accuracy of data. Applies a full understanding of procedures, methodology and application standards to include Payment Card Industry (PCI) security compliance.           Conducts and provides basic billable hours and resource estimates on initiatives, projects and issues.           Assists with on-the-job training and provides guidance to other software engineers.              What Are We Looking For in This Role?                       Minimum Qualifications               BS in Computer Science, Information Technology, Business / Management Information Systems or related field             Typically minimum of 4 years - Professional Experience In Coding, Designing, Developing And Analyzing Data.   Typically has an advanced knowledge and use of one or more front / back end languages / technologies and a moderate understanding of the other corresponding end language / technology from the following but not limited to; t    wo or more modern programming languages used in the enterprise, e   xperience working with various APIs, external Services, e   xperience with both relational and NoSQL Databases.              Preferred Qualifications              BS in Computer Science, Information Technology, Business / Management Information Systems or related field             6 years professional Experience In Coding, Designing, Developing And Analyzing Data and experience with IBM Rational Tools              What Are Our Desired Skills and Capabilities?                     Skills / Knowledge - A seasoned, experienced professional with a full understanding of area of specialization; resolves a wide range of issues in creative ways. This job is the fully qualified, career-oriented, journey-level position.                     Job Complexity - Works on problems of diverse scope where analysis of data requires evaluation of identifiable factors. Demonstrates good judgment in selecting methods and techniques for obtaining solutions. Networks with senior internal and external personnel in own area of expertise.           Supervision - Normally receives little instruction on day-to-day work, general instructions on new assignments.      ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["MS SQL", "jQuery", "Linux", "Db2", "Cics", "MySQL", "Cobol", "Oracle", "Android", "Python"]}