{"JOB DESCRIPTION": "           The Role:             Lead Software Developer will be a valuable member of our Navibilling team who will be responsible for Technical Leadership of the team. You will be role model for the HANSENCX values and strategy who has deep understanding about Telecom industry.               How will you contribute              In addition to lead functions, you will develop systems hands on, taking on the most technically complex and difficult development activities, and enabling the team to work collaboratively to complete.         On any given day you will be expected to undertake responsibilities including:            Defining architecture (system structure and architectural principles)         Ensuring compliance to non-functional requirements (performance, scalability, etc.)  Technical leadership of team         Coaching and mentoring on technical matters         Ensuring application of Best Practise development and QA processes (coding standards, build process, integration, testing)         Being on the forefront of software development and technology trends and sharing this with all colleagues         Sharing relevant knowledge with team                        Our Ideal Person:               We are looking for a real super star, who has strong software development skills and background and who can manage team technically:              8 years of relevant work experience, 5 years as principal  Preferably 5 years experience working in either USA or EU or minimum 5 years experience working for US or EU companies         Deep Microsoft Dynamics NAV/Dynamics 365 Business Central knowledge         Microsoft Office and integration to NAV/Business Central  Preferably NavibillingCX knowledge         Understanding of Scoping and Estimation, Business Process Management system will be preferred         Business Intelligence and Reporting knowledge, Integration knowledge along with Finance & Accounting understanding is a plus         MS SQL, SQL and UML knowledge will be preferred         Excellent Communication skills      ", "ROLE": "Team Lead/Technical Lead", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Telecom", "MS SQL", "Data management", "Lead Software", "UML", "Coding", "Billing", "Technical leadership", "Business process management", "Business intelligence"]}