{"JOB DESCRIPTION": "   Job description                 POSITION GENERAL DUTIES AND TASKS        Application Dev Analyst with 5+ years experience who develop applications in SharePoint 2010, O365 and 2013.       Hands on experience in SharePoint 2013, 2010, Office 365, SharePoint Designer, SharePoint Server Object Model, CSOM, HTML5,CSS,jQuery.       2+ years of experience in SharePoint 2010 with Designer workflows..        Expert in SharePoint Online, Power Automate, Power Apps, SharePoint Frame work (SPFx), Rest API, JSOM and JQuery.        Should be able to work with Advisor / Architect to develop custom applications using Microsoft tools for SharePoint.       Deliver as per architects guidance on client non-functional requirements for the solutions such as scale, performance, reliability, and reuse, physical and logical architecture.     Assists in preparation of prototype and screen layout.       Implement improvements to stabilize and enhance application environments.       Coordination with cross team for application integration and deployment.       Prepare documents and manuals.       Takes lead in troubleshooting application systems, performance and environmental concerns.       Follows and reviews code of the development team on coding standards, design patterns, best practices and advanced technical approaches to improve and stabilize the application environments.       Develops MS Flows.     Develops SP integrations with other applications          CLIENT BUSINESS PROBLEM TO SOLVE          Provide Sharepoint online support, develop MS flows and SP integrations.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Application integration", "Architect", "jQuery", "Prototype", "Coding", "Deployment", "microsoft", "Troubleshooting", "Sharepoint", "office 365"]}