{"JOB DESCRIPTION": " Key Responsibilities:    Evaluate the pre-identified potential workflows for automation in terms of value generation by considering the factors of resource optimization, complexity, cost reduction possibility; thus helping management identify the quick wins in automation help develop the same.   Designing delivering enterprise grade scalable, modular robust tools/applications/services that help Security Teams improve their efficiency by managing the stakeholder expectations   Evaluate the Industry standard Orchestration solutions through POC s suggest the management on the way forward for automation.   Define a standard process/framework for peer Security Teams to identify opportunities for automation.   Own the Automation Strategy define the standard stack recommendations for future automation projects.   Research on Emerging trends/technologies in development world that can help solve the problems of Security Teams innovatively showcase them to management through POC s.   Handoff support of Production grade applications to Operations through extensive support documentation.   Actively participate in the Security Engineering discussions contribute to them from an automation/developer perspective.   Collaborates with Departmental leadership in order to align with established Departmental/Organizational roadmaps.   Drive the entire application/automation lifecycle (concept, design, test, release and support)   Troubleshoot and debug to optimize performance   Support and/or re-engineer legacy tools   Develop executive dashboards        Required Skills:    2-5 years of Development experience good understanding of Security basics.   Ability to design deliver end-to-end full stack, reliable scalable solutions by analyzing the requirements.   Experience in developing with any of the programming stack not limiting to .NET, C#, , SQL,   Python  , REST API, .   Solid understanding of different Database technologies experience designing a scalable DB schema for a given set of requirements.   Good understanding of OS concepts well verse with standard webserver technologies in Linux Windows.   Experience with any of the Client-side frameworks/libraries like AngularJS, ReactJS, VueJS ChartJS Ability to develop custom dashboards based on the requirements.   Expertise with any one of the Object oriented languages in developing Enterprise grade desktop applications.   Strong debugging skills   Solid understanding of HTTP protocol well verse with REST API Development.   Good understating of building CI/CD pipelines.   Prior experience with any public cloud would be added advantage. (AWS/Azure/GCP)   Prior experience on Orchestration/automation solutions would be helpful.   Prior understanding of Machine Learning concepts is bonus.        Other Relevant Skills:    Written and oral communication ability to engage partner teams in driving conversations.   Ability to thrive on high ops tempo, high-stress environments   Strong team player   Ability to provide on-the-job training and knowledge sharing to other engineers.   Self-initiative with strong time management   Solid sense of integrity and identification with the mission  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Automation", "Linux", "Machine learning", "Schema", "HTTP", "Windows", "Investment management", "Analytics", "SQL", "Python"]}