{"JOB DESCRIPTION": "About Role: Interested in working for Canadas 4th fastest growing tech company as named by Profit 500?! Maropost is looking for a Software Developer - Integrations to join our development team at Mohali office. If you want to work with other brilliant people in an extraordinary work culture and are eager to learn (and have fun) along the way. Then, Maropost is the place for you About Maropost:Maropost is the only unified customer engagement platform designed from the ground up that connects companies with their customers at every step of their journey. Providing a single customer view, Maropost creates unified, personalized customer experiences, helping brands increase conversion and brand loyalty. Pairing white-glove service with industry-leading technology, Maropost makes customer engagement easy. Headquartered in Toronto, Maropost was named Canadas 10th fastest-growing company by Canadian Business in 2019 and ranked #159 on Deloittes North America Fast 500 growth index in 2018. Recognized as a G2 Leader, Maropost is trusted by brands like DigitalMarketer, New York Post, Mercedes-Benz, and Yext.Experience- More than 2 YearsWork Location- MohaliShare Resume on - sarita@maropost.comRoles and ResponsibilitiesMust Experience in ROR(Ruby on Rails) & Integration and transformation experienceKnowledge of writing complex and efficient SQL for relational databases such as Microsoft SQL Server is essential.Experience of modern API technologiesExperience of providing and maintaining transformations and APIs for customers and partnersExperience of architecting transformation and connectivity solutions using 3rd party toolsExperience with SQL, XML, JSON and CSVStrong written and spoken communication skills with the ability to make occasional presentationsExperience with integration of following APIs(Any two)Google APITwitter APIFacebook API (Graph API)You Tube APILinkedIn APIFlickr APIInstagram APIDesired Candidate ProfileAbility to work alone with minimal supervision.Ability to work in a fast-moving environment.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["ROR", "Ruby Rails", "API", "RUBY"]}