{"JOB DESCRIPTION": "My client is software and technology company based in the US and India with partners located around the world Position -  Software Developer - .NetLocation - Delhi  ResponsibilitiesDesign and architect company product offerings.Understand and document the current system. Enhance the system to cater to various dynamic needs of      the clients.Conceive, research, design, and develop security, authentication & portal solutions for pharma and other industry as needed.Provide security architecture and engineering guidance      for new and existing products. Interact with engineering, product management,      architecture, and support / services teams.Desired Candidate Profile BE / B.Tech / MCA or equivalent is neededHighly motivated and intelligent individual with expert technical and oral/written communication skills.Expert in OO Programming using Microsoft .Net/C# and SQL Server. Knowledge of developing Desktop as well as Web based applications in .Net is mandatory.Work experience in TCP/IP Socket programming is mandatory.Work experience in OpenCV or another 3rd Party library is desired for vision system.Experience working in WCF is required.Exposure to other databases like PostgreSQL, MySQL and Oracle is desirable.4 or more years of software development (Product development) using Microsoft ASP.NET/C#.Available for travel and on-site postings for short and long term.Written and oral fluency in English required.Individual will be based in Delhi Kindly send me your updated CV on annu@sharppoint.in /9136623121 Current & Expected CTCNotice PeriodTotal ExperienceKindly refer your friends / colleagues who are looking out for job change.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - System Programming", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["Opencv", ".Net", "ASP.Net", "C#", "dontnet", "C#.Net"]}