{"JOB DESCRIPTION": " Description    As a full-stack Software Developer with Resolver, you will be responsible for designing and building software applications that enable innovative, data-driven, customer-centric digital experiences for Resolver customers. You will be working as part of a friendly, cross-discipline agile team that helps each other solve problems across all functions.    Your Responsibilities:     Programming (75%)    Measures of Success: clean and efficient code, ability to stay within scope/specifications, on-time delivery of features/applications     Develop new user-facing features, from the database all the way up to the browser     Peer-review code, providing succinct and relevant feedback     Optimize applications for maximum speed and scalability     Testing (20%)    Measures of Success: delivery of quality code that meets acceptance criteria     Fix bugs in new and existing code     Build reusable and fully tested (unit tests we love mocha!) code     Documentation (5%)     Create and maintain documentation that helps others understand what the software does, how it does it, and how to use it.     Our Current Projects:     Audit Trail Event Tracking with context isolation using Worker Threads in Node 12     Rich Mapping solution to visualize data with an interactive map, styled with custom markers and polygons     Advanced reporting with Point in Time using historical Data     Working with Lambda Architecture to provide concurrency, availability and scalability     Data Export engines to PDF, Word, Excel for reporting. This includes charts, tables etc. using SVG and other visualization technologies     Permissions, Security Models to ensure privacy and access control. This includes API, Internal Services Communication, Database level access and Permissions Computation within complex hierarchical data structures     Improvements to UI and UX using React/Redux to render/modify large data sets with real-time data synchronization using sockets, polling and state management     Continuing Technical Initiatives to improve application performance, code quality, developers quality of life and overall velocity     Application Health Monitoring and mitigation strategies     Your Background:     5+ years in development (including react.js and node.js)     Experience with AWS web application architecture     A passion for creating beautiful testable code     A distaste for spaghetti code     Security of your code is always top of mind  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Security, Law Enforcement", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Ux", "Node . Js", "Data Structures", "React . Js", "Web Application", "Aws"]}