{"JOB DESCRIPTION": "Software Developer responsibilities include: *Develop and implement new software programs *Maintain and improve the performance of existing software *Clearly and regularly communicate with management and technical support colleagues   Design and update software database*Test and maintain software products to ensure strong functionality and optimisationRecommend improvements to existing software programs as necessary. Job briefWe are looking for a Software Developer who is dedicated to the craft, writes code thatthey are proud of and can hit the ground running. Should be able to manage team and deliver project in time.Role Of Software Developer You will be a part of a full-stack creative team that is responsible for all aspects ofthe ongoing software development from the initial specification, through todeveloping, testing and launching. Responsibilities• Write clean, well-designed code • Produce detailed specifications• Troubleshoot, test and maintain the core product software and databases to ensurestrong optimisation and functionality• Contribute in all phases of the development lifecycle• Follow industry best practices• Develop and deploy new features to facilitate related procedures and tools ifnecessaryRequirements• Proven software development experience in Wordpress, PHP with CodeIgniter.Experiance in others CMS is a plus (Magento/Openkart)• Proficient in MySQL• Demonstrable knowledge of web technologies including HTML5, CSS3, Javascript,Bootstrap, AJAX etc• Good knowledge of relational databases, version control tools (GIT) and ofdeveloping web services• Experience in common third-party APIs (Google, Facebook, Ebay, Razorpay etc)• Passion for best design and coding practices and a desire to develop new bold ideas• BS/MS degree in Computer Science, Engineering or a related subject• 2-3 Years of experience as Software Developer.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers"}, "KEY SKILL": ["Opencart", "Wordpress", "PHP", "Github", "Html5", "OOPS", "Codeigniter", "Joomla", "Drupal", "OSCommerce", "MySQL", "Magento", "Javascript", "Bootstrap", "Ajax"]}