{"JOB DESCRIPTION": " We are seeking a .NET developer responsible for building .NET applications using various .Net Frameworks specifically ASP.Net MVC, ASP .Net Core etc. Primary responsibility will be to analyze the requirements, prepare detailed technical design, develop the application and provide production support as & when required. Candidate will be responsible for working closely to client & rest of team. A commitment to collaborative problem solving, sophisticated design, and quality product is essential.  Responsibilities    Translate application storyboards and use cases into functional applications   Design, build, and maintain efficient, reusable, and reliable code   Integrate data storage solutions which may include databases, key-value stores, blob stores, etc.   Ensure the best possible performance, quality, and responsiveness of applications   Identify bottlenecks and bugs, and devise solutions to mitigate and address these issues   Maintain code quality, coding standards and automatization   Manage Project independently including few team members.   Provide knowledge sharing to team members.     At Least 5+ Years of experience in field of .Net Development specifically in ASP.Net MVC or ASP. Net Core   Must have handled project independently including client communication.   Excellent communication skills. Candidate must have the ability to deliver succinct, impactful and professional communication, and demonstrates the ability to easily adjust their communications to the appropriate audience.   Experience in leading team of at least 2 developers.   Technical Skills    Strong knowledge of .NET web framework specifically ASP.Net MVC & ASP. Net Core   Proficient in C# with a good knowledge of its ecosystems   Powerful experience in MVC, MVVM, Web API, Web Services etc.   Strong understanding & implementation capabilities of object-oriented programming and its advance concepts.   Industry grade skills for writing reusable libraries, clean, readable, and easily maintainable code.   Familiar with various design and architectural patterns. Understanding of fundamental design principles for building a scalable application.   Familiarity with Microsoft SQL Server with experience in creating database schemas that represent and support business processes   Experience implementing automated testing platforms and unit tests. Must have experience in at least one Unit Testing Framework such as NUnit, XUnit or MSTest.   Proficient understanding of code versioning tools such as Git, TFS. Experience in VSTS is a plus point.   Strong knowledge of LINQ, Entity Framework.   Strong experience in web technologies like HTML, Javascript, JQuery, CSS, etc.   Desired Skills    Experience with popular web application frameworks such as Angular, Reactive etc is a plus point.   Detailed understanding of Common Language Runtime (CLR), its limitations, weaknesses, and workarounds   Experience in CI/CD products and code improvement /refactoring tools.    Strong knowledge in Agile.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "NUnit", "jQuery", "LINQ", "Production support", "Coding", "Agile", "MVC", "Unit testing", "Information technology"]}