{"JOB DESCRIPTION": "IT Jobs Openings in Bangalore and USA JD1258 -  Sr. Software Developer/ Technical Lead-  .Net \n\nDev/ Sr. Dev -  .Net \n\nExperience: 5- 8 years \n\nDesignation: Sr. Softaware Developer/ Technical Lead \n\nWork Location: Bavdhan,  Pune \n\nType: Contract to hire 6 months \n\nResponsibilities include but are not limited to: \n\nDesign and implement technical solutions with a focus on event- driven architecture while taking into consideration performance,  scalability,  availability and security. \n\nContribute a comprehensive understanding of current and emerging technologies,  making sure we re as close as possible to the bleeding edge without getting cut. \n\nPlay an active part shaping the way we do things by following and encouraging others to adopt best practices in coding,  and other processes all throughout the SDLC. \n\nDesign and implement efficient,  intuitive,  modular and testable code.\n\nParticipate in daily stand ups,  retros and sprint planning sessions. \n\nEnsure development work confirms to standards such as,  design,  coding and quality to ensure solutions are fit for purpose. \n\nMeeting timelines and delivery commitments made,  escalating issues early. \n\nContribute and adhere to team objectives including coding practices,  continuous integrationand continuous delivery processes \n\nWork as a mentor to junior and mid- level developers and propose efficient solutions to complex problems.\n\nRequirements: \n\nMinimum 5- 8- year real world demonstrable experience building & deploying scalable,  high- performance applications. \n\nPassionate about software development and modern software front end architectures.\n\nDeep understanding of coding practices (SRP,  DRY,  decoupling,  TDD,  BDD).\n\nDevelopment background working with cloud platforms (Azure a plus),  C#,  and SQL/ NoSQL persistence solutions. \n\nA firm understanding of software design,  development and testing best practices.\n\nPassionate about software development and modern software architecture,  and sharing the passion with others.\n\nKey Skills: .Net ,  C# ,  Azzure ,  SQL Server \n\nLocation: Pune \n\nRequired Experience: 5- 10 yrs \n\nWhat You Need for this Position You should have knowledge of: \n\n.Net \n\n C# \n\n Azzure \n\n SQL Server", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["software architecture", "Software design", "Front end", "NoSQL", "Coding", "TDD", "Technical Lead", "SDLC", "SQL"]}