{"JOB DESCRIPTION": "Roles and Responsibilities  The software developer will be responsible for developing systems/components for the company's product suit, automation and integrations.  Desired Candidate Profile  1. Experience architecting, designing, developing and implementing large-scale applications 2. in hosted production environments 3. 3-5 years experience in Microsoft Azure, C#/VB.Net, HTML, XML, PHP, ASP, ASP.Net, SQL Server 4. Experience/skilled in JavaScript, JavaScript based UI frameworks5. Experience with No-SQL databases or SQL Server, proficient in T-SQL 6. Experience with XML/XLST transformations and developing. NET applications 7. Expertise in unit testing using frameworks8. Skilled in DevOps/continuous build processes& tools9. Comfortable developing multi-threaded applications. 10. Understanding of object-oriented methodologies and principles11. Experience in working in a multi-developer environment with an existing large code base. 12. Good understanding of design patterns 13. Ability to work with minimal supervision14. Excellent communication skills15. Creative problem solving and resolution skills 16. Ability to design algorithms, program structures, components, sub-systems, and systems17. Ability to program in an Object-Oriented paradigm18. Ability to troubleshoot defects and malfunctions in program code19. Ability to write design and program code documentation. 20. Ability to present designs and product features to internal and external audiences21. Experience in automation development is a plus22. Experience in development of integration components/APIs is a plus", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization, B.Tech/B.E. in Any Specialization", "PG": "MCA in Computers"}, "KEY SKILL": ["Automation", "integration", ".Net", "Unit Testing", "Design Patterns", "HTML", "SQL Server", "Devops", "System", "Software Development", "Algorithms", "UI", "XML", "Javascript", "Microsoft Azure", "API"]}