{"JOB DESCRIPTION": " Key Responsibilities:   Software design   Programming/software development    Programming/software development   Designs, codes, verifies, tests, documents, amends and refactors simple programs/scripts.  Applies agreed standards and tools, to achieve a well-engineered result. Reviews own work.    Testing   Executes given test scripts under supervision. Records results and reports issues.  Develops an understanding of the role of testing within system development, as a tool for design improvement as well as a validation process.    System Integration and Build   Produces software builds from software source code.  Conducts tests as defined in an integration test specification, records the details of any failures.  Analyses and reports on integration test activities and results.  Identifies and reports issues and risks.    Application support   Assists in the investigation and resolution of issues relating to applications.  Assists with specified maintenance procedures.    Key Relationships:   Global IT  Respective business function (GOPS, Finance, HR, Brand Marketing, Wholesale/Retail)  HR Management  Controlling   Key Relationships:   Requisite Education and Experience / Minimum Qualifications:    Requisite Education and Experience / Minimum Qualifications:   Four-year college or university degree with focus on Business Administration or IT or related areas, or equivalent combination of education and experience  Good spoken and written command of English  At least 3-year experience in IT  1 year of experience in relevant area ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Wellness , Fitness , Sports, Beauty", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Business administration", "Application support", "Software design", "Test scripts", "Brand marketing", "System integration", "Windows", "Information technology", "Wholesale"]}