{"JOB DESCRIPTION": " Assists in the definition and management of requirements.  Uses standard techniques to elicit, specify, and document requirements for simple subject areas with clearly - defined boundaries.  Assists in the creation of a requirements baseline and in investigating and ing authorised requests for changes to base - lined requirements, in line with change management policy.     Software design   Undertakes complete design of moderately complex software applications or components ing agreed standards, patterns and tools.  Assists as part of a team in the design of components of larger software systems.  Specifies user andor system interfaces.  Creates multiple design views to address the concerns of the different stakeholders of the design and to handle separately functional and non - functional requirements.  Assists in the evaluation of options and trade - offs. Collaborates in reviews of work with others as appropriate.  Programmingsoftware development  Designs, codes, verifies, tests, documents, amends and refactors moderately complex programsscripts.  Applies agreed standards and tools, to achieve a well - engineered result. Collaborates in reviews of work with others as appropriate.    Database design   Develops appropriate physical database or data warehouse design elements, within set policies, to meet business change or development project data requirements.  Interprets installation standards to meet project needs and produces database or data warehouse component specifications.      Testing   Defines test conditions for given requirements.  Designs test cases and creates test scripts and supporting data, working to the specifications provided. Interprets, executes and records test cases in accordance with project test plans.  Analyses and reports test activities and results. Identifies and reports issues and risks.      System Integration and Build   Produces software builds from software source code.  Conducts tests as defined in an integration test specification, records the details of any failures.  Analyses and reports on integration test activities and results.  Identifies and reports issues and risks.      Release and deployment   Uses the tools and techniques for specific areas of release and deployment activities.  Administers the recording of activities, logging of results and documents technical activity undertaken.  May carry out early life support activities such as providing support advice to initial users.      Application support   Assists in the investigation and resolution of issues relating to applications.  Assists with specified maintenance procedures.      Key Relationships:   Global IT  Respective business function (GOPS, Finance, HR, Brand Marketing, WholesaleRetail)  HR Management  Controlling      Requisite Education and Experience Minimum Qualifications:   Four - year college or university degree with focus on Business Administration or IT or related areas, or equivalent combination of education and experience  Proficient spoken and written command of English  At least 3 - year experience in IT  1 year of experience in relevant area           At adidas we have a winning culture. But to win, physical power is not enough. Just like athletes our employees need mental strength in their game. We foster the athlete s mindset through a set of behaviors that we want to enable and develop in our people and that are at the core of our unique company culture the 3Cs: CONFIDENCE, COLLABORATION and CREATIVITY.       CONFIDENCE   allows athletes to make quick decisions on the field, to reach higher. For us at adidas confidence means acknowledging that we don t have all the answers. But we are willing to take risks, we try new things. And if we fail, then this is part of our learning it helps us improve.    COLLABORATION  . Every elite athlete relies on partners: coaches, teammates, and nutritionists. We, too, know that we are stronger together. Winning as one team takes open and candid dialogue, inclusiveness and trust in each other s abilities and talents.    Being the best sports company in the world takes   CREATIVITY  . No great athlete succeeds by copying their predecessors training plans and strategies. We have to be open to new ideas, explore, gain an edge and stand out. Only then can we succeed.                               ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Wellness , Fitness , Sports, Beauty", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Application support", "Change management", "Software design", "Test scripts", "Database design", "System integration", "Windows", "Test cases", "Information technology", "Wholesale"]}