{"JOB DESCRIPTION": " We are passionate about data and new technology that can help companies with their digital transformation. We welcome others who are driven by the same passion for innovation to make a difference for businesses, consumers and society. We empower employees to think independently, get excited about new ideas and make it everyone s responsibility to add value in everything we do in order to build a smarter Stibo Systems.         Due to an increase in demand for Stibo Systems STEP solution, we are now looking for people with Full Stack Java development experience for our Technology Consulting India team to help develop and deliver a value add and solution centric customer experience. You will be working out of the Bengaluru office, in an international team environment in close cooperation with Stibo Systems subject matter experts.   Stibo Systems India Technology Consulting team s primary objective is to develop, manage and advise on technical solutions - from qualification of requirements all the way through the delivery and implementation of the software related to Stibo Systems Master Data Management platform (STEP).   If the above excites you, then Stibo Systems would like to hear from you!    Key Responsibilities:    As a Software Developer in Technology Consulting, you will be expected to:     Analyse customer requirements to prepare solution designs that align with business goals.   You will be responsible for both software development and technical consultancy, gathering and reviewing specifications, and participating in on-site workshops   Deliver high quality custom development solutions in line with defined customer requirements and Stibo standards   Resolve complex technical tasks writing secure, reliable, scalable and maintainable code.   You will ensure quality of deliverables remains in line with agreed standards within scope and budget   Implement and execute relevant Unit & Integration tests; debug and resolve technical problems that arise.   Support in project estimation, planning and risk management activities.     Skills/Experience/Competencies:     Hands on development experience (minimum 5-8 years) using Java technology stack with strong focus on architecture and design.   Solid experience in   Java,   exposure to   Java-Swings & GWT   will be a plus  .    Advanced knowledge in web development using   XML, XSLT, JSON,   ReactJS, JavaScript ES5/6, HTML5 and CSS  .   Experience working with Service Oriented and Event Driven Architectures (SOA / EDA),   JMS messaging, SOAP, REST-full services and GraphQL  .   Analytical mindset and good problem-solving skills.   Experience working with IntelliJ IDEA, Gradle, SVN, Jira, Git    Experience with   Stibo STEP MDM   (including Certifications) is a definite advantage   You are customer focused and always driven by adding value to the stakeholder experience.   You are able to focus and drive results both as a team player as well as an individual.   You have a positive attitude and pro-active approach focused on options and opportunities.   You are flexible, able and willing to go the extra mile to achieve results and obtain stakeholder satisfaction   You have strong communication skills, both verbally and written. English business language proficiency is a must  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["JMS", "CSS", "SOA", "GWT", "XML", "Web development", "Javascript", "XSLT", "JSON", "Risk management"]}