{"JOB DESCRIPTION": " You as a Software Developer will be part of Hitachi ABB Power Grids business based Bangalore.You will be the sole responsible for developing and maintain the tools requires for deploying security updates to the customer infrastructure.   Your Responsibilities     The project you'll be joining will consist out of a Server-, a Desktop- and a Web-Part where the technology decisions are not final yet, we expect that you will help us figure out which will be the best way to go.     We are very keen to have clean code, meaning that code is clear and easy to read, it's testable (and tested!) and that Refactoring is part of the daily routine.     Our teams work with Agile methodologies like Scrum or Kanban, where we have interactions with the Stakeholders and users frequently to verify if our assumptions about the software were correct.    Your Background     Bachelor degree in engineering - Computer science, Information Technology, Electrical Electronics or Communication engineer     Designing Software Systems before and you're able to come up with a meaningful architecture for problems brought to you.     Experience in end to end development of an application consisting of a Server (with a database), Desktop and a Web-part     Experience with tech stack familiar with mainly is C#/.NET and React.js, so expected to have an experience in this technology.     Experience in end to end development of an application consisting of a Server (with a database), Desktop and a Web-part.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Production/Industrial", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Web technologies", "Agile", "Infrastructure", "Database", "Manager Technology", "Scrum", "Install base", "Research", "Information technology"]}