{"JOB DESCRIPTION": "Job Description Position :  Senior Software Engineer -  Server  \n\n Location : Bangalore \n\n Vacancy : 6 \n\n Experience : 4 to 6 years of experience \n\n CTC :  15 20 Lakhs \n\n\n\nSourcing and Screening Guidelines \n\n Any Product Based company is okay. No domain specific.  \n\n No service based organisation.  \n\n Candidate needs to be design oriented,  customer centric,   \n\n Need to know optimization such as memory management and multi threading.  \n\n Ownership of the product.   \n\n Consider Candidates Relocating  \n\n Strictly NO (Candidates only from Bangalore location)   \n\n\n\nDuties and Responsibility   \n\n The company is looking for a Java Developer with experience in building high- performing,  scalable,  enterprisegrade applications.  \n\n You will be part of a talented soware team that works on missioncritical applications.  \n\n You will be responsible for Java/ Java EE application development while providing expertise in the full software development lifecycle,  from concept and design to testing.    \n\n\n\nResponsibilities  \n\n Design and develop high- volume,  low- latency applications for mission- critical systems,  delivering high- availability and performance.  \n\n Contribute in all phases of the development lifecycle.  \n\n Write well designed,  testable,  efficient code.  \n\n Ensure designs are in compliance with specifications.  \n\n Prepare and produce releases of soware components.  \n\n Support continuous improvement by investigating alternatives and technologies and presenting these for architectural review.  \n\n Effectively contribute to the code,  design reviews \n\n Requirements BS/ MS degree in Computer Science,  Engineering or a related subject  \n\n 4 - 6 years of hands- on Software Development experience  \n\n Hands on experience in designing and developing applications using Java EE platforms  \n\n Object Oriented analysis and design using common design patterns.  \n\n Profound insight of Java and JEE internals (Classloading,  Memory Management,  Transaction management etc)  \n\n Excellent knowledge of Relational Databases,  SQL and ORM technologies (JPA2,  Hibernate) Experience in the Spring Framework  \n\n Experience in developing web applications using at least one popular web framework (JSF,  jQuery,  Spring MVC)  \n\n Experience with test- driven development  \n\n Experience in Static and dynamic analysis would be an added advantage  \n\n Experience in large scale system design is desired  \n\n Experience in location based /  GPS application is highly desirable.", "ROLE": "Software Developer", "INDUSTRY TYPE": "Strategy, Management Consulting Firms", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Hibernate", "jQuery", "Architecture", "Memory management", "System design", "Application development", "test driven development", "JSF", "SQL"]}