{"JOB DESCRIPTION": "Looking for immediate joiner only Job Description:Summa Linguae Technologies is looking to recruit a Software Engineer to work as part of a team that oversees and implements Global IT Solutions. The primary responsibility of the Software Engineer will be to own the development and maintenance of next generation localization plugins and connectors for leading content management systems, eCommerce platforms and product information management (PIM) systems that work with our Translation Management System.As a member of the team, you will work on all aspects of the product from development, enhancing UI functionality and ease-of-use to design and everything in between. This is a great opportunity to influence our product functionality and work with exciting and challenging technologies.Roles and Responsibilities  Required Skills/Experience:  1. 4-8 years of Software Design and Development experience.2. Experience working as a lone contributor and managing a team of Junior Software engineers.3. Experience working with external software development houses.4. Must be experienced in Java/J2EE stack Spring MVC, .NET (frontend) C#.5. Experience in Web Application Development.6. Experience in building API Programming SOAP/REST based services and/or applications.7. Experience in building web UI using such JavaScript frameworks such as Angular, Dojo toolkit, JQuery etc.8. Experience in following Java coding standards and knowledge of software development tools including SVN, GITHub, Maven and JIRA.9. Experience in writing SQL and NoSQL queries.10. Experience in CMS/PIM Systems. 11. Good problem solving and analytical skills.12. Open to work in multiple technologies.13. Can work with minimal supervision.14. Good communication skills proficient in English.Desired Skills/Experience:Previous work experience in the Localization Industry.Knowledge of Translation Management Systems/TM/CAT Tools.Knowledge of Azure/AWS Cloud Infrastructure management.Comfortable interacting with external development teams.Experience with Data Warehouse technologies.Experience with Data Analytics design and development.Experience in Accounting Systems (Visma, Zoho).Qualifications: Bachelors Degree in Computer Science or equivalent.4-8 years of extensive software development experience.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["Java", "Spring Mvc", "VB.NET", ".NET Compact Framework", "J2Ee", "JQuery", "JIRA", ".NET Framework", "Angular", "Javascript Frameworks", "Dojo", "Rest", "Front End", "C#.Net", ".Net", "ASP.Net", "Web Development", "Plugins"]}