{"JOB DESCRIPTION": "   Preferred Qualifications    Oracle   Commerce is focused on helping the world's premier brands maximize the success   of their online businesses. The Oracle Commerce application suite is the   top - rated platform by industry analysts for powering highly personalized,   efficient and effective e - commerce sites both on the web and mobile. In   addition our platform - neutral LiveHelp services can easily be added to any   website to increase conversions and reduce abandonment. Oracle Commerce   software powers more of the top 300 Internet retailers than any other vendor.   Our client list includes Best Buy, Tesco, Urban Outfitters, Coca - Cola, Nike,   WalMart, Neiman Marcus, Sprint, T Mobile, AT&T, Chico s, and American Eagle   Outfitters. As a Senior Software Engineer, you will help us deliver our market   leading e - commerce suite that powers many of the world s largest e - commerce   real business problems. They will be able to communicate effectively with   technical and non - technical constituencies. Above all, they will demonstrate a   clear ability to create robust, easily extensible solutions for our customers. Requirements:    Degree in Computer Science or    related discipline    Minimum of five years'    experience programming in Java/JEE and experience web application development.    Ability to work with a    variety of other stakeholders including other developers, designers, product   managers, technical writers, marketers, technical support personnel, and   customers in a cooperative but fast - paced environment    Excellent software    architecture, implementation, and problem solving skills    Familiarity with standard    professional software development processes including source code control, unit   testing, and code reviews    In depth knowledge in JEE    based application development Desirable:    Development experience with    rich UI development (MVVM and etc)    Experience developing    JavaScript based single page applications using Web - Services and JavaScript   libraries like React, Redux, Redux - Saga    Advanced HTML skills: HTML5,    CSS 3, XHTML, JSP would be an added advantage    Personalization technologies    or workflow    Developing packaged software    (as opposed to professional service engagements)    SQL database and Java object - relational    DB mapping    Experience working with    application servers like WebLogic, WebSphere, or JBoss    Detailed Description and Job Requirements    Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.   As a member of the software engineering division, you will assist in defining and developing software for tasks associated with the developing, debugging or designing of software applications or operating systems. Provide technical leadership to other software developers. Specify, design and implement modest changes to existing software architecture to meet changing needs.   Duties and tasks are varied and complex needing independent judgment. Fully competent in own area of expertise. May have project lead role and or supervise lower level personnel. BS or MS degree or equivalent experience relevant to functional area. 4 years of software engineering or related experience. ", "ROLE": "Business/EDP Analyst", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "ITES, BPO, KPO, LPO, Customer Service, Operations", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Operation", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Analyst"]}