{"JOB DESCRIPTION": "    Job Description        A Java developer who enhances and maintains an internally-developed software application.  Develop, create, and modify general computer applications software using StoneRiver coding practices and methods.  Code will be written to accurately reflect written specifications supplied as part of each software project.    The role will require working directly with developers, quality assurance testers, and support personnel.    Reports to the Team Lead.      Responsibilities     Perform development on a Java platform from technical documentation Provide post-implementation support including analysis of production problems.    Have good understanding of the requirements in the area of functionality being developed Create and execute unit tests Debug code, make and test code fixes Adhere to defined coding standards and other defined quality standards      Requirements     Bachelor s degree in Computer Science andor related field; related work experience can be substituted for educational requirement 2 to 4 years of software development experience    Good knowledge of Java programming language Understanding of logical database design and physical database structures Knowledge and experience of RDBMSs.    Working knowledge of key StoneRiver standard development tools: Eclipse Excellent understanding of OO software design    Experience with the open source frameworks Spring and Hibernate    Experience with web-services preferred Good conceptual, analytical, mathematical skills    Good learner and self-starter, and a team player, ready for the next challenge - wherever it may be.    Good verbal and written communication skills The ability to interact with external and internal clients   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Hibernate", "Software design", "Coding", "Database design", "Eclipse", "Billing", "Business intelligence", "Open source", "Technical documentation"]}