{"JOB DESCRIPTION": "Develop high quality maintainable code\nParticipate in design discussions\nExecute projects and develop against an outlined design\nCollaborate across team boundaries with other teams\nCommunicate issues and technical roadblocks effectively\nAbility to navigate through a large complex codebase\nExcellent problem solving ability.\nExcellence in technical communication with peers and non-technical cohorts.\nDrive significant technology initiatives end to end and across multiple layers of architecture\nJob Location:  Bangalore / Guwahati\n\nBasic Qualifications:\n\nBS/BE/B.Tech in Computer Science or equivalent or MCA\n1 ? 5+ years of software development experience\nFirm understanding of software development principles\nProgramming in one or more object-oriented languages like Java/Python/C#/Ruby/Objective C/C++\nComputer Science fundamentals in object-oriented design, data structures, algorithm design, problem solving, and complexity analysis\nExperience with web application technologies such as React.js,Node.js, JavaScript, HTML 5, CSS, AJAX\nPreferred Qualifications:\n\nMS in Computer Science or equivalent\n4+ years of software development\nExperience developing high quality, large scale consumer applications\nExperience developing hybrid native/HTML mobile applications\nMastery of the tools of the trade, including a variety of modern programming languages (Java, JavaScript, C/C++, Objective C, Python, Ruby, or C#).\nExperience building complex software systems that have been successfully delivered.\nAgile methodologies, coding standards, code reviews, source control management, build processes, testing, and operations\nExpertise in Android SDK, Java and Android Studio/IntelliJ, and cross-platform technologies such as React Native\nPreferred Skills:\nSource Control: Git Artifact Management: Nexus, Artifactory, Yum, NPM, Gem. Build: Jenkins, Maven, Gradle, Grunt, Gulp, Ant Scripting languages: Python, Ruby, bash, batch. Programming languages: Java, Python, node.js, Go. Monitoring: AppDynamics, Wavefront, New Relic, Dynatrace. Configuration Management: Chef, Puppet, Ansible, SaltStack. Hosting: AWS, Google Cloud, Azure, on-premise.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - System Programming", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization, B.Tech/B.E. in Production/Industrial", "PG": "MCA in Computers"}, "KEY SKILL": ["code", "technical", "software", "configuration", "android", "developing", "HTML", "tools", "scripting", "java", "Coding", "web", "design", "Javascript", "Agile", "Ruby", "programming", "Ajax", "Python", "C++", "development", "Configuration management", "mobile", "Data structures", "quality", "application"]}