{"JOB DESCRIPTION": "  What are my responsibilities?      As a lead developer in the scrum team, drive design, development and testing of new feature / feature enhancement in the syngo.via / native syngo based MI clinical applications. Provide timely and quality fixes for development and production defects.     Effectively engage with different roles within and out-side of the team (e.g. Development team, Scrum Master, Product Owner, Architects, Product Management, System Team, Release Management, SY teams etc.) to clarify the requirements and realize solution or POC.     Support common System Engineering / Architecture team by driving needed technical / infrastructural spikes and POC to closure at the scrum team level.     Design and implement the solution at component / plug-in level adhering to the defined architectural guidelines.     Support the team in realizing timely and quality solutions and also provide technical mentoring to the junior team members.     Oversee team's delivered quality and prevent defects from being introduced by following built-in-quality measures like code quality, arch. Governance, developer testing, Unit Testing, automation testing, code/design reviews etc.     Strive to achieve team's committed iteration goal by willingly supporting team on need basis to complete the planned activities.     Strive for continuous improvement together as a cross functional scrum team.     Support the Line Manager with the technical assessment and recruitment of team members.     What do I need to qualify for this job?         BE / B. Tech / M. Tech / MSc or equivalent (in CS, E&C, Information Technology     10+ years of experience in designing, development and maintenance of Enterprise Applications on windows platform, working in the global setup on a comparable lead developer role.     Thorough understanding of Design principles and patterns, tools and methods     Proficient with software development life cycle and engineering practices     Proven Expertise and strong hands on experience in C# .NET windows-based application development using WPF and WCF.     Working experience with design review, code reviews and integration of software components in large systems     Hands on experience with unit testing (using NUnit) and test automation using automated framework.     In-depth knowledge and experience of analyzing, implementing and troubleshooting non-functional requirements like Performance Analysis, Memory Profiling, Stability etc. using tools like WPA, winDbg.     Excellent written and oral communication skills to effectively collaborate with different global stakeholders.     Working experience with Agile Development practices and tools like TFS     syngo.via / native syngo platform know-how preferred.     Medical Imaging and Healthcare domain (Clinical Workflow) knowledge preferred.     ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Semiconductors, Electronics", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization, MS/M.Sc(Science) in Chemistry"}, "KEY SKILL": ["Enterprise applications", "Workflow", "Healthcare", "Application development", "Scrum", "Windows", "WCF", "WPF", "Troubleshooting", "Information technology"]}