{"JOB DESCRIPTION": "Company:Mapsted Technologies India Pvt. Ltd. is a premier software consulting firm serving the location technology industry worldwide. A leader in support services for indoor navigation, hyper personalized marketing, and location intelligence, we leverage our expertise in deployment and marketing services to help our partners deploy superior location-based services to a global clientele in a wide range of industries. We have office locations in Delhi, Bangalore, and Mumbai. Website - www.mapsted.com & www.mapsted.in Requirements:Ability to communicate effectively verbally and in writing in English. Experience in working in a product team and work collaboratively across various cross-functional teamsStrong understanding of object-oriented programming concepts, designs, best practicesAt least 8 years of full stack development experience developing consumer-facing software applicationsAt least 5-6 years of experience designing and developing with rich JavaScript frameworks such as Angular 6+, React, Node, .Net, .Net Core, C#, ASP.Net and .Net Entity Framework4-5 years of experience working with SQL, Mongo, NoSQL, or any RDBMS database systemAt least 3 years of experience working with HTML, CSS and TypeScriptExperience building APIs, SDKs and managing an API lifecycle (key management, logging & auditing, security, etc.)Tenacious and aggressive troubleshooting skillsStrong analytical, conceptual, innovative, optimization and problem-solving abilities Starting Date: ImmediatelyBenefits & Perks: Global Company, HQ is in Toronto, Canada. On-site work to Canada available. 100 % REMOTE WORK until September 2021 because of CovidNew laptops issued to all employees", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["C#", "Angularjs", "ASP.Net Core", "Typescript", "ASP.Net", "Node.Js", "MongoDB", "React Native", "React.Js", "SQL"]}