{"JOB DESCRIPTION": "Strong ASP.NET,  MVC,  C#,  WCF,  REST and SQL Server,  HTML,  CSS,  XML,  XSDdevelopment experienceIn- depth knowledge of .NET 4.5 frameworkDevelopment experience in complex SQL Server programingExperience in full development life cycleEnterprise Application Development experienceExperience of test automationStrong Web User Interface development and usability skillsStrong in Responsive Design & DevelopmentHigh volume web service development experience Build and Deployment processesSource Control Versioning experienceAdvantageous Experience:Financial Accounting knowledgeProduct Development experienceKnowledge of UK Tax/ VAT regulationsJIRA for project tasks managementBusiness AutomationAzure platformWhat are we looking for We are looking for highly motivated people to join and work in a team environment to build Business Accounting product for small businesses. Software is not just about writing the perfect code segments,  but understanding the needs of the product and the constraints of the end users. We want all our engineers to want to be a part of this culture and have a desire to work within a small company as a key player in building a highly performing team.What would be expected of you Work in a team to deliver product with high quality and business valueSupport development processes,  teams and Product ManagementLead a small team and responsible for all deliveriesDetailed designs,  coding,  documentation and test casesBuildthe best development team with the brightest peopleStrive for perfection and be part of a highly performing tea", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["Delhi", "bangalore", "Software Developer", "gurgaon", ".Net Trainer", ".Net Software Developer", "noida", "software engineer", ". net developer", ".NET Framework", "Mumbai"]}