{"JOB DESCRIPTION": "View Job Description\n Software DeveloperView Job Description | Rasbor We are hiring to build a very strong technical team for the growth of our organization. We offer a veryfriendly and encouraging atmosphere for you to ideate and develop your skills. You will be workingwith very qualified and experienced pool of people,  who will guide you through for a kick start of yourcareer. You will have to collaborate with the Project Manager to understand clients businessrequirements. You will be responsible for delivering solutions to real world e-commerce andm-commerce problems. You will be required to work in a team and should have strong inter-personalskills with ability to work deliver.\n  KEY RESPONSIBILITIES \n\nWork with client and project Manager on the work package effort estimation \nDevelop customized eCommerce and mCommercesolutions \nReverse engineer for debugging errors in code \nConfirm project requirements by reviewing program objective,  input data,  and output requirementswith analyst,  supervisor,  and client. \nArrange project requirements in programming sequence by analyzing requirements; preparing a workflow diagram /  documentation \nProgramming Testing of the Code written to perform what is needed to be accomplished by thecode. \nDocumentation reference preparation for users by writing operating instructions including changesdocumentation historical records revisions. \nContribute to team effort by accomplishing related results as needed.   ESSENTIAL SKILLS \n\nHave already coded as a part of student project equal to 1 years of experience in Industry. \nDesire to make BIG in professional career. \nQuick learner and keen eye for detail. \nPassionate and driven for learning new technologies. \nConcepts of MySQL database. \nPassionate and driven for learning new technologies.   DESIRED SKILLS \n\nExcellent verbal and written communication skills,  such as meeting facilitation,  presentation anddocumentation. \nWell-developed organizational and interpersonal communications skills. \nAbility to handle multiple,  competing priorities,  meet deadlines,  manage risk,  and troubleshootproblems. \nHave strong collaboration and influencing skills. \nKnowledge of eCommerce web development. \nStrong understanding of web technologies,  usability,  information architecture,  and browsercompatibility issues. \nKnowledge of basis data management,  database concepts,  database-driven Web applications.  Masters or Bachelors Degree in Computer/ IT.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "MCA in Computers, Post Graduation Not Required"}, "KEY SKILL": ["code", "Web development", "testing", "Programming", "Workflow", "Business Executive", "database", "CV", "Data management", "web", "Technical", "MySQL", "Writing", "debugging", "Software", "e-commerce"]}