{"JOB DESCRIPTION": "  Role:   Native Software Developer    Job Description     What would you need to do? (Role and Responsibilities)     Developing and improving in-house Software Development Kits (SDKs) dedicated to mobile games (iOS, Android), which would be used by the development and production teams.   Providing support to Engineering teams to integrate Third party Mediation and Ad Network SDKs.    Developing and maintaining a highly modular code base using Third-Party tools and SDKs for iOS and Android platforms.   Working directly with Third parties vendors, via phone and email, responding to technical issues, providing escalated technical and triage support for other team members, and active contribution to our online community and knowledge database for up-to-date solutions.   Collaborating with our Engineering, and QA teams to assist with product enhancements.    Who could you be? Background and Experience:    3+ years of work experience in native Android and iOS development   Solid understanding of native Java/Kotlin and Swift/Objective-C, C# .Net framework   Solid understanding in debugging native applications   Excellent communication skills   Proven analytical/problem-solving ability   Ability to communicate technical concepts clearly and effectively, both written and oral   Demonstrated ability to lead and manage initiatives to completion   Proven ability to work with the team to quickly and calmly resolve technical issues   Demonstrated ability to learn new skills quickly   Ability to work independently and as a part of a team   Flexible, detail-oriented and organized with the ability to multitask   On-call availability    Good to have    Game development experience   1+ years of work experience in Unity 3D  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Other", "FUNCTIONAL AREA": "IT Software - System Programming", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Computer science", "Coding", "Analytical", "Debugging", "SDK", "ios development", "Android", "game development"]}