{"JOB DESCRIPTION": "     Roles and Responsibilities:          Develops or modifies software products and/or customer applications using object-oriented web development utilizing C#, ASP.Net, XML, JavaScript, SQL Server (all versions), HTML5, AngularJS/Angular, SVN, Ant, TeamCity, MSBuild, Web Services, Unit testing, and SOA patterns.         Will work on multiple projects providing development and maintenance work.          Applies existing guidelines and procedures to make varied decisions within a department.         Uses sound judgment and experience to solve moderately complex problems.          Have knowledge of how the pieces of a program fit together for meeting the requirements of an application.            Have knowledge of how to document program design, coding, and maintenance.            Have experience getting critical project to completion with high client satisfaction.            Have a strong understanding of how the software being used relates to the hardware being used.                  Job Requirements:             Demonstrated and verifiable experience with full lifecycle software development of a complex web-based product.            This should include experience developing software requirements, producing design specification, writing high quality software, unit testing, software implementation and integration, and software maintenance and support.            Years of Experience:             Requires 5 years programming and/or analysis or related experience.            Have an excellent knowledge of programming to include:              Additional experience with MVC and SOA patterns considered a plus.           Ideal Candidate will demonstrate the following:             Education / Certifications / Training:   Bachelor s degree in Computer Science, Management Information Systems, Information Technology, or equivalent work experience.          Experience working with relational databases (MS SQL) is a major plus       Experience working in SOLID Principles is mandatory      Client interaction, interpersonal communication, written communication. decision making ability, client focus.      Uses some independent judgment to identify problems and recommend solutions.      Five plus years (current) working experience with web development with Microsoft Tools.          Five plus years object-oriented software development.         Five plus years of C# programming.         Five plus years of SQL or Oracle experience.         Three plus years of experience working with XML/XSLT and JavaScript.         Three plus years of experience writing Unit Tests using MS Test, nUnit or equivalent software.         Insurance industry experience and/or experience with ACORD standards are a major plus.   Experience providing technical consulting services are considered a plus.         Must be detail oriented and possess effective oral and written communication skills.       The ability to understand the subject matter and customize the message according to the intended audience.       Strong organization skills: must be able to work on multiple tasks during the same time frame and meet deadlines with accuracy and efficiency. Must be willing to work extended hours to meet project deadlines.       The ability to communicate effectively, both verbally and in writing to a diverse range of audiences and settings.        Must have a positive attitude, be self-motivated, flexible, and a team player.       The ability to maintain the integrity of confidential business information, our own and that of the clients.       Be comfortable working in a distributed team environment.    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["MS SQL", "SOA", "XML", "Web development", "Javascript", "XSLT", "MVC", "Oracle", "microsoft", "SQL"]}