{"JOB DESCRIPTION": " Trivium is hiring a senior software developer/lead for its Bangalore office.   You will be part of our software development team and responsible for the development of complex applications for customers in the areas of Industry 4.0 and Internet of Things.    Required Qualifications:    You should have the educational background of M.Tech / B.E / B. Tech (in IT/CSE) / MCA. You enjoy working in a highly motivated team with an international mindset and an open culture. You have a deep understanding of agile software development. Ideally, you have gathered several years of experience in the area of software development and are used to working independently and have a structured approach to problem solving.   Overall 7 - 10 years of experience with strong UI skills is required.   Must to have minimum of 2 - 3 years of experience in using Angular 2 and above versions.   Must to have very strong experience in HTML5, CSS and JavaScript.   Good to have back - end experience in any one of the back - end technologies mentioned below:   .Net with .Net standard and .Net core   Experience should include structured source code management using SVN or GIT and build using MAVEN/Grunt.   Need to have good experience in Web application designing.   Knowledge of OOP concepts, industry best practices and architecture designs.   Good understanding of web technology/enterprise level applications.   Good to have experience in Agile methodology.   At Trivium, you will have the opportunity to work on exciting and innovative projects, e.g. in the area of Industry 4.0 and Internet of Things. You work in a team of highly motivated and qualified individuals across locations. We have an informal, friendly and warm company culture, which gives you the space for personal and professional development. At Trivium, we offer flexible work hours, flat hierarchies and an attractive work environment besides a competitive compensation package. we operate out of a spacious, modern, pleasant and employee - friendly office, centrally located in Indiranagar at a walking distance from the Metro Station.   .Net with .Net standard and .Net core ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["Maven", "Application design", "Backend", "GIT", "Web technologies", "Web application", "Javascript", "Development Lead", "Agile methodology", "Python"]}