{"JOB DESCRIPTION": "  Job Summary:     You are a hands-on engineer with significant experience working at the system software level.   You possess the ability to see the big picture, question the norm, and articulate the problem.   You can translate relatively abstract ideas into concrete workable solutions.   You love experimenting with ground breaking technologies that may be relatively immature at the time of their use.   You are good in identifying the technology trade-offs and can synthesize pragmatic solutions to the problems at hand by judiciously using published and open-source technologies.   You are a strong programmer and are not afraid to dive in large code bases.   Ability to quickly learn technologies / solution that exist in the market and translate them into solutions that meet the requirements specifications laid out.    Knowledge and Skill Requirements:    Bachelor or advanced degree in Computer Science or related disciplines.   At least 3 years of experience in Network software development.   Design, develop, deploy and operate software which creates and controls network functions running in hardware and software which performing packet inspection, classification, switching, steering and forwarding.   Create self-service applications and libraries for network engineers to control the network and automate workflows.   Software development skills in Python with Object Oriented and algorithmic experience.   Experience with scripting languages such as bash, Python, PERL, etc.   Experience with networking software (e.g., TCP/IP, IP Tables, NAT, Networking protocols, Deep Packet Inspection, IPV4, IPV6, routing protocols, etc.).   Experience with developing applications using SNMP, NETCONF and other network management protocols.   Experience in networks, devices, services modelling and automation   Experience with design and implementation of NMS/EMS systems.   Use open source and commercial software services, libraries and tools to speed development.   Take responsibility for and own the software services you create.   Working experience in service provider environments that amass large amount of logging data from multiple sources and performing deep data analysis.   Deep understanding and ability to model databases, schema and relationships.   Understanding of how API s from other solutions can be consumed and how API s can be developed for new solutions.   Excellent networking and communication skills.    Other Requirements:    Strong verbal and written communications skills are a must.   Ability to work effectively across internal and external organizations.   Strong technology background is required.   Aptitude to acquire new technology and concepts quickly.   Familiarity with latest trends in networking (e.g., SDN, NFV) is a big plus.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Network Administration, Security", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["NAT", "Automation", "IIS", "Data analysis", "Networking", "IPV6", "SNMP", "Perl", "Open source", "Python"]}