{"JOB DESCRIPTION": "We are looking for multifaceted SW Engineers to help us create multiple AI products. This person will be immediately responsible for UI development and implementation of iOS Apps and eventually will be picking up bigger SW development roles. Job responsibilities: Design and build applications for the iOS platform Ensure the performance,  quality,  and responsiveness of applications Collaborate with a team to define,  design,  and ship new features Identify and correct bottlenecks and fix bugs Help maintain code quality,  organization,  and automatization. Design and develop various SW algorithms (core backend software development). Design and develop web applications on need basis Take ownership of daily project needs and communications. Manage project tasks,  timeliness and communication. Notes for the Role. Apply only if you can say YES to all these questions! This is a startup job -  meaning it may demand 10 hours everyday of your time. Are you willing to go beyond your comfort zoneRewards will come in time,  but not just upfront. Can you commit at least 2- 3 years to work with usMajority of work might be tech- stuff that you have never done before. Are you up for itMust- have skills: Proficient with Objective- C or Swift {{depending on project requirements}},  and Cocoa Touch Experience with iOS frameworks such as Core Data,  Core Animation,  etc. Experience with offline storage,  threading,  and performance tuning Familiarity with RESTful APIs to connect iOS applications to back- end services Knowledge of other web technologies and UI/ UX standards Understanding of Apple s design principles and interface guidelines Knowledge of low- level C- based libraries is preferred Experience with performance and memory tuning with tools Familiarity with cloud message APIs and push notifications Knack for benchmarking and optimization Solid foundation in data structures. Good background in algorithms and strong architectural algorthim skills.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - System Programming", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Performance tuning", "algorithms", "code", "software", "tools", "Web technologies", "ui", "web", "optimization", "design", "swift", "UI development", "development", "c", "ux", "solid", "Architecture", "level", "Data structures", "it", "IOS", "cocoa", "Backend", "Cloud", "Animation", "applications"]}