{"JOB DESCRIPTION": "    Responsibilities      Design and develop highly scalable, reliable and fault-tolerant systems.     Build robust and reliable codebases and deploy polished products and systems aimed at improving customer experience.     Use customer data and analytics to identify areas of improvement and bring data focus during the feature discussions.     Work with cross-functional teams to solve tough engineering problems @Omnify, you will always be hitting scale & as engineers: we create, code, build, design & create FAST and at SCALE.     Work on CI/CD infrastructure & incorporate microservices architecture.     Experience And Skills     2+ years of relevant software development experience with B2B/enterprise products with hands-on experience in deploying large-scale applications.     Proficiency in OOP, SQL, Design Patterns, experience with functional programming is a plus.     At Omnify, we primarily use PHP, Jquery, AngularJS & Angular9. Familiarity with two or more is preferred.     Ability to design and implement low latency RESTful services.     Data modeling experience in Relational databases.     Experience troubleshooting server performance - memory issues, GC tuning, resource leaks, etc.     Understand and implement CI/CD and well versed with Agile methodologies, TDD is a plus.     Excellent understanding of interactive application development paradigm, memory management, performance/resource optimizations, database interactions.     Network programming, concurrency & multithreading, fault tolerance, monitoring, security and operability of systems.     Experience with AWS infrastructure is a must.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Strategy, Management Consulting Firms", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["jQuery", "Multithreading", "Data modeling", "Agile", "PHP", "Application development", "Troubleshooting", "Analytics", "Monitoring", "SQL"]}