{"JOB DESCRIPTION": "[Please Read the Job Posting Carefully Before Applying. This is the JD] Job descriptionAre you a Software Developer looking to expand your experience by working on multiple website and application development projects? Are you looking for international work exposure and an opportunity to demonstrate your creative skill-set? If yes, let's talk!We are a growing Digital Marketing and Development firm based out of India & Toronto, Canada looking for add a passionate Web Developer to our team. The Web Developer will be responsible to develop websites and applications using CodeIgniter, Laravel, Cake PHP, Symphony, and similar platforms.To be an ideal match, you will a minimum of 2 years of prior experience with PHP development. A bachelor's degree in computer science or engineering is an asset.CodeIgniter, WordPress - MUSTWeb Designing - MUSTLaravel - Added advantageHere are some highlighted responsibilities for the Web developer:Writing clean, fast PHP to a high standard, in a timely and scalable wayProducing and documenting detailed specificationsTroubleshooting, testing and maintaining the core product software and databasesIntegration of user-facing elements developed by front-end developersBuild efficient, testable, and reusable PHP modulesIntegration of data storage solutions includes databases (key-value stores, blob stores, etc.)Developer Requirements:Minimum of 2 years of experience in PHP developmentMUST have a minimum of 1 years of experience in CodeIgniter or LaravelUnderstanding of open source projects like Joomla, Drupal, Wikis, osCommerce, etc will be considered as an assetMUST have demonstrable knowledge of web technologies including HTML, CSS, JavaScript, AJAX, etc.MUST have good knowledge of relational databases, version control tools and of developing web servicesBS/MS degree in Computer Science, Engineering or a related subject is considered as an assetAlthough the successful candidate will primarily work in IST time zone, the job may require the developer to be available in EST time zone on ad-hoc basisWhy Work with Us?Competitive PayOccasional flexible working hoursRare opportunity of working on multiple development projects. Majority of the development projects are for North American companiesLearn and grow your skill-set by getting trained by industry professionals while working on projects ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - eCommerce, Internet Technologies", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required, Any Postgraduate in Any Specialization", "DOCTORATE": "Any Doctorate in Any Specialization, Doctorate Not Required"}, "KEY SKILL": ["HTML", "Codeigniter", "Wordpress", "Application Programming", "CSS", "Woocommerce", "Shopify", "JQuery", "Laravel", "Joomla", "Software Development", "MySQL", "Javascript", "PHP"]}