{"JOB DESCRIPTION": "  Good understanding and experience in Progress 4GL.    ADM2 skilled (preferred)      Brief:     An Application Developer, you will participate in product development sessions with business analysts and team members to analyze business requirements and proposed solutions. You will participate in design reviews and provide input to the design recommendations; design, development and testing and incorporate Architectural Standards into all application in design specifications.    Additionally, you will be required to document detailed application specifications; translate technical requirements into programmed application code and develop/ enhance software application modules. You will participate in code reviews and ensure that all solutions are aligned to architectural guidelines, identify/ troubleshoot application related issues, and review and provide feedback to any required documentation.     Responsibilities:      Understand/ reusable code design, leverage application architecture/ framework capabilities and functionality, and design/ develop solutions that are highly reliable, scalable, and perform to meet business - defined service levels.    Work with Product owners to help shape the direction of the product based on the combined knowledge of what's technically feasible and what is desired by the end - user.    Contribute to the technical code using Progress Programming Standards and design documentation.    Provide production support and issue triage for products.      Required Experience:      Very strong in Basic progress 4 GL and Hands - on Progress 4GL experience with versions 10.x. or 11.6.    Experience in developing and debugging an application using progress ADM2    Experience in the App server, technology would be an advantage.    Thorough knowledge of Progress architectures    Mature design, coding, testing and debugging skills.      Tools & Development methodologies:      Experience with Confluence / JIRA / Mercurial.    Experience with agile development processes, specifically SCRUM.    Understanding of Object Orientated Analysis and Design and Component analysis.    Working knowledge of software development methodologies.    Have an open attitude towards sharing ideas and knowledge.    A proactive approach to problem - solving, taking ownership of issues and having the determination to follow things through.    An ability to balance multiple time - critical tasks at the same time.   ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Software development methodologies", "Production support", "Architecture", "Coding", "Debugging", "Scrum", "application architecture", "JIRA", "Progress 4GL", "Software services"]}