{"JOB DESCRIPTION": "  About the Role     This is the team for you if you are excited about building platforms that supports many large scale products and tools / systems that all the Uber engineers use.   In this role you will build software primarily focusing on scalability, performance, usability and reliability.   You will mentor engineers, driving architectural decisions, co-ordinate with stakeholders, drive project delivery metrics and quality metrics     What You'll Do     You will build high quality software that enables thousands of developers with their everyday software development porcess and that provides for the entire automation and release control at Uber.    Work with developer product engineering teams to identify, design and build solutions that help scale our services and platforms.   Architect the developer platform systems, lead teams, mentor engineers and drive project quality metrics.    Drive adoption of best practices in code health, testing, and maintainability   Analyze and decompose complex software systems and collaborate with cross-functional teams to influence design for scalability and testability   Work with smart and motivated teammates in a fast-paced, collaborative environment.   Build elegant backend platform components for high throughput and low latency distributed systems.   Solve challenging problems with cutting edge design and algorithms.   You will work with technologies like Golang, java, python, Mysql, Nosql     What You'll Need     7 years full-time professional software development experience.    Enthusiasm for our mission: You're excited to build systems that support thousands of super smart developers and those that impact products with millions of userbase.    Architecture: Knowledge of data structures and an eye for architecture. You can discuss the tradeoff between architectural choices, both on a theoretical level and on an applied level. You should be able to design database schemas in extensible way.    Strong coding/debugging abilities: You have advanced knowledge of at least _one_ programming language, and are happy to learn more. Our codebase is primarily in Golang.    Product sense: You create more than beautiful code. Engineers at Uber play a crucial role in choosing what we build and how we build it.   A penchant for collaboration a team player: You enjoy working cross collaboratively to drive impact across orgs.    You believe that you can achieve more on a team that the whole is greater than the sum of its parts. You rely on others' candid feedback for continuous improvement  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Automation", "Coding", "MySQL", "Debugging", "Data structures", "SDK", "Project delivery", "Distribution system", "Analytics", "Python"]}