{"JOB DESCRIPTION": "Roles and Responsibilities RESPONSIBILITIES   Reviews, analyses, and modifies programming systems  including coding, testing, and debugging to support application development.  Must have a working knowledge of relational databases and  client-server concepts.  Must be familiar with a range of Microsoft Software tools.  Relies on experience and judgment to plan and accomplish  goals.   A wide degree of creativity and latitude is expected during  the discussions related to the development activities.  Experience and or knowledge in object oriented design.  Good working knowledge of a combination of C#, SQL, ASP.Net,  CSS, AJAX, XML and HTML.  Programming language DevExpress.   SKILLS NEEDED     Ability  to work in a regulated highly detailed environment.    Ability  to gather and analyze statistical data and generate reports.    Ability  to analyze issues and trouble shoot software bugs.    Database  management skills.    Software  coding skills within a variety of environments.   Ability  to create, compose and edit written materials.    Knowledge  of and adherence to internal quality management system.   Ability  to make decisions and judgments based on approved processes and procedures.    Ability  to gather data, compile information and prepare reports.    Ability  to communicate effectively, both orally and in writing.  QUALIFICATIONS NEEDED  This job requires a degree, diploma or  at least 2 years of related experience to the duties and responsibilities  specified.Desired Candidate Profile Perks and Benefits ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Pharma, Biotech, Clinical Research", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Graduation Not Required", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["c#", "Software Development", "CSS", "XML", "ASP.NET", "HTML", "Devexpress", "AJAX", "SQL"]}