{"JOB DESCRIPTION": "Embedded Software Developer | Octasic As an Embedded Software Developer,  you will work on Linux software for Octasics line of cellular base station products.  You will assist implementing a BSP for Octasics products ranging from silicon devices to complete systems.  Broad Linux experience is key,  especially working in real- time environments. You will closely work with the system and embedded software architects during the specification,  implementation,  and integration phases. Responsibilities and duties  Contribute to the development debug of BSP components for Octasics next generation SOC.   Contribute to the validation effort of Octasics next generation SOC.   Performance optimization and tuning of low- level software infrastructure.   Provide second level of support for Octasics deployed systems.  Technical and Skills Requirements  Bachelors Degree in Electrical Engineering or Computer Science  Overall work experience:  5 to 10 years in software design  Familiar with the steps and tools to generate a complete embedded Linux distribution (including kernel configuration compilation and bootloaders) .   Experience with BitBake,  Yocto and/ or OpenEmbedded.   Experience writing and debugging Linux drivers instantiated through device tree files.   Experience debugging embedded hardware systems,  with the appropriate tools such as oscilloscopes.   Demonstrated ability to stay up to date with the Linux communitys latest developments.   Knowledge of scripting languages is a strong asset (Python,  Perl,  bash,  awk,  etc)   Familiarity with ASIC verification is a plus (systemVerilog,  rtl simulation,  etc. )   Familiarity with the following is a plus:  Embedded Android (build and deploy) ,  hypervisors,  qemu internals,  linux containers (using) ,  Jenkins (using configuring) ,  Ptxdist.   Good English writing skills and oral English are required; oral French is also required.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Embedded, EDA, VLSI, ASIC, Chip Design", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["Computer science", "Software design", "Linux", "SOC", "Embedded Linux", "Perl", "Tuning", "Embedded software", "Android", "Python"]}