{"JOB DESCRIPTION": "Role and ResponsibilitiesA successful candidate will be someone - With 3 years experience as a full stack developer in building enterprise applications using Java & PHPPHP work experience is a must.Exceptional knowledge of Object-oriented design including design patterns.Proficient in web technologies CSS, HTML, Java Script, JQueryWork experience with at least one of the web frameworks like Spring MVC, Spring Boot, Laravel Strong experience in RDBMS and NoSQL databasesWork experience in UNIX / LINUXGood working knowledge of build toolHands on experience in testing frameworks Working knowledge of Code version control toolsExposure to CI / CD, Docker, Kubernetes will be an advantage.Exposure to APIs, profiling, web services (REST), multi-threaded applications will be an advantage.Experience developing cloud-based systems will be an advantage.Qualifications and Education RequirementsMinimum Qualification: Bachelor of Engineering / Master of Computer Applications / EquivalentSoft SkillsExcellent team player with openness to excel as a team.Passionate about work and Customer First” attitudeActive listener and good communication skillOpen to Learning – Knowledge is never-ending, able to learn new technologies and implement successfully at work.Additional NotesWhat is in it for you?Be a member of an inclusive start-up company with Respect, Professionalism and Transparency as core values in its genesis. You will be a core & senior member of Technology Group, work closely with leadership team, have a central role in shaping the solutions together with senior business experts and together shape the future for the Company, Peers and Yourself – A win-win formula.The leadership believes that an excellent work life balance is a must to be successful both in professional and personal life. You will work in a dynamic start-up environment where both profession and personal life is considered equally important. Every employee of Green Catalysator IT is an extended family, we shoulder each other’s responsibilities to strike a perfect work life balance. We mean it not just by words, rather by deeds. Sounds interesting, join us to experience and excel your career with passion. That said, each employee well-being is more important – This is taken care through a host of benefits like comprehensive insurance coverage for employee and family, professional development, Conveyance reimbursement, home office setup.What happens when you apply?Our management team will review all CVs and make an initial selection. The candidates who best match the criteria for the position will then move on to the next step in the process – the interview.The time between you submitting your application and the finding out about the interview stages will depend on the number of applicants.The applicant will be intimated about his / her application status through an email.We provide equal employment opportunities without regard to anything else than competence. ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "MCA in Any Specialization"}, "KEY SKILL": ["Java", "CSS", "Software Development", "Spring Mvc", "Javascript", "PHP", "HTML", "JQuery", "Laravel", "Web Services"]}