{"JOB DESCRIPTION": "Java IOT at Sahasya Global Solutions Pvt. Ltd. (2 Opening) \n\nWork Experience: 5.0 Year(s) To 6.0 Year(s) \n\nTitle -  Software Developer Experience : 5 to 6 Years Positions :4 Budget : 18 Lakhs Location :hYDERABAD Skills/ Qualifications: Minimum 5 years of industry experience with 2 years of product development exposure Proficiency in Java,  JavaScript with strong knowledge and experience in Object- Oriented Design. Strong knowledge in microservice and container- based deployment Knowledge of Spring,  Hibernate,  JMS,  ... \n\nJava IOT@Hyderabad Hyderabad/ Secunderabad :Sahasya Global Solutions Pvt. Ltd. \n\nJob Openings Details Sahasya Global Solutions Pvt. Ltd. (2 Opening) Title -  Software Developer \n\nExperience : 5 to 6 Years \n\nPositions :4 \n\nBudget : 18 Lakhs \n\nLocation :hYDERABAD \n\nSkills/ Qualifications: \n\nMinimum 5 years of industry experience with 2 years of product development exposure \n\nProficiency in Java,  JavaScript with strong knowledge and experience in Object- Oriented Design. \n\nStrong knowledge in microservice and container- based deployment \n\nKnowledge of Spring,  Hibernate,  JMS,  JMX,  REST \n\nKnowledge of front- end development using Angular \n\nKnowledge of graph database (optional) \n\nExcellent knowledge on TCP/ IP networking \n\nExperience with Kafka,  Redis,  Akka frameworks would be an advantage \n\nFamiliarity with relational databases such as PostgreSQL and NoSQL databases such as Cassandra \n\nPrior experience with IoT infrastructure,  technologies is preferred \n\nExperience in scalability,  fault- tolerance,  benchmark and performance tuning of IoT platforms. \n\nUnderstanding of IoT use cases in a large network environment such as data analytics,  data visualization,  data processing & actions,  events monitoring,  network maintenance,  configuration and firmware revision is preferred \n\nExperience in unit test frameworks \n\nExcellent communications skills: verbal,  listening and written Development experience with IoT platforms such as Thingsboard & AWS IoT would be an add- on advantage\n\nCompany Profile: Our client is a global IT services and solutions organization offering services in business consulting and technology implementation. Leveraging Cloud,  Analytics,  Digital and Security paradigms,  it delivers consulting and technology services coupled with proprietary execution models and IP to its clients. They have offices across Bangalore,  Hyderabad & Chennai in India,  Middle East and across US. \n\nAlready registered with us Don't have profile with us Drop Your CV We will consider your Profile for future Jobs", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["IT services", "Object oriented design", "Performance tuning", "rest", "Hibernate", "development", "software", "configuration", "Postgresql", "consulting", "networking", "it", "Analytics", "nosql", "JMS", "database", "Front end", "java", "Javascript", "developer", "Firmware", "aws", "deployment"]}