{"JOB DESCRIPTION": "Roles and Responsibilities Software Engineer Front EndAbout Us:Aptify is now part of Community Brands.Community Brands is a software company that helps organizations achieve social good. Throughour technology, we help more than 100,000 associations, nonprofits, schools, faith-basedorganizations, and partners grow stronger and achieve their missions. Like our clients, our nearly2,000 employees strive to improve the world in which they live, and we believe that technologyplays an important role in that. We are techies and volunteers who dream big and are motivatedby more than just a cool job (though thats a great perk we offer too). The Community Brandsculture is one where employees can pursue this passion as part of their profession, and werelooking for great employees to join us!A day in the life:We are looking for talented front-end developers to work within the development team. You will have the opportunity to work with a powerful web application using some of the latest technologies with a brilliant, talented bunch of developers. You will work with other development team members to design, develop, test, and launch new functionality for our platform. This position will be located in our Pune Office.About product:Crowd Wisdom™ enables you to provide a personalized, social and engaging learningexperience which is learner centric. The Crowd Wisdom™ learning management system (LMS)suggests relevant content to each learner based on our advanced recommendation engine. It alsoallows learners to connect with peers to share knowledge and guidance.Crowd Wisdom features:• Branded, Customized Interface• Centralized Learning Hub• Assessment & Testing• Tracking & Certifications• Video Playback Engine & Assessment• Personalized Learning Paths• Social Learning Community• Content Authoring• Multi-Device SupportResponsibilities:• Work with stakeholders in client implementation process to fully configure theiruser facing websites.Code integrations with client back office systems such as a Learning ManagementSystem.• Work with team to spec and estimate new product functionality.• Work with QA to ensure your code is fully tested and working properly.• Write clean, documented code within defined coding standards.• Participate in code review process with team.• Deploy to product when project is complete, we deploy multiple times per day.We'd love to chat if you have...• 3 - 5 years of relevant work experience• Extensive knowledge of HTML5, CSS3, SASS, GIT, JavaScript, jQuery, Typescript, basic Java• Experience in one of Front End framework. React preferred• Willing to work in 1 PM to 10 PM shiftGood People, Doing Good Things:Employees at Community Brands are techies and volunteers who strive to make the Company a great place to work. We dream big and are motivated to help our customers use the technology we create to improve the world around us. And, we look forward to you being part of our story!• Planned Paid Time Off • Purpose Driven Culture• Work-life balance• Passionate about Community Involvement• Company Paid Parental Leave• Remote Flexibility ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization, BCA in Computers", "PG": "Post Graduation Not Required", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["Java", "Typescript", "Html5", "Javascript", "JQuery", "React.Js"]}