{"JOB DESCRIPTION": " At slice, we are looking for an experienced iOS developer to join our technology team. If you have excellent programming skills and a passion for developing applications or improving existing ones, we would like to meet you.Check us out here - https://sliceit.com/The Project:Stime:We are building a new feature for Slice users where they can anonymously post about their interests in books, movies, sports, TV shoes, restaurants etc. and earn rewards when others find it useful. They could also discover new interests & favourites by getting inspired from the posts of their friends and other slice users. Responsibility:Design, build, and maintain high performance, reusable and reliable iOS features purely in latest versions of Swift.Work  alongside product managers and backend team to design, architect and      implement new features in production.Write unit-test code for robustness, usability, and general reliability.Continuously  discover, evaluate, and implement new technologies to maximize development.Efficiency.Minimum Qualification:Bachelor's Degree and/or Master's degree in Computer Science (or relevant equivalent)Strong  experience in developing iPhone/iPad applications with minimum 4+ years of      experience using iOS frameworks.Have  published one or more iOS apps in the app store.In-depth  knowledge of AppStore release process, iOS and apple guidelines.Strong knowledge of OOP, design patterns and debugging techniques to maintain stable production releases.Strong knowledge of Swift, Cocoa Touch and Xcode.Must be up to date on the latest iOS development ecosystem.Preferred Qualification :Excellent  command over Data Structures and AlgorithmSolid  knowledge in REST API integration and JSON response structure.Experience  writing unit tests, testable code.In-depth knowledge of PoP(Protocol oriented Programming).Great  command over iOS architectures to maintain and contribute in a large      codebase.Good  knowledge of notifications and app/ view lifecycleUnderstanding of third party SDK integrations using Cocoapods, SPM etc.Experience working in an Agile environment and project management tool like JiraPreferable if you have experience in the animation, social, and game designing   industry.Why Explore a Career at Slice?We are a young company and so is our culture. We are excited to meet/e-meet people who are talented and ambitious, who are passionate about joining us on this journey to build the first financial brand the millennials in India trust.We provide an extremely fast-paced environment for you to apply what you know and learn what you don't.We can assure you that you will be encouraged, supported as well as challenged to reach your full potential at slice.", "ROLE": "Software Developer", "INDUSTRY TYPE": "Internet, Ecommerce", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["Swift", "XCode", "Cocoa Touch"]}