{"JOB DESCRIPTION": " Primary Responsibilities:  Design, build, test and maintain scalable and stable off the shelf application or custom-built technology solutions to meet business needs Should be able to design and build applications from scratch Should be able to lead the software development process including driving the business requirements and architectural improvements  Propose the right solutions to the team by identifying & understanding the pain points  Should be able to experiment and adapt to new technologies quickly Should be able to review code for quality and implementation best practices. Promote coding, testing and deployment best practices through hands-on research and demonstration  Write testable code that enables extremely high levels of code coverage  Conduct root cause analysis and advanced performance tuning for complex business processes and functionality  Ability to review frameworks and design principles towards suitability in the project context  Mentor young engineers towards guiding them to become great engineers  Desired Skills and Experience: 8+ years of experience in Software Development Strong Java skills including Java 8 features  Great OO skills, including strong design patterns knowledge  Strong knowledge of software best practices, like Test-Driven Development (TDD) and Continuous Integration (CI)  Strong Knowledge of Data Structures & Algorithms Experience in working with data-driven RESTful APIs using web frameworks like SpringBoot, etc.  Strong knowledge of a few databases, like PostgreSQL, NoSQL, etc. Should be able to do data modeling Good understanding of ORMs like Hibernate, JPA, etc.  Better to know Azure tech stack Performance tuning of applications Knowledge of dependency managers and build tools like Maven, Gradle, etc.  Strong debugging skills Good understanding of Microservices-based architecture and the related eco-system  Knowledge of Reactive programming concepts using RxJava and other such frameworks  Familiarity with architectural/ design patterns Understanding of Docker containers and Kubernetes  Advanced knowledge of Agile methodology. Joining in 30 days  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization"}, "KEY SKILL": ["Java", "Algorithms", "java8"]}