{"JOB DESCRIPTION": "Work from home/remote based Opportunity with our US ClientJob SummaryAs a Software Engineer you will be an integral part of our engineering team, serving as a key contributor to solution design, development and release. You will be working with key stakeholders from the product and business teams as well as other software developers to ensure proper delivery. The software engineer contributes to system design, database design, and feature execution while adhering to coding standards and participating in code reviews. You understand software design, standard coding principles, database operations and code optimization. In this role you will focus on delivering products and solutions that directly impact internal and external USA clients. You must be able to balance the desire system elegance against the new for rapid delivery.Responsibilities and DutiesSoftware design, prototyping and developmentFollowing standard coding practicesWork on assignments as directedCoordinate works across the teamEstablish and maintain coding standard and practicesParticipate in software design decisionsCoordinate work on individual sprintsWork with the development team, scrum master and product ownersCollaborate with team members on coding decisionsKey SkillsStrong organizational and process management skills, Strong interpersonal skills working with business and technical teams,High degree of creativity and problem-solving ability,Able to set and manage priorities, Strong writing abilities with user requirements, user cases and user storiesRequired Experience and Qualifications3+ years in a software development role as an individual contributorProficient with SQL Server, Entity FrameworkExperience using C#, .Net MVCAbility to develop software in JavaScript (JQuery, Vue, Angular, React, or related)Comfortable with Agile development processproficiency in HTML / CSSCandidate will be required to work on USTimings. Willingness to work from 7 PM-3 AM. Salary in line with the industry standards. This is an urgent opening. You must be able to give at least 40 hours per week and finish allocated assignments.If interested, please forward your updated resume to careers@acetinfotech.com", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "Post Graduation Not Required", "DOCTORATE": "Doctorate Not Required, Any Doctorate in Any Specialization"}, "KEY SKILL": ["C#", "CSS", "Software Development", "C#.Net", "Javascript", "Entity Framework", "HTML", "MVC", "SQL Server", "JQuery", "Agile Development"]}