{"JOB DESCRIPTION": "We're ADVANCED \n\nWe re one of the UK s largest and fastest growing software companies. True partnership is the defining thing that enables us to stand out from the competition. We pride ourselves on delivering focused software solutions for the public sector,  enterprise commercial and health & care organizations that simplify complex business challenges and deliver immediate and high quality value.\n\nPOST TITLE: Software Engineer (Progress 4GL,  Open Edge,  ADM/ ADM2) \n\nLOCATION: Bangalore -  India\n\nREPORTING TO: Respective Line Manager\n\nEXPERIENCE LEVEL: 3- 5 Years\n\nPROJECT: C&C \n\nJOB DESCRIPTION: \n\nYOU HAVE SOUND UNDERSTANDING AND EXPERIENCE WITH: \n\nQUALIFICATIONS: \n\n1. Master s degree in in appropriate field of study,  3 years of experience as a software engineer\n\n2. Very Strong basics and fundamentals concepts in OpenEdge,  Object Oriented ABL,  .Net Frame Work,  AppServer,  PRODataset.\n\n3. Progress 4GL,  CHUI,  GUI,  ADM/ ADM2,  Open Edge,  Data PA,  XML,  DOM,  SAX,  .Net Framework for Progress ABL.\n\n4. Database Designing and Application Programming.\n\n5. Good in in following Progress 4GL coding standards and best practices. Experience in working with n- tier applications,  service oriented architecture,  Serialization and de- serialization,  XML Parsing and composing,  Class (OOPS approach) ABL,  Prodataset,  HTML,  CSS and JavaScript will be a plus.\n\n6. Either strong OOP or Functional Programing and modelling skills\n\n7. Experience building complex application systems that have been successfully delivered to customers\n\n8. Experience working in an agile environment,  Ability to take a project from scoping requirements through actual launch of the project\n\n9. Experience in communicating with users,  other technical teams and management to collect requirements,  identify tasks,  provide estimates and meet production deadlines\n\n10. Experience with professional software engineering best practices for the full software development life cycle,  including coding standards,  code reviews,  source control management,  build processes,  testing and operations\n\n11. Eagerness and willingness to learn new technologies\n\nSENIOR SOFTWARE ENGINEER TOP SKILLS & PROFICIENCIES: \n\n1. Analysis\n\n2. Software Design\n\n3. Software Documentation\n\n4. Software Testing\n\n5. Teamwork\n\n6. Programming Skills\n\n7. Software Development Fundamentals and Process\n\n8. Software Requirements\n\n9. Software Architecture\n\n10. Self- Directed\n\n11. Multitask\n\n12. Communication Skills\n\n13. Results Oriented\n\n14. High Energy\n\n15. Self- Motivated\n\n16.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["development", "css", "DOM", "code", "technical", "software", "testing", "HTML", "quality", "Process Associate", "oop", "Software design", "database", "application", "Coding", "XML", "service", "Agency Development Manager", "Javascript", "Agile", ".net", "Progress 4GL", "programming"]}