{"JOB DESCRIPTION": "    Job Summary:        We are seeking strong software engineering candidates who are well versed in ServiceNow for the Enterprise Applications Development group. This group is globally responsible for developing and implementing business applications for Altair. The ideal candidate will be comfortable working with ServiceNow technologies, Community, Knowledge Base and integrating various other enterprise applications. The very nature of this job makes this a highly visible position throughout the enterprise, while contributing significantly towards continuous enhancements with customer satisfaction.        What You Will Do:         Work in a highly dynamic team to administer ServiceNow instances       Design and develop high quality, scalable, robust new Apps and Widgets for ServiceNow       Deliver solutions performing seamlessly across ServiceNow for variety of customers       Work closely with the Enterprise Architect and other developers on software architecture, design, dependencies and maintainability       Create and maintain both detailed technical and user facing documentation for ServiceNow       Modify, configure, customize and manage ServiceNow instances as requirements and business needs evolve       Integrate existing solutions into ServiceNow for a seamless experience across Altair         What You Will Need:         At least 3 years of experience as a ServiceNow Developer       Experience with the ServiceNow Community and CSM plugins       ServiceNow Integration Hub developer experience       Knowledge of New York and Orlando ServiceNow releases         Basics:         Bachelor's in Computer Science, or equivalent       Ability to work as a single contributor as well as team player       Strong problem solving and analytical skills         Preferred:         Jira Spoke integration experience       ITIL 4 Foundation certification       Experience using JIRA following an Agile software development life cycle       Strong background in various database systems          ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Construction, Engineering, Cement, Metals", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Sc in Chemistry", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Computer science", "Simulation", "Enterprise applications", "Cloud", "Agile", "Software development life cycle", "high performance computing", "Mechanical design", "Data analytics", "JIRA"]}