{"JOB DESCRIPTION": "About the team and Role The software Engineer team is responsible to develop a revolutionary  finance marketplace product including the design, user experience and business  logic to ensure that the product is easy-to-use, appealing and effective. Your  broad knowledge with required skill set will make you a vital part of our new  and growing team.   Key Responsibilities  Responsible       for full software life-cycle, system design and development of front-end       & back-end systems Writing       high-quality code, participating in code reviews, designing/architecting       systems of varying complexity and scope Identify       libraries and technologies worth experimentation Build       innovative solutions from scratch and liaise with architects and engineers       to build solutions Mentoring       other team members  Desired Skill and Experience   Degree       in Computer Science or relevant experience  2-7       years of relevant hands-on software engineering experience doing software       design and development  Proven       experience of working on back-end web frameworks like RoR (preferable) or       Python/Django or Node.js  Good       command over at least one JavaScript frameworks like React.js, Vue.js or       Angular  Excellent       understanding of relational database structures, having knowledge of       unstructured databases (NoSQL) will be an  added advantage  Expertise       in object-oriented design, unit testing, integration testing, data       structures, algorithms, scalable APIs, etc.  Knowledge       of working on cloud technologies and exposure of AWS services (EC2, RDS,       S3, etc)  Work       in a fast-paced environment and make pragmatic engineering decisions in a       short amount of time  Experience       with Agile Development and Scrum methodologies. ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "M.Tech in Any Specialization, MCA in Computers", "DOCTORATE": "Any Doctorate in Any Specialization, Doctorate Not Required"}, "KEY SKILL": ["algorithms", "python", "software development", "javascript", "nosql", "react.js", "node.js", "ruby rails", "Ror Developer", "software engineering", "data structures", "ruby ror", "Ruby", "ruby on rails"]}