{"JOB DESCRIPTION": ".NET Developers (1-3 Years Experience).NET developers, are you looking for opportunities to work on more challenging projects that will take your career to the next level? Syncfusion has the perfect opportunity that will completely transform your career. We are looking for hard working budding developers who are looking for challenging roles and opportunities to work on cutting edge technologies. If you like working on simple and repetitive tasks you will find our work environment challenging (to put it mildly!). As part of your job you will have opportunities to build world class products utilizing the latest technologies including .NET(Blazor, ASP.NET Core, MVC, WPF, and UWP), JavaScript/TypeScript - Angular, Vue, React, Mobile frameworks (Xamarin, Flutter, iOS and Android). The journey will be tough but after a couple of years working with us your career will become recession proof and can withstand any adverse job markets.Job Description:You will have the opportunity to work on world class web (Components and SaaS applications), mobile and desktop applications. Interact with some of the best UI/UX designers in the world to craft Stunning user experiences.Write clean testable code using C#, JavaScript/TypeScriptRegular appraisals to ensure quick growth if you deliver on the job.Eligibility Criteria:1-3 years of experience in C#/.NETMinimum 65% in UG & PGMinimum 75% in SSLC & HSCNo gaps of any kindQualification: BE/ B.Tech, ME/ M.Tech, M.Sc, MCASkills Required:Good knowledge of C#/.NET or JavaScript (Angular, Vue and React)Good communication skill verbal and written.Good troubleshooting skillsEagerness to learn new technologies that the job requiresAbility to work in a teamAll interviews will be conducted online but you will need to come in for a final interview at our office in Anna Nagar, Chennai. Interested and Eligible candidates can directly apply in Syncfusion Careers on or before January 31st, 2021 For any clarifications please contact the Recruitment team email id: recruitment@syncfusion.com", "ROLE": "Software Engineer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Not mentione", "EDUCATION": {"UG": "B.Tech/B.E. in Any Specialization", "PG": "MS/M.Sc(Science) in Any Specialization, M.Tech in Any Specialization, MCA in Any Specialization"}, "KEY SKILL": ["C#", "Xamarin", "Software Development", "Typescript", "C#.Net", "Javascript", ".Net", "Asp.Net Core Mvc", "WPF", "Angular"]}