{"JOB DESCRIPTION": "                 Position Name: Software Developer Automotive Embedded Systems     Primary Responsibilities:   Responsible for all aspects of design, development, implementation, testing and validation of software for embedded system   Analyzing requirements, developing detailed software specifications and design algorithms, analyze CPU resource, coding and testing of firmware to meet specification and ensure firmware quality.   Develop and maintain engineering documents to meet ASPICE standard   Participate in design reviews.   Support software validation process.   Interaction with customer and other internal teams such as Electrical & Mechanical engineering for project management, project validation and manufacturing support.   Interaction with the counterpartcustomer    Desired Competencies and Experience:    Proficiency in embedded software design & development on 16 32 bit microcontrollers using CC++   Total 3-6 years of experience in automotive embedded software development   Experience in application development in RTOSLinuxQNX.   Good understanding on Microcontrollers and have hands on experience in driver development.   Experience in HMI application development.   Hands on experience in HMI frameworks like Qt, Kanzi and its tools.   Experience in working with CAN & UDS   Understanding on CANalzyer and CANoe   Understanding on Diagnostics, debugger   Experience in Application Lifecycle Management tools for Software Version Control and Defect Tracking to ensure software quality.                     ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Construction, Engineering, Cement, Metals", "FUNCTIONAL AREA": "IT Software - Embedded, EDA, VLSI, ASIC, Chip Design", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["RTOS", "C++", "Linux", "Coding", "automotive embedded systems", "Project management", "Application development", "Firmware", "software quality"]}