{"JOB DESCRIPTION": "SALARY UP TO Rs. 30,00,000 PER ANNUM!! YOU CAN WORK FROM HOME TOO!Take a quick Online Test to see if you can meet our expectations. Only the best are successful. See how good you are by copying and pasting the link below for the online test:https://rb.gy/5m0mewKey Responsibilities:Analyzing user requirements and developing software applications as per user requirements.Updating, repairing, modifying and developing existing software and generic applications in Web Technology.Strong object-oriented programming and problem-solving skills.Designing, coding and modifying websites, from layout to function according to the clients specificationsDeliver as per the quality standards set by the organization.Preparing design and testing documents for developed applications by following the documentation protocols laid by the organization.Skills / Expertise:Full-Stack developer.Hands-on experience with Web Applications and programming languages:- ReactJS/AngularJS with RestAPI- PHP, HTML, CSS, JavaScript, JQuery, JSON.- Knowledge of AWS Cloud will be an advantage.Strong grasp of security principles and application of the same in E-Commerce.Operating systems: Mainly Windows Operating systems, sometimes Linux.Should know Bootstrap, updated with the latest version.Website debugging, website development fundamentals, high-level documentation, and testing.Other Technologies to be known: Apache Tomcat, JDK, MySQL, Ajax, GitHub, SEO, etc.Excellent verbal and written communication skills.Should have good grasping of new technology.Knowledge of Python also an advantage.Job Shift: RotationalExperience: 2 years and aboveEducation:  \"We hire based on individual talent, skill and work ethic. Formal degrees are not a material in our hiring decision\"Job Location: Navi Mumbai Or Working from home till the COVID Restrictions apply.Salary Range: Upto  30,00,000 p.aIf you are successfully hired at XL Dynamics, we'll offer you the best compensation and will match the CTC that you expect. There is no limit for the right candidate.Please copy and paste this link for the online test now!!https://rb.gy/5m0mewYou may answer the questions in the Programming Language you are most comfortable with. You may attempt this quiz at any time, day or night. Here are Testimonials from our current developer Team:https://rb.gy/bus80thttps://rb.gy/zxvgydPLEASE NOTE: Candidates are eligible to apply only if they have spent 2 years of their work tenure with one company. Candidates who haven't worked for any one of their past or current employers for at least 2 years are not eligible - Candidates who have appeared for our selection process in the last 3 months are not eligible for this opening.- Candidates with relevant additional knowledge / skill may get higher package.Perks and Benefits Salary is not a constraint for the right candidate!", "ROLE": "Software Developer", "INDUSTRY TYPE": "Banking, Financial Services, Broking", "FUNCTIONAL AREA": "IT Software - Other", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "MCA in Computers, M.Tech in Computers", "DOCTORATE": "Other Doctorate"}, "KEY SKILL": ["server", "c++", "architect", "front - end", "react", "microsoft", "sql", "back - end", "IT Software - E - Commerce", "database", "java", "Javascript", "data scientist", "html", "python", "c", "oracle", "techical", "engineer", "senior", "angular", ".net", "developer", "IT Software - Middleware", "software developer"]}