{"JOB DESCRIPTION": " JOB SUMMARYWSP is the UK's largest supplier of Land Referencing services and is looking for graduates wanting to start a career in IT industry who will help it to improve and support its systems.We work on the countries largest infrastructure projects with clients in a variety of sectors such as Road, Rail, Energy and Water. Guiding our clients through the planning process is key to the success of our projects meaning the high quality information we store can be usd by our land consultants to demostrate the robust nature of the our data and how we have met dilegent enquiry.You will work within our software development team and embrace our agile approach. This will involve all aspects of software development and ensure our systems have the ability to deliver our projects in an efficient manner.You will report to one of our experienced developers in our Noida Office who will provide advice and mentor you to obtain the skills required to carry out the role using our innovative systems. You work will closely along side our Development colleagues in our UK offices. CORE FUNCTIONSImplement new and improved functionality as per the development schedule and technical documentation.Communication risks and impediments effectively in a timely manner.Work as part of a development team with co-located and remote colleagues.Write accurate technical documentation including deployment plans, test plans and release notes.Deliver work items on time and on budget that fully meet the requirements.Testing changes before release, to ensure the quality of our systems remains high.Take part in our scheduled meetings providing accurate updates of progress on work and demonstration of working functionality.Consistently apply programming standards and techniques to assure quality, resilience and availability. RequirementsWSP is looking for self-motivated individuals with strong verbal and written communication skills. The role will involve an introduction to all aspects of software development, from the requirements capture to the user testing and deployment.Wed love to hear from you if you have:six or more years commercial experience in software development using C# ASP .Net / ASP .Net Core MVCUnderstanding of APIs which use RESTStrong SQL experience, implementing queries with a focus on performanceExperience with design patterns such as Dependency Injection e.g. Autofac or UnityExperience with task tracking software such as Azure Dev Ops or JiraUnderstanding of source control using TFS or GITA willingness to constantly learn new skills and apply them in your roleStrong communication and ability to work within a teamwork A degree in a computer science or related subjectYoull stand out if you have:Experience with a modern JavaScript framework preferably React.js.Experience in front end developmentYou can demonstrate personal projects you have created, and are proud to demonstrate them** Immediate Joiners Preferred", "ROLE": "Software Developer", "INDUSTRY TYPE": "Other", "FUNCTIONAL AREA": "IT Software - Client/Server Programming", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Sc in Any Specialization, BCA in Any Specialization, B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["C#", "Dependency Injection", ".Net Core", "Software Development", "Javascript", "ASP.Net", "Autofac", "MVC", "Selenium", "React.Js", "ASP"]}