{"JOB DESCRIPTION": "Software Developer PHP\n\nMinimum 5- 7 years experience.\n\nDescription:\n\nWe are looking for a Senior PHP Developer who is dedicated to the craft,  writes code that can hit the ground running.\n\nThe candidate will be a part of a full- stack creative team that is responsible for all aspects of the ongoing software development from the initial specification,  through to developing and launching.\n\nResponsibilities & Requirements:\n\nMust be able to handle and lead a team of developers/ designers effectively.\n\nMust be able to take skype/ phone calls,  chat with clients on regular basis.\n\nShould be able to take up ownership of projects running under him.\n\nContribute in all phases of the development lifecycle.\n\nAt times,  there may be needing to take client calls at late nights or early mornings (US Time zone).\n\nKnowledge of Cloud Computing (Amazon Cloud,  Google Cloud) is a huge plus\n\nSkills & Expertise:\n\nProven software development experience in PHP.\n\nUnderstanding of open source projects like Joomla,  Drupal,  Wikis,  osCommerce,  etc.\n\nDemonstrable knowledge of web technologies including HTML,  CSS,  Javascript,  AJAX etc.\n\nSound skills with third party integration,  payment gateway integration & Database Caching.\n\nSource code repository (SVN/ GIT) knowledge is preferable.\n\nKnowledge of MEAN Stack & continuous integration and delivery is a huge plus.\n\nStrong oral and written communication skills in the English language mandatory.\n\n4 Years of Engineering Degree (IT/ CS) is a must.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - eCommerce, Internet Technologies", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Cloud computing", "development", "code", "software", "developing", "HTML", "Joomla", "cloud", "Drupal", "database", "OSCommerce", "GIT", "web", "Javascript", "PHP", "developer", "Open source", "Ajax"]}