{"JOB DESCRIPTION": "About UsKnowzies Technology Solutions (www.knowzies.com) is one of the leading Custom Software Development company focused markets in USA and India. The company has been recognized as one of India's 20 Most Promising eLearning Solutions Provider, by Silicon India. Position: Senior Software DeveloperCurrently Job is Work From HomeExperience:  3 Year  5 YearsJob Responsibilities & Duties: Build complex, custom-designed, multi-tier, enterprise-level business applications that      utilize LAMP stackWork on full life-cycle software applications, including analysis, data modeling,      requirements gathering, development, testing and deploymentLead development teams, including conducting task estimation, iteration  planning, coaching through software issues and facilitating architecture discussions and decisions Write effective REST APIs  Build features and applications with a mobile responsive design Write technical documentation Use best practices of software development methodologiesTo write and implement test scripts and frameworks, including unit, integration, and      functional testingDesired Candidate Profile  Experience in eLearning domain will be an added advantage.Has been part of the core product team and helped in building and maintaining the product Full life-cycle software solution experience, including analysis, data modeling,      development, testing and deploymentDemonstrable analytical skills (coding exercise required) Hands on experience in the following technologies: Angular 8, JavaScript, jQuery, PHP-Laravel, HTML 5, CSS, XML and SQLVery strong knowledge and experience in MySQL database (DDL and DML) is a mustHands on experience on Amazon Web Services (AWS) (optional)Knowledge of other PHP frameworks would be added advantage", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Diploma in Computers, Engineering, B.Sc in Any Specialization, BCA in Any Specialization, B.Tech/B.E. in Any Specialization"}, "KEY SKILL": ["angular", "Software Development", "Responsive Web Design", "Html5", "MySQL", "PHP", "Laravel"]}