{"JOB DESCRIPTION": "  Duties and Responsibilities          Experience importing, cleaning and manipulating large datasets (500,000+ records) using one or more statistical packages (R, Python, STATA) and identifying, summarizing and effectively correcting data inconsistencies. Ability to clearly document and communicate data exploration and cleaning decisions while assessing their effect on resulting data structures and possible analyses.   Employ sophisticated analytics programs, machine learning, and statistical methods to prepare data for use in predictive and prescriptive modeling.   Build scalable and high-performance machine learning algorithms.   Create easily understandable data visualizations of findings (e.g. charts, graphs, infographics).   Document findings visually and/or verbally for memos and reports to clients and/or internal project teams.   Support senior staff with development of presentations and papers.      Qualifications       Bachelor s or Master s Degree Computer Science, Computer Engineering or Information Technology with data science training     Five or more years work experience with cloud-based software development and data analytics applications     Programming proficiency with React/Angular, D3, MySQL and Python/R.     Detailed understanding of backend and UI/UX development using modern cloud based platforms.     Experience with Exploratory Data Analysis including wrangling, grooming, transformation, and analysis     Experience using IDE tools such as Jupyter to develop and demonstrate results     Experience with Azure stack and Kubernetes is a plus     Experience and success operating on an Agile Scrum team     Experience working with MySQL and relational databases.     Experience working with NoSQL databases such as MongoDB or CosmosDB.     Experience with integrating and using Data Science libraries such as scikit-learn, MlLib, Pandas, python (Jupyter, scikit-learn, pandas, etc.), R, Java      Experience with supervised and unsupervised machine learning techniques      Experience with Agile development and Agile tools (i.e. Jira, Confluence)      Strong understanding of creating APIs to leverage a variety of storage and analytical engine nodes.        ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Oil and Gas, Energy, Power, Infrastructure", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Computer science", "Data analysis", "data science", "MySQL", "Consulting", "Machine learning", "Data structures", "JIRA", "Information technology", "Python"]}