{"JOB DESCRIPTION": "      Job description     Position Objective:       Responsible for designing and writing business applications, designing and coding middleware for system integrations, and designing enhancement modifications to existing systems.      Position responsible for maintaining and upgrading existing systems developed in-house     Must work on new requirements being defined and providing emergency patches when necessary for production systems.      This position is expected to act as a technical resource for IT Project Managers during the feasibility and design phases of their projects.           Responsibilities         Take ownership of user stories and ensure tasks have been defined to meet the acceptance criteria.     Design original software that enhance business processes and efficiencies within allotted timeframes.     Responsible for leading some code reviews.     Follow and enforce the Kemin development standards.     Learn the existing line of business applications and the associated business functionality.     Responsible for building data models in relational database systems.     Must be able to work as a part of a team of developers and able to work independently on smaller projects.     Compose technical documentation and troubleshooting guides for administrators and help facilitate the handoff from development to systems support teams.     Provide a timely and effective response to escalated user queries by identifying, analyzing, investigating, and fixing bugs in production software as required.     Ensure proper stakeholder communication and escalation as required.     Perform ?root cause? analysis on user issues/bugs and provide immediate workarounds for critical problems.     Maintain support documentation for software and system developed and ensure they are up to date.     Develop strong relationship with the infrastructure and support teams to resolve production issues in a timely manner.     Good general awareness of Information Security policies and Technology Risk Management.     Work with product owners and business analyst to define design requirements.     Keep up with the latest development trends and have an open mind to new technologies and methodologies.        Qualifications         Bachelor?s or Master?s degree in IT - BE. BTech, BCA, BSc etc.,      Minimum 6 to 10 years of proven experience in information technology as developer      ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "BCA in Computers, B.Tech/B.E. in Production/Industrial, Any Graduate in Any Specialization, B.Sc in Chemistry", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Root cause analysis", "Business Analyst", "Coding", "Information security", "Troubleshooting", "Risk management", "Business applications", "Middleware", "Information technology", "Technical documentation"]}