{"JOB DESCRIPTION": " Works independently under limited supervision and applies knowledge of subject matter in Applications Development. Possess sufficient knowledge and skills to effectively deal with issues, challenges within field of specialization to develop simple applications solutions. Second level professional with direct impact on results and outcome.    Your future duties and responsibilities:     Member should have 5 years of experience in Analysis, Development & application debugging using Magento 2   Good exposure to Magento 2 Backend    Required qualifications to be successful in this role:   Member Should be willing to work in Europe Shift   Must have a minimum 4 years development experience in Magento and minimum 2 year of development experience especially in Magento 2.   Competent with PHP object-oriented programming & MVC applications.   Ability to do customizations in Magento 2.   Strong understanding of Magento back-end and Magento Framework.   Strong in responsive and adaptive web development procedures.   Knowledge of how to interact with APIs (REST, GraphQL) and formats (JSON, XML).   Should have good knowledge of semantics and code optimization techniques.   Experience in working with Docker, PHPStorm and Xdebug.   Experience in working with Magento coding standard and quality gate validation.   Knowledge of RDBMS (MySQL). Experience in creating complex SQL and understanding how indexes work is a big plus.   Familiar with Version Control Systems, specifically Git.   Experience on Agile Methodology   Magento 2 certification (Good to have)   Familiar with PWA Technologies like Magento PWA Studio or Vuestorefront (Good to have)    Skills:    Magento ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["RDBMS", "Coding", "XML", "MySQL", "Web development", "Debugging", "PHP", "JSON", "MVC", "SQL"]}