{"JOB DESCRIPTION": "Senior Software Developer JAVA - e-Commerce We are looking for few brilliant JAVA developers to be a key part of technology team @ RateTag. We have multiple vacant positions to fill. The location is Gurgaon, role is permanent.  As part of the technology team, you will be responsible for building new software components and enhance the B2B e-Commerce marketplace that our clients run on. Along with this, there are several other systems to integrate with.  ## Duties ## Writing, deploying and managing JAVA code  Architecting technical solutions for various business problems either as an individual contributor or as part of a larger team depending upon your seniority levels.  Work with Java development tools like Eclipse, Maven, Github etc. Integration with presentation/aggregation layer using RESTful or SOAP web services API integrations with 3rd parties Automation of software testing at development stage Database and application optimization  Write applications capable of handling high traffic in cloud environment such as that of AWS  Work in teams or as individual contributor as per needs ## Qualifications ## B.E./B.Tech (CS)/ MTech from reputed engineering institutes or universities Passion for writing software Minimum 4 years of work experience, preferably in an e-Commerce company  A solid foundation in computer science, with strong competencies in data structures, algorithms, and software design.  Familiarity with SQL/NoSQL (Oracle/MySQL/MongoDB/) databases Proficient understanding of code management tools such as Git or Subversion Must have experience in Spring Framework Knowledge of Tomcat or Jetty application servers will be helpful  Should be well verse with Software Development Life Cycle especially in Agile methodologies like SCRUM etc.  Front-end frameworks knowledge like Angular.js will be helpful, though not mandatory Basic understanding of front-end technologies, such as JavaScript, HTML5, and CSS3 Preferred - experience in Lucene, ElasticSearch/SOLR, Jenkins , Docker, Grails, Groovy Please email your resume and a cover letter to hiring manager", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - eCommerce, Internet Technologies", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Production/Industrial", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Computer science", "Software testing", "Software design", "Front end", "Spring framework", "Software development life cycle", "E-commerce", "Data structures", "Java Software Developer", "Individual Contributor"]}