{"JOB DESCRIPTION": "  Role Summary        The Software Engineer is responsible for designing the software components (detailed design), codes the software components and tests the software components based on the software architecture and the software requirements within a project.       Key Responsibilities        Development (design, implement, test and debug) of core , BSW and/or application specific software requirements for automotive embedded electronic module serial production projects         Develop software in compliance with a formal ASPICE/CMMi based Global Product Engineering Process (GPEP).         Verify software requirements at component and bench level         Support rest of the functional disciplines with all aspects related to software.         Perform detailed work assignments provided by the mentor or team member, by applying established and well defined software engineering techniques         Work assignments primarily involve entry level or intermediate work.         Performs other duties as necessary in support of business objectives. Ensures that facilities are in full compliance with all safety regulations.         Maintains regular attendance.         Follows safe work procedures; Uses appropriate personal protective equipment (PPE); Uses workplace tools and equipment as instructed; Reports workplace hazards, injuries and illness as soon as possible following event.         Complies with the requirements of Quality Operating System (QOS)       Key Qualifications/Requirements        Bachelor s degree in Computer Engineering / Software Engineering / Electrical Engineering / Computer Science or equivalent         (Master s preferred)         0-10 years relevant experience regarding the Responsibility / Activities (listed above) for automotive electronics serial development projects (mandatory).    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Automobile, Auto Anciliary, Auto Components", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization"}, "KEY SKILL": ["Computer science", "Electrical engineering", "software architecture", "Project development", "Product engineering", "QOS", "Compliance", "automotive electronics", "CMMI", "Software engineering"]}