{"JOB DESCRIPTION": "Where the learning curve never ends Responsibilities:  \nSystem configuration & trouble shooting across networks and clusters (on several OS,  with advanced versions not released to market) \nWriting automated testing of features for the above systems -  this could involve shell scripting /  perl scripting Troubleshooting and Analysis \nThe candidate is expected to have analytical and problem solving skill. He will be responsible for communicating problems in the product and co- ordinate to get them resolved.  Requirements: 0- 2 years of experience in Linux and Unix Expected Technical Skills:  \nSystem Level Understanding of Linux \n Understanding of Shell Scripting /  Perl Scripting \nConcepts of Testing will be an added advantage \n System Administration Should posses sound knowledge of Operating system concepts (Linux/  Unix)  B.E. /  B. Tech /  M.E. /  M. Tech /  M.S. in computer science /  MCA /  BSc in computer science /  BCA or equivalent Responsibilities Senior level developer who will be responsible for development and implementation of complex application integration on diverse platforms Expected Technical Skills:  \nStrong shell programming and C systems programming skills on UNIX platform with 2- 5 years of experience. UNIX knowledge is must. \n Exposure to system administration,  storage domain and knowledge of storage software is preferred,  but not a must. \n Candidate should have excellent communication and presentation skills,  both written and oral \n Strong organizational skills,  attention to detail,  ability to take initiative \n Strong leadership,  problem solving and communication skills are essential for success in this position  \nAbility to support by carrying support cell and resolving issues during non- business hours   B.E. /  B. Tech /  M.E. /  M. Tech /  M.S. in Comp.", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - System Programming", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["Unix", "bca", "c", "technical", "software", "level", "configuration", "administration", "testing", "Perl", "mca", "Business Executive", "System administration", "Comp", "Computer science", "scripting", "bsc", "Linux", "Analytical", "Shell scripting", "Technical skills", "troubleshooting", "developer", "support"]}