{"JOB DESCRIPTION": "Roles and Responsibilities• Familiar with the software development life cycle (SDLC) from analysis to deployment.• Comply with coding standards and technical design.• Believes in systematic approach to developing the system through clear documentation (flowcharts, layouts, & etc) of functionality, address every use case through creative solutions.• Adapts structured coding styles for easy review, testing and maintainability of the code.• Integrate the developed functionality and/or component into a fully functional system.• Ensure unit and integration level verification plan are in place and adheres to great quality of code at all time.• Active participate in troubleshooting, debugging and updating current live system.• Verify user feedback in making system more stable and easy.• Work closely with analysts, designers and other peer developers.• Preparing technical training documents for onboarding new engineers.Exp. - 2+ years of experience as Software Engineer or Software Developer or in a relevant role.• Proficient in React, NodeJS & GraphQL/ REST• Hands-on with SQL or NoSQL database.• Knowledgeable in data structures and algorithms.• Experience in designing interactive applications.• A background in Engineering with sound oral and written communication skills.• Prior experience with AWS stack would be added advantage. • AWS certification would be a big plus .", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Sc in Computers, B.Tech/B.E. in Computers, BCA in Computers", "PG": "Any Postgraduate in Any Specialization", "DOCTORATE": "Doctorate Not Required"}, "KEY SKILL": ["REST", " AWS", "NoSQL", " NodeJS", "troubleshooting", "debugging", "software engineer", "developer", "graphQL", "React", "SQL"]}