{"JOB DESCRIPTION": "Team Lead /  Sr.Software Developer -  Java We are looking for Team Lead willing to experiment and be on the cutting edge,  Collaborate with Product team,  UI Designers,  product operations and marketing to develop and deliver path breaking projects and apps. \n\nRoles Responsibilities Developing key components/ modules using Java/ J2EE,  Cloud computing and related technologies Help enumerate Project specifications and evolve Architecture design Participate in testing and deployment phase of the SDLC Help manage entire cycle from Specs,  Development,  Testing to successful Delivery Resolve technical issues by debugging,  research and investigation Evaluate emerging technologies and techniques; formulate ways and means to incorporate them in current projects Skills Qualifications Minimum 5- 7 years of industry experience B.E./ M.C.A./ M.E.- M.S.- M.Tech Proficiency in Java,  Servlets,  Java Script,  PL/ SQL 2 years in Java development for large,  web- based applications Preferable knowledge in Oracle/ MySQL,  Linux,  Apache,  AJAX XML,  XSL,  XSD,  XSLT,  XML parsing/ processing,  HTML,  JavaScript SQL,  PL/ SQL,  and common database technologies (Oracle,  Mysql) Must be familiar with packaging and deployment on Application Servers like Websphere or Weblogic Object Oriented Design Skills:  UML,  OOAD,  Design Patterns Good verbal and written communication skills", "ROLE": "Software Developer", "INDUSTRY TYPE": "Media, Entertainment, Internet", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "M.Tech in Computers"}, "KEY SKILL": ["technical", "developing", "research", "sql", "cloud", "database", "java", "ui", "Weblogic", "MySQL", "design", "Oracle", "Ajax", "architecture", "deployment", "development", "testing", "Java Software Developer", "Apache", "javascript", "Linux", "application", "UML", "XML", "PLSQL", "developer", "sdlc", "applications"]}