{"JOB DESCRIPTION": "We are currently seeking full time Software Developer with 6 to 7 years of Industry experience. To be successful in this role,  you should be able to independently understand the functional requirements and write functional code. You must be a motivated,  self- starter,  self- learner & should possess strong customer service and technical problem solving skills.\n\nPost: Software Lead\n\nQualification: Any Graduate\n\nExperience: 6- 7 Years\n\nJob Location: Pune.\n\nSkills & Experience Required\n\n Good understanding of the Web technologies\n\n Good understanding of the databases (MySql)\n\n Excellent coding skills in Core Java,  PHP & Android\n\n Has participated in requirement gathering and analysis with clients\n\n Has participated in designing the products /  solutions\n\n Can collaborate with internal teams to produce software design\n\n Able to mentor Junior Team members\n\n Provide inputs & participate in upgrading,  configuring and debugging existing systems\n\n Need to have basic knowledge of Linux operating system\n\n Excellent written and verbal communication skills\n\nProductivity /  Efficiency\n\n Leverages individual and team knowledge and expertise,  knowledgebase,  documentation and other information sources to help solve problems\n\n Good time management skills and demonstrated ability to effectively prioritize own workload\n\n Able to troubleshoot,  debug and reproduce customer scenarios\n\n Logical thinker with analytical and problem solving skills\n\n Learns rapidly through both formal and informal training\n\n Required to be flexible,  detail- oriented and organized with the ability to multi- task", "ROLE": "Software Developer", "INDUSTRY TYPE": "Recruitment, Staffing", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Core Java", "Software design", "Web technologies", "Linux", "Coding", "Analytical", "MySQL", "PHP", "Customer service", "Android"]}