{"JOB DESCRIPTION": "New trends and expectations are reshaping the automotive  industry. Inspired by the exciting new challenges associated with this  revolution, Faurecia anticipates the future of mobility developing cutting-edge  solutions for smart life on board and sustainable mobility. If you’re willing  to contribute and create value for tomorrow’s cleaner and smarter mobility,  Faurecia is the place to be.  The Digital Services  Factory (DSF) is a fast growing team in charge of providing AI solutions for  manufacturing excellence and efficiency as well as for smart product  development for the automotive industry. In order to meet the increasing  expectations we are enriching our team by adding highly skilled resources.Qualifications:  Masters or PhD in Computer Science, Physics, Engineering or  Math.  Scripting / Programming Skills such as Python, Java, Scala  C++ as well as programming applications backed by cloud services. Deep  knowledge in micro-services software architecture and principles - Experience  with Containers, Docker, Kubernetes.  At least 5 years experience in leading or developing high  quality, enterprise scale software products using a structured system  development life cycle integrating state-of-the-art DevOps CI/CD technologies.  Experience in applying software- defined architecture approaches  Experience working with external or internal customers to  implement large scale data oriented solutions in an Agile environment.  Demonstrated ability to adapt to new technologies and learn  quickly.Operations skills would be appreciated:  Certification IFPUG or similar approaches is a plus  Experience as software development team lead in Agile  environment is a plus  Experience in development of Web application Front-ends and  knowledge of Javascript frameworks (such as ReactJS, Angular JS) is a plus  Experience in one or more specific IOT / Embedded / M2M  Industry (i.e. home automation, factory automation, smart utilities, etc.)  Intermediate / advanced knowledge of the cloud services ", "ROLE": "Software Developer", "INDUSTRY TYPE": "Automobile, Auto Anciliary, Auto Components", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Sc in Any Specialization, B.Tech/B.E. in Any Specialization", "PG": "MS/M.Sc(Science) in Any Specialization, MCA in Computers, M.Tech in Any Specialization", "DOCTORATE": "Any Doctorate in Any Specialization, Doctorate Not Required"}, "KEY SKILL": ["CLoud", "Java", "REST", "Software Development", "Enterprise Application", "Docker", "Mircroservices Architecture", "Python", "Kubernetes"]}