{"JOB DESCRIPTION": "Role summaryAs part of our virtual team based  in India and the UK, you will lead innovation of new and existing end  to end cloud based solutions for our applications and for third party clients. You will be responsible for  development of backend solutions as well as design and build user  interfaces and responsive/progressive web apps. We work using agile/SCRUM methodologies and remote communication channels (video calls /chat Slack, Skype).If you are self-driven,  independent, and reliable with a high level of integrity and passion for  technology advancements this is a role for you.Essential skillsBSc/B.E. in Computer Science related degree, 2.1 minimumExpert in running and use GIT for version control.Excellent awareness of security including injection, package and code scanning/checking Agile experience (SCRUM)Linux or OSX advanced userAbility to  communicate effectively and promptly through remote means like Slack,  screen sharing with excellent written and spoken English. IELTS 7 is a plus.Aware of best patterns (SOLID, GOF patterns book)You will be working independently using git  and committing work to a git repository. You will follow the git flow  to open PRs to the main branch for review. You will need to document  ,using markdown/README style documentation, and suggest best practices  when necessary.Docker/docker-compose essential knowledge is required to run the local development environment.Front-end JavaScript: React, Angular, JQueryCSS3/HTML5 (Yarn, NPM, SASS, LESS, Grunt, Grump or other building tooling)Back-endPHP Version 7, ideally strict typingAbide to PSR standards, 1, 2,3,4,5,9,12Symfony framework certified preferred, CodeIgniterTwig Doctrine ORMAble to create re-usable bundles and import them into custom projectsSQL - MySQL/PostgreSQLExperience/interest in managing and troubleshooting AWS solutions/integration for BAU activities, deployment and supportability.Desired SkillsKeen creative eye to design sleek and user friendly mobile first responsive interfaces.Able to sketch wireframe and sample interfaces fast (Balsamic Mocks is a plus)Experience awareness of pair programming, even remotelyMasters creation of both rasterized as well as vector based graphics and knows how to optimise them for the Web using Photoshop, Illustrator, GimpTDD with cucumberjs, PHPUnitLinux - ability to create and understand complex bash scriptsContinuous Integration - Able  to follow and abide to CI principles and prove every single commit code  change is Unit/BDD tested with best effort code coverage using GitLabExposure on GitHub, Stackoverflow and ideally an open source passionate (provide links, linkedin, github, stackoverflow)Security - OWASP - aware of best security and pen testing techniquesPerformance Testing - ability to run performance testing and prove code is performance optimise", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Temporary/Contractua", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers"}, "KEY SKILL": ["Javascript", "PHP", "SQL", "Open Source", "GIT", "Docker", "Html5", "Web Technologies", "Phpunit", "JQuery", "Grunt", "Angular"]}