{"JOB DESCRIPTION": "Job Description:We, at Jet2 (UK’s third largest airlines and the second largest tour operator), have set up a state-of-the-art Technology and Innovation Centre in Pune, India. This job opening is for Jet2 Travel Technologies Private Limited (Jet2TT) which works alongside software development teams at Jet2.com and Jet2holidays.As a part of Jet2TT, you will work with Jet2 project teams in UK offices. These teams help Jet2 in building new systems, upgrading legacy ones and fostering innovation.As a Senior Software Developer, you’ll be part of our team in Pune. The successful candidate would be a technical expert at application design and development and can take on software development responsibility with minimal or no supervision.We are looking for a Senior developer with proven technical abilities to help us in making this new development stream a resounding success.Responsibilities:You’ll be in a very hands-on coding role, as a senior developer in an expert technical team.You will be responsible for the delivery of assigned user stories/tasks, meeting your own goals and supporting team members in meeting the team’s commitments.You will take pride in the quality of your code, peer-reviewing clean, maintainable code that you’ll support in the future.You will share skills and techniques, to drive quality improvements across the team.You will work closely with your colleagues in the UK, actively participate in the early phases of the scrum and propose a plan of action to achieve the desired outcome.You will mentor junior developers to grow them technically.You will demonstrate strong written and verbal communication skills to discuss complex solutions to both a technical and non-technical multinational audience.Technical skillsProgramming: You have proven expertise in software development & troubleshooting in the MS tech stack including C#, .NET 4.0+, ASP.NET, MVC, WCF, and Web API.Front-end: You demonstrate a proven experience in front-end development, with technologies such as Angular 2/4/7, Bootstrap, HTML, CSS.SQL Server. You write efficient queries and debug effectively. You understand how changes can be deployed without risk. You are an expert at SQL and MS SQL 2012/16.Continuous Integration CI/ CD: You promote CI/ CD and automation of processes. You possess intermediate level skills in branching, release & deployment with tool such as Git.Architecture/ Design: You have sound knowledge of project architecture principles and design patterns. You actively participate in architecture and design forums.Agile / scrum. You embrace change, minimize risks and deliver useful software frequently. You work in a fast-paced agile environment and possess experience with agile tool like TFS/JIRA.Test-Driven Development. You ensure developed application is easily testable. You possess experience in TDD frameworks like MS Test/ NUnit.Code Quality. You promote high quality coding, promote reusability, enhancing redundant architecture and educate junior developers in team.Required Candidate profileBachelor/Master’s degree in Computer/Information Technology Engineering from a reputed institute.5+ years of hands-on experience in .Net/C#/Microsoft stack development.Net/C# certification from a reputed institute is desirable.Experience in Microsoft Azure with focus at development, build & release would be a plus.Prior experience in the travel industry would be a nice to have.", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Any Postgraduate in Any Specialization, Post Graduation Not Required", "DOCTORATE": "Any Doctorate in Any Specialization, Doctorate Not Required"}, "KEY SKILL": ["c#", "Angularjs", "GIT", "mvp", ".net", "mvc", "agile methodology"]}