{"JOB DESCRIPTION": " Job Summary:  We are looking for a Assistant Software Developer to build and implement functional programs. You will work with other Developers and Product Managers throughout the software development life cycle. In this role, you should be a team player with a keen eye for detail and problem-solving skills. If you also have experience in Agile frameworks and popular coding languages (e.g. JavaScript). Roles and Responsibilities  Key Responsibilities:  • Work with developers to design algorithms and flowcharts • Produce clean, efficient code based on specifications • Integrate software components and third-party programs • Verify and deploy programs and systems • Troubleshoot, debug and upgrade existing software • Gather and evaluate user feedback • Recommend and execute improvements • Create technical documentation for reference and reporting Desired Candidate Profile  Skill Requirements:  • Proven experience as a Assistant Software Developer, Assistant Software Engineer or similar role Familiarity with Agile development methodologies Experience with software design and development in a test-driven environment Knowledge of coding languages (e.g. .NET, C#, MVC, ASP.Net, SQL, JavaScript) and frameworks/systems (e.g. AngularJS, Git) Experience with databases and Object-Relational Mapping (ORM) frameworks (e.g. Hibernate) Ability to learn new languages and technologies Excellent communication skills Resourcefulness and troubleshooting aptitude Attention to detail B.Tech, MCA Degree Perks and Benefits 5 -6 Lakh PA", "ROLE": "Software Developer", "INDUSTRY TYPE": "Medical, Healthcare, Hospitals", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "B.Tech/B.E. in Computers, BCA in Computers", "PG": "MCA in Computers, M.Tech in Computers"}, "KEY SKILL": ["c#", "Software Development", "Life Cycle", "Coding", "Problem Solving", "Javascript", "Agile", ".Net", "ASP.Net", "MVC"]}