{"JOB DESCRIPTION": "   As a Software Engineers you will play a key role in our product engineering squads.      You will be responsible for helping design, develop and maintain our communication products and related services.      You will actively work towards achiving our target of 1 Billion SMS from in a day.     Our product engineering squads have the freedom and authority to create impactful products to empower our customers.      Our phylosophy is agile and mothodology is SCRUM. We ensure a new release every two weeeks, while ensuring our applications are rigorously tested and statically analyzed.        Work Area        Help design and build a performant, scalable and fault-tolerant communication platform     Team with engineers to solve system design and implementation problems (and get a thrill out of every triumph!)     Work with and enable engineers from other teams who interact with the platform     Problem-solve issues based on business/customer need and impact, working with technical and non-technical stakeholders      Skills Required        Minimum 2-3 years of hands-on software development experience     Fluent in one or more programming languages, including (but not limited to) C# .net Core, Python (Addeed advantage)     Fast, collaborative and able to problem solve (but no egos, please!)     Experience working on large-scale and high-availability distributed architecture would be an advantage     A degree in Computer Science or a strong knowledge of computer science fundamentals     Full (professional proficiency) in English, both verbally and written    ", "ROLE": "Software Developer", "INDUSTRY TYPE": "IT-Software, Software Services", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["TCP", "Analytical", "Manager Technology", "SQL", "Software engineering"]}