{"JOB DESCRIPTION": "  Job Overview:    As a Senior Software Engineer, you'll not only design/implement SaaS, cloud-based, Supply-Chain management software solutions, but you will also work with a talented team to bring to market the innovative approach to supply chain that is used by our clients like McDonalds, KFC, Taco Bells and Pizza hut. In this highly innovative, cutting edge software company, you will not be bogged down by politics and policy.  You bring us your passion to develop, your technical skills, and above all else your passion to make a difference in this company, and we will provide you a career with a very competitive salary and benefits as well as peers that are collaborative, motivated, brilliant, and dedicated.       Job Responsibilities:     Develop features across multiple sub modules within our applications, including collaboration in requirements definition, prototyping, design, coding, testing, debugging , effort estimation, and continuous quality improvement of the design code and deployment   The incumbent will design and implement new features, provide fixes / workarounds to bugs and innovate in alternate solutions.   S/He should be competent to provide quick solutions to problems and taking a feature /component through the entire life cycle, improve the space ? time performance, and improve on usability / reliability.   Design, implement, and adhere to the overall architecture to fulfill the functional requirements through software components.   Take accountability of successful delivery of his or her functionality or module for the overall product objective   A senior software developer creates consistent design specifications using flowcharts, class diagrams, Entity Relationship Diagrams (ERDs), and a variety of other visual techniques to clearly convey the development approach to lead developer and other stakeholders.   A senior software developer is also the primary person involved in source code walkthroughs, re-factoring and ensuring it meets the documentation standards   A senior software developer is often called to support troubleshooting efforts in production systems as well as fulfill support requests from the developers.    Experience and Skills:     Bachelor?s degree in Computer Science or similar technical discipline required. Master?s degree preferred.   Good experience as a software engineer; demonstrated success developing a variety of software systems while taking on increasing responsibility for analysis, design, implementation and deployment tasks with a reputed software product company.   Good experience in Product development using Java8, J2EE, Spring boot, Spring MVC, JSF, Rest API, JSON, SQL Server, PostgreSQL, Oracle, Redis Cache, Amber, Javascript/Jquery etc.   Good to have experience in Handlebars.js, Flyway, PrimeFaces.   Good experience developing data-driven applications utilizing significant relational database engines as part of the overall application architecture (relevant experience in any of the following: SQL Server, Oracle, DB2) including writing complex queries and stored procedures, and query optimization is required).   Good experience building web-based software systems, utilizing N-tier architectures, dynamic content, highly-scalable approaches, and complex security models/implementations.   Understanding of Design Patterns, system architecture and configurations for enterprise web applications etc.   Exposure to development environments like Eclipse, Github / Bigbucket etc.   Should be comfortable in different concepts of source code management (Version control).   Should be self-motivated, energetic and a fast learner should have excellent communication skills (will need to interact with remote teams).   Experience with Agile software development is a plus.  ", "ROLE": "Software Developer", "INDUSTRY TYPE": "BPO, Call Centre, ITeS", "FUNCTIONAL AREA": "IT Software - Application Programming, Maintenance", "EMPLOYMENT TYPE": "Full Time, Permanen", "ROLE CATEGORY": "Programming & Desig", "EDUCATION": {"UG": "Any Graduate in Any Specialization", "PG": "Post Graduation Not Required"}, "KEY SKILL": ["Lead / Software Developer"]}